{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Pvda-p1TtoxAkeXg5MIB6w", "review_id": "mLN45DcCppOwQ1hlv3nzCA", "text": "Ordered the pierogie gyro, and thought that it was really good.  The gyro meat was cut fresh from the cone, and spiced very well.  The perogie was also really good. I will definitely go back and try some of their other dishes, or just to get a really good gyro again.", "business_id": "PSlOtPIo28BvWOzdLmRRRQ", "stars": 4, "date": "2013-06-23", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "nEYPahVwXGD2Pjvgkm7QqQ", "review_id": "U_4_Drg77roYyra03cDAzw", "text": "Honestly, it's pretty unassuming from the outside. Inside it's a tiny greek diner, albeit some \"Americanized\" choices on the menu. Hello buffalo chicken gyro!\n\nBut if you are craving for a fixin' of some stuffed cabbage, potato pierogies, or halushki, this is your place. And for dirt cheap too. I think our total bill was like $10. \n\nObviously you'll get the traditional gyro's here as well, with the twist of the buffalo chicken one. Obviously, I'm intrigued. They also sell ice cream, which if I wasn't so full from my meal, I definitely would have indulged in!", "business_id": "PSlOtPIo28BvWOzdLmRRRQ", "stars": 4, "date": "2014-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bl3UC7GP5dX14uYQsVrKuw", "review_id": "R-p_qNGmgKo_tp66zgPubw", "text": "Hummus is very good. Not a place you'd want to \"go out\" for dinner but great for a quick bite to eat. Would go there again.", "business_id": "PSlOtPIo28BvWOzdLmRRRQ", "stars": 3, "date": "2014-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cp2PUYtZQXrYzhRm7uwXEg", "review_id": "9iyh46JwtCuxmUDurBGlDQ", "text": "I am surprised by the low ratings. I have eaten here on the go several times and really enjoyed the gyros. My vegan friend got the falafel and was impressed as well. Granted, we were starving, but I think it was above average. Ambiance is certainly not their forte--but that didn't matter to us. We grabbed our piping hot sandwiches and hoofed it outside just in time to catch Skyblast over PNC Park. A clear night, fresh gyros and fireworks reflecting off the buildings and river--pretty nice.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 4, "date": "2010-08-06", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "sVfFDp7G7qhSMPGusBM1gA", "review_id": "GWkq7f1u-bIlmc-p56pCOg", "text": "Decent gyros, but it is kind of a dive in the middle of Pittsburgh.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 3, "date": "2011-07-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "FYdpS8hpJUzzKD1VT1z3iA", "review_id": "vnmwHX1kqFtCsJK_sLdAiQ", "text": "I have eaten at Salonikas on 6th St. over a dozen times over the past three years.  I would eat here more often if it was more convenient.  To me, the gyro here is the best in Pittsburgh.  Better than ANY other.  Until someone can point me at a Gyro place that makes them like they do in some of the larger cities in the U.S., or like in Greece or Turkey, where they hand make the meat on a spit, it is lamb sliced thin, and placed in layers on a skewer, then slow roasted, and sliced and served while you watch, then Salonikas will remain the best.  \n\nSeriously, every single Gyro place around here just buys that big round slab of processed meat, and puts it on a spinner. Folks that say \"Oh it is seasoned so perfectly at XXXX\" are nuts.  No place around here makes their own lamb gyro meat. If you know of one, put it down, I want to go there.\n\nI like Salonikas because I like the pita, it is nice and thick and chewy, and they fry it on the flat top.  Places that don't heat the pita (like that place on the Strip that sells Gyros for $5 and he don't even heat the pita?!?!) They STINK!  \n\nI like the tszaziki (however you spell it).  It is nice and thick and well seasoned.  It does not go running down your arm when you take a big honking bite of your gyro.  \n\nI like the meat, it is seasoned so perfectly!  (!?!?!) Actually, they cook it long enough to make it a bit crusty, and they slice it nice and thin.  And they put on a LOT of it.  \n\nAnd all the veg is just right.  I wish they used hotter onions, but oh well.\n\nAnd best of all, they have a bar, that is VERY fairly priced.  Especially considering it is located so near the theatre district.  I also absolutely like all the other stuff they have, the spanakopata, and the moussaka, and the grape leaves.  Pretty much anything they sell.\n\nAnd keep this in mind, this place is inexpensive.  I mean seriously, the negative reviews this place gets all seem to say \"the prices are cheap, and tastes it\".  Well, bull.  The food is inexpensive, and what you get for what they charge, is way above what you expect.  Like, instead of ground lamb in some dishes, you get ground beef.  Still tastes good to me.  Not as great as it would be with ground lamb, but it keeps the price down, and it still tastes good.\n\nMy favorite time to eat here?  New Years eve, or Pittsburgh Light Up Night.  I have been here every one of those the past three years, they are packed, you get to have a gyro and a beer.  It is just a nice fun time.  And considering how busy they are, the staff are all way happier that at some of those pinky-in-the-air joiunts in the theatre district.\n\nOh, and the customers are all friendly.  Nice mix of blue collar and cops and folks getting a bite before or after some event in the cultural district.  I REALLLY like this place.  \n\nNow, next reviewer who throws down some ignorant review about how some other gyro is better, first, is it a REAL gyro, made with REAL thin sliced lamb, slow cooked on a spit and sliced off fresh and juicy, then PLEASE put the name of the place in your review.  I have tried EVERY gyro spot in the city, and quite a few outside it.  And I am STILL looking for a REAL gyro made like that.  Until then, this place is the best for me.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 4, "date": "2012-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NFmSZ4ZwUUG2z7RNCiAYdw", "review_id": "WrO5Biqal0Y8O1mZjuKE9w", "text": "Went here before the regatta yesterday, was my third time here...consistently great, best gyros around!! Thanks.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 4, "date": "2013-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2jkE2AhFum7t3jHSngMZtg", "review_id": "HU6iu9jBJzbN9va45CmdPQ", "text": "Stopped in for lunch. Nice place. I have a few items I'd like to try so I'll certainly go back. Had a fried tilapia sandwich and loved it. I usually stay away because its never seasoned right. This place got it right. Best fried tilapia I've had. Nice selection, friendly service and affordable.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 4, "date": "2015-08-20", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "1ToqCxhANlKXg5m8Mq6HyQ", "review_id": "UyOehgxktu9YRoaLSMYoBA", "text": "Went for lunch, the hummus was good, i had the eggplant which was awfully bland even with a nice tomato sauce.  no beer with lunch though (bogus!)", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2008-07-12", "type": "review"}
{"votes": {"funny": 4, "useful": 2, "cool": 2}, "user_id": "EY2M507w8246POHv37TLyA", "review_id": "-m0UurqLubdV3UdKgx3m5w", "text": "Had dinner here one evening. Ordered the Greek salad with Feta cheese - AND a Gyro platter. plus a glass of lemonade.\n\nSalad was very basic - iceberg lettuce with a smattering of other greens and onions, some feta cheese, dressing - and one olive. Just one.\n\nThen the platter came out - two pieces of Pita bread, several long thin pieces of Gyro meat, hummus, rice - and another Greek salad. Now why the hell didn't the guy who took my order bother to tell me I got a salad with my Gyro platter?\n\nI ate the Pita and Gyro meat along with the hummus and most of the rice. Interestingly enough - this second Greek salad had - drum roll please.....\n\nOne olive! Must be an olive shortage in Pittsburgh. I did not eat the second salad as I was all salad-ed out at that point. I did eat the second olive though.\n\nFood IMHO was just average - it felt more authentic than some of these places that serve you the Gyro meat wrapped up in a piece of Pita with a yogurt sauce.\n\nI got one refill on my lemonade. The older gentleman who took my order was not particularly outgoing or friendly. In fact he was kind of gruff and standoffish - I was very friendly and polite during my visit.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2009-06-20", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "8OvgI9_SZ0_8ZQ535-PEFg", "review_id": "JI4qa4eQxsoyFOyTRk_sJw", "text": "This was one of the most disgusting restaurants ive ever been in.  First decided to sit inside.  There were nats flying all over the place.  So, I decided to sit outside as i had already ordered my food.  However, there were bugs all over the outside patio as well (probably from the standing water with plastic flowers in them).  I ordered a hummus and pita (which they made me think was free but charged me for) a glass of wine, and a chicken kabob.  The food was decent at best.  Then, I go to check out, my dinner was $25.  Better yet the cook who was checking me out had the nastiest yellow finger nails i have ever seen.  I thought i was going to throw up but i was too motivated to get out of there.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2009-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dd0jxaSri5q9ufScWHuy7g", "review_id": "7bW2VQOAwpKeCWRyYUJPwQ", "text": "Christos has European charm along with wonderful Greek food!  The owner is very caring about the comfort and enjoyment of his customers.  The home made wine, red is the best, adds a great touch to the food, although people who want can byob.  \n\nOur favorites are the spanakopita and the exohiko, lamb in phylo dough with a great sauce.  Can't leave withotu tasting the Jackie O desert.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 5, "date": "2010-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "izawilPFdo6mxCbmBKeJpA", "review_id": "9wtzkMwQHXrZQavjbF9fqA", "text": "The food was clearly microwaved (ie the ring around the soup bowl and splatters along the sides). The fish was rubbery. The wait staff, although nice, was very salesy always trying to \"add on\" something in a pushy way. \n\nI asked for my check and barely ate anything. I think the waiter got his ego bruised because he decided to display his \"Best In City\" award right behind my head as I was still sitting at the table... a shame the award was from 2005! I guess a lot changed in 7 years?\n\nDon't bother with this place!", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2012-08-17", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "cSStu8p4Ep1GAokE7UVGLg", "review_id": "PbIrXNeGi7xZiBrd-aX7bg", "text": "WARNING. DO NOT GO HERE.\n\nMy family was visiting my sister in Pittsburgh and we had our eyes set on a specific restaurant, not Christos. A gentleman, I presume the owner of Christos, saw my family and I as we walked down the street. He flashed us his menu, pitching to us why his restaurant was the best and why his food was the best. I could barely tell if he was selling food or used cars. I kindly told him we were not interested. My family, however, was indecisive when it came to getting a restaurant. We ending up wanting to go eat at the restaurant next door to Christos so we backtracked. Again the owner flashed us his menu, sensing our touristy indecision. I again declined and pointed to the restaurant I was heading to. He then ignored me and pan-handled to my two sisters, mother and wife. They gave in to my dismay. As they said \"sure...\" I looked inside the restaurant of Christos at peak dinner hours.  No one was inside.  Absolutely no one. As my family walked in and I rolled my eyes, I thought, well let's give them a chance...my whole family seemed to feel bad for the guy and I like Greek food.\n\nAs we got in, it seemed nothing was going on. We had just came back from kayaking so we needed to wash our hands. They didn't seem to have a restroom but they took my sisters and mother through the kitchen and downstairs to find one. The silence was broken when they finally put music on and suddenly a couple of kitchen helpers came out and looked like they were warming some of the kitchen equipment up.  Were we their only customers tonight? I bet we were. Before I could settle in, he casually asked if I liked pita and hummus. Obviously I said yes. He was asking me so casually when I didn't even have a menu, I assumed it was complimentary when he said he would get me some, but as I waited I found his restaurant on Yelp with my phone and the first review gave them one star and mentioned how the owner didn't tell him the pita was extra.  Great. \n\nThe rest of my family later came back from the restroom (akin to going to a restroom at a grocery store where you're around stock items...except you need to go through their kitchen). They started with salad. The waiter asked if I wanted anchovies or something else on my salad. I was going to say \"sure\" but my wife stopped me and said it could be extra. The waiter, looking like he got caught, verified he was offering all extras to me even though earlier the owner said salads came with dinner. I had to say,\"I just want the standard salad, nothing extra.\" I couldn't let my guard down.\n\nWe ordered some food, priced about what you'd expect.  The pita and hummus I ordered earlier was just barely average so I don't know why they thought it was worth $4. My sister ordered \"leg of lamb\" so I expected to see a leg of a lamb. Instead when her plate came out, it looked like sad slices of ham. Really. We all got vegetables but they were soggy and unappetizing. I saw them earlier in the kitchen sitting in a big pot when I had used the restroom. Nothing here is fresh. My lamb was on the chewy side. My sister's \"leg of lamb\" was left uneaten and she asked if I wanted some. I \"tried\" to eat it but it was too chewy. They then asked for dessert. I wanted to say no out of my discontent but again my family members all said yes, even when they were telling me the food was not great.  I don't have their sense of pity. The desert and salad were the best things of the night, which was kind of sad. \n\nWhen we got the receipt and my wife insisted we check it.  Surprise. They overcharged us $7 from two mysterious items. Their receipt doesn't even list what you ordered. I went up the the cashier to ask them what the two items were. He tried to explain one but he really couldn't. He scratched out the $3 item. I then questioned the $4 charge. Again he tried to explain it but he really couldn't. Again he agreed with me and scratched out the $4.  On top of all this we still gave them a normal tip out of pity. I could tell the waiters were just following orders. I could tell the owner had trained them what to say and how to make extra money.\n\nYou've been warned. There's a reason why this place is doing so poorly.  There's a reason why the whole hour between 7:30pm and 8:30pm we were the only ones in the restaurant. There's a reason why the owner is begging customer to come in. They're cutting corners on customer service and food quality in exchange for salesman tactics, overcharging and tricking you to buy things you don't even know is extra. DO NOT GO HERE.\n\nOwners like this will say,\"But I have to or else I won't make it.\" You know what? Restaurants like yours shouldn't make it. Not to be harsh but it was a poor experience. Change your food, your sales tactics and your fake receipt items strategy. Maybe a long time ago when they started they were real but now they are doing every dirty trick in the book to nickel and dime you.  \n\nWARNING. DO NOT GO HERE.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2014-06-04", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "fMhoyozpOmBk5KSEwCDkUQ", "review_id": "WCFy3Q4Aucc5E9bZQgCTqg", "text": "This place is something STRAIGHT out of a David Lynch film. It felt like I was transported to some sort of alternate reality with the help of a smiling, and overbearing greek man outside a restaurant door preying on the weak and indecisive. Something in the air of this place comes off as so fundamentally strange, and almost, discomforting and nightmare-like. You are going to feel uneasy, is what I'm trying to say. \n\n- They overcharged us, probably intentionally. They don't have itemized receipts. \n- The waiter kept giving us options as if they were... free options that you're supposed to choose. We caught on when we specifically asked if they cost extra.\n- The elusive bathroom felt like we were descending down the staircase to hell. Better than nothing, I suppose.\n- The food.... oh my god. None of our food was good. In fact most of it was outright gross/uneatable. The hummus was decent, but... I can also get decent hummus at Trader Joe's. \n\nWe initially felt bad for these guys. A struggling business is always sad to see. But with all of the strange behavior, attempts to scam us, etc. that sympathy turned into a sense of understanding as to why this place isn't doing so well. \n\nIf the owners are reading this-- I'm sorry if my review came off harsh.. but really, please, rethink the way you are going about your business. I don't want you to fail, I want you to overcome this. Do it the right way, not the scummy way. I know you're trying, but try differently.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2014-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YuWNDnawAz-E9amYCOknZA", "review_id": "CZtcsm21Wdi1F3JTHzHQxg", "text": "Off the path Greek restaurant, in a town with a million restaurants, this was one of our favs. It is homey, great service, good food and outstanding prices. Go there just to meet the owner Christos, a remarkable man who cooked for Jackie Onassis and offers her signature dishes. Fresh, homemade, and authentic cooking. Ask Christos for his recommendations. We loved the Greek coffee, homemade wine, and dessert. And the food was great too!", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 4, "date": "2015-07-22", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "ljGxYz9as2xIvojzh-5Row", "review_id": "AraNiQ8FNHuh792yv_2oPg", "text": "If you like rotting salad, rude staff, greasy food, stupid stories about Jackie Onassis and her favorite dessert then this is the place for you. Absolutely terrible. I cannot say a single good thing about this place, it's just tough to figure out how they remain in business.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2015-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r7kKgGnX3w-mY2hoWdIh3w", "review_id": "SGV9UNFoLyJy18-dtFjBTA", "text": "Australian here travelling from sydney and a lover of Greek food and all Mediterranean Cuisine. After traveling through the states i was after some real home made type food. I ordered some hummos and bread, leg of lamb with rice and vegetables (and of course Greek salad). Waiting for my meal the place looked a little run down but at the same time homely. There are pictures of family and their history all around. The server (who i think was the owner) and the Chef were two of the lovliest men i have met. I ordered my food to go as i had to get back to the hotel. The food was SO good i almost made myself ill trying to eat more. The most DELICIOUS hummos i have ever had. I also got talked into a dessert cake he called the \"Jaqui Onassis\" a Vanilla cake with fresh cream and cinnamon. Also lovely. Not a bad word to say about this place. Don't let looks deceive you!! This place is the real deal.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 5, "date": "2015-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "S1cdgvzcJSgUrGdh3wvz9Q", "review_id": "VuAzoWevG_k1qW0URtZT-A", "text": "Food lacked flavor for every course. Service was very bad even though only 2 tables were being served at the time. The leg of lamb was flavorless strips of low grade meat, maybe lamb. Waiter will try and hard sell at every interaction throughout the meal.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2015-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "trYPAmnPz6ChpIgx0jGbyg", "review_id": "Fv3yjTnPNRigNJPkJvDPwQ", "text": "Great for a lunch gyro or salad. I go here all the time for a quick salad. The vegetarian salads are basically roasted red peppers and fries (a few tomatos and cucumbers) so nothing fancy.\nThe lines are typically long, but you never wait more than ten or 15 minutes. Or you can order ahead of time and pick it up.", "business_id": "AH1PrZQDIdjpKgy1z8XxUg", "stars": 4, "date": "2012-08-15", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "WzaaorVCmUTQvu4mScunNg", "review_id": "JEl3HZTLyFi-ZW-sEUOzSg", "text": "I always enjoy coming here for lunch.\n\nI love that Zorba's has specials everyday- I usually come on Thursdays for the Gyro Special. The gyro is good and they are very, very generous on the yummy fresh cut fries. \n\nI've also had the buffalo chicken salad and it's piled high. The handbreaded fish is huuuuge.(way larger than the roll that it's on) and handbreaded.. so winner winner, fish dinner (or lunch!)\n\nIf I were rating Zorba's homemade ranch, it'd be an easy 5 stars. sometimes I pack my lunch (a quick sandwhich and some crackers) then head over to Zorba's just for some fries and ranch, hahaha!", "business_id": "AH1PrZQDIdjpKgy1z8XxUg", "stars": 4, "date": "2013-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IiatnLKWJeYytasf5XX2AA", "review_id": "9DkNvAwE9d8REjc6LGIBjQ", "text": "Service was horrible. You receive a ticket and the pick up your orderwhen they say it's ready. We had two of the specials of the day. Buffalo chicken salad and a spinach, sliced strawberries, Gorgonzola, pecans and onions salad.  I also had also had grilled chicken on my strawberry salad.   I asked for no onions in the salad and the counter person assured me it would be no problem.  After fifteen minutes (and three numbers  after ours being called) we went back to the counter to check on our order.  She assured us that we weren't forgotten and ten minutes later here comes our orders. My friend's Buffalo chicken salad was piled high with French fries (A Pittsburgh staple I have come find), plenty of Buffalo chicken and nicely spiced. This is not for someone who doesn't like the heat. My salad came exactly as stated with three fairly large grilled chicken breasts. \nThey were cleaning to close early for the holiday and that was used as an excuse as to why it took so long for our food. We ate quickly because our lunchtime was greatly diminished by the wait for food. Salads were both great tasting and large enough to be satisfying. While we were eating someone kept coming by and taking the condiments off our table. They didn't ask about the food or if  everything was alright. \nI would go back again because of the food but don't expect any kind of service. That just seems too hard for them.", "business_id": "AH1PrZQDIdjpKgy1z8XxUg", "stars": 3, "date": "2013-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CYRuZPHvfQcPHbPx1TCiPA", "review_id": "fKU6BNNvuoOcOVtzoOJgCw", "text": "Usually only order their Grilled Chix Salad which is good. They make home made ranch dressing and their salads have no cheese which I prefer. And of course, since this is PGH, fries are included. Definitely recommend.", "business_id": "AH1PrZQDIdjpKgy1z8XxUg", "stars": 4, "date": "2013-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Brqb98qyRl_6QyaHfY_r3A", "review_id": "libYOyGs0RSXHNpUrqxmAw", "text": "Best chicken salad downtown. Zorbas never fails. One of my favorite lunch spots. Try to get there at either 12:30 or 1:30. If you go at noon or 1:00, the line is usually literally out the door - it's a popular place.\n\nPrices lean towards the high side, but worth it considering the portions.", "business_id": "AH1PrZQDIdjpKgy1z8XxUg", "stars": 4, "date": "2015-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fminMno-vPIz4lwKJRv7cg", "review_id": "qMgNzi7vJprMxx562OeF5A", "text": "Best EVER!!!!!!!!!!!!!!!!!!! Been eating Zorbas since i was a child & they were next to tower records", "business_id": "AH1PrZQDIdjpKgy1z8XxUg", "stars": 5, "date": "2015-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "Cs9UzYRRGVaMkTEk8cXl8g", "review_id": "ffRf5r_Vt-dVlGwREII9tw", "text": "Loved the texture of the spanakopita (somebody in the kitchen must have a healthy appreciation for butter) and the incredibly fresh warm pita. \n\nThe staff is attentive and good-humored, and you definitely feel like you're in a cozy local restaurant. \n\nThe Greek iced tea was also perfectly spiced and delicious - inspiration to experiment with cinnamon and cloves at home!\n\nThe hours seem to be somewhat erratic, so just call beforehand to make sure they're open. My boyfriend and I tried coming once around 8:45pm on a Thursday but they were closed.", "business_id": "cH8I7JgPXcrcutT1a3YrjQ", "stars": 5, "date": "2010-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zYdFH6R1fKGJWgqcYEg5bw", "review_id": "EmUKAvvrDdPkXAu7dec02w", "text": "The food here is so good that I was ready to give It's Greek to Me a four-star review after eating takeout that had ridden halfway across Pittsburgh to meet up with me. It's a cliche to say dishes have layers of flavor, but there's no more accurate way to describe this thoughtful, absolutely delicious cooking.\n\nThe restaurant isn't fancy, but it's like eating in someone's living room, and those are some of the best restaurant meals I've had. The takeout gyro was great, with buttery pita and a potato-garlic spread that goes with frankly everything. But the souvlaki eaten in, while considering the scrapbook-worthy collection of paintings and memorabilia on the dining room walls, was sublime - a little char and a lot of flavor in every bite.  I have eaten a lot of Greek food cooked by a lot of Greek people who are very good cooks, and this stands up to any of it. Save room for the baklava, and don't share - you'll want your own piece.", "business_id": "cH8I7JgPXcrcutT1a3YrjQ", "stars": 5, "date": "2013-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zYdFH6R1fKGJWgqcYEg5bw", "review_id": "zMGZbHqv7CZ1fw_VD7-RHQ", "text": "A revisit for dinner, and three of the four of us ordered meals with salad and rice rather than sandwiches. The salads were really good, with chunks of feta and interesting spices - but the plates just reminded me that the sandwiches, with all of the ingredients married together in saucy, pita-wrapped  goodness is where It's Greek to Me really shines. The sandwiches?  Five stars, no question. Play to the strengths of their menu, and you'll leave happy.", "business_id": "cH8I7JgPXcrcutT1a3YrjQ", "stars": 3, "date": "2014-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EDvrXlhzlYgySM6qpt5wKQ", "review_id": "pj2rra2_Fbvx5DlSrqenEA", "text": "Awesome gyros!  Great kabobs!  Greek tea is awesome.  \n\nMother and daughter team are great.  Friendly and great service.  \n\nMike the owner is the Original mike from mike and Tony's in the south side.", "business_id": "cH8I7JgPXcrcutT1a3YrjQ", "stars": 5, "date": "2015-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "92RqcHZOg9tftlFLC8vDWQ", "review_id": "muRywCQTc8fHpWAuyQ-lNg", "text": "If this is the same family that owns It's Greek to Me in  Dublin  Ohio I'm going to be super happy and know without a doubt this food is gonna rock. I was there in oh I training for a job for 2 weeks and this place was right across the st. I ate there 6 times while I was there. Breakfast and lunch! Bangin good food.", "business_id": "cH8I7JgPXcrcutT1a3YrjQ", "stars": 5, "date": "2015-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AEQowxQ8076LsWNirwHTww", "review_id": "SOcoyUOlIIlALfEfpZ_lHg", "text": "I thought the gyros were just okay.. too much seasoning. Fresh cut fries is a plus.  I come here for the lunch special ($10.50 for two gyros and some fries). Great value", "business_id": "cH8I7JgPXcrcutT1a3YrjQ", "stars": 3, "date": "2015-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BaVOupGXzHzbaWcH5n1_xQ", "review_id": "mliihuUHmFBeBYIOM6K3oA", "text": "Hey! What happened to It's Greek to Me? The door is locked. The restaurant is empty. The pics are piled up out front. It's our favorite and we love the mom-daughter duo. Are we never to see them again?", "business_id": "cH8I7JgPXcrcutT1a3YrjQ", "stars": 4, "date": "2015-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E3uTI36A9ygD1rVgdqHbpg", "review_id": "L-DK_qMC36qiSnGzb51zsA", "text": "My girlfriend and I came in for breakfast. Amazing deal, great service, and a killer baklava!!!! I highly recommend to anyone in the area as we made the trip from exit 25....we heard good things! This will certainly be our mom n pop breakfast from here on out!", "business_id": "ASwN3Ih0Eh1oH0npLbzVjA", "stars": 5, "date": "2012-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V0mCFwCzkSWC_-htGIPtjg", "review_id": "0H3o6UxaOdPBUGxqJCtCwA", "text": "Showmars is great for breakfast and lunch.  This location does have the preferred combos of grits...hash browns..eggs...and the meats of choice.  Everything is prepared well.  Seating is never an issue...and i can get in and out in 30 mins.  The restaurant can get busy at times...and timing may halp.  With the various locations...they are pretty much the same on service.  I have to admit....coffee is hottest at other locations than here on 3rd.  But overall....you cannot beat the convenience!", "business_id": "ASwN3Ih0Eh1oH0npLbzVjA", "stars": 4, "date": "2015-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2E5g1BDDjUrI_Sp0UYHXQw", "review_id": "7DK8vYVFHf_Yl9jJT25Ihw", "text": "Change management and has gone down hill. It's slow, portions are smaller and the staff is terrible. They also raises the prices. I would have been happy to pay the new prices to the previous management but not fit what you get now.\n\nMissed opportunity.", "business_id": "ASwN3Ih0Eh1oH0npLbzVjA", "stars": 1, "date": "2015-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5pdgqocQ4JaoVPoFYGYO4Q", "review_id": "3IaskBeYC9vP5nAKgG79nw", "text": "I used to work uptown and there are (or were) three restaurants that I will make a special trip into town just to eat there.  This Showmar's was one of them. I had been craving the chicken fingers platter with fries that I ate once  a week, every week for over fifteen years.  \n\nAfter receiving my order I was at first a little disappointed that they were using Ken's honey mustard dip, I can buy that crap anywhere but ok I let that one pass.  The fries were not as crispy as I like but that too was a relatively minor offense. Then I tasted the chicken finger.  Gone was the flavor and little taste of spicy burn at the end. Major disappointment! Might as well have been eating the frozen tenders served at all the other locations.\n\nI asked WTH and they told me, management change. Told me the recipe was the same but my tastebuds tell me a different story. Boo! That makes me so sad knowing I will never experience that wonderful flavor again. Sure wish someone could tell me what that spice was and I would try to duplicate it at home. And what was that wonderful honey mustard sauce brand?  If only I had known things were about to change I would have asked many questions.\n\nJust like the slaw at Jakes, the turkey club at Rusty's and the BLT at Taso's, they will only be a fond memory.....", "business_id": "ASwN3Ih0Eh1oH0npLbzVjA", "stars": 1, "date": "2015-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "W6LTsXcY1R76M9EdeN0G6A", "review_id": "B1rxAXkOGUIuvTAn12GcBg", "text": "Everybody loves Showmarssssssss... and it shows. The commercial is now stuck in your head. Oops. My bad.\n\nNow that this is my neighborhood 'Mars (why yes, I did just give Showmars a nickname), I get a little sad every time I come here. Why? Because it doesn't have Alex. He's my favorite worker at the Freedom Drive location.\n\nI love the Grilled Chicken Santorini. Tzatziki sauce makes everything better. I'm also a big fan of the Greek Grilled Chicken Salad. Not sure how healthy it is if you eat the entire bowl, though. You have to eat the bowl. It's a must. \n\nSHOWMARS ALSO HAS THE GOOD ICE. You know what I'm talking about. I think it's about time I make a \"Good Ice List\" on here. When I become president, I will make all restaurants carry the good ice. GOOD ICE FOR EVERYONE!", "business_id": "8PsQqhrAH5uqJ7HODOmXYg", "stars": 3, "date": "2014-07-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YnMNA5Fm6NAzndIzdx6KhA", "review_id": "M4jIRmoNO4TPCu97BG4WPw", "text": "Great food real fast. Love their breakfast and their staff is efficient and friendly.", "business_id": "8PsQqhrAH5uqJ7HODOmXYg", "stars": 4, "date": "2014-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZxHf8lfDlNY0YZEJsngXwA", "review_id": "WKvzV4Q6myTDQt8xqaX-Cg", "text": "The breakfast here is amazing. I come here on Saturdays with my mother and grandmother and we get a booth in the back. I get 2 eggs scrambled, sausage patties, and hash browns. I love that they give you a slice of cantaloupe with your breakfast, it helps me get my daily fruits in. The servers are great and the food is always ready in a short amount of time.", "business_id": "8PsQqhrAH5uqJ7HODOmXYg", "stars": 5, "date": "2015-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-pF3n_6nafb8k9p3fGcjsw", "review_id": "bjZQIRCdId8FPfKP0BC20g", "text": "Not too bad.  Lots on the menu for a deli.  Atmosphere is fair and it's a bit loud in the dining room especially with a woman yelling out numbers for order pickups (extremely irritating).  Sandwiches are ok, nothing special.", "business_id": "crKd3Kf3YYP8znwoMvcA-g", "stars": 3, "date": "2011-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hYpCpleBxL5h4jz3HeNqGw", "review_id": "v-gB5xOBq6nTSRpV7DY5UQ", "text": "I just started a job over here and was happy to find a little place that's right by where I'll be working.  It was a decent sized place and when we first walked in I was worried because the line was pretty long. Well, I have to say, the line is definitely from the yumminess & price of the food because they moved us through super fast. They had alot to choose from, and I tried the chicken parmesan. The cheese was just dripping off and man it was good!! I'll definitely be back to this little place.", "business_id": "crKd3Kf3YYP8znwoMvcA-g", "stars": 4, "date": "2012-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HCT9XwDWbUzzxmZRJy_cBQ", "review_id": "GIXY7Y26dVxk6OhjK4MPtQ", "text": "Good....fast....friendly.  There's just a little bit of everything for everyone at Niko's Grill.  Kinda half deli, half counter-service.  This is a great place to drop by for when you're in a big hurry, or not.", "business_id": "crKd3Kf3YYP8znwoMvcA-g", "stars": 4, "date": "2013-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "4P1AfdABykulRK6C-ww4sw", "review_id": "55o0xQe40JqFpj6g96ApnQ", "text": "This is one of those local hidden gems.  Could the walls use a painting?  Probably.  Could the interior be slightly updated?  Probably.  Does any of it matter?  Probably not.  The sanitation grade was 96.  The food is cheap, good, and fast, and the people are friendly.  Order at the front and they will bring the order to your table.  $5.05 plus tax for a killer steak pita dripping with mayo and dressing plus a bunch of good fries?  I'll be back.", "business_id": "M89wkxqAcXuVMtWh91BIjg", "stars": 4, "date": "2012-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GCpNFW4HOs4Ij6H4FYgEyg", "review_id": "-39bMatzHID7VC4qi258zA", "text": "Awesome Philly cheese chicken sandwich and fries.  Great for lunch!  Small eatery feel. Friendly staff", "business_id": "M89wkxqAcXuVMtWh91BIjg", "stars": 4, "date": "2013-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eUdSqKoXrki8uG8Jg-jBrg", "review_id": "8yNFA0vpTANDqclCOmwxrQ", "text": "Nice little quiet lunch place.... And one of the better places I've eaten... A large Gyro and a large fry for under 6.00..  Good Service, smiling faces from the front girl, quick order up...\nI will revisit and tell my co-workers\nI'f your on the Charlotte West side near the airport check this place out.", "business_id": "M89wkxqAcXuVMtWh91BIjg", "stars": 4, "date": "2015-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sol_WPnzwDEawQ_jC_19zA", "review_id": "U8RO7eyGZrsMVtbq6948hg", "text": "I like Showmars restaurants and this one is no exception. I went in during the busy lunch hour and received very fast service and good food in a clean environment. This location has a drive thru. I recommend the grilled chicken pita for lunch!", "business_id": "Lw-01HQDswygHvAZfwkpxA", "stars": 4, "date": "2010-08-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "PM2jXrlVzik1jDwwahLJJQ", "review_id": "R4oVC8cLE4vyEQPcUN4h2A", "text": "I really like this place!!!\n\nThe food is cooked to order and everything I've tried has been delicious!\n\nThe pita bread is always soft and fresh warmed to perfection with whatever topping you choose burgers, chicken breast or make it into a gyro! Any choice is super delicious! \n\nThe seafood is also delicious! The shrimp are crispy and the fish sandwich is one of the best I've ever had, with the crinkle cut fries or onion rings and you have a delicious meal! \n\nBest part of all...they are not expensive at all for less than $10 you can get a very filling hot meal...which in my book is not bad at all!\n\nThe staff here are all super friendly and the manager walks around asks about your day and even refills your drinks! \n\nThis place is definitely going to the top of my YUMMY list!", "business_id": "Lw-01HQDswygHvAZfwkpxA", "stars": 4, "date": "2012-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "i0MZiMWK3X57vnLbmHMnuA", "review_id": "AD6ny4rOSyCiBQVxcshSVA", "text": "Showmars is outstanding!\n\nThis has to be my new \"go to\" spot for lunch if I am stuck between choices!  They never let you down!\n\nI have never been disappointed in any item off the sandwich, pita or salad side of the menu.  I cannot speak for the \"dinner\" portions as I have not ventured to that side of the menu.\n\nTheir tag line says it all ... \"Casual Dining ... Fast!\"  You got that right.  The drive-thru is a quick and simple execution just like going inside to order \"to go\" or taking time to dine in.  They bring the food right out to you.  The staff is very friendly (that is hard to come by these days!) and are always eager to assist with anything including drink refills and clearing the table.\n\nThe interior is a simple design with your standard dining booths and they provide a few televisions throughout for you to catch up on via news stations and the four letter sports network.", "business_id": "Lw-01HQDswygHvAZfwkpxA", "stars": 5, "date": "2012-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sMGwawG0hPVt0CQHiss1XQ", "review_id": "GnnUWk1hzFSBsygY7c4pPg", "text": "Their motto is \"Good food, fast\" and they mean it.  My favorite is the Gyro platter but have had most of the menu and it is all very good and is served very fast.  They have a wide variety of offerings from seafood to burgers to pitas.  They even have a BBQ sandwich. Their fries are the crinkle kind which you don't see very often anymore.  The staff is always friendly and happy.  Please be aware that they are closed on Sundays though.", "business_id": "Lw-01HQDswygHvAZfwkpxA", "stars": 5, "date": "2013-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UroYfx8oq8yiX3WJec6brQ", "review_id": "PjwbPMAw8kXVy8QD0PMhwQ", "text": "Thought we'd try Showmars; they are convenient. You place order at the counter and then find a table. Plenty tables available but every one was sticky. I don't consider a table top that holds on to you to be clean. \n\nFood was served quickly and is okay. Nothing slid off the table...", "business_id": "Lw-01HQDswygHvAZfwkpxA", "stars": 3, "date": "2014-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tqADiRI0XrQb9jRea5_QyA", "review_id": "vBFDjlBVcwqH0f5MawCCyQ", "text": "Always has been one of my favorite lunch spots and showmars unfortunately I don't live or work close by this location anymore! But stopped by recently and it is still my favorite the food is always great and the staff is as friendly as ever.", "business_id": "Lw-01HQDswygHvAZfwkpxA", "stars": 5, "date": "2015-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RvIP2eXHTxg8KdOduEmXIQ", "review_id": "pxWHw_tXS752dlm93TvNqQ", "text": "Yum great food a very friendly staff a very clean store.  The wait was very short. I got a to go order. It was 7 dollars for gyro and side. Good price. I recommend it.", "business_id": "Lw-01HQDswygHvAZfwkpxA", "stars": 5, "date": "2015-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hwOZBFgxUH3m4NJjQYgdAQ", "review_id": "i8zHvgoqui9waeailbz0tA", "text": "ALWAYS my favorite!  I do not live in the Charlotte area anymore but when I visit I always go for a meal.  \nCashiers are always friendly\nOnce you order you are given a number and the food is brought to your table\nThe restaurant is ALWAYS clean\nA staff member is always checking on you to see if everything is OK or if you need a drink refill.\nI love their burgers and the fish is great too.", "business_id": "Lw-01HQDswygHvAZfwkpxA", "stars": 5, "date": "2015-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0hdkW5qaQs4gTiUnRdadqA", "review_id": "mPPUWwJmDyzt-Pk6R9Ow7A", "text": "Don't get me wrong the food here is great, especially for vegetarians like myself.  It is all authentic Mediterranean food with a spicy zing to all of the dishes.  The place is always fairly empty, so you never really have to worry about a wait.  It is a great place to go if you practice Islam, because all of the dishes follow the Qu'ran's guidelines for food.  My only gripe is that the employees aren't very personable, and the wait service is kind of lacking enthusiasm.", "business_id": "6-jlUgqp0Mv3PUzMGjrb0A", "stars": 3, "date": "2008-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V0mCFwCzkSWC_-htGIPtjg", "review_id": "a0npl8QJRbx0W2KhyIsBtw", "text": "I have enjoyed going to Showmars for years.  I used to go 3 times a week or more when I worked in building adjacent to Showmars.  I could start the day with breakfast....2 eggs scrambled well....grits, bacon and eggs and whole wheat toast to make it as healthy as I could possibly get it.  Cant do much about the butter in the grits...it just makes them good...if it is not too much of it.  OK...fast forward....8 years...and the breakfast plate is still the same....exactly the same!  I remember taking my daughter there before she went to work.....and she would eat two...yes...2 breakfast plates!  I still wonder how she did it!  they were good.  I now drop by...maybe once a week if parking is good on 5th St.  Drop in also for a good fast and nice casual lunch with a friend.  The service has always been very good...and the staff so friendly!!!  I think I will go tomorrow....and get a bowl of those good grits!!", "business_id": "bffCUYaQ4FejTfu_xFwjyQ", "stars": 4, "date": "2011-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s10ks7DE9ixCfulcenm-SA", "review_id": "wEUuG11cz0qDn2DQOSTK1g", "text": "Been going there for about 10 months now, sometimes 3 or 4 times a week...sometimes maybe once every 2 weeks.\nThe people there are always friendly, they remember you and greet you as a friend.\nI've always had top notch customer service at this location, the food is always served as ordered, hot and fresh, I've liked everything I've tried so far.\nWorking right across the street, it's nice that they are convenient, personable and have good food..\nKeep up the good work guys :-)", "business_id": "bffCUYaQ4FejTfu_xFwjyQ", "stars": 5, "date": "2015-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "J1AbNgbKYRZO26uyrygICQ", "review_id": "xPeOSqR6VMzxrOJjxenImw", "text": "Love this place. Flavorful food, fantastic pricing plus attentive service. Don't let ordering at the counter put you off. The staff at Shomars speed you through the ordering process then they hand you a number and you choose your booth. Within minutes your food is brought to you piping hot. I generally order the large Greek salad with Gyro meat $6.95. They could easily charge $9.95 for this portion. I order an extra side of gyro meat $2.50 and it is a feast that quenches my XL appetite at dinner time. Order whatever you like...it all looks great!", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 4, "date": "2010-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HxxPa0ZvrqU6JlcLJGbxtg", "review_id": "bCD7dmN-0oD2ZLlklTr6MA", "text": "The Gyro was surprisingly good. I have been to 3 different locations. The food is pretty consistent and pretty good.", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 4, "date": "2013-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-VwlbgJMfnxoS7rv3kOsEA", "review_id": "HUya6gyiPKwNngDh_EDXMQ", "text": "Food is great! The fish sandwich is amazing. The service is not and my experience tells me that this is unique to this location. I frequent this chain across the city and I always have a pleasurable experience with service-except at this location. The staff are always short and rude. Don't expect service with a smile.", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 3, "date": "2015-07-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "O-B1owHiMQVp_XOw7oXSDg", "review_id": "_9OxYDnTjE57DOVIBBpOTQ", "text": "After reading other Yelp reviews, I decided to try Dimitri's, unfortunately. The gyro meat was bland...gyros are not meant to be BLAND! We also tried the so-called spinach pie. Again, it's pretty bland and seems like it came from a grocery store freezer. It isn't actually *bad*...it's just not *good*... so I gave it two stars. There is much better food in Madison.\n\nIf you want gyros, go to the Parthenon.\nIf you want spinach pie, go to Med Cafe.\nIf you're on the East side and you're desperate, go to Dimitri's.", "business_id": "Pa_brCvUaiUPPvm3tJQwgw", "stars": 2, "date": "2010-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "FKRl-IDVExxedNJvy9CCxQ", "review_id": "sjkB76TPMnk5MM5w8uxD8w", "text": "I can't believe I walked past this place for three years.  What is more sad is that many of those times were likely while I walked into Subway across the street on a Tuesday afternoon to drop $5 on a Veggie Delight.  Little did I know I could get a delicious, warm, and fresh vegetable hummus pita across the street for a little over a dollar.  At least I have many more Tuesdays ahead to take advantage!", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2007-07-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "CX4GcrCCnzfNyAl0cPqGbg", "review_id": "rbaYNhpQc0StyFW0WxQgOg", "text": "The gyros here are decent and they have live music on certain days. Expect to pay a cover for the music.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 3, "date": "2007-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "OOkr8AHWyqnaN0sZlunzjw", "review_id": "cUr-us1eIPz_n0dyBM_gjA", "text": "I love the gyros here.\nI love their cucumber sauce even more :)\nYou can pick the size of gyro you want, so you can load up on as much as as little meat as you please.\n\nService is good and there is plenty of room to eat right in the restaurant.  The only \"problem\" is that you'll smell like gyro, onion, and grease when you leave.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2007-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "_7VcEa3xUpsc9XUTFCqlhg", "review_id": "rIz8OOZ_4F505MswS8CUMQ", "text": "This is where I spend 20 minutes every Tuesday night.  Good gyros, cucumber sauce, etc., and thanks to Groovy Tuesdays you can get a kickass feta (+hummus, if you like) veggie pita for a little over $2.  Service is fast and it's not usually too crowded.  Nice, tall tables too.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2008-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "SpKVX3rt892E-BrL-yeqiw", "review_id": "K4vgpQkNg5NOYpBibvIU8Q", "text": "Reliably decent gyros, although I haven't seen much else that's very exciting about the place as of yet.  It does have its location going for it, though.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 3, "date": "2008-08-16", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "we3wNaG0cZujkRpzzKHmuQ", "review_id": "q9QA_iuRz3teu62sdDAVCg", "text": "Great restaurant! Being that I was hanging out in Everitt for most of my stay in Chambana - I got very familiar with Zorba's!\n\nWhat to say about it... Service is always great. The people that work there always seem happy and treat you well. Prices are totally reasonable. I went almost every Tuesday as it was cheaper on Tuesday. Their gyros are great - though if you get a normal gyro you will be left smelling, well, like a gyro. The chicken gyro never had that effect for whatever reason. So good.\n\nI went almost every Tuesday and I'd get a large normal gyro with a side of fries. I'd bring a textbook and study for an hour or two while enjoying my amazing food. Great place to study ( at least for me) as there was always enough noise to keep my mind from wandering - but little enough noise so that I could concentrate.\n\nNever eat here before a test. You'll go into a food coma and not do well on your test. I learned this the hard way. The very, very hard way.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2008-08-21", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "QktjbAmpOT6CPKxOLQRetg", "review_id": "5SufCyy7Pf2_sP0vPga0hw", "text": "Hands down the most underrated place on campus. Everything they offer is at least good, while their gyros are nothing short of amazing (for Chambana, at least). The jazz shows are a nice touch, the prices are very reasonable, and the staff is always friendly. One of my favorite places to spend a break, whether it's between classes or during work.\n\nIt doesn't offer enough food on the level of their gyros to warrant a five-star rating, but it deserves a strong four.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2009-06-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "27lOuVNMavQQhzvtz3pNGg", "review_id": "a_fi_1nGbeo74Nj21m-6tw", "text": "I usually eat healthy, well-balanced meals.  However, I occasionally indulge with something less health-friendly.  When I indulge, I go to Zorba's.  I order an enormous gyro with mountains of onion, tomato, cucumber sauce, and feta cheese.  A Zorba's gyro is heaven for the tastebuds.  \n\nUnfortunately, I usually get massive amounts of heartburn after eating at Zorba's, but it's totally worth it.\n\nI've been told that Zorba's has live music some nights, but I've never actually seen it.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2009-06-25", "type": "review"}
{"votes": {"funny": 4, "useful": 4, "cool": 2}, "user_id": "2sklUYBnk7LxzM-11yPUPg", "review_id": "epnhGv84zdfpZinI8wSBRQ", "text": "Came to Zorba's on the suggestion by a cousin who has, and I quote, \"never given a bad food recommendation\".\n\nAnd it was another hit!  Chicken gyros and fried mushrooms for dinner hit the spot.  \n\nAt other Greek spots, I'm used to having a humongous foil wrapped hunk of a mess of gyro served to me that I inevitably finish... and end up feeling like a blob because I didn't want to waste food.  But Zorba's is here to help you with portion control!  I like how they offer their gyros in 4 different sizes.  Oh, and try the cucumber sauce.  \n\nYou know you're in for a treat when it takes 9.8 seconds for the grease in your meal to seep through the bottom of the paper bag.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2009-06-27", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "BcNdlyXsmyYYBMfHq6UFpQ", "review_id": "UOeUjZqzTy11PpFxWpQZXA", "text": "Ah Zorba's, makes me feel young again.  I frequented this place all the time when I was a student at UofI.  YUM their gyros are some of the best.  I like that they have different sizes of gyros.  Definitely get the fried mushrooms, you won't be disapointed.  Pass on the spinach pie though, it's not very good.  They aren't the cheapest if you're a poor student, it can add up if you get fries and mushrooms and everything.  Cheap beers.  They used to have free jazz on Tuesdays, I think, not sure if they still do.\n\nYUM their cucumber sauce is awesome. They also have a wonderful honey dijon for the chicken gyros.  My bf sometimes has to go down to UofI for career fairs, I always make him to go Zorbas and get me a gyro with extra cucumber sauce.  I will eat it 3 hours later and cold, and it's still delicious.\n\nThey call out your name when your order is ready, my friends and I would give them funny names like Shaft and one time I was Captain, and my friend was Tennille, but they called Tennille first, that blew.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2009-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mF9fRrUQn8iBj-WSbxwifg", "review_id": "P30tbNffLbje5cuKQ9b46A", "text": "Good food and I love all the dipping sauces.  Best gyro I've had on campus.  Not a huge variety of food, though.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2009-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8uLYQm5YJnvpC7477FAwLw", "review_id": "N-krNG5zqB5ocQ0rVsjwTw", "text": "Absolutely, the best gyro that I have ever eaten, and I have eaten a lot of them over the years.  I miss you Zorba's!", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2009-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2niwhUC9pAeHH_W29cl9Cg", "review_id": "3MtviGx3J3vMCylXLTQ5rQ", "text": "Currently closed due a fire above them.  :(  I always look forward to eating here and was so sad when I came home in May and couldn't have any.  I wish them a speedy recovery.  I'll be back for the holidays and hope they have re-opened by then.\n\nMy parents used to come here when they were dating back in the day.  They started taking me and my brother as kids.  The whole family enjoy the food.  It's the only place my dad will eat fries.  I, on the other hand, love fries, and while their fries are good, they aren't THAT good.   The gyros on the other hand are!  We get the lamb ones.  It's always a tough decision trying to figure out what size to get- sometimes your eyes are bigger than your stomach.  The food is consistent good and served quickly.  And I love the Illini memorabilia.  Hopefully, they will still have some to post when they re-open.\n\nParking is an issue as they have no dedicated lot.  The best plan for when school is in session (if you don't live on campus) is to drop off someone, let the other person circle around to find parking, and take it with you.  Otherwise, be very patient with finding parking- especially during lunch time.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2011-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S3dhPGW9PJfK6ZuQoJhKfA", "review_id": "2yw-DLDMzPwXFDQ3T0yDgQ", "text": "Please note that this closure is temporary...there was a fire above the restaurant and part of the building has been gutted.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2011-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PoArLCMA9Pkf5NiV51GQOw", "review_id": "7BeS5TQlzdyAXEhLo3xWxg", "text": "My favorite restaurant right around the university. \nPhenomenal gyros. I'd say I still hold Zorba's as the golden standard of gyros. \n\nI was there every Tuesday in college for Groovy Tuesday - $1 off gyros - and i was probably there at least one other meal each week. Quick, cheap, delicious. Can't get better than that.\n\nI have a gyro or two every time I'm back in Champaign. \nEveryone should eat more Zorba's!!", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2013-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j0PRrTf1B2f9ocv0DPLL2Q", "review_id": "CTaCeWZQzgUVZaDCgSnBQA", "text": "Matt and his gang do a great job. Love the chicken Gyros.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2013-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZB5yx64AVO-O1An2rMadzg", "review_id": "b-y2ZCNWxZR_8vxIMdvE0A", "text": "Gyros are soooo tasty, I keep coming back for more. Price is okay and service is fast. Only complaint would be portion size for their salads...their small was much smaller than in most places, but it was yummy. Seriously try their gyros.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2014-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "A4QMKbj65m9Hbp0rmHDGcw", "review_id": "ccI3FTUuBRYWRG92Nv6VIw", "text": "The joint that launched my love affair with the gyro. Their tzatziki sauce is still my favorite, and the chili is delicious.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2014-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uiM0_A783IDKHpeXoUF1Sw", "review_id": "rSmhfPuCqzXB6vGcC9oY3Q", "text": "The best gyros I've had anywhere, which is saying something since I was born and raised in Europe, and live in Los Angeles. \n\nThe meat isn't dried up and charred like I've hat at so many other places - it's fresh, juicy, and flavorful. No bland, thin pita or cucumber sauce here. The only downside is that there aren't any Zorba's in LA, because now I'm addicted.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2014-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BLQXixrG0gT1puIqXs5R-A", "review_id": "_z7g5I41ovsw27E4VFac5Q", "text": "Love the food at atmosphere.  And they keep that line moving.  Fries are something special and if you get the combo you get a small enough portion so satisfy your fryer need.  They don't have beer anymore which has helped university productivity.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2015-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QqXKGqTAh5jQsmkFPpsmzw", "review_id": "NEQvc1iso91jmhoK3wNQgg", "text": "Zorba's is another place that my parents remember from their time as graduate students in the late 70's, and it appears to be somewhat of an institution now in Champaign.  I went with my parents on a summer Tuesday right at opening time and our food came out quickly.  It's cafeteria-style seating and the place filled up within a half hour.\n\nWe got 2 of the beef/lamb gyros and a Greek salad.  I thought the gyro was okay.  I mean, totally acceptable, but honestly I've had better at the Greek-fest thrown by the little Greek Orthodox church across the street from me in Boston.  The one I'm used to has a lot more of the meat, better sauce, and way more tomatoes and more thinly-sliced red onions (instead of the white onions used at Zorba's).  The fries that came with the combination platter were not good at all.  Those were mostly left untouched.\n\nOverall, Zorba's delivers reasonably good value, and was a quick, convenient lunch stop in Champaign.  I didn't think the food was great by any means, but it gets the job done.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 3, "date": "2015-08-15", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "JgHGyWS2emyHq6aq144SLQ", "review_id": "hGoGBEwWnv6l3F5t-4S7nA", "text": "This is some incredibly tasty and greasy food. I walked around like a confused tourist for a moment while looking for the menu. I'm pretty indecisive so I would prefer a menu that wasn't taped to the counter where you order. Being able to peruse a bit would have been nice. Even so, I ordered a falafel with feta and jalapenos and it was fantastic. Even the fries were delicious and I'm just not a potato fan. The biggest pro - They have a tzatziki dispenser! Most places charge you for extra and considering condiments are the highlight of my meal, this was fantastic! I also thought the gyros were delicious although it is tough to mess that up I think. The price is great, you can eat here for just about $5.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2015-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JgDkCER12uiv4lbpmkZ9VA", "review_id": "W3qwEhlI6aBjrsHaOiaaBw", "text": "Been here twice, and I cant say either time was a thrilling experience. One thing I can say as a plus is the bartenders at lunch are always friendly and quick. The food so, not so great. I can never eat it all, the portions are extremely generous, but it's never very high quality. Just kinda seems like it is coming from a slop kitchen, and not really fit for a human. The house margaritas are actually pretty good, and a fair value. I recommend hanging out with a margarita and some chips and salsa (also pretty good) and then moving elsewhere for dinner. Call me crazy, but restaurants that leave me feeling sluggish and greasy are never my favorites.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 2, "date": "2008-06-03", "type": "review"}
{"votes": {"funny": 5, "useful": 10, "cool": 5}, "user_id": "2rlBbFPHyZjXSFSE8r551w", "review_id": "3p5tFEJJEp95Ao0A0Ifh0A", "text": "I wanted sushi and was willing to drive my friends to PV for Yasu Sushi Bistro (highly recommended by me!) but they were too tired and wanted something within a block or two of the Hyatt. \n\nThey asked the concierge, who recommended this place as very good! \n\nHas she ever had good Mexican food, or is she getting kickbacks?\n\nThe Matador Restaurant is across from the Hyatt Hotel, in the center of downtown. It has been in business since 1976, is large, and IMO, \"Bleh\".\n\nIt is owned by a Greek Family for one. All 32 years. All the Mexican dishes and specialites were mostly from one of their first cooks. Great, make your cook create all the recipes for authentic dishes and you make all the money. There is even a small Greek section of the menu which offers low end Greek dishes (Gyros Sandwich, Gyros Plate, Greek salad, Feta Cheese plate, and something called Shrimp a-la Mike!)\n\nThe menu has print so small, only a search light and magnifying glass can decipher it. \n\nThey do have some authentic dishes, like menudo, carnitas, lengua con chile verde; and the basics like enchiladas, tacos, tamales, tostadas, chimichangas, carne asada, chalupas, fajitas and flautas. \n\nThey bring you chips and two types of salsa. We ordered (extra) guacamole, and it didn't taste or look very fresh, like they mixed a jar of paste with a couple of avacadoes. The Margaritas were uninspired and weak. \n\nI tried the Machacas (sauteed shredded beef) which was moist but lacked flavor, and was supposed to be with green chilis, tomatos, and onions with rice and beans for $10.95). 3 others in my group were unimpressed with the food, and they were French Canadien (So what do they know about Mexican food, except when it isn't good!).\n\nThey also have steaks and chicken dishes, but why bother? \n\nThe food was passable but would not entice you to come again, unless you got drunk at a ball game at the local Chase Field stadium and were starving.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 2, "date": "2008-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "t95D1tnWvAOy2sxXnI3GUA", "review_id": "2x1lh94fVAhk61CmzATI9Q", "text": "Stopped by for breakfast. Sat outside. Promptly served 2 glasses of ice water and a menu. Chose Bacon & Eggs for $8.95. Ridiculous price, but came with beans and hash browns and thick-sliced, very fresh, bakery bread toast. Ordered soda which came half-way through my meal. My server, Jesus, who was very hard to understand, explained it was due to \"macheen broke\".  Food came within minutes of ordering and was decent. Generous amount (6) thick-sliced bacon. Only complaint is, Jesus never returned to replenish my water, or collect the check. Employees do convey an \"anxious-to-serve\" approach, but seem rattled, confused and \"tripping-over-each-other\" for your attention. Nice and refreshing to see, but strangely executed. Friendly, and welcoming. Overall, just o.k.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 2, "date": "2009-08-11", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 3}, "user_id": "eyis-TUPTQzFwFdS8ZFCCw", "review_id": "-P649-kAjNLJVerzKPCVKQ", "text": "Dined with a good friend of mine while in town, so the slow(ish) service was no bother. Actually, we had good service. They were on top of my need for water with lots of ice.\n\nLisa had the chile rellanos and she said they were good. The portion was large and she took about half home.\n\nI got the chimichanga. It was a delight. The meat was done perfectly and was very flavorful and not at all bland. Usually my rice goes uneaten, but this rice was about the best Mexican rice I've ever had. The beans were as I like them; full of cheese. \n\nThey have 2 sauces that come with the chips, one a chipotle, which I'm not a fan of, the other a spicy red which I slathered on top of my food.\n\nI'm sort of shocked at the low stars this place has gotten. My experience was grand and that's no bull! (Matador; bull; get it?)", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 4, "date": "2009-08-11", "type": "review"}
{"votes": {"funny": 14, "useful": 13, "cool": 12}, "user_id": "E5QyEU6FCQwnTys0S73zNw", "review_id": "7b7kwwuKahqAoY5tHsidlA", "text": "OMG NOOOOOOO!!!!!!!!\n\nlike Grand Master Flash said about the white lines \"Don't Do It\"\nRang dang diggedy dang di-dang \nDiggedy dang di-dang diggedy dang di-dang\n\nmy Torta Burro had no flava-dang, i was sad panda mang\n\nthis business has been in operation too long and clearly the owners (i doubt the original owners) stopped giving a shit. if they did the average rating wouldn't be 2.5 stars. i remember this place as a kid, i don't remember ever eating here. so i really cannot comment on how great it was. but like Sing High, the downtown nostalgia restaurants are extremely scary. just avoid this...it's not good. my plate looked sad, just a naked burro with a side of hashbrowns that were hardly crispy anywhere. the salsa was tasty, but i would hardly add a star to it. the service was compitant, but i couldn't understand her. i couldn't blame my ADD on it. my friend liked the menudo, but i wouldn't make that a saving grace for this place. cool logo on the building. very retro..but do not be fooled by it.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 2, "date": "2009-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "IhcTLLWKS6ZiNyIX9oQQPQ", "review_id": "IuGDOM0RoT5mewUia4jGCQ", "text": "The food was good - nothing extra special.  I like that you get guacamole with your meal and that they have lingua on the menu.  I will have to go back and try it.  \n\nThe things I did not like were they sat our group of 10 right by the server station.  It's awkward to overhear their conversations.  \n\nThe service seemed a bit lackluster.  It was almost as if they were not intrested in a big group coming in.  Our server was pretty good, but not overly friendly.  I will definately try this place again and update.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 3, "date": "2010-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IZ0QPjvhqbZg7pgONwYoXg", "review_id": "1YQyi-yxMLMXzoTvMqUYoQ", "text": "One of my favorite places for breakfast. Go for the chorizo con huevos or huevos rancheros. Noms!!", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 4, "date": "2010-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BlpVYy_op_BFn-kbJAAM-g", "review_id": "vnscOkaCpYsjcZa7TzJ-hQ", "text": "Badass Decor.   Incredible Salsa.   Great service.   Good food.\n\nCOME ON!    This place was closest to my hotel but I almost skipped it for a taco bar place because of these reviews about the food and salsa.    Lucky for me we decided to try it.   And to the reviewer with 1 * who says CHICAGO is home of authentic mexican?    I laugh at you.   I suppose if you think Chicago is authentic Mexican, then your 1* actually makes sense  (yes, I've lived in Chicago)\n\nOld style bar (beautiful) and woodwork.   Cool patio.   Service prompt, thorough, often, and with a smile.    Huge spaces with tons of tables for large groups.\n\nSalsa: They bring you two types.   In mini-pitchers so you don't run out.   And they are both GREAT.    And thick.   And spicy.   And \"guaranteed authentic\".\n\nFajitas were good.   Enchiladas were good.   Rice was good.   \nBased on the rest of my experience I would assume most things there were good.\n   \nThe Bad: \nNo Micheladas.   Flour tortillas seemed homemade, but something was off - I think we got older ones / stale - either make them fresh or change your recipe - something there needs a change.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 4, "date": "2011-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "nyHh14Vb9S269-kGKaUelg", "review_id": "x927gFqVNPSOPwNrKqPmmQ", "text": "I've eaten at Matador almost once a month for about15 years. I won't get into the logistics of others reviews. I give the higher than average star rating based on service and the salsa. Service was really good: the wait staff is always nice and attentive. Never a bad experience.\nThe salsa is fresh and good. Made chunk style with fresh green peppers and they provide, in abundance two kinds (I like to think of myself as a salsa expert...both the eaten and the dancing type ;)!!). They also fry their own tortilla chips. \nOk, so anyway for AZ/MEX it's good, not great. The combo plate is good, with a tamale, a taco and a cheese enchilada. This is food that is cooked for high volume. You can get much better in Arizona, granted but for downtown, it works. \nLunch is always packed, especially later in the week for the specials. Decor is old Mexican: still reminds of the days when most of the politico's would come down from the capital on main street to eat in the 70's and 80's. I love it. It looks dated inside and the booths are red leather. \nI've never experienced the bar or the adult beverages at Matador so I can't comment on the quality but it looks impressive. \nOne more thing: its a landmark in downtown. Anyone who works the downtown area knows this place and goes there once in awhile (they will admit it) for a quick AZ/MEX fix.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 4, "date": "2011-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "bfuVbKov5Uwcha6-l4ikFg", "review_id": "p6Uqa53oQQtzeIm1f7D0Ww", "text": "I went here for lunch yesterday with a few friends/coworkers and thought it was the cutest place I have been in a long time.  I have to admit, the area seemed a little weird to me, but maybe its just because I'm not familiar with the area.  We entered, and were immediately greeted and told that there is a hearing for the liquor license on the 28th...so that should definitely be a plus for this place.  There was a gentleman playing guitar which was very nice, but just a wee bit too loud for ambiance - we had a hard time hearing each other.\n\nTwo of my meal mates shared the hummus to start, I tried it and it was awesome as were the dolmas served on the side.  It all looked fresh and was presented very nicely.  I ordered the Champs de Elysee' sandwich which was TO DIE FOR...if you like brie, I highly recommend it.  The soup of the day was crab bisque.  When I asked our server if it was a red or white bisque he told me \"neither\" and then let me know that most of their items were nontraditional.  He wasn't lying.  I don't think there was a piece of crab in my bisque.  It was more of a broth, with large potato chunks and pieces of grape/vine leaves.  It wasn't bad, I just don't think I would get it again.\n\nEveryone else enjoyed their food.  The two downers that prevent me from being able to give it 5 stars are the lack of parking - some stupid macho man twit in his white Dodge Ram was blocking most of the driveway then almost runs me over trying to get a spot in the parking lot when he could have just as easily parked where he was sitting on the side of the road (which is where I ended up parking btw) and the soup.  It just wasn't a crab bisque", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2008-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "T7J9ae0wTskrI_Bgwp-4cA", "review_id": "KOIIoJq6iYawkwjSZHb-RQ", "text": "I think the ambiance is nice enough.  The background live music is nice.\n\nI LOVED the Champs De Elysee sandwich.  I can't stop thinking about it.  I found the potato salad with the ginger just okay but I am not a huge ginger fan.\n\nA friend ordered the turkey sandwich that has cranberries in it and liked it.  Another friend ordered the cheese platter and it looked just okay.  I think the one at House of Tricks is much better.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2010-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "N6fXTxMFxtHntDZnEotAtw", "review_id": "Tsyh1PsHAfcrqlD8uyhHXw", "text": "Let me tell you about a sandwich. Mostly.\n\nI was there yesterday afternoon to drop off a cruiser bike I sold to a new friend. She lives in the neighborhood and as it was an easy ride back to her place I met her there.\n\nI NEVER liked the old location on Roosevelt, and the new location is slowly growing on me. My preference will never be chairs with wire backs(I'm a booth man, personally)but it is clean and funky at the same time.\n\nBack to food: the Garlic Pepper Sirloin Steak sandwich was one of the best sandwiches I think I've ever eaten. Yes, lots of onions and garlic, not the date night meal, but wow...good bread, huge size...really good meat and sauce.\n\nWhy not 5 stars? Well, the good news is it's a full bar, and yes you can buy a PBR or Schlitz...but on Saturday afternoon no juices for mixing, and yesterday was very very hot. I think the wine and beer menu are varied, but it just seems the liquor menu is all top-shelf. I think Smirnoff vodka is just fine, same with Dewars scotch,etc. Take a tip from Carlys, Palette etc. and find a way to keep a varied price-point. Two drinks plus a sandwich was $22. plus and I tip 20%. I think I would have made this a five-star day if it had been a $16.00 to $17.00 meal and drinks. \n\nBy the way, the drink we finally created was a \"John Daly\", an alcoholic version of the lemonade/ice  tea classic Arnold Palmer. Due to a lack of materials, it was improvised by with some sweetened tea and sweet tea/lemonade vodka. Tasty, but pricey for Grand Ave on a sweltering day in the PHX.\n\nYes, I'll be back, but I'll ask the drink prices first.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2010-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YTw0hz4Y9z29xtd4axMcNQ", "review_id": "8evfajVpQcxcXftzKyHoPw", "text": "My experience was on a random Saturday afternoon, and I think that might skew my opinion a bit.\n\nDuring my visit we were the only guests dining.  There was one guy at the bar that was friends with the employees.  \n\nThe atmosphere is mellow.  And I can imagine it being a pretty happening place on weekend evenings.\n\nThe prices were a bit high for what we ate.  I had a pita sandwich and it was just under $10.  The lunch prices are a bit steep.\n\nThe food was okay, but nothing I'd go back time and time again for.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 2, "date": "2010-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wsouO79E-BW7lStwopkfjA", "review_id": "17bRqXZAuZBnyYqWdnDLNA", "text": "On our 100 things to do in downtown Phoenix, Paisley Violin made our restaurant short list. We love this place for so many reasons. It epitomizes urban culture, downtown life and a willingness to be part of the community.\n\nThey do all that and offer a great meal. We've brought some of our most critical friends and they walked away loving the place too. I would have given them 5 stars if the service was a bit more consistent. That said, the staff is lovely and down to earth.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2011-06-23", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "JkMOQaMjlBHMqp6gj-hL3w", "review_id": "92wk8MKUHXqzBHiKZkSeWA", "text": "Came by here for the first time on a Friday night to drink some wine and listen to some live music. I fell in love with the place right away, it is just perfect, nice and cozy, but not cramped. We drank a couple of bottles of wine and enjoyed being right in front for some great music. \n\nWe had already eaten not much earlier so I decided to get an appetizer to give their food a try. I was craving some hummus, but a few moments later I was advised they were out and the server suggested trying the baba ganoush. This was actually my first time trying this dish, ever, and it was superb !! I have also heard great things about their peppered turkey sandwich from a fellow patron, so I will try next time.\n\nAlso...while enjoying my Friday night, it got even better when the owner/manager came over and thanked us for coming in and gave us 2 complimentary meals!!! So, I will be back for sure to try some more food, you should really check this place out.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2011-08-01", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 2}, "user_id": "JkMOQaMjlBHMqp6gj-hL3w", "review_id": "grQ5XHLjiirUD4irqoxFwQ", "text": "Came back here on a Wednesday afternoon to redeem my complimentary meals with my daughter. When we arrived there was only one table occupied, yet it took about 10 minutes before someone came to our table, as we were waiting I noticed a fly flying around inside the sugar dispenser..yuck!!! \n\nThe server/bartender was very friendly throughout our stay, but as the only one working as tables started to fill up, service lagged a bit. \n\nI ordered the turkey/raspberry sandwich served with fresh mozzarella, lettuce, cucumber, raspberry jam, and mayo. This is a cold sandwich but the turkey was like room temperature and not very enjoyable. Also, the croissant was very flimsy and did not hold up very well to the ingredients. I  opted for the soup which was Mediterranean Chicken...waaaay too much pepper and not enough salt or chicken.\n\n My daughter had a similar sandwich (minus the jam) and chips. She said the sandwich was average, but the small broken chips that were on the plate looked like they came from the bottom of the bag...no bueno.\n\nAnother issue that I had was that the server/bartender went outside at one point, not sure what he did, but he DID NOT wash his hands when he returned and started making drinks & serving food. A few minutes later when he came to our table he reeked of cigarette smoke....this is not acceptable in any way. \n\nDespite the issues that I had on this visit I do still like the place for drinks and music...also the employees have been very friendly. I would return for these reasons and I hope that they make some improvements on the areas that I mentioned.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 2, "date": "2011-08-11", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "jt8jtEY1K6TD1FBzYa7HGw", "review_id": "bTSrBsqYrE7bx7jB4_OX_w", "text": "Zoe's get's a solid 3 stars b/c they have the raddest, most sinfully delightful chocolate cake around. The best part is it's only $2.00!  The reasonably sized slice of cake totally makes up for the boring, albeit sometimes satisfying food.  The chx kabobs are pretty awesome, enough for two people.  Comes with two huge scewers of chx, peppers, cherry tomatoes... over a bed of salad and rice pilaf.  Pretty delish.  The Gruben Sandwich is also a hit.  FYI -- If you don't like Feta, stay away from this place.  They put it on just about everything.  They trully believe in that old addage, \"Feta makes it Betta!\"", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2006-08-24", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "iwWBF3nKoRMoy1sbkLJwvg", "review_id": "V2U_nlR-TBTzt3v1YofusA", "text": "I seriously don't know how this place rates a three star average. Just like many other reviewers, I really wanted to like this place. The concept is great! But that's it, it's just a concept. The food is as sterile as the environment. The only thing that distinguishes one dish from the other is the texture... each item has the same bland taste. And as I am somewhat of a foodie, the thing that is most amazing is that I know you have to work to make food this blah. The ingredients seem fresh, they seem to have herbies and such to make them look good, but everything tastes like they boiled it until all the flavor was released, removed the food and tossed the good flavored broth.\n\nI suppose if one of your favorite food combinations is mayonaise on white bread you might be impressed, but IMHO save your money and take yourself anywhere else.  :)", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 1, "date": "2008-06-06", "type": "review"}
{"votes": {"funny": 8, "useful": 6, "cool": 4}, "user_id": "zHH2Iz49wCZYYDLBTv0YOg", "review_id": "ToobZdF-PHcB4GMuzOlWZg", "text": "Three stars because the menu's hit or miss. I dream about the grilled feta sandwich. Toasted just right, soft and chewy, so tasty. But I gagged on the pimento cheese sandwich. Couldn't even finish it. Tried giving it to the dog when I got home, but she didn't want it either. And she'll eat anything. One time she ate a whole tube of Neosporin. Neosporin! What a freak. Love the pasta salad, but can't stand the potato salad. I keep going back, I just get the same thing every time. Almost took off another star because one time some chicken somehow ended up in my grilled feta sandwich (I don't eat chicken), which I didn't discover until I was chewing. Yuck!. Took me a long time to forgive, but I finally did. Haven't forgotten, though - I still peek inside before taking each bite.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2008-07-23", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 4}, "user_id": "9VPNlcKsL99FvKtz1r9qJg", "review_id": "nAnhzRoToSYekjvDDdujFQ", "text": "Russ suggested My Florist for lunch since we were in the area, but I said, \"well I always go there at night and while sitting at My Florist, see this cute little lunch place across the street that I've been wanting to try, so let's go there.\" \n\nIt's good for a quick lunch and an alternative to fast food (anything is better than the F food).\n\nI got the chicken feta pita, it was okay, kinda boring.  I think I liked the design of the place better than the food. So, ++ for good marketing and design, now if they'd do something more interesting with the menu :)", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2008-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "4JapGtmN58pZYo1ClbV8qw", "review_id": "NrL4qThbgy10RDfewEC4zQ", "text": "This place is just OK in my book. I love the idea... a healthy alternative to fast food but it could be better. The first time I went I liked it but it's also hard to screw up a grilled cheese sandwich. Sooo... I went back and tried it again. My fruit cup was sour, my sandwich was stale and just blah tasting. I could do with out it. It made me sad though... it's so close to work I thought I was going to have a great place for a quick meal that wasn't going to top 1000 calories.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 2, "date": "2008-08-27", "type": "review"}
{"votes": {"funny": 5, "useful": 4, "cool": 4}, "user_id": "gWZldnzDeinTsXTvXsW6bg", "review_id": "fFO79MX0JFhacN01uvcupw", "text": "We get lunch at my office well, pretty much everyday. We usually stick to the reg spots, but one of the girls wanted to try this place. \n\nI had the Greek Pita w/ the pasta salad. It was pretty big but a little difficult to eat. Especially at your desk! I have to say though the pasta salad wasn't as great as I'd hoped. My coworker raves about the slaw. I hate it, so I couldn't tell ya, but I'd take her word... Take out was a little slow, but overall, for the price and what you got, I'd say it was worth. Good place to go for a quick lunch.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2009-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "C0WhCeFcuuBgKEHrQlyP1A", "review_id": "HoK9Ca3hUzJ1p8lm8m92aw", "text": "I really love the chicken and tuna salad.  Goes very nicely with their sweet tea.  Good sevice and good salads, and an overall trendy and upbeat atmosphere.  I would recommend it definately.  Plus the staff is eally nice too.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2009-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zing3W2AVxcHwmBHid-Fcg", "review_id": "VLpheKrQmfoJ7njBeT3QUw", "text": "I wish there were stars for service and food separately because I hate to give 2 stars to a place I like, but the service today was just...ugh.\n\nFirst off, I like Zoe's. It's not the greatest food ever but they use a lot of feta and I love feta. I am not a fan of the overdesigned feel of the restaurant, but whatever.\n\nToday, I departed from my normal and had a different sandwich. I asked the girl at the register nicely if it could not be too heavily toasted because I've had some turkey sandwiches nearly blackened to where the bread was useless. She not only proceeded to do a subtle half-eye roll, but she was outright unpleasant. I've never seen her there before and this surprised me because usually the people up front are really nice. \n\nWill I go back? Yes. But I'll make sure to not go to her if there is someone else available or just order it on the phone so that way if she does answer, I can't see her roll her eyes at me. \n\nOh, and they didn't burn my sandwich alright. Actually (if I could take a picture I would) they barely heated it. The cheese is still mostly intact.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 2, "date": "2010-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "KXoRjWfTxPT6LFkOdK6ovQ", "review_id": "b1bdvWjjwn5X9PSAQfC6QQ", "text": "Now I can't comment on their service, as I took takeout...but this place is DELICIOUS! I'm always looking for healthy places to eat for lunch and sometimes it's a strike-out. You know those places....the ones that promote good, healthy eating and when you check their nutritional values you just gobbled down 800 calories and 64g of fat! I had their Greek Chicken Pita and it was FABULOUS! SO good, so fresh, so tasty....and you know what else? Totally healthy! The entire pita is only 300 calories, so if you're watching like I do, this is great. There's plenty on their menu to keep you coming back too. And while you're there, try the slaw, different, but quite good! I'll be back for sure!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2010-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "xdWsnbaTEfBMVHttqZDHxg", "review_id": "T03sOhTInQgwhsMfKA3CLg", "text": "My downtown friend saved me from the Arizona Center (where the Los Olivos car wash dropped me off) and took me here.  For under $7, their lunch deal was pretty amazing.  Pick a (good) sandwich, side and chips.  The reason why I'm impressed it was a whole chicken breast in my Med Chicken sandwich... I thought Greek marinara meant code for the tzitiki (sic) sauce, but really it was red marinara... Greek maybe for the green seasoning on the chicken?\n\nOverall it was tasty, and the lemon limeade my friend calls crack.  Six blocks from Los Olivos car wash if you're trying to kill time.  Saw they have a security enabled wifi network but didn't try asking for the wep key to see if they share.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2010-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Zcx66YAlgyClDEhi5W86Hg", "review_id": "aPwYpobtunHTeCB6fwVSPA", "text": "Just didn't feel like making dinner tonite, and wanted something quick, yummy and good for me.\n\nI noticed Zoes on my drive home and decided to stop in and check it out. The food was pretty good! I got the grilled chicken platter with a side of rice. I left feeling full (but like the good kind, not the \"on my God I'm gonna pass out\" kind ;) and satisfied!\n\nI gave it 2 stars because it is kinda generic and there are so many hidden gems to keep an eye out for.\n\n:) Enjoy!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 2, "date": "2010-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8d3AGso7vTLYxXrLrkO9aQ", "review_id": "940mlj-9HmuMdGeiggaWxw", "text": "I went to Zoe's Kitchen today for lunch and ordered the Ham & Swiss grilled sandwich. My first experience with Zoe's was mediocre, but this time was much better. There was a lot on the menu to order, but I was in the mood for something with flavor but simple. It definitely hit the spot. I work downtown and it was quick, there was seating available, but a lot of people there, and parking was much better than Pei Wei (right across the street).", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2010-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-YLtOLwOh1_xxxBnGtuvNg", "review_id": "QCUHoPem82faS0eTCYrQUQ", "text": "it is very nice to have a healthier alternative during lunch. That being said, the food really isn't that great and is WAY OVERPRICED. My small pita sandwich (comes with a side), and drink was over $10 bucks. You can go to Paradise or Subway for a whole lot less. Not only that, but there is never any parking available, and most of the menu items are completely bland. Drop the prices and add some flavor to the food.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 2, "date": "2011-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "100Df1wcVrl9rJgB7EG6xw", "review_id": "h7KXdlTxDiTWX9FUvt0vLQ", "text": "Zoe's is a great place to go to when you dont want to cook dinner and you need something healthy.  I went there yesterday after the gym and ordered the chicken kabobs with extra salad.  Nothing really special about the actual meal, it is just chicken seasoned with some grilled veggies on a bed of salad.  One cool thing about this place is that you get a free small drink after 5pm when you order a dinner meal.  When I checked in on my iPhone I also received a 10% off my next meal there, so I will go back sometime soon.\n\nThe girl that helped me was really nice which is always a plus!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2011-07-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "z06IHGXI_ofBc2DkAbCgnA", "review_id": "9zyNu1SJ1yoq4ycBOPJhVQ", "text": "I forgot how much I liked Zoe's.  I used to come here all the time but just stopped for some reason.... now I'll put it back on to the \"usual\" list for sure.  The \"Grüben\" grilled turkey sandwich on rye is super delicious, and I can't get enough of the feta coleslaw, though the pasta salad w/ basil is really tasty too.  I noticed they've added braised white beans as a side option which is intriguing; can't wait to try them!  The service is always ridiculously fast; which is a plus for a 'fast/casual' type place. \n\nThe chocolate sheet cake is super yummy and reminds me of the cakes my grandma used to make.  You always get bonus points for reminding me of my grandmother. :)", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2011-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "abYued9Tx5_dNeqpzmun0Q", "review_id": "l3dmqfci7tkdPaNyurCrJA", "text": "This place is the best! Always friendly staff, super delicious salads and chicken kabobs. Would recommend to all!!!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 5, "date": "2011-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LZrS2Uwzjo5E_qAm-P6TlQ", "review_id": "oN7kE_szEnRhTtQU_hgNMg", "text": "Spinach wrap and iced  tea, can't go wrong.  Perfect for lunch. Always nice staff as well-service with a smile.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2011-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7ToIE5d3_oyqJ6zyxg1OVA", "review_id": "ojhRoeFlPBrz4Uq9-ZQumg", "text": "Everything I've ever had here is excellent (I've probably eaten here about 10 times).  The \"Grüben\" is my favorite (grilled turkey, swiss, slaw, spicy mustard, rye bread), but chicken roll-ups are a close second.  They offer a great selection of sides, and the fruit is always fresh. The limeade is so worth it in my opinion, though I don't think you get refills on that.  (Note if you buy a big cup you can bring it back for a deal on the limeade.)  Also note that if you check in on your Yelp phone app, Zoe's gives 10% off; every 3 check-ins gets you a free piece of chocolate cake. I'm a fan of the cake as are many others, though my wife didn't care for it.  Oh, and the parking: very tough to get right now with the construction next door. If you wait a few minutes you should get a space in the lot and won't have to park around the corner. (I haven't tried parking in the costume store lot.)", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2011-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CtuoM6_Im-xBZMAqPKMQ8A", "review_id": "1E4OhpLcgl_-zC4vLzcKGw", "text": "I went to Zoe's Kitchen for lunch last week & had a great meal. I ordered the chicken salad & fruit plate which was pretty big. By the time I ate the chicken salad & fruit I was so full I couldn't eat the remaining greens. \n\nThey have a ton of soup, salad, sandwich & hummus options - can't wait to try more!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2012-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jWpbwcHxQtggzIISVmDGvg", "review_id": "2PibJWOEympfBzj3VVirTA", "text": "Awesome lunch spot! Very fresh foods, you can tell exactly what you're eating.  Even the fruit salad looks made fresh daily (and its not your usual melon and cantaloupe mix).  Their menu is healthy to begin with, but you can also ask for their Simply 500 menu and see all their options with 500 or fewer calories. The Greek chicken pita is huge and only 460 calories...delicious!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2013-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "3gIfcQq5KxAegwCPXc83cQ", "review_id": "BKWmcwV8EPOrGuN6BRdWvw", "text": "This place is good, but nothing incredible. I went here for lunch today and it was busy! It was difficult to find parking, but I managed to snag a space (in the lot next door...shhhh don't tell!). Anyway, it was easy enough to order, although none of their dishes really screamed at me (most of them sounded ok, but not great). At someone's suggestion, I ordered the chicken roll ups and they were alright. The chicken and the onions were good, but I think maybe the cheese or something in there made them taste just slightly off. Anyway, it was good, but I wouldn't run over there to get it. This place does get points for being fairly inexpensive and quick.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2013-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "n9RsVHVAD9n4IGN48xY1JA", "review_id": "ruYs-gN9gyCzsFCSj1bq0w", "text": "First off AMAZING chocolate cake!! Most of the good is awesome !! But sometimes service is a little slow :-/", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2014-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DwTKScyPaGXMm3D033JzZw", "review_id": "npP_cvO4Gg8ozqmInM93-Q", "text": "The kabob dinner was delicious. The chicken tasted great, the greek salad it was served on was flavorful.\n\n***HOWEVER***\n\nIn an attempt to order, I stood DIRECTLY in front of a woman I presume was the manager for several minutes while she scribbled down a catering order as if her life depended on it. When she finally looked up, she pretended she hadn't seen me walk up (\"Oh, I didn't see you there...\" ...really?!? SO cliche, don't do all that, girl...) and implied I should have tried harder to make myself known. Thanks for the lesson on conducting myself socially , but NO THANKS.\n\nThe cherry on top of that experience was the latex glove I found buried in the greek salad on my second bite. \n\nThe food is good and most of the staff is friendly and attentive, but that woman!! She needs to be Gordon Ramsey-ed right in the face!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 2, "date": "2014-08-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "wUEp87FqOB9ew27Iz6zk_w", "review_id": "ALNdQii1serFG-JTKvAzWQ", "text": "This place is a chain restaurant, so it doesn't really need a review, but since I eat here probably once a week, I thought I'd give my take on it anyway!\n\nI think their Greek salad is great.  It has veggies on it like cucumber, tomato, green bell pepper, and those pepperoncini peppers.  Their dressing is light and simple, which I love.  I can just order the side of Greek salad, which is like $2.80 and I feel pretty full after that.  But I usually also get a side pasta salad or side of hummus also.  The other stuff on the menu is not that great, nothing spectacular -- oh except for the chocolate cake!  I love that cake and the frosting they put on top which is thin and forms a slight crunchy crust on top.  My only complaint with the cake is that the slices are cut very inconsistently.  So sometimes I get small slices and sometimes I get huge slices.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2014-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cCq0GfHbyjE6r8zGjZmiTQ", "review_id": "AY-uytT3uVP85jt2f797DA", "text": "My first time here. I ordered the GRuben sandwich which was recommended to me by the cashier. it was worth it! Next time I think I would try the kabobs tho. This location seem to have lots of seating. The staff were very accommodating and friendly. Overall it seemed quite clean also. parking seemed to be a bit limited. I would definitely recommend this place and I plan to be back!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2015-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PgXCMYED6OdJ0TmMBfAiog", "review_id": "FDr-jfRgNdG-9PM1ycV3ng", "text": "Their Greek salad with chicken and chicken salad sandwich are amazing! The employees are always very sweet. I almost hate how much I love this place!!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 5, "date": "2015-07-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pTJ2Y1YXqLX3LXbzzoFLdg", "review_id": "Ik4HdOs2QSyNTvkMb6Vy6Q", "text": "I catered lunch today for some of my medical providers and other staff. I'm rather meticulous when I order food for my team because I want it to look amazing and taste even better. Well, we enjoyed both of those things with Zoe's. First impression was with their delivery driver, he was extremely professional and thanked me for my business as he handed me my receipt. The food was absolutely delicious and just beautiful. It was exactly what I ordered. Then... it really blew my mind when I got a call from Nichole, at Zoe's, later that afternoon asking me how the food was and was everything how I ordered it and she asked me if I had any feedback. I was so impressed by their professionalism and a company that actually calls you to ask if they met your service standards. YES, Zoe's Kitchen on McDowell & 7th Ave in Phoenix you met all our services needs and then some.  Amazing food and staff!!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 5, "date": "2015-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5Z6BhKp_rdTIcg8xZ4NZIg", "review_id": "EEglQdMzPpYkdBFemUHXdg", "text": "I used to go to Zoe's a few years ago but moved. I decided to give it a try when I was in the area. The food is just as good as it used to be. I can t say that for a lot of places. The quality of the food is good. I ordered a chicken pita with slaw. I had a side of pasta salad which had fresh basil, tomatoes, and feta cheese in it. I also splurged and had the chocolate cake which is so moist. The lime aid was good and not too sweet with a little bite to it. If you go I would recommend splurging for some cake.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2015-08-11", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "bl69-2c_Amf4SGqoAmANig", "review_id": "2apQLZ3FnCTdtEzjm9swIw", "text": "I've been coming to this place for while now and I got to give them credit they are accommodating . they once got my order wrong and just gave me about 40 dollars of extra food. But anyways this is favorite spot on the McDowell and 7 ave food selection area. The food always taste fresh, the people are always nice and its not to expensive. Personal favorites the chicken roll up with white beans so good. I also like all the he kabobs. I feel like a good meal with cost 10 dollars usually, the wait time after ordering isn't to long  10 to 15 minutes after logging. It good chain and I recommend it especially if you want to see some green added to your diet.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 5, "date": "2015-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "VBEbhE0ISjg6xowGNiGmgQ", "review_id": "IwXPzUuy07tGEIhv7Qsqww", "text": "Convenient and tasty. I work right next door to this place, and it's like my office's cafeteria. \n\nThe best thing about this restaurant are the wonderful people who run it. They're always very friendly and helpful. \n\nThey feature a surprisingly diverse menu that ranges from the obvious (gyros and pitas) to the not-so-\"Athenian\" (egg salad sandwhiches and ruebens). \n\nOne thing I really like about this restaurant is how generous they are with their high-quality indgredients. You can really tell they don't cut many corners.\n\nIt should also be mentioned that they have the best Greek salad in town. It's delicious! (just get it without the onions, thy're way too strong)", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2007-07-27", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 4}, "user_id": "WZCAwPXauKtNoAhHK2-pCA", "review_id": "3OC_ss-Gaw8X7K5axVg5QQ", "text": "Athenian Express is just that.\n\nNo, not \"Athenian\". . .\"Express\"!\n\nAnother in the long list of counter-service restaurants in Phoenix, this could quite possibly be the fastest ever.  After the wife and I had placed our order, we filled our fountain sodas, gawked at the impressive selection of hot sauces, selected a table to sit at, and before my butt even hit the seat the food was on its way to the table.  Impressive!  Finally a place to grab a quick, hassle-free lunch.  And, well, since they aren't open past 5:00PM or on weekends at all anyway, I guess this place has figured out its niche - the downtown lunch crowd.\n\nThey offer a huge variety of subs, pitas, and salads, most of which are your normal deli standards.  Most of the actual Greek offerings aren't even listed on the regular menu but as \"sides\" - falafel, spanakopita, dolmades, hummus.\n\nWe ordered a gyro and a falafel platter. Be forewarned, the \"garnish\" that comes with the falafel pita is essentially a side salad, I made the mistake of getting the side salad instead of one of the other sides and had two big mounds of veggies.  Not a big deal, just something to know for next time.  \n\nThe food itself wasn't spectacular by any means.  In fact, dare I say the gyro meat looked pre-pacakged and was DEFINITELY not freshly shaved off a big rack of lamb, the pieces were waaaay too uniform in size and shape.\n\nBut hey, 2 super-quick large meals and huge sodas for $15 works for me!", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2008-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_lA4GgcUKW1f892o5jGhBQ", "review_id": "e1uzSGecVi9q60RSbvmdbw", "text": "Summer time is supposed to be \"healthy time\", so I am trying to watch what I eat. Now, I will always be a big guy (not \"two fat twins on their matching motorcycles\" big, but you know, not little) but I definitely am eating more appropriately. However, I work in an office, and around 11:30, people start to double-think their lunch choices. Yes, the night before, a breakfast bowl from Jimmy Dean sounds like an excellent lunch selection, but all that pushing of buttons and watching your meal spin in the microwave? Forget it; one \"What are you doing for lunch\" from a buddy and I was out of there.\n\nAthenian was a prime lunch spot for me for awhile, and just fell out of favor. No time like the present to return, plus SB had never been there before today. We took the 2 minute drive to Central and rolled in to a 1/3 filled Athenian Express. Happy to have missed the rush, I immediately ordered my favorite dish, the gyro feta (no tomatoes/onions, add lettuce) with fries, and SB got a chicken sub and potato salad.\n\nFirst issue, no fountain soda? If I can't destroy myself with aspartame in my free refills, it's not a great lunch. Plus, I don't like drinking out of cans unless its a more adult beverage. Fix yo machine, Athenian!\n\nOutside of the $1.50 soda, the meal was as good as always. It was a bit lighter on the feta than usual (and LOVE me some feta goodness), but still had quite a pile. The meat was thick and cooked through, definitely filled up the pita to an overflowing Greek party. The french fries weren't overcooked, which is good because burned fries suck fully. Add in a side of tzatziki sauce to poor over everything, and times were well spent. It's a ton of food for what you pay, and one of the best deals downtown.\n\nMy coworker didn't fair quite as well, but it was more his preferences than issues with the meal. His chicken sub came with a huge breast, which I would think is a good thing, but for him caused the sandwich to be overstuffed (like I said, weird preferences). He demolished the entire thing, so it must have not been too bad, along with the potato salad, which he was a fan of as well.\n\nAll in all, very good lunch experience. I usually get take-out, but the Greek team had their World Cup game, so it seemed appropriate to hang out and watch the \"exciting\" 0-0 match-up. If we can get some fountain sodas up in there, Athenian will likely jump back on my radar (and I may even get a salad.....maybe).", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2010-06-22", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "7C-jyTrOX-iJ-MrSJuh-8A", "review_id": "zQaa2kuXNad1fwNl9y_Hgg", "text": "You must look for the signs to park in the park and they will direct you, might I mention that right across the street is Short Leash Dogs? so take your pick. The inside is surprisingly big, dim, and cool. If you enter in the back to your right you will find the enormous condiment counter with every hot sauce, sauce you can think of. The menu is really big and we took about several minutes to look everything over.\n\nIn addition to that, there are signs to modify everything if that doesn't make the menu that more exciting. Platter of big chocolate chip cookies, brownies and lemonade were calling my name but if it were not for my diet, I would have given in. I had the usual falafel plate with french fries and my other diner had the steak sandwich. The fries were thick but tasted a little old, and some were brown like they were old. The falafel was crisp, they are fried into little discs rather than balls and the pita bread, while soft, appeared not home made. \n\nI felt like I was still hungry after this meal. My companion's sandwich he proclaimed was good but was a bit too small, and the potato salad it came with seemed to be made with lots and lots of mustard and very little mayonnaise. The service was friendly and I will probably return to try something else as I saw they have breakfast specials but it has not become my most beloved of places.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 3, "date": "2011-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lVEF4j-pU3TAlL4WeZ0BuQ", "review_id": "QQFN9bKTvHE8tHwAjyFi8w", "text": "The food is very tasty, just not always very fresh tasting in non-peak hours, i.e. 3 pm.  However they have a very interesting take on Greek food and they aren't too pricey.  Definitely worth trying and worth the occasional lunch trip.  Also parking can be tricky to find, but its in back.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 3, "date": "2011-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Dw0b16ira4GoAm0wlWlYQA", "review_id": "I_lvcb1hzAJ7flTvnVfRHQ", "text": "Feta gyro, how i love thee! \n\nAthenian Express has an entire wall dedicated to menu options, and I just can't get myself to try anything different. The prices reasonable, the food fresh and tasty, it's a great lunch spot downtown. I visit, and will continue to do so at every opportunity. If i were to change anything, it would be to open for dinner and fix your soda fountain. But I am one happy customer! Lightrail accessible and parking in rear.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2011-08-01", "type": "review"}
{"votes": {"funny": 5, "useful": 6, "cool": 4}, "user_id": "cRyNICH0mhjxagvSyVr60Q", "review_id": "-mFB4Y6hDP3zhsApuI4U_A", "text": "I wouldn't exactly call this the best gyro I've every had, nor would it be a close second - or third.\n\nThe gyro was made with pre cooked pieces of (beef/lamb) gyro and not sliced off a cone. I'm not sure where this new trend is coming from, but I've had a few gyros from othe Med. places around the valley, and all were made with the same or similar pre packaged gyro pieces.\n\nIn case any gyro / greek / mediterranean restaurateur cares, the pre packaged gyro meat is NOT GOOD. I'm just not sure what else there is to be said. If you can't do a decent gyro, I'm just not coming back. Sorry. :/", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 2, "date": "2012-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "At7cNBShE1OErhavh4Q9Hg", "review_id": "Ia888hPLGrT4Dgf1B1wTPw", "text": "I LOVE Athenian Express. The vegetarian pita with hummus is SOOOO good!! There are tons of vegetarian options, actually, which is awesome. And I love the people there too :)", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 5, "date": "2012-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DhLAQcBvOwJwDC1FHuUifw", "review_id": "4iJltbaKqOkvF9v7yqkU0A", "text": "This place is awesome when you want good food and dont have much time. When I am in a pinch I will order the falafel to go. It is filling and yummy!  I have also had the gyro and side salad on previous visits. Highly recommended!!", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 5, "date": "2012-07-11", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "Ni0SC2zIhemP_3rDGeN9AA", "review_id": "4RO3O8pL-AuEbbE42yL0hw", "text": "yep. tons of feta on the feta gyro hides the fact the meat is missing. \n\nweak.\n\ntry king gyros on 43rd/tbird. little out of the way, but way better and you wont leave hungry.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 2, "date": "2012-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Xp7TZzQ-To7MUAfEiji2SA", "review_id": "EC8xiXvEcaiJtiEO3MWlrQ", "text": "LOVE this place! I eat here on a monthly basis and always have great services and food. It's affordable and quick! Definitely worth checking this place out!", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 5, "date": "2013-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JsimV2W4h6_H6sybcPyU4Q", "review_id": "2350UHu3NmLvzDVj2FtXVw", "text": "It's a good place for lunch in Phoenix. The food is inexpensive and the service is always friendly. They also deliever but the last time I ordered delivery, it was well over an hour by the time my food arrived. I either eat there now or order ahead and go pick up.  \n\nThe vegetarian pita with hummus is really good. They sautee the vegetables and always put plenty of hummus on the pita. I always get a side of fruit with it because the fruit is always fresh and a good selection. Most places just do melons for fruit cups, but this place includes berries, kiwis, and grapes which make for a great dessert after lunch. It's a lot of food though, so come hungry or be prepared to leave some on the table.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 3, "date": "2013-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TXN53-oke4gHDdLAu4ksBQ", "review_id": "iM4LI4LkkDxNyISJOprjnA", "text": "When I want to go Greek I go to Athenian Express!!!!! This place is totes amazeballs. I love everything from the hummus to the falafel...they have patio seating so I prefer to go to the restaurant and sit outside. Very CA casual and peaceful. Def make a point to visit.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2014-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-E3Wben5kMnB7JitzvI7TA", "review_id": "VpOOYb-uqq227Pz9oMRrNA", "text": "Locally owned, authentic, good prices, big servings. Gyro meat is moist and full of flavor! Veggies are always fresh. Feta is the best! Go to in the Roosevelt Row neighborhood.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2014-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "N1koTSTyiLCD8zH0rHSh4w", "review_id": "Ua4J4Z67L-33B3Ajg_Nxhw", "text": "gotta say that this place failed on the majority. service was slow and rude. the hummus was almost all tahini, no lemon juice, and no seasoning. lentil soup was like chef boyardie chili gone bad.\n\ni dont recommend this place at all. lots of choices in the area.", "business_id": "FltN1Hnw4n7BORXJH1kaeg", "stars": 2, "date": "2008-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "mUUy72UfqmFj_krWclKELw", "review_id": "cjjM7q6UJ-WikOnpzsp8MA", "text": "the food was delightful! i've eaten here twice and enjoyed it! the service was very friendly and good place to sit down with your friends and just yap away about your horrible day. the food will cure away your hard day at the office. if not then just go to taco bell and call it a night. \n\ni also  like the setting inside, it's lighting is a great place to take out a date if both of you are adventurous about trying out a totally different place to eat. HURRY they're closing in October as Bobby Q. stated on his post. \n\nI will try to go there before their doors are shut for good. :(", "business_id": "FltN1Hnw4n7BORXJH1kaeg", "stars": 4, "date": "2008-08-25", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "1S7XdhbZWR17Wy4TBsIzaw", "review_id": "W10M_hLCDVnMc_lXc9nRaw", "text": "Bacchanal's is another big group restaurant.  It's more fun if you have at least six people. \n\nThey have a live band, belly dancer, plate tossing, dancing barefoot in the parking lot, what more could you want?\n\nThe food is quite tasty, and the owner of the restaurant is always milling around checking to see that everyone is having a good time.   You can't help but have fun unless you're just a sourpuss.  It helps to have awesome friends to make the night even more memorable.\n\nI seem to remember someone dancing like the Ally McBeal baby....hahahaha....", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 4, "date": "2007-07-12", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "f9qlFSrJBZZ6zCg97YTeOg", "review_id": "UEfdNBmlPhM_l648Y8oFpA", "text": "Bacchanal has an FQ (fun quotient) that just can't be beat.   My journey to Bacchanal was just a hoot.  We held an office related function at this hidden treasure and simply had a blast.  The food was good, or at least that that I took the time to eat.   I was so enthralled in our belly dancer, plate throwing and eventual group dancing that I failed to really enjoy the food, but from what I recall it was all good.   The owner treated us all like family and made us all very welcome.   They also worked exceptionally well with our company in advance of the event and customize the evening to our group.  If you go, go with at least a small group and make a night of it!  Opa!", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 5, "date": "2007-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 3}, "user_id": "engDBDCpr56s1wt96JLDng", "review_id": "bV_XcGdlBxicy0BzlTuPZg", "text": "This place is a blast for entertainment. You feel like you have crashed a greek wedding. I think the next time I go, I skip dinner and just have a drink in the bar. The food is overpriced, bland and it is so loud you cannot enjoy your company. If you come for dinner, you sit thru the band playing the same rifts over and over. I can only yell in my neighbors ear, so the rest of the table is forgotten. But for a rowdy group that just wants to drink and dance, this may be perfect!", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 2, "date": "2008-06-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "ioTuTA_pI-ZgiM4uISDQPg", "review_id": "OT8Jq2Q5zA3_Eatxe5TQow", "text": "We went last night.  If you want to drink Greek beer, ask what they have, it's not all on the menu, which is kind of cool.  We had Marathon and Mythos, preferring the Mythos.\n\nWe got to saganaki, which is good, $9 which I thought a little pricey but it was very good.  We also got the Mushroom stuffed with crab appetizer, tasty as well and they give you 6 big schrooms.\n\nThe Greek salad is very diverse, the dressing is not my favorite Greek dressing but it still was plenty tasty.\n\nFinally, we shared the Fantasia plate $22, it is a sample of everything and everything was good.  The lamb was very tasty and we really liked the Greek lasagne.\n\nI don't know if they have the band and belly dancer every night but last night they did and that was really fun.  So for dinner and a show the place is worth it even if the dishes are a little higher than most Greek places.\n\n\nThe owner, don't know his name, is very excited that you come to his restaurant, which is a nice touch :)", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 4, "date": "2009-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0RLbaKxvnLgoQJD60BRy2Q", "review_id": "C7a51nYuK4pc-bBfjVk-iA", "text": "The Bacchanal is the BEST and MOST AUTHENTIC Greek restaurant in Arizona and by far my favorite place to go.", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 5, "date": "2009-06-07", "type": "review"}
{"votes": {"funny": 5, "useful": 5, "cool": 4}, "user_id": "wHg1YkCzdZq9WBJOTRgxHQ", "review_id": "Gx8zTHqyCYQuvnk7dO2TVg", "text": "Maybe more like 3.5 stars.  Does someone at Yelp not understand the power of a fraction?\n\nWe went on the advice of friends, expecting to see bellies shaking, plates breaking, and all around havoc.  Unfortunately, depending on how you look at it, no such luck.  The entertainment does not start until 7:45.  We arrived after 6 and were the only diners there, but we were warmly welcomed by who I assume is the owner.\n\nThe server/bartender generously offered me tastings of two Greek white wines.  Then proceeded to fill up my chosen glass, and I mean fill it up, to the top.  Was it the best wine?  No, but there was a lot of it!\n\nWe ordered the baked Kefalograviera flaming cheese as an appetizer.  Cheese on fire is always fun, but the cheese itself...just okay.  It's a hard sheep's milk cheese, salty.\n\nSince I'm horribly indecisive when it comes to food, I had the Fantasia platter.  It included dolmade, pastichio (a lasagna), moussaka (layers of eggplant and potato with a red meat sauce), arni psito (leg of lamb),  and kota Athenian (chicken with mushrooms and artichokes).  The lamb and moussaka were delicious, and I would recommend either.  The lasagna was okay, but nothing special.  The chicken dish was disappointing to me.  It was dry and lacked flavor.\n\nOur service was great, attentive without being obtrusive.  And the owner thanked us as we left.  Seems like it could definitely be a fun place while there's entertainment...hmmm, possibly the makings for a Yelp event.", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 3, "date": "2009-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "crrp9oqSWsVnDHPKgy_bqw", "review_id": "dNeus5pr2U1iKGFjTa9_mg", "text": "live greek music, belly dancer, and uozzo 12 - how can this trio disappoint?\n\nso what if the food is just ok?  there is just too much fun to be had here.", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 4, "date": "2010-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "eb8GBhjkFBk8Nwjz-rHr_g", "review_id": "8vIGPkTKrNJ_s2eH_XNKGw", "text": "being in Greece!\n\n2_fewdgasm\nAugust 15th, 20:30\nI've never been to Greece yet it's on my bucket list! The food is amazing, the people intriguing and the scenery incomparable!\n\nThe closest I've come is visiting local greek restaurants. Years ago ( 1989 to be exact) a new restaurant opened and sent mail coupons to advertise. Taking a chance I ventured out to find the most welcoming, friendly atmosphere with greek food that made me feel as if I had been transported to a greek island! A place where the owner greeted each patron upon entry and gave them a hug or a handshake to say goodbye...what a treat.\n\nSadly, I've only been back a handful of times. No particular reason, just living life and business.... \n\nSaturday, I was thinking of belly dancing , food and good company. My companion and I decided to head out to The Bacchanal restaurant in Phoenix. \nI was hesitant as it had been eight years since I had eaten there.\n\nMy heart leapt and a smile crossed my face as Yoryos, the owner ( a bit grayer yet he had the same spring in his step and welcoming smile on his face) greeted us and seemed genuinely happy we arrived. The live greek band had begun to play and already it was feeling like home.....\n\nWe were seated quickly and promptly ( I recommend reservations on Friday and Saturday nights). The wine list is not extensive but has enough greek wines to interest a connoisseur. The atmosphere was dimly lit with candles, white linen tablecloths. Mirrors added the aura of more space and allowed one to see the dancer from every table.\n\n\nWe started with one of the appetizer variety plates ( Tiropita, spanakopita, dolmades, feta, kalamata olives,\nstuffed mushroom, and tzatziki dip ) The Spanakopita was cheesy, delicate melt in your mouth. The stuffed mushroom ( bacon) was firm not mushy and the bacon was delicate not in your face.\nThe Tiropita was gentle with a buttery crust and delicate cheeses inside. All in all a lovely dish as a good introduction to greek food.\n\nOur entrees arrived. The traditional Moussaka looking lovely in it's red sauce paired with lightly salted potatoes and a mixed vegetable. It was meaty, hearty , tomato flavor that tasted as if your greek mama slaved over it all day. Just enough mix of onion and egg to bring the flavors of the lamb alive. \nThe Veal Bacchanal was served in a creamy white sauce with mushrooms and artichoke hearts! It was tender, juicy and subtle yet very tasty... one bite combined with the artichokes and mushroom made me close my eyes and just say \" AH'. fewdgasm! \nIm usually not a fan of mixed veggies but the spice and tenderness made them quite tasty.\n\nAs we ate and enjoyed our wines, Alexia , the belly dancer began her moves. She is Yoryos' wife. She was very fluid, beautiful skilled and playful! She moved around all the diners....collecting a few dollars along the way :).\nThe restaurant was full with many birthday groups ( the largest being 25) Yoryos and his wife invited many diners on the dance floor . One beautiful older lady ( 90 if a day) was up doing her own belly dance moves.\nIt was as if one were in a greek home partying until the wee late hours!\nOf course we hit the dance floor a few times !\n\nAs we left Yoryos spoke with us about our evening, my children, his children.... and after I received a kiss , hug and admonition to not wait eight years to come back.....we went home with soul and stomach happy and content.\n\nI give this restaurant 4 of 5 orchids! The service was adequate but not exceptional.\n\nIm ready to go back and next time it will be for MY birthday ! \n\nThe Bacchanal \nBacchanal\n3015 E. Thomas Rd.\nPhoenix, Arizona 85016 \nTelephone: (602) 224-9377\nBelly dancing Friday and Saturday night ( 8-1 ) Live music 8-1 am\nOn Friday and Saturday they have special performances of Folk dancing and traditional Shoe dancing. And of course belly dancing!", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 4, "date": "2010-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "ac2FRbOgBkC7zJOWlTlFAQ", "review_id": "er8GEyK5x81T8VBemIAGIg", "text": "I absolutely adored Bacchanal! The wine, food and live Greek music is amazing!!!  If you want to let loose you can here!!!! Practice Belly dancing, greek dancing.....bare foot dancing ;) and break plates .......truely the best time I've had in a while. Check it out!!!! :)", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 5, "date": "2011-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "UoBfwbXaixelZBghbJ2cSg", "review_id": "nOjwHN32qbrUjF8rqlAJeA", "text": "I have known about this place for years, but just went for the first time last week as a default when we discovered that the Big Fat whatchamacallit place across the street had closed. What a nice surprise. The staff was very friendly although they hovered a bit too much for my liking. The food was spectacular, and as a vegetarian I had a lot to choose from (although the menu needs some help; things marked with an asterisk are supposed to be vegetarian, but there were asterisks dotted all over fish dishes). The array of desserts was to die for. My main complaint? Pricey like woah. And it was sneaky pricey. There were three of us; our main dishes were $10-$12 each, with a $9 appetizer, 3 desserts, cocktails, etc. and the bill was over $160!!! I thought my poor boyfriend was going to crap himself.  I honestly don't know how it got that expensive. The drinks? The desserts? Were the baskets of pita $8 apiece? I mean, a Greek meal costing  more than a steak extravaganza at Cork and Cleaver? Come on. While all three of us just loved it (a rarity, as we are all differently picky), at that price, it's going to have to be reserved for special occasions. Sheesh!", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 4, "date": "2008-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8LAf67lQTjtsS98E55MYrg", "review_id": "aH2F4m5TvjSSoss3gu2QDg", "text": "How this place stays in business I have no idea. Food is gross,  the place is empty all the time, small dishes, over priced. Service is totally crap. The parking lot  looks like a place one could get raped in. If you're handicapped you are screwed one parking space for the whole building. Pot holes everywhere, I can't believe they haven't been sued yet for the condition of the parking lot.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 1, "date": "2011-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "rGPI0G1w0bWrf1AU9PYdMg", "review_id": "vTi3tlWAiH8HhnE4TnZgGA", "text": "We were celebrating my husband's birthday and Father's Day combined and I had make a reservation ahead of time via Open Table.  I mentioned that we'd like a quiet table as my parents have some trouble hearing.  So wonderful to be greeted as we came in the door and to have our request acknowledged!  The lovely owner/hostess mentioned that she had selected our table personally based on our request and offered others if we didnt like it - so nice!  Sometimes those requests fall into the black hole so it was wonderful to be treated like a special guest.\n\nWe had eaten here before and were looking forward to all the wonderful food and were not disappointed - everything was delicious - moussaka, calamari, saganaki, gyros plate - all great!  The bread is very special too - I think it has a touch of anise.\n\nOur waiter was very attententive and made us feel special!  Thank you for a lovely evening and we're so happy we chose Greekfest for our celebration!", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2012-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "gxT6EtxJfI0KUp9y68k0zQ", "review_id": "fYnNQ940R2bzmfPHBh2yvQ", "text": "Tony and Susan have made their mark in the Biltmore restaurant scene with Greekfest. I used to live in the area for about 4 years before moving back to the midwest and Greekfest was a place I could come to, to treat myself for any celebration I deemed necessary. My wife and I had our first \"business date\" here and the rest is history. We were in the early planning stages with Susan to have our wedding here, but certain circumstances had everything move to the east coast. \n\nOn my first visit here back in 2006, my parents and I learned that Tony brought all his herbs from Greece and transplanted them here. You can taste the difference in the food and realize that this is not your run of the mill Greek restaurant you can find just about anywhere in the US. Tony thought about the texture and taste to each dish on the menu. I believe I have just had about everything on the menu during my 4 year residence there and everything had a unique and distinct taste from the last meal. My Yiayia always used to make me, my brother and my cousins beautiful food and I always would set the standards by her TLC cooking. Tony, does the same. The amount of TLC he puts into his food is unmatchable.\n\nThe decor and atmosphere of the restaurant is beautiful. We also learned on our first visit, that he brought back as much copper and tin items that he could when he immigrated over. The restaurant is beautifully decorated with the items and the white table cloths and walls bring you to the islands of the Agean sea. I could always feel transplated when I would step through the door.\n\nDuring your meal service from the exceptional serving staff, Susan makes the rounds to the each table getting to know everyone on a personal level. Over the four years, we have gotten to know each other as well as we could from those 5 minute conversations, but she is able to recall what we spoke of the last time. That is hard to find these days. Someone that listens.\n\nI wish this place much success and when I am back in Phoenix, I can not wait to give them another visit and feel like I am sitting in Yiayia's kitchen eating the food I grew up loving.\n\nBy the way, ask for a bag of kourabedis before you leave ;).", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2012-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "nP2HH7Qe5UtSsjeEH3NZuQ", "review_id": "w0hkrvZ_HNyxL2wF8jWQpg", "text": "This is a must try when you are looking for your Greek fix. The sampler appetizer is great. I had one of the casseroles and it had huge chunks of Lamb that were tender and tasty. The server was extremely helpful and never let a water glass go empty. A very positive experience.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 4, "date": "2012-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0fPGqt9cSkmpTAO3IsGtZA", "review_id": "M_pFpxbIKj92LYE_aieOUg", "text": "We love Greek food and have eaten it all over the world - including Greece....  This wasn't all that impressive.  First clue should have been that the place was virtually empty on a Saturday night....  Calamari was mediocre - definitely had much better elsewhere.  We can make Tzatziki that is equivalent or better in quality.  Moussaka was a huge disappointment - dry, undercooked eggplant...  Best dish was marinated swordfish - but definitely not worth $18...", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 2, "date": "2012-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "7rjO61IsgxdRBTLstKoxog", "review_id": "MflNTJVM4IT_qumH8sJCBw", "text": "Sooooo good! Here on business. I had the lamb and it was great. Their roasted eggplant is very good. Their rice pilaf is very good too, has some broth-iness to it. Very nice staff. Great experience!!", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2012-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_LsbT_uW0UE6rhsWiAIrsg", "review_id": "W0HZFsW3wsN_2vy0YB0ytQ", "text": "wonderful, the best greek food.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2013-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "9JKuE7C9JMPY2KJum6hbbw", "review_id": "v5wDVygjWlNxY9JsH_TxYA", "text": "Very authentic Greek food and ambience. The owner came and chatted with us for a while.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 4, "date": "2013-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "0JIv3n8gHPAADJ1cIHqWbQ", "review_id": "Wq_QgOkr2vmTFLqs3r0B_Q", "text": "My friend Christos from Thessalonika (Greece) took my friends and I here when he was in town and ordered half the menu items. It was fantastic. Christos said it's the best Greek food in the city.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2014-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "qS1vnl53fMrDbUY3Mlu_Qg", "review_id": "vgwu8I-np_sPqYisRGmBlw", "text": "Fantastic service and tasty food. We loved it so much we're going back soon. Best greek restaurant in Phoenix. Ambiance was unique and authentic. Pita yum. Yogurt yum. Made for a wonderful meal.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2014-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "EYfH8HzfE2oIStl4IPzJUw", "review_id": "k_vRj3xW8z2ZYWEOnoOT1g", "text": "OPA!\n\nAs if dining on the Mediterranean itself, more than just going out for dinner, Greekfest is an ethnic experience.  Marathon lengths have been overcome to solidify Greek authenticity.  The owner ensures a personal experience by often stepping from the kitchen to visit guest at their table; educating about the Greek experience or just making sure everyone is happy.  The saganaki is made with kefalograviera cheese which is what was originally intended; also offering an exclusive sausage saganaki.  Directly importing ouzo from Greece these labels will not be found at Total Wine or BevMo.  Avgolemono soup; if you can't pronounce it, just ask for \"the lemon soup\", they'll know what you mean.  More than once I've filled up on appetizers, soup and ouzo, keeping the tab less than a ticket to Athens.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2014-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rykR263Mw1LPE1uJdGXdjg", "review_id": "v29bmKRK0erLd6mSigjmcQ", "text": "Fellow Yelp reviews and close proximity lead us to choose the restaurant for dinner a few nights back. The service was phenomenal, the food was delicious and the overall experience was incredible. I will definitely be back!", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2014-06-26", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 1}, "user_id": "zdtHefMi1cCuHa6Z80nQ2w", "review_id": "iU9U8b-rOLsky0w-bKof4Q", "text": "I posted the following review on Rewards Network and received the following response which given the circumstances was actually enough for me to decide to not return to this establishment. While the food is good and our waiter was good the responder is a piece of work. It should be known that my service animal was wearing a vest with an insignia on it. The question should have been answered just by that. The fact that I and anyone in ear shot could hear her was calling undue attention. Whatever the health codes etc are the ADA is VERY CLEAR and this restaurant is this/close to violating that act. \n\n----review and response below.......\nThe restaurant service and food were really good. Everything tasted fine and was presented beautifully. The drawbacks were just minor but they added up...as did the bill. Our waiter was friendly efficient and left us to our devices while we ate after he checked on how we liked things. He did however take a long time to bring the bill. The drawbacks were as follows: We have a service dog and they made a bigger fuss than necessary. We could hear a woman (I am assuming the owner) asking repeatedly if the Maitre d'hotel checked to make certain she was a service dog. He assured her several times, yet she loudly asked him again to verify it. Had the restaurant been crowded it would have been embarrassing enough for me to consider leaving. It is really no one's business besides mine that I have a service animal. Not that I can hide it, but the woman made it seem as though she doubted my disability and or need. The prices were pretty high for what was served. I think 2 people should be able to leave a Greek restaurant for under $60 a person even with wine appetizers desert and coffee. We didn't order the most expensive wine either. Just a Greek Rhoditis. Ultimately I would probably go back but I might try other places first. Being a former Chicago resident a lot of places I go to for Greek food end up being compared to the phenomenal restaurants one finds in Greek Town there. \n\nThe establishment replied to this comment on 06.28.2014:\nWe regret that you felt the response to your dog was \"over the top\" - however, as the Health Dept is adamant about no dogs other than genuine service dogs in a food establishment - it was necessary to determine that the server had the correct information.. Your server was not a maitre d'hotel and as there have been language barriers that resulted in miscommunication in the past it was important to ensure there was no misunderstanding. There were other issues that unfortunately you were not aware of. We have had many, many diners with service dogs and as well, we have had guests who have \"laughingly\" called their pets \"service\" dogs. In the interests of meeting strict health code parameters it is better to err on the side of caution. We are here to provide a healthy environment and will continue to strive to surpass these expectations regarding both the environment and of course the food. We thank you for taking the time to share your comments. SM", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 2, "date": "2014-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j9vdeDjPWLoUVLxsPbv5jw", "review_id": "koRCX2_26incTfSYZAkXSw", "text": "Expensive but amazing food! The portions were small so those who shared a dish didn't get a decent size meal like you would at other places.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 3, "date": "2015-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l11tgPw7A_BQlUQpQk40Ow", "review_id": "bANLde4Onp5BsmI1691F7w", "text": "Traditional Greek food, and all was delicious!!  The staff was welcoming, knowledgeable, and helpful from start to finish.  We shared various appetizers, salads, entrees and desserts and everything was great (okay the shrimp might have been slightly over).,  but we will for sure be back!!!", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2015-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "T4h0Bm1sncuLN0yH7msbcQ", "review_id": "2BAzyv2dj_b3f96WDk4YSg", "text": "THEY ARE OPEN FOR LUNCH!  I just wanted to help them out by saying that, because I dropped in at lunch and there were no customers. Yes, it looks like a dinner place, but you can just drop in and get a quality, affordable salad like I did.  The owner was pleasant and even came over to chit chat. I thought the place looked so beautiful just like a Greek restaurant should look like.  It was clean, organized and beautifully white with beautiful dinner ware set on every table. I will plan on bringing my family in on my next visit to Phoenix. I wish I lived in town because I would come in on the weekends for sure.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2015-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KI4sBf9jWLs4aGm_mIsFQA", "review_id": "MLv4fE107zX36OXpv0r-IQ", "text": "In my last update, I stated that the Italian Beef didn't quite do it for me.  \n\nI just had one today and it was completely awesome.  Totally soaked, and they gave me extra juice to boot.\n\nI've also had a pizza puff and a slider.  The pizza puff was dead on...its all the greasiness and crispiness and gooiness that I remember from the Chi.  The slider was tasty, but don't confuse this with any White Castle offerings.  Both of these are cheap and worth tacking onto any order.\n\nWhat can I say?  I love this place.", "business_id": "bxpzP73A7gauvxFEyd_8xA", "stars": 5, "date": "2009-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "crrp9oqSWsVnDHPKgy_bqw", "review_id": "Dla8VIa3kkGKIBVI0wazNg", "text": "oh my, these are huge gyros.  somewhat scary looking at first.  not pressed in their cellar but good enough to find on a food cart in nyc.  simply can not beat the value if you are hungry for lunch.  they do need some greek coffee though.\n\nwith all the i heart chicago wallpaper, you'd think they would have a plasma TV with my big fat greek wedding on repeat play,", "business_id": "bxpzP73A7gauvxFEyd_8xA", "stars": 4, "date": "2010-07-01", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "eBFm-lABQiKpaUcPDfYOgA", "review_id": "p_ycPn17Pocgn0KT-GqZTQ", "text": "this place prolly deserves 4 stars as a lunch place, which is when i go. its counter service during lunch, and you can get a giant wrap thats a meal in itself for 5 dollars. it isn't the greatest greek food you will ever have, but it's still really good and the place has a good town and country ambiance, a patio, and good iced tea to go with it.\n\nas a sit-down dinner place it doesn't compare to pita jungle.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 3, "date": "2007-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "cZEVW_x0NKI69Xm55tknBg", "review_id": "-ewYNkiBcMvTkdNlfu_RMA", "text": "I dig this spot! I worked next to it for a few years and it gets better and better. The owners are actually Greek and seem to know what they are doing. The garlic fries are awesome and my fave is the gyro plate, yummy. Everything is pretty good, even the location and the price.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2008-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JgDkCER12uiv4lbpmkZ9VA", "review_id": "4TLXxnb8gh7BZ6TnTN8CPw", "text": "Ok so first of all, it seems like the girls taking the orders are always hot, kinda like at Pita Jungle. The food is good, not great, but definitely above average. It's a great healthy option and is much cheaper than Pita Jungle, which I've always thought was overpriced anyway. Lunch with a drink is usually under 8 bucks and always very quick. I don't understand the plastic cups for the soda, why not just give styrofoam ones, then people can take them with on the road... or is this because people will drink less soda? weird.\n\nThey skimp on quality of vegtables... most people think as long as you are eating veggies, you are doing a good job, oh no... not at all. Iceberg lettuce has no nutritional value at all. Fattoush and a few other places serve good lettuce. So yeah, better than Pita Jungle, but not as good as Fattoush.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2008-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "EEsYi_yEGWADkWJxkkWcYg", "review_id": "fAcg_7Jr4qlGKxzRO2B8rg", "text": "Someday I'll branch out and try some other dishes, but the Chicken Cesar Pita keeps me coming back!\n\nChicken is always hot, lettuce always fresh and well chilled - The perfect combination!  And at $4.95, you can't beat it!  I actually like the fact that it's served on a traditional pita (taco style), not a burrito pita like most other pita joints.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2008-07-21", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "rPGZttaVjRoVi3GYbs62cg", "review_id": "RkDDs7_te6Dlo2f4QpTtqQ", "text": "I stopped by the Cypress Pita Grill last weekend and treated myself to a salad and side of greek fries.   The portions were large... the \"side order\" of fries would have been plenty for two people to share.\n\nMy salad was filled with all my favorite stuff... crisp lettuce, tomato, olives, and feta surrounded by soft pita triangles.  The fries were swimming in feta and dressing... mmm, so good.  \n\nI'm looking forward to going back and stuffing myself on more fries!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2008-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PVIJ0S6sVxGYstpyWAUciw", "review_id": "dxzn7-wF-YfBtGOLGfh5bQ", "text": "I love pita, hummus, Mediterranean food and was anxious to try this place. What a huge disappointment. Dressing was over spiced, just burned. Pita was bland. \n\nGlad to see stable something in Town & Country.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 1, "date": "2009-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rWAz-KTylKA6cfD9lEHPqQ", "review_id": "rQgksaNNQY7LNMaLXNNe_w", "text": "I love Mediterranean food, but Cyprus Grill is just OK. The food is better than the service which isn't saying much. I was there yesterday and they screwed up my takeout order and I had to return to get the right food. When it was all said and done they did give me the correct food and let me keep the wrong food but did not try to comp me a meal or dessert. I probably won't go back.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 2, "date": "2009-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hHimxg0RrR4--yOwj0mOGg", "review_id": "Whp-0D9VgQ-MN_LknjM0zA", "text": "Love this place!  The portions are huge, the food is excellent, & the prices are reasonable.  Come here hungry!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2009-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "usQTOj7LQ9v0Fl98gRa3Iw", "review_id": "ochr4sT3MLVIeW0Xgn2RIw", "text": "Quick little restaurant, once you get the attention of the waitstaff.   My friend had a burger and greek fries.  The burger was so-so but he fully enjoyed the greek fries, a zesty lemon drizzle with feta cheese crumbles over fries.  I had a gyro salad which was the greek salad with slices of gyro meat.  I should have asked for taziki to go with my salad it needed an extra little something.   Would I go back ...maybe if I was in the area again.  Would I go out of my way to go there...ehh...probably not.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 3, "date": "2009-06-28", "type": "review"}
{"votes": {"funny": 4, "useful": 7, "cool": 7}, "user_id": "V0y4fqp-4pSRfsz0FmsjPA", "review_id": "VOj1ZEsVOyn4IwWj3lwhoA", "text": "Went here with my sis today she never wants to go to FEZ ::sigh:: I had the falafel pita and she had the ceaser one. I had the passion fruit tee yummmmm I almost walked out with the glass I didnt want to put it down it was so good. Our pita's came out hekka quick the giant falafel balls were ok maybe a bit hard and dry in the center but pretty tasty. My sisters chicken was a tad burnt around the edges but she ate it all anyway! Next time I want to try the homemade sangria it sounded lovely!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 3, "date": "2009-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hFP7Si9jvdOUmmMesg4ghw", "review_id": "PAEtJ-MR7Utc9zmEM6JEAQ", "text": "The BEST chicken souvlaki I've ever had!!!  GREAT PLACE and very quick!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2009-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2jg6zEtMpe9QyY9eI9L2zw", "review_id": "NDAJrYosv6kzsk54qq8fBw", "text": "Cyprus is always a reliable place for good greek food. The gyros are excellent, salads are always fresh tasting. We must eat there 5 or 6 times  a year and never had a bad meal or bad service.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2009-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "gUXfVNgnNF9WU73T-d-FKQ", "review_id": "sX_VphZbmdSjxWWFraIOaA", "text": "This is one of my favorite places!  My friend and I often go after the gym (LA Fitness is a few doors down).   We take our 2 little kids and the staff at Cyprus is so nice to the kids, friendly and we always get fast and fresh food.  I love the salads and pita sandwiches with fresh chopped cucumber and tomato!  The tzatsiki sauce is ridiculously good and I could happily pour it over everything and eat entirely too much pita with it!  And, although it looks weird, the schefitalia (spelling?) meatballs are really good.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2009-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "B7mOEA-S2acoo1S4t8wZ-Q", "review_id": "prsJzXoAEfesTFmSBD8BhA", "text": "had lunch here today outside with the girlfriend and my mother. I have to say we were pretty blown away with the size of the hummus plate, 3 pieces of pita with a good 3/4 to full cup of hummus, for under 4 bucks.\n I had the chicken pita, tasted great  had onion, tomato, cucumber, and  tzataiki, freakin awsome! my girlfriend had the gyro pita and loved it. My mom had the lamb pita and says it was awsome... unfortunantly we were all being greedy and didn't want to share our pitas. I also ordered two falafel, best i've found, crunchy outside with a crazy mixture of being dense and light, you could taste all the flavor on the front of your tongue and the spice at the back of your tongue. We'll be heading  back pretty soon I hope. \n\nAlso Lisa I think we spotted you there sitting outside. not sure it was you since you where sitting behind me and next to some folks with their dog.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2009-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "g6rlp5No6GjEDXkrjvg1kQ", "review_id": "ckbiOyzI56M72pMQGf_VNg", "text": "Okay I finally ate on site. Service was beyond fast..every table that sat near us including ourselves.. exclaimed \"wow that was fast\" when the food came. Im talking not even a 15 minute wait. I had the grilled chicken pita and it was delicious...pita was fluffy and doughy and chicken as grilled to perfection. Greek Fries are a must have.. you will eat them first before you even get to your pita they're that good. Its delicious, fast, inexpensive, you cant beat it.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2010-06-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "2KNPtV5E44vAiEr5BvMkUA", "review_id": "4fLbZD-aJOldmvgOhBemuA", "text": "Scrumptious! After going with my friend to see 'Get Him to The Greek' (it was a theme day!) we went to Cyprus Grill for lunch. I ordered the Spartan sandwich (which is grilled chicken and gyro meat (presumably lamb, but possibly cow, lol) on a pita and a side of Greek Fries (which are their fries with crumbled feta and maybe a lemon type sauce)...well, whatever is on those fries, it should be illegal! I rarely enjoy fries and I ate every single last one on my plate! The portions are big and I will probably be eating my pita sandwich for another two days. I highly recommend this place, it's super tasty! (and the service was uber-fast!)", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2010-06-06", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "_lA4GgcUKW1f892o5jGhBQ", "review_id": "fid0VWsRB_N2_xcFQE-qtA", "text": "Maybe it was a matinee viewing of \"Get Him To the Greek\" last weekend. No matter how it happened, I have been all about Greek food the last few days. Following up my delicious gyro feta on Tuesday, I decided to try out Cyprus Grill, right around the corner from my stomping grounds. The place is right next to Trader Joe's, so I am not sure how I missed it before tonight. Walking in, Cyprus has a smallish set-up with hardwood floors and some outside seating (with misters, thankfully). \n\nI was immediately greeted by the hostess/cashier/etc with a huge smile, which always lets me know I made a good choice. With all of the complaints about customer service on Yelp, I would think more restaurants would train their staff right, and Cyprus certainly has do so. From an earlier Yelp review, I knew exactly what I wanted: the Spartan Club (a pita sandwich with grilled chicken, gyro meat, lettuce, tzatziki, feta, and hot sauce) with greek fries. My new friend offered an upsize in fries, but they were bad enough as a side, so I was fine with the normal order. After about 8-10 minutes, I was on my way.\n\nSimply put, the sandwich is fantastic. I love pita bread, and this was soft and tasty, but strong enough so it wasn't breaking with the weight of the sandwich. The chicken was excellent, if not overcooked just a touch, and the gyro meat was as good as any I have had. The tzatziti sauce was lighter than I like, but it and the feta certainly added to the meal. The one issue I had with the sandwich was my own fault. The hot sauce seemed like a strange addition for it, and even though it added a little bite, it eventually overcame the Spartan. Don't get me wrong, it tastes great, but I would probably go without the hot sauce next time.\n\nThe Greek fries were fantastic as well. Sometimes with Greek fries, the lemon overcomes the rest of the meal, but it was a perfect compliment to the melted feta and seasoning.\n\nAll in all, another great Greek meal and well worth the solid price you pay for it.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2010-06-24", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "45V7-1r79DEG0HbuaKYIlg", "review_id": "rGCVsId0z_hoM60eMwOIIw", "text": "The people here are psychic!\nReally, I eaten here at least 10 times.  Each time, my food has been delivered within moments...way too fast to actually prepare it - but is always incredibly fresh.  So - they must sense I am coming, know what I am in the mood for (even if I don't know myself!) and start putting together the dish while I am still driving there.  I can't think of any other explanation!\n\nI am not a lemon soup fan - but everyone I have taken there who orders it swears by it.  The lamb is perfectly cooked, the souvlaki is well seasoned, and the gyro meat should be the standard by which all gyro meat is graded.\n\nAs one who drinks a LOT of water or iced tea, I appreciate the huge cups they are served in - I don't have to wait to catch the server's attention for a refill.  In fact - I don't think I've ever finished my first cup here.\n\nSo glad to have this place as a dining option in my area - doesn't cost much more than fast food and is SO much tastier!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2010-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "2KNPtV5E44vAiEr5BvMkUA", "review_id": "Rp5CbqlaTjGAO-N35GRh9g", "text": "Once again, this place does not disappoint. Tonight I took my friend from Northern Arizona out to dinner. We ordered the hummus (yummy), and I orders the mousaka. OMFG! It came out looking like a beautiful Greek lasagna (if lasagna was blessed enough to include mashed potatoes and eggplant!!!!). I was already pretty full from the hummus but just could not stop myself from eating more and more of the mousaka. It was, simply put, PERFECTION. My friend had the gyro plate with Greek fries and she was also VERY impressed. This place is awesome.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2010-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_TS3aQ5wSe_JEjOjXe3WJg", "review_id": "dACC_6saxhptIhKP-PXzww", "text": "Awesome Greek fries!!! Anybody who loves greek flavors must try them!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2011-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zcSzK5KQmnsyg0umeezTYg", "review_id": "9x2AjI6hMmDE-W9pn4Z4yw", "text": "We frequent here often but I'd never taken the time to post a review. I cannot say a negative thing about Cyprus. The staff are amazing. They are prompt to serve us and the food is always fast and fresh. They have opened a new location in Chandler and we have been there quite a few times as well. I can honestly say they do everything right and it is consistent at both locations. \n\nGreek fries are a must and my husband loves the gyro pita and I love the chicken souvlaki pita.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2011-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "D5J4mKahKvUBJUTWanZwdA", "review_id": "Rf8MEGGkAsJnWeV8w8wRuQ", "text": "Cypress Pita is a nice Greek restaurant tucked into the Town & Country retail area. First off the Service was very nice and attentive. The food was good, but for the price Phoenix has other alternatives. For Greek food I think it's 4 Star.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 3, "date": "2011-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-yZJr73bAoPtlpHUL7JBzg", "review_id": "lcViu0BwxCwcwYHu_2Fclg", "text": "I do this this restaurant. I've been here many times before. Their gyro platter is wonderful, the pita bread is top notch and the prices are reasonable. I was there yesterday for lunch and ordered the Mushroom Brie Bisque. It was delicious except for the fact it was served in a bowl with not one, not two but, three chips on the rim. Big noticeable chips. That bowl belonged in the trash and a customer should not have been served a $5 bowl of soup in it.  A dirty fork or knife happens in the best of places but there was no excuse for the condition of that bowl. You lost a star on that one Cypress Pita Grill.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 3, "date": "2011-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "buaBeSWtHvYGZ-6iPFgysA", "review_id": "3bRZjQa5WPJZJ8A4dhPIDw", "text": "Great food! I've only been once, but I was happy with the lamb entree. The salad the entree comes with was decent (nothing to write about...seriously). However, my brother got the side of fries topped with feta cheese, some paprika and lime. DELISH. oh so good. \n\nAlso, the drinks come in these huge glasses. I mean HUGE. and the service was excellent. 5 stars worth. Only manned by one girl, but she was just so polite, nice and attentive.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2012-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XyY5iUUpNf906kOd52mVBg", "review_id": "GF01qxFdde43dwJy_RqS5g", "text": "I'd give this place 0 stars if possible. Went there for pickup and the waitress was EXTREMELY rude!! Acted like I was wasting her time, didn't say hello or goodbye, just kind of left us standing there awkwardly after she handed us the reciept. The food was very overpriced for what you get (got the felafel dinner) and the felafel was very dry. Don't go here!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 1, "date": "2012-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gxT6EtxJfI0KUp9y68k0zQ", "review_id": "ZNDQbqrieMo72HBMjdMbNw", "text": "Cyprus was my kitchen away from kitchen ...(get it?). I would come here sometimes once a week and enjoy the food of my father's home. Although it is not gourmet, it is a place where I could always get a great meal for a great price served by a wonderful staff. It was nice to see the owner almost every time I was there to keep the quality up and the it never sweltered. This is one of those places I had to sadly say goodbye to when I left Phoenix.\n\nThe food is just plain good. From the gyros, to the avgolemono, to the souvlaki, to the lamb rack, everything was cooked just right! I enjoyed the outdoor seating a lot! If the sun was at that point in the sky where you couldn't see the person across the table in front of you, the wait staff was more than willing to bring down the outdoor shades.\n\nI hope everyone enjoys this place as much as I did.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2012-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ncFbDwW5V4RfoEkhcAPfBA", "review_id": "hXJuOBxKeBenKwhbZKLj9w", "text": "Great service, good food, nice patio. If you are in the mood for Greek you can't go wrong. Noteworthy: hummus, Greek fries, pitas, gyros, Greek salad, chicken souvlaki dinner, and mousaka!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2012-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "OFh132j7qFuQCSTxGKumLg", "review_id": "jChOnzADChN19XTbCss-IQ", "text": "This is my family's favorite little place to go for dinner. They have the BEST soft, warm pita and we always get the hummus/tzatziki split for the three of us. My 4 yr old son loves the chicken souvlaki and my husband and I either split the Spartan Club (YUMMY!!!!) or the white fish dinner. I love the little side Greek salad that comes on the side because everything is cut up nice and small into bite-sized pieces. And I love the tropical tea, too.\n\nThe very best thing though is the service. The girls are all so sweet!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2012-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_flYqCwzepZGW8lud6UT3Q", "review_id": "Bkgh-unluuzKwtEXvG2R0w", "text": "A comfy, cozy, clean and welcoming place, in an energetic terrific neighborhood.  Excellent gyros and pitas,  Tzatziki sauce is really good. We've always enjoyed the pita and hummus appetizer.  Wait staff very friendly and efficient.  Outdoor seating in nice weather is always a plus.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2013-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vUM21g3cPEdSlI89oDttgw", "review_id": "Ts7dKf8AORhNMabKxXAdmQ", "text": "My friend took me here for lunch last week and I quite enjoyed my gyro pita with greek fries.  It was derishious!  I've thankfully had the real deal when we were in Athens years and years ago and this was fairly close.  I do wish the gyro had a tiny bit more Tzatziki though.  The greek fries (or they might have been a slightly different take on their specials menu) had feta cheese, which is my absolutel favorite next to parmesan, lemon squeezed over it, and oregano.  Mmmm mmmm goooooood!!  \n\nThe service was speedy and they were accommodating despite it being during the busy lunch rush on a weekday.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2014-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "-8BqfYouq3o_UoazAQWwNw", "review_id": "tLYB1MlYcmTZEqEG4LYXkw", "text": "Came here and got the Greek fries for an appetizer. That was awesome it's actually a pretty large portions so I would share. The gyro pita sandwich was good, also comes in a wrap. The only thing I would have to say is that the sauce was only on the back half of the pita which made for a dry sandwich at the beginning. Overall it was good and I would recommend it.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2014-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TJWnhb5E_iDItf0cBteRnA", "review_id": "tq-I_DaZKqBPTkXq2yGk0g", "text": "They need to change the oil, fries both regular and greek came out brown and well done. Everything was bland. Greek salad tasted like nothing.  Calamari fried in old oil as well. Gyro sandwich was bland too. Beer selection limited. I'm not sure how this place is still running? Service was outstanding but we will never go back.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 1, "date": "2014-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7POoR51Gy_JVRKQae975-w", "review_id": "OIfYUqyOmDegrDHXJe3Lkw", "text": "Mediocre food. The staff also has no idea what the hours are. Yelp and their website says they are open until 10pm but I was just turned away at 8:45 because they just closed. Avoid.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 1, "date": "2014-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WBZXNbaf1hmID5VgGAIX0g", "review_id": "VkOCKBaHLrxsqRUeNwBiuQ", "text": "Cyprus Grill is a good stop-off for a yummy Greek lunch.  The spot delivers solid gyros, chicken, and lamb pitas, lemony, feta-y Greek fries, big salads with fresh ingredients, and acceptable avgolemono (chicken lemon rice soup).  Their pitas are great - soft and fluffy.  But nothing on the menu is stand-out.  I'd recommend it for a quick and satisfying weekday lunch at reasonable prices, but wouldn't suggest it for any of your more serious meal pursuits.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 3, "date": "2014-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "07xo3YvRL83hQS50xlzaYw", "review_id": "ziSJOcxn96IktcAi2oBWEw", "text": "I have been here before but I just had the most wonderful experience here.\n\nThe service was really fast and the waitress Amethyst was so nice and friendly. \n\nI love to have Sriracha on my gyro and this place nailed it. I ate the pesto fries and a gyro with Sriracha and it's exactly what I was looking for.\n\nPrice: 20 bucks got two gyros and pesto fries. Me and tony are like kings. We sat down but it was fast enough to get it to go.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2014-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uAX1KpJOgfX-vdJhlx_-Hw", "review_id": "DF_XpZJoHweMdRAWahHvtQ", "text": "Tried this place the other day and the food here is very delicious. It's around the corner from my house. Another mom and pop business that we should be supporting. Service was superb and the food is great !", "business_id": "cvb__rYMkj4BMhC3p_FB3Q", "stars": 4, "date": "2010-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7pkjLqRLn4UInVwG6FMv6w", "review_id": "ShHFs5bVtDTWvCVphpL1yg", "text": "Everything about this place was great! The food (it just kept coming!), the service (we were completely spoiled), the quaint ambiance, and the genuine interest shown by the Owner in our dining experience. My experience was just as the other reviewers have stated - down to the personal attention showered on my child - suffice it to say, we felt at home.\n\nI must now admit my shame... shame that I have lived here since 2001 and am just now patroning this establishment.  Please don't make the same mistake I did - you know you have driven by and glanced at their sign, maybe from the inside lane on Thomas and figured it was too much trouble to turn around - believe me, it is worth fighting the cross traffic - go and visit them folks, I promise it is worth the stress of shooting the Uey.", "business_id": "cvb__rYMkj4BMhC3p_FB3Q", "stars": 4, "date": "2010-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "N0YXmyrM6IwfTdOeImXCnw", "review_id": "M68YGxMs5TVVEwDRLl30dA", "text": "I have the best, freshest salads here for lunch. It's a bit pricey for going here too often so I save it for when I really just need a nice salad. The pitas are the best too! The owners are super nice and get to know you personally. It's a good place for a date.", "business_id": "cvb__rYMkj4BMhC3p_FB3Q", "stars": 4, "date": "2013-06-05", "type": "review"}
{"votes": {"funny": 6, "useful": 7, "cool": 8}, "user_id": "6WJHk3E4PLt0-EXakw5Kdw", "review_id": "T-MIO8aq77rjn92UxbOJ1A", "text": "Yowza....  Food so good you'll slap yer Momma!\n\nI've driven by this place a gazillion times, and I've been wanting to try it.  I hadn't quite sated my need for Mediterranean food, so I decided to get some take-home.  \n\nI'm *trying* to be sort of careful about what I eat and making sure I get more veggies, blah blah blah.  So I got the mixed meat salad -- because I still needed some gyro meat.  All I can say is WOW.  The veggies were fresh and crunchy, the chicken was great -- marinated and really tender.  And, FINALLY, gyro meat that dreams are made of!  Perfectly seasoned, and just freakin good!  I chose the house dressing -- garlic, lemon, and olive oil -- and it was a great choice -- it was awesome.  This big ass salad comes with pita bread, but I'd get an extra, so you can sop up whatever dressing is left.  \n\nThe service was lovely as well.  The sister of the owner was working this evening, and was so friendly.  \n\nI will definitely be coming back.  I can't wait to try more!!!!!!", "business_id": "ejfy33R1avFm7oygL34uQg", "stars": 5, "date": "2008-08-14", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 5}, "user_id": "qph_LkeFT6DMl2IzknQNGQ", "review_id": "ChFgFkkhs8smQfGSy-KsuA", "text": "Yes, I agree this place is a gem.  I have always had terrific food here (the gyros and salad's  are awesome).  ALWAYS fresh.  A little expensive considering it's a dive (a very clean one though).  And i have had co-workers complain they don't give you enough food.  But giving 5 stars based on the quality of the food", "business_id": "ejfy33R1avFm7oygL34uQg", "stars": 5, "date": "2008-08-30", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "AbYhAHw5uI4mEfx0UPIWIQ", "review_id": "a086ZQ8LSH-xlncCS56KLw", "text": "The food is good. It's not great. It may be slightly overpriced for some... BUT  they don't get discounts for buying in bulk like the chains and the owners are good people trying to make an honest living. \n\nIt's local, family run business and the service is awesome. The owner greets you with a huge contagious smile when you walk in & she is always super friendly.\n\nAND YES -- DON'T FORGET: it's CASH ONLY!\n\nI wish the Valley had more places like this.", "business_id": "ejfy33R1avFm7oygL34uQg", "stars": 4, "date": "2009-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "qaogVXIa3uEG8gnUZ4b2Mg", "review_id": "PPsECBnyy6-EIFH2xY9zYA", "text": "i mainly eat vegetarian when going out to eat, and a wonderful combination to get here is a plate of tabouleh, hummus, and baba ganoush. i've been going here on and off for almost an entire decade, and the food's always been good. what i miss though, since they've slimmed down their menu a bit, are the grape leaves. they used to have such good ones...and it was a main reason i kept coming back. also their yogurt with cucumbers (not exactly like tziki, but still good), is also gone, and it was so good served with pita. oh well, at least they haven't yet  gotten rid of the holy trio of baba, hummus, and tabouleh.", "business_id": "ejfy33R1avFm7oygL34uQg", "stars": 4, "date": "2010-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gfoErsyOWfR_rx6v6Xwy4w", "review_id": "rLQnLMnDnkS0pl5yTaCvgw", "text": "I'm divided.  \n\nI don't really like the way the place looks.  I am the last one to complain that decor is old and outdated, because I like un self-conscious outdatedness.  Unfortunately, it looked dirty, and by dirty I mean dusty and unscrubbed.  I began to wonder if they kept the kitchen as clean as the dining room. \n\nThe wait was interminable, or seemed so because of the creep sitting next to me who wouldn't stop talking about \"the aliens\".  In all actuality, I was probably there for about twenty minutes, having gotten there about 11:15 am.  Another note about the dining room is the kitchen obviously has insufficient smoke ventilation.  As I waited, my eyes began to sting, and the haze in the room was visible in the sunlight.  No dine-in for me.\n\nWhen looking at the menu, I thought the prices seemed slightly high.  Once I got my food, I felt that the prices were fair due to portion size.  I got the baba ganoush and grape leaves.  The grape leaves were awesome.  The baba ganoush was interesting, with a consistency that looked like hummus.  Totally creamy, no evidence of seeds.  It was dosed with so much liquid smoke that it kind of tastes like barbecue sauce.  Good at first, kind of sickening after half of it is gone.  I wouldn't get it again.\n\nI need to try this place one more time and see if my experience is comparable.  If it is, I doubt I will be back.", "business_id": "ejfy33R1avFm7oygL34uQg", "stars": 3, "date": "2011-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "syJ-WZZ1vcbQZgtjqmJ1uA", "review_id": "2pEMbFLjY99olgPSffcndA", "text": "REAL CUSTOMER SERVICE AND GREAT FOOD.  The woman that takes the orders and serves is always there and she is GREAT!  The gyros, hummus, and salads have been fresh, consistently good and prompt.  The decor is dated, but C'mon I'm in there too eat.  The woman has remembered me and my wife despite a number of weeks between visits.  This place is very refreshing in an era of dying customer service.  Don't judge a book by it's cover because you'll miss out on this gem.", "business_id": "ejfy33R1avFm7oygL34uQg", "stars": 5, "date": "2013-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "zBkv5EqgkrgT_f3oL1B4yg", "review_id": "N1TSxdv495dtxPauSZTO4w", "text": "Clean inside and clean kitchen. Nice staff and super good food. The chicken pita was good, not great but the salad was super good. I even liked that it had no feta. \n\nThe burger I had tried another time was SUPER good. Taste just like you made t at home but without having to mess up your kitchen. ;) \n\nThe hours are a little annoying because but that just means they take pride in their food when it is open.\n\nI would definitely recommend everyone go give them a try.", "business_id": "ejfy33R1avFm7oygL34uQg", "stars": 4, "date": "2013-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PwemCNJqvGerNZHbSSbmFA", "review_id": "Ay0Bf_tdRAd8GCq2vU-vtQ", "text": "If you're looking for true Mediterranean cuisine, this is definitely not the place. It's not Middle Eastern either, this is a gyro joint. Every good review about this place has to do with gyros, which is American Cuisine. Otherwise, the reviews regarding falafel and rice, etc. are from people who've lived in Phoenix for too long and don't know any better.\n\nI started by ordering the Saganaki, (fried cheese). I haven't had this in over 10 years, but I remember how much I loved it. The table-side presentation was quite nice, but the quality of the cheese was not. It was tough, not tender and juicy like it should be. I ate half of it and left the rest.\n\nFor the entree I ordered the chicken shish kabob. I was very hungry and this was quite good, but not memorable.\n\nDessert is where everything goes downhill. The baklava was good, not as moist and flavorful as it should have been. But the Turkish Coffee was a disaster. It wasn't Turkish Coffee: There was no sugar, no cardamom, the coffee was poor quality and so was the water. Turkish Coffee is supposed to be \"sweet and strong\" not weak, bitter and without flavor. Please remove it from your menu or invite me in to teach you how to make it. I've been making it for many years and look forward to it when I see it on a menu. Unfortunately, I am usually disappointed. \n\nThe term \"leaves a bad taste in your mouth\" is exactly that. The last thing served in a restaurant is the most memorable. I would have given more than 2 stars if not for the coffee, but I came in mainly for the coffee!  Coffee is not expensive, learn how to do it properly.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 2, "date": "2010-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gg_OKjOAl_vVmdh5ZETuiw", "review_id": "HrGX1KAJUUpQFijiBAKlIQ", "text": "I moved from Tempe to North Phoenix a month ago.  Aside from access to light rail the one thing I had been missing most was access to great Mediterranean food.  I'm always game for a good kebab or falafel sandwich.  A coworker mentioned Saba's and I was there just a few days later.\n\nI stopped in after work and picked up dinner for me and the roommate.  The place was busy and almost filled to capacity.  Saba's is one of the places that lacks width but stretches back kind of far.  Looked a bit cramped but I can handle that style of seating for good food.  The waiters brought out plates of flaming dishes and yelled \"OPAH!\" each time.  Not sure if anyone working there was actually Greek but it makes for a good show and adds some to the atmosphere of the place.  My order for two was ready to go in about 5 minutes (not too fast or slow).  I was out the door and headed to home with the fantastic aroma of sheesh kebab sandwich filing my auto.\n\nMy roommate had the Rolled Baba sandwich, a veggie dish made with baba ghannouj.  She liked it a lot but I didn't try it so I'll take her word for it.\n\nI had the lamb sheesh pita.  It was served with an ample portion of delicious meat and they were generous with the veggie toppings and yogurt sauce.  Fantastic sandwich.\n\nThe menu has a fine selection sides, salads, burgers, sandwiches and entrees.  They serve Greek beer and I think they have one from the Middle East as well.  One day, sooner than later, I'll venture back and dine in (even if it's a bit crowded) and take in the atmosphere and a great meal.\n\nSaba's was very impressive all around.  It's on par with my two favorite locations in Tempe.  This place will be getting a lot of my eating out money.  If it wasn't for other favorite kebab locations in New York City, Philadelphia and Toronto that were a tad better I likely would have given Saba's a solid 5 stars.  It was that good.  Can't wait to go back.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 4, "date": "2011-08-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "qryLRtNCpyx7BLmKbXL8TQ", "review_id": "VimJX7-plBjPzhsQVtP-ig", "text": "Low key spot where you can be super casual or take a date. Sabas has REALLY good mediterranean food. Quick and friendly services and food is ALWAYS fresh! Good variety of Greek beer!", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 4, "date": "2011-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pI3X549nb5ASgTQX5D--1g", "review_id": "ykUjvaT_RuzQMhS6oYe_jg", "text": "We hadn't been here for quite a while...and now, I wonder why? We had a very good meal with attentive, friendly service in a casual and authentic environment on a busy weeknight.\n\nWe loved the dolmades- tightly wrapped, flavorful filling- not mushy.  The lamb schwarma was tender, tasty and delicious! I love their basmati rice and also had my entree with tabbouleh which was yummy in my fresh pita with the lamb! The falafel gyro was also very good.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 4, "date": "2012-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GCjitbgKJGcyuEQ4brZptQ", "review_id": "iD2Qd5J1dOBnd5cVb2BRBA", "text": "This is my husband and I's go to place for take out.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2012-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tJqUqHnwcSe2BCIPDrC3Fg", "review_id": "qqOJ8OkLrl0Zsx9AWSwzxw", "text": "Stopped by here for a quick lunch. Looks like a great diversified menu with plenty to eat! It'll take several visits to try everything you want, but I'll base this review on just one.\n\nWe had the saganaki (Flaming feta) for an appetizer. While the taste of the dish was solely melted feta with a little oil, watching the guy light it on fire right besides your table was just awesome. \n\nI personally got the Chicago gyro with fries. The gyro meat was nice and crispy, while the flavors balanced quite nicely. The sauce falling off the pita actually made it more enjoyable, I'd say. The fries were also pretty crispy.\n\nGood value lunch, and I would recommend if you're looking for a fix in the area.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 4, "date": "2012-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E89THW7mjOoRYZnnNEZtbg", "review_id": "iOLxsGxTCG42giqI-SV9bQ", "text": "Calamari and Mac n' cheese the best I have ever had! Our whole family absolutely loves eating here.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2012-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "Z0ZFt2xLqar_t4taR1R2YQ", "review_id": "JOPWB9WHz7GSWlWDTUVQiw", "text": "Yum!  This place had my family wanting to go back the very next night. Hubby and son had gyros and loved them. We had the spicy feta fries as an appetizer and...wow!  Dishes are authentic and fresh. Our server was fantastic and brought all of us a small piece of baklava after dinner. We only wish we lived closer so we could visit Saba's more often.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2012-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jtT3RFcI8isonLupfH7RwA", "review_id": "yOqhny4uSqIbfB02_m1Qpw", "text": "I love the gyros here. They pile on the meat. Great service as well...not going to lie, don't get the baklava it was not good. I have had a couple salads as well and they were very tasty!", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 4, "date": "2012-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AQg9sUF1kMfrOn9FucpCPQ", "review_id": "0lAOfzs_IVur2ggRimy5mg", "text": "Hit this place for lunch today on a random stop.   Service is simply stellar--very attentive and considerate.  I sat myself by the door so I observed one person who was in a real hurry.  She got her gyro in under 2 minutes flat and was out the door.  This place isn't just a nice relaxing sit-down restaurant, but they can turn a to-go order in no time at all.\n\nI had the Red Lentil soup and Sleepy Gyro Salad.  The soup was excellent...I'm going to try to recreate at home for sure.  The large salad was absolutely huge and stacked with gyro meat.  Simply wonderful and I will definitely be back.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2012-08-16", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "Hi7VohxSS5OBt98w4j8t4A", "review_id": "awC6PqFXQB7ep26wn8rWYw", "text": "I have been going to Saba's for over 10 years now and always had a good experience. Up until today I would rate it 4 stars. Yummy falafel, delicious vegetarian red lentil soup were among my favorites. Their house dressing is lemony goodness. \n\nBut today's visit pushed them to a 5 star for me.\n\nWhile running errands, I stopped in for a quick bite. I intended to keep it light and healthy. Which is very easy to do here. Salads, vegetarian pitas, soups are all healthy choices they have that are also very delicious. \n\nThey have added some exciting additions to their menu since I have last been in.\n\nI see the rolled hummus sandwich which I have had before and enjoyed. Pita, hummus (which now you can choose from different kinds- I chose pesto hummus), lettuce, tomato, cucumber, and a pickle. Yum. And I knew I wasn't completely blowing my diet.\n\nThen I see Greek fries and my heart stops. Feta, herbs and spices, and lemon wedges on fries?? Would I like to add them on to my wrap? Um, yes please.\n\nI was kicking myself for doubling my calorie intake while I was waiting for my food. \n\nThe food comes out fast and all my guilt and self-loathing are replaced by pure desire for the food I'm about to consume. The portions were ginormous. Big enough for 2. I make a deal with myself to only eat half the fries. The fries covered with the most feta and spices of course. The pita was crunchy, hummus-y yummyness. The fries were so damn tasty. \n\nThe prices, especially the sandwiches and salads, are very reasonably priced. I checked out the drink menu and noticed bottled beers were between $3 and $3.50. Not bad at all. They had a couple unique beers by the bottle and by tap. \n\nService was warm, friendly, and prompt. \n\nAfterwards, I thought \"Why I have been away for so long?\" But I will be back Sabas. Oh yes, I will be back.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2013-06-07", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "uT7-7UnF06vj-xTNxFIfIA", "review_id": "k72E8-ONzyKE9-JlNAYPfQ", "text": "We've eaten at Saba's for years now, and the food was always good. Last night we got our dinner to go, and it was pretty bad. We had the calamari appetizer, which has always been wonderful. Last night, it was undercooked, it was practically raw, and it smelled fishy. If we had been dining in, I would have returned it. I had my usual Falafal sandwhich, and it also wasn't very good. The Greek fries were soggy and limp, not crisp.  I don't know what was wrong, if it was just an off night, of if they are going downhill. I have no desire to go back, and it was one of our favorite restaurants. I give them 2 1/2 stars, because they used to be 4 stars in my book.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 2, "date": "2013-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VdsMHw0KEr7TPUfWEzn-eQ", "review_id": "d0-n3g6Jx756X-80RFaT0g", "text": "Love this place. Authentic Greek food with plenty of other options. George is great.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2013-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a52HS4bnvsyveupq4Y1b-w", "review_id": "3rQtxLjVP57LeGa7syinNQ", "text": "Love Sabas!  Great gyros, salads, baklava-we have been taking out and eating in for years. Everything on the menu is great. Quality is consistent and food is fresh and well seasoned. A family run restaurant that is a great find!!", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2014-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "twZoTvWG92ntMVfEvbCnIg", "review_id": "H3kin5NWPBqq1DW4WsJCfQ", "text": "This place has some of the best Mediterranean cuisine in Arizona, period.  I had passed by this place several times on my way to Rubio's over the past 5-6 months and never gave it a second look.  After hearing someone mention it as a yummy place to get hummus and a gyro I decided to meet up with my family for dinner.  I am still thinking about the amazing meal I ate.\nWe showed up a bit early from what I had anticipated so the fiance and I decided to start with a couple of appetizers.  Flaming Cheese and Greek Fries.  The cheese was AMAZING and the fries were addictive.  Awesome spices and feta cheese.  Since we were waiting for the rest of the family to show up we struck up a conversation with George who told us a little bit about himself and the food.  He also brought a couple of samples of their soup.  Split lentil and lemon chicken rice.  Both were so flavorful and yummy!\nFinally the family arrived and we ordered dinner, chipotle gyro and the Spanikopeta (sp?) with the lemon rice chicken soup poured over.  Absolutely delicious.  Ate everything despite already being so full.\nFinally, we finished it off with Turkish Coffee and baklava, both pistachio and walnut.  Left feeling so very full and I cannot wait to return.  If you're in the area I cannot recommend this place enough.  You will have a wonderful experience.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2014-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Uhw_wKIajsPxVath7Kodlg", "review_id": "TBKWYtGNrrSR1YI964wsAA", "text": "I had the falafel pita sandwich and greek fries.\n\nThe fries were nothing special. Just regular fries with a couple globs of feta and basil on top. The fries themselves were not coated in any sort of spices. Failed to meet my expectations based on the description in the menu.\n\nThe falafel pita was also quite unspecial. Just the basics (Lettuce, Tomato, Tahini). The falafel itself was better than most falafel I've had locally, but it was either overcooked or cooked in very dirty oil because the outside was black (No, not dark brown... Black), and it tasted slightly burnt.\n\nThe staff was friendly enough, but while I was waiting for my order, several of them  gathered near the front counter and had several personal conversations within earshot of me. Nothing they discussed was inappropriate, but the congregation of employees behaving so casually made what at first appeared to be a reasonably nice sit-down restaurant feel much more like a low-class diner.\n\nI'll keep looking for better, but this is unfortunately the best falafel I've found in this neighborhood. :(", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 2, "date": "2014-07-16", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Sdj97Asyp2P8MIP1etB6ug", "review_id": "ApM1cQmQjWc8qr73ovMArQ", "text": "I have been here a few times and I have never been more impressed then \"meh\".\n\n1) The space is small and cramped. There is very little room to move around and it is dark in side. The paintings and murals on the walls are nice.\n2) The food is average. I love gyros, but theirs is nothing special. I like My Big Fat Greek Restaurant's more. You can get better french fries at McDonald's.\n3) The customer service is ok. Our food came quickly, they tended to our needs/wants, but they did't make our experience memorable.\n4) Their lunch prices are great, so I guess you get what you pay for.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 2, "date": "2014-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "KYeLSM3MQpirmHukVV5Iow", "review_id": "dm-kG5bWkc-a-S0lMC6A1w", "text": "First things first: Saba's does not have the best Mediterranean food in Phoenix. There are just some really awesome Lebanese places in Tempe and elsewhere around the valley, and as I discovered yesterday, we even have some excellent Moroccan food. But Saba's is very, very good. Possibly the best in the Paradise Valley-ish area.\n\nAnother thing: if you don't like Saba's because you've had better gyros, or you found your pita sandwich too lackluster, you are an idiot. Not because their sandwiches are good - I don't know if they are, because YOU DON'T GO TO A QUALITY MEDITERRANEAN PLACE TO GET A PITA SANDWICH. There, I said it.  The only places you judge solely based on pita sandwiches are places that primarily serve pita sandwiches.\n\nNo, at Saba's, it's the entrees that shine. The lamb kafta, the lamb shank, you know... actual entrees. Their baba gannouj is excellent; I get that every time.  To round out your sides, the grilled veggies are a great choice.\n\nThey also have fries with feta cheese and seasonings, but I didn't like those as much.\n\nThe mango juice is also a must.\n\nSo, to reiterate, Saba's is very, very good - so long as you don't get the same thing that you can get at every dime-a-dozen Mediterranean fast-food place on earth. The best? No, but it owns the neighborhood, as far as this genre is concerned.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2014-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k5b1u7Y3CFJ3oQizpAcrwA", "review_id": "XZ2z0lRPMtG4FODNnSh19A", "text": "This is my favorite Mediterranean resturant.  George and Liz run the family resturant with authentic family rescipes.  I have a couple of favorite dishes, Shawarma Chicken, Falafel (best ones in town) and Lemon Shrimp Pita  are my top 3 picks!", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2014-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CrQ-nnCQvW0qJi8vtF5jyw", "review_id": "LJZCcK-vBLzDlRxpnn45KA", "text": "First time here the other day, was out running errands and decided to stop in here and give it a try. The place is fairly small and it was packed, we did have to wait a short time for a table, not more than 5 minutes. The hostess was very friendly and welcoming, offered to bring us tea while we waited for our table. I was pleasantly surprised there were many Gluten Free items to choose from. I ordered the Sleepy Gyro Salad and my friend ordered the Chicken Schwarma Pita. We both really enjoyed our lunches. As busy as they were the service did not suffer. And our order came out pretty quickly considering how busy the place was. It didn't let up the entire time we were there either. Our server was nice and attentive. I do want to mention that the small Sleepy Gyro Salad was huge and I had the leftovers for lunch the following day so I would only recommend the larger size if you have an appetite to match. My friend's pita came with fries that I had to taste being a fry fanatic, and they were pretty decent, sprinkled with feta cheese. Mmm cheese. Yeah. I will definitely return.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 4, "date": "2015-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "T5e0TMI6Omz6fqDuBbqnxw", "review_id": "2o_mMAMRB-0cihNPSno7Gw", "text": "My husband and I love this place!! Great family owned atmosphere and even better food!!! :)", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2015-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "viMBXDX4ZNujDk4-4ENE2Q", "review_id": "jviN5WrpNIDLmc8IoZ7j7w", "text": "We live in the neighborhood, but this was our first visit to Saba's. I had the lamb shawarma and it was great. We also had the Greek fries, which are a cool twist on French fries. We now have a new favorite local restaurant. Shout out to our server Jared!", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2015-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "O6G4C4IFrWz_ugB6KPtCXA", "review_id": "SZjMpuDZ45dkXef9hMixaw", "text": "The red lentil soup is out of this world.  I unfortunately live in the East Valley and only go here when my job brings me to this area.  This is my favorite Mediterranean restaurant in the Phoenix Area.  The food is fresh and flavorful.  The restaurant itself is small but the quality of the food more than makes up for that.  Try the Tzatziki and Hummus they are so good.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2015-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "beb6q-rqtiUu1JzKOARh5Q", "review_id": "_HGBPYMcjJY95HVtgn0wrA", "text": "It was \"ok\", not too Mediterranean , wasn't impressed with their food as much as their menu, ordered the gyro and my husband had the shawarma, definitely not even a comparison to the original/authentic  gyro and shawarma flavor texture that we are used to. Only reason we stopped by was because it was the closest and we were short on time . Their fries were good though. There's only 1 waitress that was handling all the tables, while she was great, but I don't think it's right to have 1 waitress serve about 10 tables during lunch hour... With the help of the cashier boy every now and then .", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 3, "date": "2015-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3hxrCoQUUqdjduAqpRveNw", "review_id": "ejq5S_pM4p9RwIV39B07oQ", "text": "We started with no expectations. The decor is simple and unpretentious. Then my husband ordered the mint iced tea, I had a sip, and I knew we were in for some thing special. I ordered the chicken shwarma salad. Order the smaller size because the portion sizes are generous. It was so easy to eat healthy. \nThe garlic fries were crispy and addicting. The beef shwarma in a pita kept my partner in crime wordless until he finished it. \nThe service was great. Another table ordered a flaming dish and it was served with flare and OPA!\nIt's so hard to find a good Mediterranean restaurant these days. \nWe have to come back. There's too much on the menu to try. \nThank you.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2015-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zhY7n4oAQzjFEbE7Q3cFCQ", "review_id": "triJn6uRbzD5z_gCV1keuA", "text": "Thank you, Yelpers, for helping us find this fabulousness!\nWe were at the MIM and developed a taste for Greek (somewhere around the Greek section of the museum), did a search on Yelp and decided the reviews were great AND this was soooo close. So why not?\nIt was all sorts of yumminess. Started with the Greek Fries... good start. I had Chicken Shawarma and the hubs had a Shawarma (and I didn't pay attention, was chatting and eating). My vegetarian sister had a Starter combination with 5 different appetizers, all equally yummy.\nWe were not let down! All was good. My sister and I had leftovers enough for lunch the next day.\n\nComfortable, clean, friendly staff. Good prices, fabulous food.\n\nWe HIGHLY recommend!", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 4, "date": "2015-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xomky6I_2VKViL4G47pD7Q", "review_id": "KfIAFBr0IgKljAWx5NQdiA", "text": "Service was fantastic. ..Food was wonderful and the owner was personable.   We Had shwarma, Falafel,  gyro.  Great food.  We will definitely be back.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2015-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CFZKqMbpHvG8sm2068r04A", "review_id": "E8Dd1_fHkPillMmllayPFQ", "text": "Amazing food... Good service... Have visited so many times.. Never got disappointed.. chicken shawarma is a must... You won't forget it's taste... Mediterranean food lovers must visit..", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2015-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Kk0J5XpNfpNW9CS5_--YHg", "review_id": "a3jAGzjAAYkhicvvu8qkqg", "text": "My father just raves about this place so he brought me in for dinner. I had no expectations but by the time I left I loved every part of my experience. The staff was extremely nice and always checked up on us. We started with the traditional hummus and pita bread for an appetizer and for my meal I had the falafel pita and it was all fantastic! Being a vegetarian I was pleased to see how many vegetarian options they offered. The vibe of the restaurant was lovely and I will definitely be going back!", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2015-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4bUgJy26MYE0Rdxt2lfvXQ", "review_id": "HYW35jxJQPOeQbnBzDV_rQ", "text": "This place is so overpriced. Their pita bread is from a bag that they simply reheat. Staff is unprofessional and rushed with the customers. I think people only go there bc of the lack of middle eastern cuisine in the PV area, they settle for this place. Hummus not that smooth or flavorful. Fattoush salad dressing they use is bad... The thing that gets me the most frustrated about this place is the portion size for their kebob entrees. I ordered a chicken and steak entrée both and there were three pieces cut of each for two entire entrées that they had packaged together for my to go order.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 1, "date": "2015-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "drD9o1h8-NV3F2mIS8Z9nQ", "review_id": "HTpRLNwieaT-X4chKZOEHQ", "text": "Very good and a lot of food for great prices! We go here regularly and always enjoy it.  The lemon rice soup is very good, and I get the three entrees with sides which is also very good the next day for leftovers.  I love the lamb shank, gyros, and falafel.  They also have great baba ganoosh (sp?) , hummus, and fries.  Service is also consistently good and nice atmosphere.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2015-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EZ8IZMduz11UsUjEjARFyw", "review_id": "gOXLyFDYt569p-YHQgbA-Q", "text": "We just moved to the area and we were looking for a yummy Mediterranean restaurant! We had the chicken scwharma, gyro, with Hummus and Greek fries. So glad we tried this place. Everything we got was amazing!! Cannot wait to go back to try more items. I will definitely be back :)", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2015-08-11", "type": "review"}
