{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5Jpzn5-E04wdltv8Ks5QQg", "review_id": "5PsicTP02LpiayZHZk5QIw", "text": "I got an eye exam and two pairs of expensive eye glasses in Pittsburgh Downtown branch. It was a horrible experience. Firstly they sold me sample pairs without telling me, I paid more than $350 for two pairs, when I received the eye-glasses luckily I understood there is a problem with them, I went back to the store, they insist they are new pairs, I asked to see the samples and such a coincidence they were not there anymore. I asked them to check the inventory, and they agreed that they are samples. I had to choose new two pairs, but most of the models they have were already so low quality and old fashion. I chose one Rayban and one Calvin K. they were over priced than the market. \n\nI had to go to store three times, it means three days permission from the office, and I had to deal w parking in downtown, a horrible and rude customer service. I think they took advantage of me, being an international student. I am writing this comment to save other people.", "business_id": "gX96CYY9T3K-jiippnnXDA", "stars": 1, "date": "2015-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5gGq73p291r7MPrnMCuQ8g", "review_id": "m2zr1etQSvXjJh4b2a0mLw", "text": "I got my new specs at the PEA.  I loved the staff and my glasses.  I have gotten many compliments.", "business_id": "U071C9Sl-ICavtE0hUMpcw", "stars": 5, "date": "2013-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "s53i1zN1TBOjFQScmSrOMA", "review_id": "8a81KiSLXchPNvwzrtJrQQ", "text": "Very rude, condescending, and snobby office staff. I tried to make an appointment for my fiancee who's a physician, by the way. The office staff spoke on the phone very rudely, inappropriate, and unprofessional. To make matters worse, she sounded nasally, high-pitched voice, and very arrogant. Ugh, if I could, I would have punchedd her through the phone. I recommend going elsewhere, to a professional ophthalmology practice that will treat you respectively and have a lesser chance of misdiagnosing you. The office staff is the first impression of how well the service and the doctors are.", "business_id": "mMA6f_xF9kzTvU9kUCBo9A", "stars": 1, "date": "2012-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Khn8f6W8x4533xJ2qBliMQ", "review_id": "09C3AQdo-Y96xMJQZZ_dVA", "text": "Udderly disgustingly rude staff.  What a poor example for an eye doctors office.  Listen to all the other reviews and don't even give this office any business because if you are lookimg for good, compassionate people, YOU WILL DEFINITELY NOT FIND THEM HERE!  Customer service at its complete worst!  Never got to be seen because the front office and office manager was so horribly rude.  I'd hate to see how the doctor's visit would be!", "business_id": "mMA6f_xF9kzTvU9kUCBo9A", "stars": 1, "date": "2014-08-28", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "8T4ym_f1N0-uyCLcIdjfAQ", "review_id": "MaM1LkMwRnm6w3vX80HUsw", "text": "Whoever answers the phone here needs to take a nice long lesson in customer service. I can say the experience with the dr wasn't bad, but getting past the wall of frowning faces you walk in to when entering the place is difficult. I won't be back.", "business_id": "mMA6f_xF9kzTvU9kUCBo9A", "stars": 2, "date": "2015-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DiX4DzTS7eq3bU5pwY29Ng", "review_id": "dh7LkgJ5KdEjOyuzXZeMOQ", "text": "One of worst patient experiences . Dr Berkowitz is rude, impatient and a poor listener. He then try's to push his optomtetrist . His staff is embarrassed.", "business_id": "xdbAfuSqgqnuoPvLzKjzww", "stars": 1, "date": "2015-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "27aGnUabXY23OH5oilHe7g", "review_id": "yj93YvVcqfAT38dQJkxAkg", "text": "Unfortunately I have to totally agree with Drew. Stay far away from this place if you want consistent, competent treatment. They operate under one Physician, which I would not mind at all, if the nurses and PA's were the least bit competent. \n\nOffice staff is snappy, rude, and never apologetic if something goes wrong. \n\nThey have turnover on nurses worse than McDonalds has on drive-thru service. Which is scary.....one nurse will put you on a medical prescription plan, then your follow up is with a holistic nurse?? Huh??? But that nurse put me on these meds, and now you are telling me to take a herb, that has ZERO proven medical use, and to read a book. But what about the other nurse....why did she get fired. Bedside manor?? Really?? Because you are the one not listening to anything I say, and rushing me out of the room. Sorry to ruin your afternoon by having an appointment.(Spratt)\n\nOne of their own staff has admitted they will only see Dr. Kanelos himself or ONE (Jenny) of the PA's because they don't trust anyone else. \n\nI came here with my 6 month old, so as to have a smaller, \"family\" style practice and not the baby factory I was going to....and now I deeply regret it. Do not make the same mistake.", "business_id": "2yBBmcVEbhrGrk-hAUAfJg", "stars": 1, "date": "2013-06-06", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "Ib-dHhq6CcFHUEmYsBCmKA", "review_id": "hD3NvvmbPP1gJqidIpmq_w", "text": "I have been a patient of Carolina Family Healthcare since 2011. After unsatisfactory dealings with other Doctors at several highly reputable clinics,  I finally found a home at Carolina Family Healthcare. From the moment you walk in, the staff greets you like a family member. I get the same feeling as when I am invited to a relatives house for dinner. Very welcoming and professional. Dr. Chistopher Jenny is an outstanding physician. He is very analytical, insiteful, super friendly, easy to talk to and can find a solution to anything with pinpoint accuracy. I appreciate being confident that my health is finally in good hands. He is also very cool. Kelly is another staff member who takes time out of her busy day to play with my 2 year old whenever I bring her along. My daughter calls her Aunt Kewwy. At Carolina Family Healthcare, you will be treated like family.", "business_id": "2yBBmcVEbhrGrk-hAUAfJg", "stars": 5, "date": "2013-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "2-uR7a5losM7P_PAZdws3A", "review_id": "BlTtA4Rb9JNlqVSyBNJrKQ", "text": "The experience I had here at the clinic was one of the best I've had at a big hospital.  It might have helped that I was the first appointment of the day, but for a mandatory yearly ritual it was quite enjoyable.  Dr. Karner was very attentive and really listened to my input and opinions about my treatment.  So since I have to spend 1-2 hour of my life every year getting pointlessly getting checked out, I'm glad I chose to do it here.", "business_id": "1nUhZPE06iQRKI6_z78IjA", "stars": 5, "date": "2008-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "8uOmnlKFYIPkNCn1v8-DVg", "review_id": "B4Bbs7sgJ2Wa2VtmOfwVgg", "text": "Desperate to leave another practice whose name I won't mention here, my friend referred me to Dr. Caroline Pierce.  My experience was outstanding with everyone that I encountered at MMG, from the lady at the front desk (Rita) to Anna in phlebotomy.  Nurse Mira was pleasant and kind as well.  Dr. Pierce seemed very organized with her examination.  She exuded a genuine concern for my well being and health.  Plus, she appeared to be physically fit and showed interest in my exercise habits.  The only drawback was dealing with an annoying parking attendant in the BB&T building upon leaving, but that is not MMG's fault.  I now have a practice that treats me with respect and compassion.", "business_id": "iYlGqyRNH5UYQABKsDuuDg", "stars": 4, "date": "2013-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "cPHjBgUO31vXzjjCdMDsYA", "review_id": "aq6cjyhSn2GaJohFPo_jUQ", "text": "I have been going to this practice for yours.  Really liked my primary a lot.  That said, I have noticed that last year or so, they over-bill folks.  I went in for my checkup- the doctor spoke to me about high blood pressure.  No prescriptions were written, nothing outside of a BP test was done, yet they split-coded it as a separate visit/discussion than my annual.  $150.  I thought the purpose of my annual was to talk about stuff like that.  This practice and the associated hospital are there to make a $.  No customer service.  When I went in to discuss, I heard another patient checking in.  This time the attendant let them know anything out of basics annual check up routine, anything else discussed will be billed separately.  Clearly other folks complained and now they CYA at check-in.  I decided to get a copy of my records and find another practice.  2-months later, I get a $30 bill to photocopy my records.  To photocopy people.  Whatever happened to service and treating folks right.  This place looks at you as an ATM.  I wouldn't recommend folks to go here for lousy service, non-transparent billing, and you just never know what a letter from them will hold.  I don't think they really care about your health.  Its just a business model for them.", "business_id": "iYlGqyRNH5UYQABKsDuuDg", "stars": 1, "date": "2013-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ts7EG6Zv2zdMDg29nyqGfA", "review_id": "SRiSa_qYANXcCbzG2yqYlQ", "text": "Came in to visit Dr. Anne Barnard and was greated by some of the friendliest people.  I get pretty anxious about any doctor visit so anyone willing to share a smile is a plus for me.  \n\nI was most impressed at how close to my appointment time it was to when I actually got taken back to my doctors exam room.  That's a rarity these days I think we can all agree on.\n\nThe place was clean, doctor was great and the support staff was equally impressive.  I'll be back for sure.", "business_id": "iYlGqyRNH5UYQABKsDuuDg", "stars": 3, "date": "2013-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bnieuzhlS4axGt0oLoqgGA", "review_id": "ymFhEIXWhCPTEiBCtc0ynw", "text": "I have been a patient of Dr. Stephens for over 20 years.  She has delivered all three of my girls two of which now are also her patients.  My first daughter had complications which Dr. Stephens immediately responded to and had her out by c-section safe & sound very quickly - I am thankful that she wasn't in her office rummaging through fabric swatches for her waiting room!  She is always professional and in an awesome mood.  She came highly recommend to me when I moved to Charlotte by a very \"picky\" person & she has always lived up to her recommendation.  An office that is neat and clean and has a good supply of magazines is a plus but whether there is an array of lattes or 5 flat screen TV has no relevance to the care you are given.\nDr. Stephens is alone the only MD in the practice, there aren't 20 doctors so you always know who you will see and who will deliver your baby!!!", "business_id": "jmHing2kjywBhQlZKsgD_w", "stars": 5, "date": "2015-07-09", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "FDhXfKzGsis4OJSdx54FjA", "review_id": "gbxiT0EwLkwJFNbd5StT8Q", "text": "Went today for the first time because of a referral by a friend. The facility is really nice and the personnel we're all extremely nice. Getting a \"physical\" is never a fun experience but doctor Yavorski was super quick and very gentle. She was very nice and asked thorough questions. I would highly recommend her to anyone looking for a new OBGYN!!", "business_id": "8BOcD4EO-9hhEWps0fXm6g", "stars": 5, "date": "2012-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SKXbhQNc9GGKDLoz-7xY3A", "review_id": "4flr244hfhdolTApPCDLEw", "text": "THIS PLACE WAS AWFUL TO ME. I came in to get a scar on my nose fixed and the doctor told me he would take care of it but needed to do another surgery first. He screwed up the major surgery and I had to come in for a second surgery that I had to pay for. My scar ended up being WORSE than before I even came to them for help. They did NOTHING to correct this. Terrible.", "business_id": "UOLNw0-7GjxomFQiHUXisA", "stars": 1, "date": "2013-06-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "fZl9k-NFmNd2nagArHFVDA", "review_id": "qXjOKgqO39pUkOQA22GKzg", "text": "Really pleased with my experience here.  My doc is extremely helpful and nice and the staff and nurses are great as well!", "business_id": "UOLNw0-7GjxomFQiHUXisA", "stars": 4, "date": "2013-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m-KiExRlVb_U3kINeQ3J8A", "review_id": "2vLe4muRoTL3p7r6H1ryfA", "text": "I went there for an annual eye exam with Dr. Atlas and experienced some of the worst customer service I've ever seen at a doctors office. The receptionist who checked me in did not know how to properly do it, and had to seek help from 3 other receptionists. If someone is hired for a job they should be properly trained in it before performing the job itself. The communication between the doctors office and the contacts department was nonexistent. The nurse at the office told me it would be fine to not dilate my eyes, and when I was sent to the contact department they said I needed to be dilated and sent back to the office for another part of the exam. This was after over an hour had passed. I went back to the other waiting room to learn that they did not request for me to come back or be dilated. Although the original nurse from the office gave me the reversal drops for the dilation, their communication issues need to be addressed. \nNeedless to say, today they lost 3 patients including myself and my family. Get it together.", "business_id": "UOLNw0-7GjxomFQiHUXisA", "stars": 1, "date": "2014-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0SaYjiFRGbTjXucflO2paw", "review_id": "66HmDHcDdKIOKpMTUnTW_w", "text": "My regular eye doctor is very concerned about a condition that I have that could possibly be very serious and referred me to Charlotte Eye Ear Nose and Throat for further evaluation by a specialist asap. When I called Charlotte Eye Ear Nose and Throat to schedule a \"first available\" appointment, I was told I would have to wait a week, which I found frustrating but understandable. When I arrived for my appointment I waited over an hour just to be brought back to a room (again, I work in healthcare so I understand). But what made me SO MAD was when I was then told that their staff member who had scheduled my appointment on the phone was \"just a call center person who didn't really know what they were doing\" and scheduled me for the wrong type of specialist. The doctor I was wrongly scheduled to see refused to see me, because they didn't think there was anything they could do to help. My frustration is that I waited a week for an appointment that was scheduled with the wrong doctor with a possibly serious medical condition for which I will now have to wait even longer to be seen for. When it comes to something which has already caused me so much anxiety and my desperate need for some answers, the fact that I spent a week worrying and waiting for an appointment that never happened and that I now will have to start the waiting process all over again is incredibly frustrating. I understand that mistakes happen, it's just unfortunate when it comes at the cost of patient care", "business_id": "UOLNw0-7GjxomFQiHUXisA", "stars": 1, "date": "2015-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2uvXfEky3QpD-MNKgtmRZA", "review_id": "BPUKr8Z-Plx2gTrnlvUogw", "text": "My appointment was at 9. It's now 10 and I'm still waiting.  :-/  everyone around me was here when I got here and are still waiting as well...  I would not return based on the lack or respect for my time.  When I finally got to see the dr at 10:30 she spent all of 4 minutes on me.", "business_id": "UOLNw0-7GjxomFQiHUXisA", "stars": 1, "date": "2015-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PpkKVodWC0sdn74TbHQLzA", "review_id": "ltUexBCzku4wiCw_dhoIlA", "text": "Most Fun and Relaxing Surgery I have ever experienced!\n\nTable-side manner is very important when you could potentially experience pain and possibly pass out!  Dr. Lind and his Assistant had a great sense of Humor while being completely professional and were very careful to help me feel as comfortable as possible!\n\nThis was a minor operation on the same toe that has undergone a similar surgery by a different Physician, many years ago before Jongeys walked the Earth.  When informing the staff here that the previous anesthetic did not work, they were confident that the drugs had improved over the years.  Hummmm... as I suspected the \"new drugs\" were indeed \"better\", though even after extra injections I could still feel some of the procedure (mostly only a few sharp pains that were only momentary) and minor discomfort compared to what I had experienced before!\n\nDr. Lind and his Assistant made sure I understood my \"at-home\" post-surgical work to insure the best healing outcome!  The Receptionist was great too, very friendly and patient!", "business_id": "ByctOq-Af6lAZxROXkXTXw", "stars": 5, "date": "2012-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PhIlD6Iz1AShd5tv2F_wPQ", "review_id": "ftvhZFm096CiWBHkzjpTPg", "text": "I went to this practice after experiencing moderate to severe pain in my right ankle. When I made the appointment I told the person booking the appointment that it was related to my ankle (so they would hopefully assign me to a physician that was versed in that area).  When I went for my appointment, however, I was told by the doctor who saw me that she was not an ankle specialist, and could I come back later that same day to see someone who was.  As inconvenient as it was to do that (having to take time off work, twice in the same day), I went back. This new doctor, the \"ankle specialist\" examined me and basically said he wasn't  \"exactly sure\" what was wrong, could be one of any number of things, but he shot my ankle with cortisone in an effort to alleviate the pain. That relief lasted for two days, at which time I went to another practice (recommended by a co-worker) and took my x-rays from Carmel Foot Specialists. The new doctor told me that the x-rays were of \"such poor quality\" that there was no way anyone could make a diagnosis from them, adding \"it's typical for podiatrists to utilize poor imaging equipment\". The new doctor scheduled an MRI based on his exam and my symptoms, and I now have a diagnosis and a treatment plan--something that Carmel Foot Specialists was not able to provide, even after two separate visits, yet billed me over $500. What a waste of time.", "business_id": "ByctOq-Af6lAZxROXkXTXw", "stars": 1, "date": "2012-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "SS8c_cazIWMQRT0T087yVw", "review_id": "VzSaF18l65QnN8jWEJwE6Q", "text": "Dr. Hull is great but not great enough to overcome the poor treatment from the business office.  Don't ask for anything out of the ordinary like calling in a mail order script.  They are a well oiled machine and you are truly just a number there.", "business_id": "siixOX00BhEkUlKg3n06tA", "stars": 1, "date": "2011-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0dZX68eacHlyfWJtGbojSA", "review_id": "ZnwFT7K-2suAxFBe92sLaQ", "text": "I'm leaving Charlotte and dreading finding a new doctor because Dr. Larsen has been a fantastic doctor for the past 2 years. Making an appointment is easy, the staff is fantastic. Dr. Larsen takes his time and answers questions. He's correctly addressed any medical issue I've had. In addition, if relevant for you, he's LGBT-friendly (I found him on the Gay and Lesbian Medical Association). I can't speak to the abilities of the female doctor there, whose name escapes me, but Larsen is gold!", "business_id": "R-ff6qTsHb6HC7wQ2Wl5bg", "stars": 5, "date": "2011-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "xGogLv6PBMkGMQp8EEWhDg", "review_id": "YKsGJH_2hDwpW_byLBHZUA", "text": "staff is friendly enough..drs are quick and dont really listen or ask any questions... ive changed drs since my last visit and am very happy. i had an appt that i had rescheduled here and they keep sending and will not stop sending a letter asking me to pay for a missed visit when i called to cancel a week before. found a way better dr...little better to drive but at least i feel like im getting the customer service i deserve...", "business_id": "R-ff6qTsHb6HC7wQ2Wl5bg", "stars": 1, "date": "2012-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WBYtL4fLRBt5uB0Jn2G9Ng", "review_id": "yjtjhJB50j0E_PSXz1UnUA", "text": "Northwest Family Physicians is the best!  I have been going there for about 10 years or more. Incredible service all around.   Dr. Larsen is my favorite physician ever. He is very personable, friendly, and professional - - and even in these fast times, ALWAYS takes time to listen intently to every concern (even if I have a list) without judgement - a model for all doctors to follow and live up to.  He's very logical and thorough, so I know there is no stone left unturned.  And it's always clear during these discussions that he is up-to-date on the latest in medicine. I moved to Durham, NC, over a year ago and he's still my primary physician!  Wouldn't have it any other way!  Dr. Larsen's nurses are also great - friendly, professional, and very attentive (won't name names - don't want to miss anyone).", "business_id": "R-ff6qTsHb6HC7wQ2Wl5bg", "stars": 5, "date": "2013-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EmArNT-fovBi70QFgSIgwg", "review_id": "xcky5O6SJw_1L3rxfI_xoA", "text": "Nurses at the front counter are a little spacey and slow but otherwise this urgent care is just wonderful. I asked the front nurse for some tips on preventing an infection I keep dealing with and she just looked at me blank and said she didn't know. I'm sorry but you're a nurse, how the hell do you work here and not have ANY advice to give me? Thank goodness the doctors and nurses in the back know what's going on. In fact they're some of the nicest I've worked with. Definitely go here if you need to, they're some of the most hospitable and friendly doctors who go above and beyond the call of duty to help.", "business_id": "6YSHRi2-qYYCiZ1CMXvn7w", "stars": 5, "date": "2013-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6DBrrefh6xZcttVmxPJ55w", "review_id": "jWtnWL709FewVeBjiiEbjw", "text": "If I could give zero stars I would.  Waited almost a half hour for my number to be called to even be registered, but that never happened.  I ended up leaving and going to cvs clinic instead.  Won't ever go back there.", "business_id": "6YSHRi2-qYYCiZ1CMXvn7w", "stars": 1, "date": "2014-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "RxmcJv6cVMR-sLYpW1j1qg", "review_id": "e2agbyDORwCE-bg1VUHGPw", "text": "I just had my one year follow up after getting my eyes corrected.  I could not be happier with the outcome.  After one full year both eyes are stable and I can see better than ever before.  The surgery was one of the hardest choices for me to make.  My fear was unfounded but I'm sure common to most thinking of having corrective surgery. Is it safe, is it worth the risk, will I be happy with the outcome.  All valid concerns and ones that they will help to answer for you.  I can only speak for my experience and the outcome.  It was safe, quick, and no worse than dealing with cutting an onion for a very brief period of time.  I opted for the mono-vision correction. It's a choice really well suited for older patients that are at an age where reading glasses will start to be needed.  So late 30's early 40's.  The procedure corrects the dominate eye for distance and the other eye for reading.  Your brains does the rest and it was seamless for me.  No more glasses and a very good chance I will never need reading glasses.  The procedure was about 10 seconds per eye and I walked out with perfect 20/20 vision.  At my one year visit my vision had even improved to a little better than 20/20.  The doctors at this practice gave me honest answers to my questions.  I never felt I was being sold a service but more guided to the best choice for my goal to never wear glasses again. If you are looking for a doctor that will not offer you a buy one eye get one free deal this is the place.  The cost is set and the value is well documented in the number of happy patients they have.  Don't look for the best deal.  Look for the best doctor that will give you an honest price for safe, virtually painless, corrective treatment.   It's your eyes, you may have been born with poor eyesight, but trust is earned.  I would do it again and recommend this practice to anyone thinking of getting corrective treatment.", "business_id": "Z5HWuClqy4YZzvVrTRUEuQ", "stars": 5, "date": "2013-07-28", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "OKBPOBzuDrbaj5e5c51ETQ", "review_id": "dhuWaetQOCaFm7czU0tB6w", "text": "Nice facility.  Nice staff.  Saw Dr. Mark Shaeper. \n\nI've been sick for several days - coughing, body aches, chills, very low energy.  He listened to my lungs, looked in my ears and throat and from a 3 minute exam he determined that it's not a bacterial infection but I have a viral infection and that I just have to deal with it until it runs its course .  To me,  that basically means that he has no idea what is wrong.  He did write me prescription for my cough - Tussionex.  Of course this medication wasn't available in generic form so even with my insurance it would have been $50.  Geez, a $50 cough suppressant?!?!  I think not!  I swear, doctors and pharmaceutical companies have a racket going on.  I'm glad I didn't fill the prescription.  I came home and googled Tussionex and found that you shouldn't take it if you are allergic to Codeine - I am allergic to Codeine and I even told him I was and he still prescribed it!!\n\nSee below:\n\n\nDo NOT use Tussionex Pennkinetic Extended-Release Suspension if:\nyou are allergic to any ingredient in Tussionex Pennkinetic Extended-Release Suspension or any other codeine or morphine related medicine (eg, codeine, oxycodone)\n\n\nRead more: http://www.drugs.com/cdi/tussionex-pennkinetic-extended-release-suspension.html", "business_id": "SYASUMcTwhVB3TnfeoUZJA", "stars": 1, "date": "2010-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LyLPBBca0MjxQQkJrw20OA", "review_id": "e2ycA5pNKuTe4l2x1AGj1A", "text": "Takes three times (at least) if you leave a message asking for a call back.", "business_id": "SYASUMcTwhVB3TnfeoUZJA", "stars": 1, "date": "2013-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1SUsOKqvB57nR6kJmjD1kg", "review_id": "jLEisNoe78aSeQ7iZgS4UA", "text": "I had a full face broadband laser treatment to remove sun damage (brown spots) about one month ago.  During the free consultation, Kim answered all of my questions and made it clear that the spots might come back in a few years, even if I use sunscreen religiously, and I appreciated her honesty so I could make a fully informed decision.  She also explained that the spots would darken temporarily and then flake off in about a week, and that's exactly what happened.  The results exceeded my expectations and I'm very happy with it.  The worst of the dark spots are completely gone.  I still have some lighter brown spots, but they are barely noticeable unless you look closely.  My co-workers thought I started wearing makeup!  On top of the actual results, Kim took time to explain my options but I never felt pressured to buy more/different treatments, my appointments were always on time, and Kim and the staff are very friendly.  The office is clean, quiet, and almost spa-like.  All in all, this was a very good experience and I'm very glad I chose Lasting Skin Solutions to do it.", "business_id": "1IxCNVVW9aKbK3BfQpI7eg", "stars": 5, "date": "2015-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "TMVr4sJ1yAQoaR4h_C_C7g", "review_id": "AccWAC3WPelqz5mTaWtvMQ", "text": "(This is the first time I felt the need to voice my opinion on yelp and this being such a personal matter, I hope it is useful to future women in my shoes).....As a first time expecting mom, this office has catered to all my obscure worries and fears with care. Always making me feel at ease and answering my questions to fulfillment. I had the unpleasant event of waking up with a kidney stone at 3 a.m. To make matters worse, try typing in \"contracting lower back pain, third trimester pregnancy,\" on the web, instant scare considering I am only 29 weeks. I  called the after hours number and my call was returned by Laura, literally within two minutes. She calmly instructed me to go down to maternal triage at my hospital. I was greeted by Dr. Thompson, who just so happened to be hanging out at the hospital at 4 am, and treated within 45 minutes of making my first call.  This experience alone makes me feel confident when I go into labor this Sept, I know I will have the support of the team as promised. That right there takes a load off my shoulders and gives me the opportunity to enjoy the last few months of pregnancy. \n\nFurthermore, all my appointments have been pleasant and timely, their follow-up is reliable, and the staff is very friendly. Reading another review regarding the lady at the front desk... Don't let her fool you. She is a sweetheart and you will grow to like her. Not being chatty Cathy doesn't mean she isn't helpful or good at her job. \n\nMoral of my review: They have done an excellent job handling a high-matainance, over-reacting, scared to pieces, mom-to-be. And I couldn't be more pleased.", "business_id": "1acmBPmmFDovVSHHzMrJ9A", "stars": 5, "date": "2011-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "UVkWC0B4DY5Y6Wgf6o4OzA", "review_id": "oQ0wO4SJPH1XRXC-kSe34A", "text": "I called to schedule an appointment for a pap smear and to check out a suspicious lump on my breast. I was a little baffled when the scheduler told me the next available appointment was not until a few weeks, seeing as I clearly stated I need to get my lump on my breast examined. I may only be 22 years old, and it may be rare for a 22 year old to have a malignant lump, but I do have a family history of breast cancer that was conceived early in their 20's. \n\nAs for my appointment, I had it scheduled at 7pm and I wasn't seen by the NP until 7:45. When the NP (nurse practitioner) came in, she checked out my lump and told me we need to get an ultrasound right away to make sure it isn't anything we need to worry about. When I had my pap smear she told me it looks like I have a yeast infection too. \n\nShe also gave me \"tips\" about keeping your vagina healthy such as Douching. First of all, this is HORRIBLE advice. Douching is the worst thing you can do for vaginal flora. This is the main reason why women get vaginal infections and bacterial vaginosis. I had to laugh at her but she is a NP, she knows what she is talking about...\n\nThere were two things that really bothered me about my appointment. The scheduler after my appointment told me she would call me the very next day to let me know the time of my ultrasound at Good Sam. I never heard from her the next day. This is very frustrating for me because I had to wait a while to even get in to see someone and now that I have a suspicious lump, I feel like we are just taking our time for something that needs to be a priority! Second thing is that I was clearly told I have a yeast infection and was not given any prescriptions to take care of it. \n\nI really feel like the office just does not care about my health or concerns and didn't do anything to make me feel comfortable. It was just a waiting game; wait for your appointment, when your appointment finally comes wait an hour for the doctor and wait some more to have an ultrasound scheduled. \n\nI will NOT go back here again.\n\n*update--I called to see why they hadn't called me back to schedule my ultrasound and they acted like I was dumb--saying that they gave me the order to schedule it somewhere else. They basically lost my order and are going to research my situation and see what happened. I HAVE A LUMP ON MY BREAST and this is how they treat situations like this. I'm very disappointed.", "business_id": "1acmBPmmFDovVSHHzMrJ9A", "stars": 1, "date": "2012-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B1UuXZXKByCP7bOAzu6oGA", "review_id": "zXvSVYBAfFLOnhDwhIsjLA", "text": "Let me just start by saying, do not judge a book by its cover. I haven't been here since September 2012, so bare with me. \n\nThe building that this office is in is a bit outdated, as are the decorations inside. Do not let that scare you away! Although I do appreciate the \"breastfeeding acceptance\" posters. I loved seeing the babies names posted in their lobby with weights and such. It made me feel like they enjoy delivering babies. They have pictures of babies EVERYWHERE!  When you get to your appointment you have to pee in a cup, so come ready with a bladder ready to go. The front desk staff isn't that outgoing, but the ladies who took my weight and blood pressure were always sweet.  I felt bad about my weight gain during pregnancy, and they didn't come down on me about it. (which was a relief.) \n\nI came into this office when I was 30 weeks along. They took me in, to my surprise because I heard that women have issues with getting a doctor that late in their pregnancy. My doctor was Dr. Sharon Thompson. She's super sweet and down to earth. I picked a female doctor because I just don't feel like a man would understand what I was going through. She basically sat me down when I came in and was like \"We try to do things as naturally as possible around here. No pushing you to do one thing or another.\" AH! What a sigh of relief! I was in love with the office already. I was sad that they wouldn't give me an ultrasound when I wanted one, but I understand it was insurance reasons. Appointments were quick which was nice because it was mid summer and I was super pregnant and wanted to be home. Just a lot of \" do you have any questions?\" and responses. I felt a lot of reassurance in my answers to my questions. I swore I was dying because my feet were swollen. She reminded me it was just a part of my pregnancy and once the baby was out I'd be fine! And guess what? I am fine. \n\nOkay, labor talk. I went into her office for my once a week appointment when I was informed that I was 6cm dilated. She asked if I wanted my membranes stripped, and did. It wasn't that bad, and told me what to expect over the next few hours to day. She said \"tomorrow you'll be meeting your baby\" and I did! She let me push when I wanted to and gave me three different ways to push. I pushed for about an hour to an hour and a half.  She wasn't even mad that my water broke on her shoes. We TALKED the whole time I was in labor. The whole room was laughing at one point because people were cracking jokes. (I did have an epidural) I also had an extremely attractive resident guy there to witness his first birth. Super cool.  \nI never imagined my labor experience would be so amazing. For that, I give her five stars. Yes, there are some imperfections with this office, but to me, she gave me a great experience.", "business_id": "1acmBPmmFDovVSHHzMrJ9A", "stars": 5, "date": "2013-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "sfqWLuEx79KLkA7w0sis2w", "review_id": "gFAx4JjSYDxZzdNmrHHOAQ", "text": "Wow. I have been going to this practice for 3-4 years. I have had some troubles with them in the past but this is the kicker of them all. I just called and explained to the person at the front desk that I have been having some breast pain and didn't know if I should come in earlier than my Oct. 1st  Well Woman exam. Her response was, \"Well, if you come in early you will have to pay for an office visit.\" I said, \"well if I wait I'll just talk to her about it at my Well Woman.\" Her reply, \"if you talk to her about it then, then you will be charged extra.\" My reply, \"just for talking about it??\" Her reply, \"yup, I don't know what to tell you. Just go to your primary care physician.\" I then explained to her that this was a gynecological issue... No response. Her overall tone was brash, rude, and short. Did I mention uncaring.\n\nUnbelievable. Never, ever have I been so appalled. A woman calls and says she has breast pain and isn't sure if she should come in and this is how the front desk responds!! I'm outraged and waiting for someone to call me back from the office. I think Dr. Johnstone has the right to know how the front desk is treating her patients.", "business_id": "1acmBPmmFDovVSHHzMrJ9A", "stars": 1, "date": "2014-07-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r7AI7WDk1X1Q40P3Su-MAA", "review_id": "KeMSTgyA4JOr_ExxzjyrdQ", "text": "I  followed my NP to this location from John C Lincoln and figured the service would be similar. I was running late to my appointment and called to notify them but the  phone message said I called after working hours but that was not the case as I called from 2pm-2:30. \n\nWhen I got there the receptions was rude, told me I had to reschedule and when I mentioned  calling  she brushed it  off as if it didn't matter. I filled out my paperwork and noticed they have outrageous fees for everything from filling out fmla forms to copies of paperwork. \n\nI rescheduled but after this I plan to never go back.  Most unpleasant service from the beginning and from the reviews, I'm not the only one left  with a bad impression.  I will just start with a new  doctor at JCL.", "business_id": "1acmBPmmFDovVSHHzMrJ9A", "stars": 1, "date": "2014-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Fme3OaZPdZyxMYlkNw0JjQ", "review_id": "AlkIrQKv0uMPAg2uZzqEpA", "text": "I have suffered with migraines for 41 years, and if you have had them, you get what it is like to not live life during those times. Mine usually come in clusters, generally not lasting longer than about two weeks - and generally only about 4-5 times a year. As long as I preempt them with medication at the first sign, I am good. \n\nThe last six weeks I have been living in a newfound private hell. Either my body is rebelling (all those wrinkles, lol?) or weather? Whatever it is, this is the longest cluster I have had. I called this office BEYOND DESPERATE. Mayo is booking into October - and I can't take anymore pain. \n\nI am so impressed with the office staff and the doctor. I have not even been in, and was virtually in tears when they told me they were booking first appts in three weeks. THREE WEEKS??!! It MIGHT as well be next year, with the pain I was in. Bless her heart, the receptionist asked e doctor if she would come in a little early next week one day to see me...and she said YES!\n\nThat is old fashioned medical care and service. I haven't even been to the office yet and I am already giving five stars. Impressive.", "business_id": "PFO7RF1xz4ZBuaq46KsLpA", "stars": 5, "date": "2013-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PlXBKFwybweAMUZYrEHQeg", "review_id": "nTTFzIDzKyfLEjxPjYTH_Q", "text": "MR's review was spot-on. I've been seeing Dr. Shafran for almost (10) years. She will remind you of a Judge Judy. She may seem abrasive but she's a great doctor who does not like to see her patients in pain. Office staff work well together- what you see is what you get. Not for the meek at heart.", "business_id": "PFO7RF1xz4ZBuaq46KsLpA", "stars": 5, "date": "2015-07-20", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 0}, "user_id": "982IZ8KPEjW6rHPgklTHSA", "review_id": "mP27W_Htgrp1J_zRLidLQg", "text": "I originally went to the AZ Heart Institute due to fainting spells and periods of breathlessness when I wasn't moving.  In addition to an extremely abrupt manner - saying things like, \"Doesn't matter.  Nope.  Doesn't matter,\" when I told him about my family history of heart problems (didn't matter because it was my uncle, not my parents.  Because there's no way that my grandmother could have passed the defective heart gene to my mother, who could have passed it to me without showing symptoms herself.  And the fact that my father at the time had heart issues, eventually dying from a heart attack, was inconsequential.), the doctor seemed extremely bored and had a \"why are you wasting my time\" demeanor.\n\nI was wasting his time because I was in my early twenties, but was having chest pains, hard thumps in my chest, and was passing out in clusters.  The icing on the cake however, and the reason I left and never came back, was when he shut the door and it bounced slightly open, and I was able to hear him making fun of me to a nurse right outside the door.  Humiliating, to say the least.\n\nNow, some years later, I continue to have clusters of fainting, gasping for air, pounding in my chest, and memory problems.  I'm in the process of having the issue diagnosed with another cardiology practice, one who actually listens and has the courtesy to at least wait until I leave to snort and laugh about whether or not you can believe this chick.  I would never ever return to this place, nor would I ever recommend anyone go there.  As a matter of fact, I have steered a couple of friends away from the AZ Heart Institute due to my experience.", "business_id": "KXt0Iky3ybeLsbY9KC6GSA", "stars": 1, "date": "2014-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DCZkrSgbUN-5PTUuKWdb_w", "review_id": "ccE571pKNLa1NB3X71MQ7Q", "text": "Ditto on the sonographer!  She seemed super irritated because my 6 month old son was crying and upset the whole time.  We were all super nervous and uncomfortable and she did not help the situation at all.  The actual doctor and nurse (Kristy I think) were great but the sonographer lady really rubbed me the wrong way.  He's a baby with no shirt on laying in a cold room with a stranger messing with him!  Of course he's going to cry!  Learn some bedside manner and help console him not say things like \"can't you give him a binky or somethin?\" NO!  He doesn't take a binky!", "business_id": "BXKhaF0EeDnycbqgKzDuJQ", "stars": 3, "date": "2014-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UcRBG84uCEnrrKSSWw8BrQ", "review_id": "DYWyA0RLGf_OpypNkA3gdg", "text": "Dr. William Stevens performed my complicated spinal surgery. \n\nThe next day I was walking and in Less Pain than before the surgery! Of course everyone recovers differently.! \n\nThe incision healed beautifully and I no longer live in moderate pain. \n\nDr. Steven also stopped the progression of my spine from curving . \nMy spine is so much healthier and I am much happier. \n\nDr. Steven is confident and a very successful doctor who has performed hundreds of complicated spinal surgeries. He is kind and listens with compassion. \n\nFor the comment from another patient regarding doctors wearing suits, I love it! They are professionals!!! \n\nAlso, and to that same person regarding Dr. Stevens not performing his surgeries in a hospital, that was not the case for me. I picked the hospital I wanted. I had three choices. \n\nDr. Stevens credentials and confidence along with him performing so many successful surgerys gives him the admiration and respect he deserves! \n\nA++++++ and one of a kind doctor! \nHighly recommend this doctor! \nKelly", "business_id": "JTiqc8D0MJpYbnObHuNA9w", "stars": 5, "date": "2013-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Y58Qc8rI1AkljUITymJesg", "review_id": "isaA55jG3QBlwF1fci9wYA", "text": "This is not for Dr. Stevens, but for the center's billing policies and staff.\n\nI called to schedule an appointment for surgery but was told I needed another appointment before then. No problem, just schedule me for another appointment.\n\nNot so fast. You have a $22.00 outstanding balance on your account. No problem, can I pay it when I show for the next appointment? No, we're sorry, we cannot schedule you for an appointment with an outstanding balance EVEN after checking with our billing supervisor.\n\nReally? If I didn't like Dr. Stevens so much, I would have switched to another facility. \n\nIt's $22 people. Think customer service.", "business_id": "JTiqc8D0MJpYbnObHuNA9w", "stars": 2, "date": "2014-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Ebi30JkOwUzAI-qRchF-xw", "review_id": "-fhV_dbN2EoZxIcYdiVyiQ", "text": "Dr Austin is incredibly thorough with pt and family history. She personally spent a lot of time with me. Dr. Austin has awesome bedside manners and is very personable. This is a small well run office. Staff is also personable. Dr. Austin is a stellar example of a great doctor. I can't imagine that a patient would be turned away if they showed up in need without an appointment.", "business_id": "k7xAg1QhK_8wze3BYWglRQ", "stars": 5, "date": "2011-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "P-rzvhLnOji18p_EqMKXCQ", "review_id": "WijvIaPpZi87ht9T5SvQqw", "text": "I saw an NP, Courtney, on my first visit for my annual. I had some questions and concerns because I'm trying to get pregnant, and she was very knowledgable and helpful. She was professional and patient, and took her time in explaining what I needed and wanted to know. I was initially skeptical about not seeing an actual MD at first, but she was great and I'm so glad I found this place!", "business_id": "aOtx6bMU5M-Q_cNxhB0wYw", "stars": 5, "date": "2015-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GQ5hjnYDGUmwHBdZ9IGMhg", "review_id": "0msOsqSwcm8ygBgZIg8jlA", "text": "I delivered my little guy in September 2012 and at that time was new to Arizona. A family member suggested Southwest Women's Care so I moved forward with them (unfortunately doing little research of my own).\nFrom early on I was NOT impressed with the front desk clerks. They were not the least bit friendly and incredibly rude when approached regarding a late appointment.\nSpeaking of late... it was a RARE appointment that was not at least an hour behind. Twice I had to leave and reschedule due to their tardiness.\nI saw a different practitioner on almost every visit. They do ask who you prefer to see though appointments book up so quickly and so far in advance it really isn't an option.\nDr. Allred delivered my son. We had never met before (which is fine and something I understood was a possibility). Unfortunately she did not introduce herself, or bother addressing my husband or I. She bolted one second after his delivery and didn't look back. \nShe is certainly not in the correct profession.\nIt has been almost three years and I am still haunted by the awful experience I had with this group. Please please please consider looking elsewhere.", "business_id": "aOtx6bMU5M-Q_cNxhB0wYw", "stars": 1, "date": "2015-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-5DVq0fSQBsbXXGJaDNvWg", "review_id": "0YbsMgV0TCCIg_uE1OJUCA", "text": "Doctor Lepetich was great. However the office/practice has some policies that are nothing short of a Libertarians wet dream. My wife was under their care and part of that care was an in hospital surgery. She still works and was able to take FMLA and short term disability for here recovery. Well she needed to extend the FMLA and STD but the office charged us 15 dollars to fill out the updated paperwork work. All I can say is REALLY WTF?!?!?!. What's next charging the patients for the KY? Come on that is clearly part of the surgical process and after care.", "business_id": "aOtx6bMU5M-Q_cNxhB0wYw", "stars": 1, "date": "2015-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nnS_UYgVm-zJ3edYHlLqdw", "review_id": "M6IY7RELL_g4C8sjSbpBHw", "text": "******Caution******\nPlease choose your dr with care. This group is one of the worst I have seen.\nLong story short; I suffered a 2nd trimester loss with my first baby. I decided to seek early care with my second. Dr. Spence saw me first, she was horrible, rude, condescending. She stated that she did not think I suffered from my diagnosis even though I had 6 specialist tell me otherwise. Dr spence stated \"I have to see for myself\" \nFast forward I decided to try another dr. Dr.cook was very nice, promised me quality care. Well I only saw him once. everytime I would go they had someone new. Once I hit 15 weeks they noticed I started having the complications that I had stated I had. Once again dr spence shows up at the ultrasound  and she said \" I too have lost many pregnancies, sometimes you have to give it up\" I was mortified, her colleague dr hood saw Me and even though my diagnosis was strict bed rest she asked me to move around , she said Maybe something was wrong with my baby and that's why my body was trying to go into preterm labor. Thankfully I reached out to my dr in Las Vegas and he was mortified by the advice these so called high risk drs gave me. I laid in the back of an SUV for 6 hours and once I got to vegas I was admitted. The following morning I had emergency surgery to save my son. Thankfully I am 8 weeks post surgery and now 22.5 weeks pregnant. I am on strict hospital bed rest. I don't know if We will make it full term but i know that I have done everything possible to save my baby. \n\"A life is a life no matter how small\" and as mothers we need to fight and advocate for our babies.", "business_id": "K4yExVqUtW2sRE4grXU8Zw", "stars": 1, "date": "2015-06-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "G2AR0uVQ4wh0VH7yJg1jqQ", "review_id": "f_2D9_2ThrDbR-AMlj53IA", "text": "My 1st impression was great, but am now no longer exited. I gave them a memory stick of thousands of pages of records and waited 3 weeks for them to review and help my very ill partner. I dragged him in there and sat down to see the nurse practitioner who didn't know how to open the files and after wasting an hour of our time she says. \" I need one of the drs to look at this and that was over a week ago and still no word. It really really sucks that there is no urgency in healthcare for all the money on the planet and that's very sad and disturbing.", "business_id": "cVxig7AVvbWkHh9ZyOQyfA", "stars": 1, "date": "2015-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EzKRzSxZwLfHTUVWIdjNfQ", "review_id": "Sf0Ke9IMQ0si39m2DthF1w", "text": "Visited the Mesa location. Dr Nguyen was great but his staff not so much. The nurse had to mention to my son that his sister was his half sister. That did not have to be stated at all! That's irrelevant. Now I have to explain to an 8 year old how and why his sister is a half sister. That is really unacceptable!!!", "business_id": "lZFUmxcvjD8LdzyTYXBd_A", "stars": 3, "date": "2014-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "H0m97uODUCIGL7ahTDFqhA", "review_id": "f1YNU6MRaCkN7jr07qpk9A", "text": "My son has seen Dr Ritchey since birth. Everyday we are thankful that he came into our life.  We are confident with his abilities and consistently have seen his extraordinary care and dedication (to patients and parents as well!).  He honestly changed our lives!", "business_id": "lZFUmxcvjD8LdzyTYXBd_A", "stars": 5, "date": "2014-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "r2KPiKG0S3M3w9FvQbm_lw", "review_id": "qxY0cj_HuqvDN2A5TY1eCQ", "text": "Love this business. Anything having to do with health and beauty for women can be found here. Jaki is fantastic...I can always drop in for a b12 shot for energy. They are all so nice here and its nice to have everything including gyno in one place.", "business_id": "kOT8AO8e1e3J9pUBJ2C7Iw", "stars": 4, "date": "2011-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "tDnhgDLVZsfv7phsw0SWlA", "review_id": "1l0OXX5W7ByBXyq-F0aGlA", "text": "i have never been treated so poorly in my life. i will never go back to this office ! they are unbelievably rude and have the absolute worst bedside manner i have ever experienced from start to finish.  \neven though they had me in their system they could not find my \"chart\" so they decided to charge me new patient prices...even though i was clearly a patient previously. i had spent lots of time on the phone with the finance lady (like a car dealer, odd) telling her exactly what i was coming in for so financially i knew what to expect.... because last time i recieved and $800 bill, yup thats right....$800!!!!! seemed a little excessive for a pap and routine labs...they sure like taking advantage of the cash pay people which is sad especially since i'm sure they do their fair share of ripping off insurance companies. anyway, i was told to come in early for appointment, i wound up waiting over an hour in the waiting room, no one would acknowledge me so i finally asked when they could see me. they soooo so rudely brought me in back to the room. i saw the super rude grumpy nurse practitioner who treated me like i was an airhead. and instead of addressing my issues i was there for she went right into wanting to do bloodwork, cholesterol screening, mammogram, and told me i probably have a pituitary tumor!!!!!! WTF!!! who does that?? she hadnt even done a routine exam at that point. and then told me i didnt know what i was talking about. such a rude rude rude woman. they more interested in doing more labs to make money than anything. so after my horrible experience with that hag i had to deal with the car dealer finance lady who decided to then charge me new patient prices which is more than existing and more than what was agreed upon on the phone. they new and admitted they told me one thing and then made me pay another . they really are rotten people and i hate when people get into any kind of health care knowing people are ailing but they dont have the temperment to deal with it long term so they walk around like a bunch of grumpy sourpusses in the office and make patients coming in with issues feel like we're a burden! isn't that what they signed up for??? try to be a little kinder rude ladies, its probably because they're all hitting menopause in there right now", "business_id": "eovEq5kDSdf0WF_P_bD2Uw", "stars": 1, "date": "2013-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jL4rptwNmwKughbWC98u5Q", "review_id": "MYgVAzx2ICrXZ4q5RYfFwA", "text": "My sister was treated so rude. I called the front desk in a very professional manner to address the issue and see what was going on and how to resolve it.  Instead of her treating me like a human being she decided to be VERY rude and unprofessional with me as well. Every question I would ask she would say she's not gonna argue to me. I didn't think we were arguing. She was so rude that I had to ask if I could speak to someone else who could speak with me professionally (I thought this was automatic at a business. Why did I have to ask?) There was NO MANAGER available until Monday so I guess until then they can treat people however they want. I've never been to the office but the way I was treated only over the phone is a good enough reason for me to never step foot in this office. If you want to be treated disrespectfully and not like a  human being then go there. Otherwise go somewhere else. I still can't believe there was no manager to speak with. I would give zero stars if given the option.", "business_id": "eovEq5kDSdf0WF_P_bD2Uw", "stars": 1, "date": "2014-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "3x1MykIUtUJjIUk-pji2WQ", "review_id": "w2uy3rOwjLqHkwBLARdK9w", "text": "I have held out for awhile going to the dermatologist because of some bad experience's in the past. I found this place online and decided to take the risk. I ended up with Dr. Fermento and I couldn't have had a better experience. She listened to all of my questions/concerns and I felt very comfortable. The staff was very polite, and the waiting room is pretty comfy. I would definitely recommend this place!", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2011-08-25", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 2}, "user_id": "4lkTIhTuMhLprQprGlTRlA", "review_id": "u_ZVNImnNiCzIewiQ-A8VQ", "text": "I'm a new patient at Phoenix Skin and I was impressed with the staff, appointment process and follow-up. Dr. Tania was awesome and she knew almost immediately during my check up what the cause and best treatment to resolve my problem would be. Although those six shots to the head hurt like a Mo Fo, the team made me feel comfortable and served up my healing with a smile, gentle touch and genuine concern. I was happy to find a solution and I started feeling better and noticing improvements within a few hours. Two days later, issue resolved. \n\nThanks Phoenix Skin!", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 4, "date": "2012-07-19", "type": "review"}
{"votes": {"funny": 1, "useful": 6, "cool": 0}, "user_id": "zU8tZqjC5YhkWebuREb0RQ", "review_id": "AdKhlib_E8aW51cDhKy-AA", "text": "I received thorough a consultation on the available options for my melasma.  I am so happy to have found a decent dermatologist office after a horrendous experience elsewhere .  I went from a wicked witch and her ugly henchman to a bit more pleasant office setting. Yay!  One thing that I was turned off by is when they do the chemical peel, they don't bother putting on sunscreen.  They just send you on your way?!!  The last visit the tech asked if I brought sunscreen and of course I did since they cant seem to do so.  I haven't experienced that anywhere else.  And find it unprofessional to peel of your skin and then send you on your way into the hot burning sun.", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 3, "date": "2014-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "U6h6PydzcSQE8GPxsiN6Uw", "review_id": "FaykHANnmDOk0tM3gz2eXg", "text": "They charge for negative tattoo space so it's double the price. Aka they are charging for non existing ink in a tattoo area. Delete tattoo has picosure laser and prices are half the price and they don't charge for negative space. Called to see if they stopped charging this way and they told me no they still are charging for negative space. Makes NO sense. Just trying to get more money.", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 1, "date": "2015-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cCItoNdjvUiRaZUFH9BmzA", "review_id": "8xdXD4WHwECiGH0CmdqT9Q", "text": "I had a fabulous experience at Phoenix Skin!  I've had chronic skin problems since a toddler and this is the first time that a \"skin wellness plan\" was put together for me.  Tana Frumento is thorough and understanding.  I think Maria assisted and totally set it up so that the prescriptions were nearly free.  The front desk staff were all very helpful as well.\n\nNot only will I be back for my chronic issues, but I plan to schedule a couple of cosmetic procedures to clear up some damage as well!  Phoenix Skin is seriously the best I've ever been too.", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2015-07-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zU8tZqjC5YhkWebuREb0RQ", "review_id": "8X1SNiuVbQUMcPqQMco3Qg", "text": "Fantastic service, friendly and professional staff.  They put out enough sunblock to coat / protect your face after a peel.  Very pleasant experience :) thank you Phoenix Skin!", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2015-07-10", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "y0kTrVVLQBIyPEH2lNCK4g", "review_id": "ZEXFoFdQ0TesaqaaaDqSSw", "text": "Really great place for professional skin care. I am so impressed with the entire team and process here.", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2015-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iXMc4KY3UUsl7IQdfH_GBQ", "review_id": "cznUyMJk9BtcCTY_7H69YQ", "text": "The office is now located on the southwest corner of 15th street and Osborn. \n\nMy ear had been hurting for days with what I suspected to be an ear infection. I was trying to avoid going to an urgent care and the hefty bill that often comes along with that. Every primary care physician I called in the area had a three to four week waiting list for new patients- except Dr. Corrigan. \n\nWhen I called, the courteous receptionist let me know that walk-ins were welcome and there currently was no wait. From the time I called, I drove to the office and met with Dr. Corrigan all in about 45 mins! The wait was short, the office staff was more than helpful, and Dr. Corrigan was knowledgable and efficient! \n\nI definitely recommend this walk-in clinic and plan to return and see Dr. Corrigan as my primary care physician.", "business_id": "7Y5HNCtQGCIP_28QfjfihA", "stars": 5, "date": "2013-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wfPteKAmcELpSlE0ziuzbw", "review_id": "uVjROIZTxDGQgA-8WYi9aQ", "text": "What a racket. This is everything that is wrong with economies of scale. \n\n-You will spend excessive amounts of time on hold.\n-You may never actually speak to a doctor. Good luck even getting to a PA.\n-Everyone you do get a hold of on the phone will pass the buck and transfer you to another department.\n-No one takes any personal responsibility. It is always someone else's job or it's just the way the system works, etc.\n-After \"urgently\" ordering me to rush in for an MRI and collecting their $$, it was damn near impossible to get service from TOCA. \n\nWorking with TOCA has led to nothing but half-baked information and a HUGE hassle.\n\nToo big for their own good. You will feel like a commodity and not a patient.", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 1, "date": "2014-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Gm3qZqNh3YUviQeZN8uKLw", "review_id": "_AHW-RDZ8oR6KF2LoMgADg", "text": "Love Dr. Chhabra....location of this new Tempe building is good. PARKING SUCKS! Bring an extra 10 minutes or you may be late because you can't find a spot to park. I ended up having to park on the street behind their building and walk around to their front door.", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 4, "date": "2014-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "AjKqZicnKHIxhONuYmqgrg", "review_id": "KOUVW1zG1i5q4A40iIIboA", "text": "If I can save 1 person sending this review from the pain and suffering I have been in as a result of surgery by Dr. Kostas J. Economopoulos it will be worth it.\n\nWhatever you do make sure to never have him as a doctor.   I am 10 months post a torn labrum hip surgery and bone shaving (I went in for a torn labrum but he insisted I have this bone shaved at the same time as there was a \"spot\" from puberty on the bone he wanted to remove)and all these months later I am worse than I ever was one day before the surgery.  Once things were going NOTHING like predicted pre-surgery suddenly he knew nothing and didn't know why and once I insisted on further tests against his suggestion it was discovered I had Bone Edema and his response was \"I don't  know anything you can do to help that\".......and then he will just shrug his shoulders and stare.  I have been thru so many pain meds, stomach issues now due to so much ibuprofen, etc.   I can't work out like I did before which was my hobby, my life line.  It's been a MESS.  I am positive it will work out but PLEASE avoid this scam of a DR.  You're just a number.  He wants to rush surgery, get his payment and move onto the next number.  \n\nTo be fair I cannot speak on any other DR in this establishment.   I can confirm the office waits are up to TWO hours and it's a cattle call.  I hope this saves someone from a mess.\nClinton M", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 1, "date": "2015-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7qeqlEFhwb2IE5o7NTjZUQ", "review_id": "5bz9xtghH75WOCFGaT9Riw", "text": "Dr zoltan rocks, great sense of humor, always explain what's going on.  Highly recommend him for any orthopedic problems.  Thank you dr Z....", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 5, "date": "2015-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7UAhPt9AT7M3zCBF_8UInw", "review_id": "hfq37r72xoJrncfooFInqw", "text": "I took my daughter to see Dr Lederman in the Glendale office as she was needing a shoulder replacement. I was told he is the best. My daughter has multiple disabilities from a TBI. She only has the use of that one arm/shoulder. Of course the doctor knew her condition at the first appointment. He said she was too young for a replacement as they only last so long and wanted to put off the surgery. He suggested a series of  shots in the shoulder which did not relieve the pain. Then the next appointment with Dr Lederman a couple years later due to increasing pain, my daughter was sent to a pain clinic again saying she was too young for the surgery and rehab would be hard. Shots in the shoulder and neck did not relieve the pain. Then she was prescribed with pain meds. This went on another few years. She was crying in pain everyday and in the night too. I massaged her up to ten times a day and bought every pain topical solution I could find besides taking the pain meds. She cried and  \"begged\" me to cut off her arm several times. We finally went back to Lederman again. This time my daughter refused to take no for an answer...she wanted the surgery. Dr Lederman left the room and came back in saying \"I'm not the man for job. Myself or my staff is not accustomed to working with someone with a TBI.\" Then he walked out. Like he did not already know her condition from day one. My daughter suffered terribly for these years of delaying the surgery then refusing to do it. He did refer us to another doctor who turned out to be a blessing with a very caring heart. Dr Dana Seltzer. The surgery WAS difficult and the rehab WAS difficult, but we got through it as a team and she is now pain free with most of her shoulder movement intact.", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 1, "date": "2015-07-03", "type": "review"}
{"votes": {"funny": 1, "useful": 6, "cool": 0}, "user_id": "4gaG2PMS5erPnRmf7oEYNA", "review_id": "dqXHH6GzPFML0AWwWljcyQ", "text": "I was referred here for my husband to get LASIK by a good friend who works in an optometrist department. She said that the treatment and doctor were the best and there were plenty of other LASIK centers that she had seen substandard results from. Noting this, we went to BDP for a free consultation expecting the best. What we got was the worst. \nMaking the appt was easy and the people on the phone were pleasant. However, when we got into the office, they acted like we couldn't afford the procedure and therefore weren't worth the time. They didn't explain any of the tests they did, nor did they talk to my husband the entire 2 hours he was there. When my husband tried to ask questions, he was ignored. When the doctor saw him, it wasn't any better. He was brief and to the point. My husband required PRK LASIK and it would be about $4000. When my husband tried to ask a question or inquire about the vision for life program, he was told quickly about the medications he would need to purchase in addition to the procedure. The doctor then promptly closed his folder and left. \nIn contrast to this, we visited another LASIK doctor with good ratings and were treated like we were worth his time, explained everything to, and talked to thoroughly about the procedure and medications. They never once left us in the dark, nor did they treat us substandard. The price was the same as BDP, the difference was in how we were treated. Sadly, I was excited to go to BDP and now will not due to their attitudes towards us.", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 2, "date": "2012-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zemraIXtdaNmeVdtstDjCg", "review_id": "fR3Ix-DTvZyIiu8p3abVfw", "text": "Had Lasik last Friday!! Best thing I ever did. Only regret is that I didn't do it years ago! Staff and Doctors are the best. Very professional and knowledgeable. I checked around and not only is the instruments they use the best. The cost is great.\nLove my new eyesight Barnet Dulaney Perkins!", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 5, "date": "2012-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UjJ6f7hgVUrJIbpyEbXRfg", "review_id": "igUTRgvMSq8Df9c4wlhaew", "text": "I would recommend Barnet Dulaney Perkins Eye Center to my wife, family and friends.  They were very friendly and very informative from start to finish and answered every question I had.  The surgery was successful and the recovery time was fairly quick, however there was a few hours of major pain afterwards.  I asked a few friends who have had LASIK and they said the same pain duration post surgery.  To respond to another review regarding it's all about the money.  Um, ya if it weren't they wouldn't be in business using top of the line equipment during your initial exam and surgery, which I'd gladly pay a few dollars extra to have.  Their pricing is competitive, not the cheapest and not the most expensive, just right.\n\nOf course, I only have a sample size of one and I plan on keeping it that way.", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 5, "date": "2013-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 1}, "user_id": "bmP_CaPgcVwIehg5i0ZJDQ", "review_id": "jt7a8WrjHMS38Ve8DpjQFw", "text": "I just had my LASIK procedure completed at BDPEC on 19 Jul 2013. So far, so good. My vision is still a bit hazy but I checked out at 20/20 during my post-op the following day. AMAZING!\n\nI got off to a shaky start with this clinic. The person who performed the consultation exams was extremely friendly and professional. She did seem to want to push me toward the ICL but when the doctor (Dr. Schiff) came in to review my results, he said there was absolutely no need for that and said I was an excellent LASIK candidate. (I did not feel that he tried to steer me into a procedure that I did not need.) His 'bedside manner' was perfectly acceptable and I felt he was thorough. He reviewed my results with me, explained the procedure, and then popped in a demonstrative video for me for me to watch.   \n\nAfter meeting with him, I was directed to a person I refer to as 'The Closer.' He explained my surgical cost, what the day of the procedure would be like, and then asked if we could get the surgery scheduled. The cost was higher than what I was expecting and when I questioned the cost, I felt that he became a fast talker - 'their technology is the best, they have been around the longest, other vision correction centers are basically hacks, etc.' He also seemed to insinuate that my reservations about the cost somehow diminished what should be my ultimate concern - my vision. I found that a bit insulting. This felt like a sales tactic to me and made it feel a bit like a purchasing a car versus a medical procedure. I couldn't help but wonder what his commission was on this 'sale.' My recommendation to BDPEC would be to review this portion of the consultation. \n\nWhere I was most disappointed in BDPEC was that I left this appointment with no pre-arranged ride home. I was told I wouldn't need one despite the fact my eyes would be dilated during the appointment. I do assume personal responsibility for this but I had NO business driving myself home this day. My vision was horrendous - I slowly worked my way from Phoenix to Chandler using as many side streets as possible. I admit that I should have pulled over and waited it out but, as it turns out, it would have made little difference. My vision was still blurred 24 hours later! When I called to ask if this was normal, they said it was and that it could take up to 48 hours for normal vision to return. If that is the case, why would they not tell you to arrange transportation on your consultation day? I considered that a strike against their care for their patients.   \n\nAfter talking with several friends who have had the LASIK procedure, weighing their experiences, what they paid, etc., I chose to go ahead with the surgery at BDPEC. I was told I would be called with my surgery time for the following Friday. By Tuesday afternoon the week of surgery, I had not received a call and had to call them to find out when I was scheduled. Perhaps I was being impatient but I did have the schedule of my husband (who was driving me there and taking me home) to consider and wanted him to be able to arrange his day with as much notice as possible. So, that was another little strike as far as I was concerned.\n\nThe day of the surgery, everyone was quite nice except for maybe one person who administered the Valium - she just wasn't very friendly. No biggie. The surgeon sat down with me for a moment to review any questions I had. Despite a full waiting room, I did not feel that he was rushed and did feel that he was engaged in our pre-op meeting. The staff were thorough about plastering my name all over me - I assume to avoid mixing up prescriptions and patients. I appreciated that! They told me to expect to be there for about 90 minutes and I was. During the surgery, Dr. Fintelmann and another gentleman assisting him were both very calming. I was quite nervous and they really did what they could to keep me focused and relaxed. I am so grateful for that! The procedure took minutes and when I sat up, though very blurry, I could see! Dr. Schiff took a quick look before I could go home and he was kind and excited for me.\n\nAt my post-op the following morning, everyone again was friendly and welcoming. Though I am sure they experience this multiple times each week, they seemed genuinely excited for me as they congratulated me on my 'new eyes.' On a personal note, it is a very moving moment to hear someone tell you that you have perfect vision after a lifetime of being dependent on vision correction.\n\nI would recommend BDPEC based on my overall experience.", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 4, "date": "2013-07-22", "type": "review"}
{"votes": {"funny": 1, "useful": 13, "cool": 0}, "user_id": "LVRfFBoJYrEJS4jaA-V2yg", "review_id": "xj1tZ9I3pA77auCER60MwQ", "text": "I went in to have cateract eye surgery in both of my eyes which began in Nov. 2012.  The two surgeries were done 2 weeks apart.  I was sold for an additional $7000.- above Medicare and Blue Cross charges to have  lens implants that would not require me to wear glasses after the surgeries.  One of the lens's that was implanted in my eye was not centered and 3 weeks later, it had to be removed and replaced with a different lens.  Both eyes had laser surgeries.  My left eye also had retina work after the initial implant (supposedly my retina was torn in 3 places.  Also in my left eye, I had to have cornea surgery on my eyelids.  Finally after 7 months of office visits and surgeries, I decided to get a second opinion from an outside opthamoligist.  He explained to me that the LensX ($7000.-) should NOT have been used for me due to my stigmatisms.  I asked why Dr Perkins recommended it to me, and was told that it was all about additional money.  To date, my vision has become alot worse prior to going in to Barnet Dulaney Perkins.   NOW, I have eye glasses for both reading and distance.  STAY AWAY FROM THIS COMPANY- THEY ARE A TOTAL BUNCH OF CROOKS AND NOT VERY PROFESSIONAL.", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 1, "date": "2013-07-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "I2H2DBqEzWsmwmfbmhpb4Q", "review_id": "367H11kGuJZOFHM8HLZgog", "text": "I recently had a retinal detachment that required immediate attention.  I was referred to Dr. Sipperley at the Eye Center.  It was absolutely the best care and attention that I could have asked for.  After a thorough evaluation it was determined that I needed surgery and they actually jumped through hoops and kept the surgery center open after hours and brought in an on call staff to repair my retina.  Every single person that I came in contact with was incredible.  I have only the highest respect for Dr. Sipperley and the entire staff.  Would highly recommend to anyone.", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 5, "date": "2014-07-08", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 0}, "user_id": "uxcaoyCZEiX0jd126nSYrg", "review_id": "jy1QE4MI4qm-gHGanWtofQ", "text": "Don't go here!  I tried to get some necessary surgery done but to no avail after having the staff \"forget\" to schedule a physical and do the necessary insurance paperwork, and having them overcharge $1000 because they could not add. \nTo start they insisted I had to have another expensive eye exam even though the optometrist who referred me did the exact same exam two weeks before.  Cost $305!!!    I called many times only to be left on hold sometimes for 30 plus minutes.  My husband is disabled and I had to schedule care for both of us after the surgery and during the appointments prior to the surgery.  I waited months and MONTHS to be scheduled in and then had the staff tell me a few days before the surgery as they \"forgot\" to do the insurance paperwork and they could not do the surgery unless I paid for the whole thing up front.  Much to my chagrin I re-scheduled some weeks later but two days before they called again as they \"forgot' to have me get a physical.  I couldn't get care for my husband on that short of notice. \nI got the bill yesterday.  They charged me almost $700 just for a 20 minute consult and an un-necessary eye exam. They also charged $90 for two digital photos of my face which took 60 seconds by an assistant. I have to start over as I neither trust the Doctor or the staff.  You decide if it is worth it for a careless service.   I've never had a good visit!!!!", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 1, "date": "2014-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kCQmF8idE96UmaTlmMACbw", "review_id": "BUF5AqhKqSeOrxnanki9sg", "text": "Good reputation and word-of-mouth for surgery results. HOWEVER, this appears to be an overgrown medical practice that is poorly managed and has no respect for patients' time. As just one example, this morning I had a follow-up appointment with one of their optometrists, not even one of their opthamologists or surgeons. One and a-half hours after my appointment time, I was finished with the testings and the consult with the OD...but I was left waiting an additional 20 minutes for \"check-out\" to set the next appointment and do payment. INEXCUSABLE. I walked out still without being checked out. If enough others let BDP know that this is ridiculous maybe they'll get the message. As for me, I choose to no longer be a patient and will search for another healthcare provider for my eyes.", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 1, "date": "2015-08-27", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "hq0WUfau1Mh3GyHn8oVdNQ", "review_id": "xsafqgxJMRQkBXP1tyNgwA", "text": "My hubby and I have been seeing Dr. James Doris here for about 2 years now and really feel that we're in good hands. The office is very modern with all computer record keeping, there's a blood lab on site if you need any lab work done, and the staff is exceptionally friendly and caring. I've been able to get same day appointments for urgent needs.\n\nMy hubby had a perplexing illness that took several weeks to figure out and Dr. Doris made a real effort to get to the bottom of it. He was very thorough with getting tests done and trying to find the root of the illness instead of just prescribing antibiotics and referring him to a specialist. \n\nBoth Dr. Doris and his wife (who is also a doc there) were educated in Britain and take their time with each patient instead of rushing them in and out in five minutes like a lot of doctors.  They're part of the John C. Lincoln Hospital network...if they take your insurance I would recommend them.", "business_id": "c_PhRjEIA2jRAvWDWsn4Vg", "stars": 4, "date": "2009-06-23", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "3m0aWTZ7DVdJzRAkPUXizA", "review_id": "JSUINVDsHPV7WlBBqs8mig", "text": "Dr. Kramer has been my family physician for a few years and he is my favorite doctor of all time. I believe my two children would agree. True, he is busy, but he does care and he does take the time to talk to you about your medical concerns and issues. I feel extremely comfortable and confident in his abilities to ascertain and diagnose accurately. He is honest, funny and personable. I give him a five, even if he does run a little late, because he and his staff are forgiving if you do, too.", "business_id": "9zlpLPhXYwK_STi2u8DjxQ", "stars": 5, "date": "2010-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gzx4BZR2KKG4-W-RH95ykA", "review_id": "57CTpV_XMcHS8V525lMn9g", "text": "I have not met a doctor who has refined the Rt of brushing off pzt ients btter than Lawrence Kramer.\n\n  After been show into the treatment t  room, I was asakved by the assistant: 'so what is your problem today? ' i told them it wasnt a problem but i was just having some symptoms. Nevertheless, after the doctor came in, his eyes were. glued to the computer screen and I think he only glanced my way f or a second.  after rhe entered some stuff into the computer and asked me a few questions, the session abruptly ended when he simply walked out after about five minutes.", "business_id": "9zlpLPhXYwK_STi2u8DjxQ", "stars": 1, "date": "2015-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5bp3yypTJHYhxEATTql2QQ", "review_id": "Elb1brflkohSc9N9eUpRew", "text": "I was in a car accident about 8 months prior and was still having pain. My primary care doctor sent me to this guy for a thorough exam, X-ray, consultation, etc.  \n\nThis guy likes to brag how he's so well trained and knowledgeable. He might be. But all I got from him was \"It's in your head, get on with your life\". When I tried to explain that the pain happened in very specific situations, he said \"Your X-rays are fine. Get over it and get on with your life.\"\n\nLong story short, I ended up at A DIFFERENT doctor who listened to my concerns, explained what likely happened in the accident, why I was still having pain, what to expect going forward, and suggestions for follow up care. \n\nI would never, ever recommend this doctor nor would I go there again..and I live walking distance from his office. He was so dismissive of my concerns, arrogant, and truly seemed like he had more important things to do than help me. \n\nThe actual office was very nice though. Zero stars for the \"doctor\" but one for the nice office.", "business_id": "OJDtbPWAuym1iKawyuHNZg", "stars": 1, "date": "2015-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iYkSboOfOfD8-z5ZIwTRCw", "review_id": "DEBzaK-1aFZfCa1_-N2FCg", "text": "If you're looking for a superb doctor who has a wonderful bedside manner, look no further than Dr. Dena Cornelius! She is one of the best, most caring and thorough doctor I've ever had.  She truly cares about her patients, making time to talk to you about all your concerns.  I can't say enough about her and highly recommend her!", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 5, "date": "2011-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "41C6eUwQKg9WM0ZPvT2sAA", "review_id": "DiTFmQ2fypDH3qyiNMfsnA", "text": "Searching for a new primary care physician is difficult.  After the first visit, i loved Mountain View Family Physicians, the staff seemed to know their job description (but not go above it to be friendly), I loved the technology, and the doctors seemed to take that extra moment to chat (which is hard to find these days).  \n\nHowever, after four visits, two doctors, four blood samples, four urine samples, and over a week and a half to get results back every time, only to hear a submissive \"everything seems fine, it should go away with time\" each time, I sought a new doctor and was diagnosed with the problem immediately.  \n\nThey seem great, but are missing the most important part.", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 2, "date": "2011-08-18", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "ibfK8z_emnNa57YpLuuPWQ", "review_id": "gF3LkLmWHApJmq1ftrm_AA", "text": "I was recommended to Dr. Bauer by a friend.  The first time I called to get in, I was seen by Dr. Davey because I couldn't get in with Dr. Bauer until the following week.  He told me I had pink eye and gave me antibiotic drops that made my eye feel worse.  As soon as I stopped taking them, my eye felt better.  It must have just been allergies, so kind of a waste.\n\nI recently made an appointment with Dr. Bauer, and this time they were able to get me in within a couple of days!  I didn't have to wait too long, but I thought it was strange when she came in and said 'it's been a long time since I've seen you!'.  I was like, 'uh, I've never seen you.'  Nonetheless, she seemed pretty nice and concerned about my symptoms.  I was having some weird symptoms, which were difficult to diagnose, so she told me that I needed to get ultrasounds and also they'd like to do some blood work.  She told me to go to the waiting area and someone would come get me.  When the gal came to get me, I was trying to chat with her but she seemed like she wanted nothing to do with me and pretty much ignored me.  I didn't like that, considering she was sticking a needle in me (and who likes that??).  After that, she told me I could go, and was left standing there confused.  I thought I needed to get an ultrasound?  Was there paperwork I needed?  Would they tell me where to call?  I waited another 5 minutes to find someone at the front desk and was finally given a paper to bring with me, along with the info for the ultrasound.  I thought that it was strange that no one cared to tell me what I needed to do.  A few days after my ultrasounds, I received a call from the office saying that they received the ultrasounds as well as the results of my blood work.  The blood work all came back fine and there was nothing wrong there, but she wanted me to come back in to discuss the results of my ultrasounds.  Uhhhh... I called right away, totally freaked out about what the results were!  I had to wait two days to get in to see her, and I had nightmares.  It was not fun.  I go to my appointment, and I have to wait 45 minutes before she ever comes in to see me (and I had gone in the middle of my work day!), and what she wanted to 'discuss' with me was................................................ nothing.  The ultrasounds were all  normal and everything looked fine and dandy.  What?!  Why did I have to come in for that???  So I can pay another office visit fee?  I was really disappointed, and really late getting back to the office.  She recommended I go see another doctor and let her know how it goes.  I feel confused and not 100% sure if I'd go back to this doctor :(", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 3, "date": "2013-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "sNozn8aPgwI-C7w16v6LGg", "review_id": "zaGvOoV6z5o9z5wuy-f9BA", "text": "After another appointment I am still so happy with this staff! They are more then happy help you in anyway that they can. Still love Dr. Bell!", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 5, "date": "2015-07-02", "type": "review"}
{"votes": {"funny": 0, "useful": 9, "cool": 0}, "user_id": "0UCWOfFSbSk-tXPd17_Wmg", "review_id": "RrIiUKXza7WrLRKwKXjRsg", "text": "I had Lasik this afternoon. It's now 8:43 PM. I just woke up from my post-op nap and I'm the happiest dude in Tempe. I haven't been able to see this well since I was a little kid. There's nothing like standing in my backyard and staring up at the finite features of the moon through my own eyes.\n\nLasik itself is great but obviously I'm not reviewing a surgery. This place deserves five stars for four major reasons. 1.) They were overwhelmingly friendly from the minute I walked through the door. 2.) They did a fantastic job preparing me for what to expect. 3.) I arrived at their office at 2:15 pm today and was done w/ surgery by 3. I know some people might think that sounds a little cold and impersonal but it wasn't. The doctor was extremely friendly and as soon as I shook his hand I relaxed completely. 4.) This surgery cost me 700 DOLLARS TOTAL! I responded to a banner ad they were running on Google for 299 per eye. I assumed it was a bait and switch. For me, it wasn't. I understand that everybody's eyes are different but I qualified for that price.", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 5, "date": "2010-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "a8uZ3HEqqbs1HODTdaywfQ", "review_id": "UAb1IJGWsGdnnDhVByxTqQ", "text": "The staff is amazing! I had an awesome experience with perfect results! I am now a year out from my surgery and it's as good as the first day. I have and will keep recommending LVI to anyone!", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 5, "date": "2012-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "eHowibQMqmWR9xAN1ZgRTg", "review_id": "C7uTXXHL5PQBuwon58xf6g", "text": "It has been over 2 years since my lasik and my vision is still 20/15.  I have gone to LVI for two annual exams and they are still polite and quick and a bit charming.\n\nMy husband went with me last month to get a free consult since he has worn glasses for over 20 yrs and contacts for the last 10 years.  The optometrist told him his vision is 20/20 and he needed neither surgery nor contact/glasses.  IT turns out his vision is actually a hair shy of 20/20 but contacts are not required.  I appreciate their honesty.\n\nI still recommend this place to EVERYONE.", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 5, "date": "2014-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "utD6Pi48oZb6a08NxkG6jg", "review_id": "c1L19M0w7kZgWCe8j1GLBQ", "text": "Eyes are dry a lot, but the Dr prescribed an eye drop that seems to be helping.", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 4, "date": "2014-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9uGM5DXj20vgvwBll0HefA", "review_id": "Dz9l_1K-sDPWh1oHr-B4eA", "text": "I brought my mother in here a couple of weeks ago to see if she was a candidate for lasik. Every single person there was extremely nice and helpful. Their prices were very affordable and they even offered us 20% off due to us being referred by a friend. My mother ended up needing a procedure that they do not offer but they quickly referred us to another center. As you can tell from my five star rating, I highly recommend this place.", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 5, "date": "2014-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "Ofdpb77tcimVR414_QFtqQ", "review_id": "DRDPy2bk_WCgxNa8yxzT7Q", "text": "I had my surgery done on August 14th and I was amazed with how quickly I recovered. After only a few hours post-op, I was able to see road signs and my clock from my bed, which were things I could never do before. The next morning, I went in and the eye exam revealed that I had gone from 20/600 (-5 in both eyes, one which had astigmatism) to 20/20!   \n\nInitially, they gave us a 10% discount, but I had received an email about procedures being 20% off over the summer, so I asked them for an adjustment. The amount for the entire procedure ended up being around $3,500. A friend of mine flew to Korea for her procedure and paid $1,400 for her flight and another $1,800 for her IFS LASIK procedure, but if I were to do it all over again, I would choose to go back to the LASIK Vision Institute in a heartbeat. \n\nMy husband was really pushing me toward PRK, but I chose LASIK because I did not have the recovery time (they said it would be 2-3 weeks vs a few days) and still, if I were to do it all over again, I would choose LASIK. I had minimal discomfort and dryness and I opted not to pay for the permanent punctal plugs. I used the prescribed eye drops, which cost me $80 at Walmart, quite liberally. I will say that they cause a strange metallic aftertaste that is appalling, so be forewarned.  \n\nI was concerned with the blurring in one eye that kept coming and going, but I have read that it is normal. I also had some ruptured blood vessels from surgery, which are now gone. Surprisingly, I've had minimal dryness compared to what I was expecting. You know, like having dry eyes while wearing contacts. Even the Acuvue Oasys brand contacts would cause great discomfort. An optometrist basically told me I shouldn't wear contacts at all because my blood vessels were growing toward my corneas, so glasses were the only option for me. I'm in my early 30's and I don't know why I didn't have LASIK sooner. Also, the halos they warned about don't seem any different from what I experienced with glasses. \n\nI'm thrilled. My husband says that there is a glow about me and honestly, I feel liberated. No more smudged glasses or crooked glasses, worrying about getting them knocked off of my face, or fumbling for them upon waking up.\n\nMy only gripe with this facility is that they scheduled a bunch of us for \"surgery\" at 9AM. The receptionists seemed to spend more time in the back of the office than the front. I waited until 2PM. The procedure itself lasted only 15 minutes. As we sat, nervously waiting in a dark room in our ridiculous garb (a hair net and some shoe covers), we were reassured that all we needed to do was stare at a light during the procedure. Dr, Kownacki performed the procedure and again, repeated that all I needed to do was stare at the light. The procedure itself is indescribable and there was slight pressure due to the suction and speculum. He must have done a fantastic job because during my post op, the person who examined my eyes said he could barely tell that the procedure had been performed. \n\nI know there are a lot of horror stories out there. I read a ton of reviews before deciding to go through with the procedure. The consent forms I signed at the office also caused my stomach to churn. However, nothing in life is without risk. Do your research, ask questions, and negotiate the price of your procedure. I wish you the best of luck in your decision-making process!", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 4, "date": "2014-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uaqBuJey17Z0uKA46iBWMQ", "review_id": "uacvUbHkgpMRE5VMKLVPsA", "text": "I have to dock a point because of the wait times (often 2-3 hours) and their computers seem to always be lagging and they book way too many people for the amoun of staff. However, all of the staff is friendly and my PRK surgery was a very comfortable experience. Special shout out to Valerie the manager. She rocks and will make your visit great!", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 4, "date": "2015-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "DvQ09Ieg_d_PgrAdQy71Qw", "review_id": "Sz2okyqVc00PJArhqZqaMQ", "text": "Dr. Riley has been my doc for 6 or 7 years now.  When I first went to his office, I was confused.  There weren't a ton of people in the waiting room.  I didn't have to wait one hour in the waiting room and another hour in the room.  As soon as Dr. Riley walked in, I started my \"speed-recitation of current symptoms\" - (this because my previous MD actually would look at his watch and note the time - and then do it again at the end of the \"consult\") - Dr. Riley listened calmly.  I was confused again, when he didn't just tell me I could pick up my prescription at the counter on my way out.  He actually TALKED with me.  He asked questions.  He didn't make a mad dash for the door!  Miraculous!!  And the good news is that this has not changed in all these years.  I don't have insurance, so Dr. Riley works with me on that.  He and his wife, the staff, everyone is great in this little gem of an office.  Dr. Riley is a real FAMILY doctor - he is always there for you.  What more could you possibly ask for?", "business_id": "BZqn7i_Z-MJ1QrxCyjFZSw", "stars": 5, "date": "2011-06-08", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "B4K5ruafil9RSDiTIL-1Bw", "review_id": "WCvehBiAzF9YXyTE_SYpew", "text": "Dr. Riley is very down to earth person who just happens to be really smart and have a medical degree.  I'm usually pretty freaked out by doctors, medical offices, etc. but I don't feel that way with Dr. Riley - he is very calm and a good listener.  \n\nHis office is small and you can usually get an appointment the same day or next.", "business_id": "BZqn7i_Z-MJ1QrxCyjFZSw", "stars": 5, "date": "2011-06-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "KqMUO0KFaa2aLPqfHmMQrg", "review_id": "mS1rXq75SDfxMXPAJSpU5Q", "text": "Tried to schedule an appointment today as a new patient because I broke my hand in a motorcycle accident, and was turned down. Receptionist said they take one new patient a day and as of 6/14 they are already booked until July. What? No sense of urgency.", "business_id": "BZqn7i_Z-MJ1QrxCyjFZSw", "stars": 2, "date": "2013-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DoTOs7OOJbmFH3rcjGsHDA", "review_id": "YobZ70efzUk1zwKrpsa3OA", "text": "Dr. Riley is great. I've only met with him twice, but have found each appt. very pleasant. He's welcoming and easy to communicate with.\n\nIn addition, the ladies facilitating his office are kind and friendly; and have been very helpful during my past two visits.", "business_id": "BZqn7i_Z-MJ1QrxCyjFZSw", "stars": 5, "date": "2013-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "rrzMerl6qhFn7ipXXpsJPg", "review_id": "5kx-BTLfQq65JTtMRG1ImQ", "text": "Been seeing Dr Riley for years. He recently moved to Banner Healthcare. I like him. He has called me at home a couple of times to check on me. I was pretty ill but how often have you had that happen?!  He is a great doctor and a compassionate human being. And he loves fly fishing!", "business_id": "BZqn7i_Z-MJ1QrxCyjFZSw", "stars": 5, "date": "2014-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 2}, "user_id": "1F5G7Tdo14xzsGyISkHDvQ", "review_id": "BlV2ta8EoZYAokKpTFhaVA", "text": "I haven't been to a doctor in quite a while, but Dr. Riley made the visit quick and very informative. The office is in an older building, but inside is so clean and inviting. The staff was very helpful and quick.\n\nDr. Riley himself only kept me waiting for maybe two minutes before opening a dialogue with me. He has an excellent way of communicating symptoms and issues. I'm very glad I decided to go.", "business_id": "L6f65Mpp5kMBjUnUY6lQ5g", "stars": 5, "date": "2010-08-16", "type": "review"}
{"votes": {"funny": 3, "useful": 8, "cool": 6}, "user_id": "fwEPqYiyZCaB7QKY6a7h5g", "review_id": "oDnyRGKAvSxDNt53uudIZA", "text": "Outstanding team of cardiologists here at Biltmore Cardiology! \n\nI had been experiencing some intense chest/breast pain out of nowhere. You know, just sitting on your couch, laying in bed, sitting at your desk.\n\nPretty scary when you're a youngin like me. Heck, anyone of any age, but you get the idea.\n\nMy Mom has fibrocystic breast condition (easily managed when you dial back on your caffeine consumption or eliminate it all together, no fun), and told me to hit up my OB GYN to make sure there weren't any suspicious lumps. \n\nWell, clearly a mother always knows what's up. \n\nOB GYN was almost positive the chest pain I was experiencing was related to that amazeballs fibrocystic breast condition (aww, thanks for sharing, Mom). But, as an elite level athlete, she didn't want to take any chances. \n\nOut of the office with a referral in hand to Biltmore Cardiology. Boo ... But better safe than sorry. \n\nSaw Dr. Akil Loli and Dr. Harris on my first visit. Teenage like blood pressure, normal EKG, heart sounded great. He also said some of my chest pain could be related to all the torso twisting involved with hammer throw. \n\nCaring, compassionate, respectful specialist, and very easy to talk to. He gets major points for knowing what my sport is. Usually I have to explain it as Track and Field / Hammer throwing isn't too popular in the United States.\n\nDr. Loli still wanted to go forth with an echocardiogram and stress test because of my lifestyle. Nothing like only making it to Stage 6/7 on the treadmill to make you feel like a fat athlete, no?! \n\nFront desk ladies and the testing team were stellar! \n\nHad Dr. Loli's partner, Dr. Gordon (retired, but occasionally covers for the practice) review my results. Clean as a whistle. \n\nWhat a relief!\n\nI hope I never have the need to see a cardiologist again. But if I do, I know I'm in good hands with anyone here. \n\nHighly recommended.", "business_id": "gVEtYzzezWoy1Jfvtv3ZLg", "stars": 5, "date": "2014-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IqiVqq31gvfCsUJA7orzqA", "review_id": "-lqsjy_9O8GjgN4A7FZ-ig", "text": "Revised review: I posted the original review (and the picture of the inept front desk staff) from the waiting room. The woman who performed my echocardiogram (Wendy) immediately apologized and promised to address my issue. That made me feel better. \n\nI had kind of forgotten how much I liked Dr. Loli until I saw him after the test. He promised me that the issue would be handled.  I believe him.  My point was and is that patients are people. Some of us can sit in a waiting room all day, some of us can't.  Front desk staff clearly knew the technician was running behind, but no one told the patient. If I had that information up front, I would have been far less irritated. \n\nThe original review:  The office staff are totally inept.  If the testing person is running 30 minutes behind, why not tell the patient instead of letting him fume about the wasted time spent in the waiting room?  The response of the front desk staff?  \"I wasn't the one to check you in.\"  You can be assured I will find a new cardiologist immediately. (That last sentence is no longer true.)", "business_id": "gVEtYzzezWoy1Jfvtv3ZLg", "stars": 3, "date": "2014-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "sHzcp_jjMUhJAc28NFDDQg", "review_id": "RQeKhM-cadgK6VtIwWa0Cw", "text": "STAY AWAY AND FOR GOODNESS SAKE, DON'T TAKE YOUR CHILDREN!!!  My daughter was misdiagnosed and spent two years on a medication she didn't need!  Words cannot describe how angry I was when I found this out through a reputable allergist.  I suspect that they are receiving kickbacks from pharmaceutical companies, because we spent hundreds of dollars on equipment and medications (which they provided directly).  The staff is ambivalent at best, downright hostile at worst.  And don't get me started on the excessive costs and all the hassle with the insurance!", "business_id": "vDftL4Exl7ZcMVx2aPY8mQ", "stars": 1, "date": "2013-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w3X9rllzDnPZtOSgAnqfNw", "review_id": "87U4TacBHvNLRPkig0M_2A", "text": "This place was the only place to tell me what my chest tightness actually was. And no it was not simple asthma. They take their time with you in the room and listen to all symptoms not the ones that just they deal with all day. Everyone is helpful even the staff.", "business_id": "vDftL4Exl7ZcMVx2aPY8mQ", "stars": 5, "date": "2014-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eDnACPK9kqheoGXnxyC1Dg", "review_id": "S2hgbA6jkT464d5j8Mhbvw", "text": "I decided to ignore the other reviews and paid for it, literally haha ($90 for an allergy test with good insurance). I researched it after and the intradermal test they used to diagnose me is miserably inaccurate (they definitely didn't mention it though). I was falsely diagnosed positive and was given further treatment recommendations. Also abysmally long wait times. If you really need a test that will accurately show what you are allergic to you truly need to do a blood test at a well reviewed and reputable health clinic, the common percutaneous and intradermal tests they recommended will very likely provide you with false data regarding your health! If you just want to see what you are allergic to quickly and cheaply, it is usually safe to expose yourself to a little bit of the suspected allergen (I went to a rabbit adoption event). On a side note, I think it's hilarious that this clinic is next door to the only community flower garden I've ever seen in phoenix. Really people don't go here", "business_id": "vDftL4Exl7ZcMVx2aPY8mQ", "stars": 1, "date": "2015-06-16", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "2tUCLMHQKz4kA1VlRB_w0Q", "review_id": "WLAD7_guJdOOcs370JR2LA", "text": "The receptionist was not friendly, and wears no name tag so I didn't know who was greeting me.  She actually never said \"hello\" and never smiled.\n\nLong wait times, so schedule when you have a lot of time and bring a good book.  \n\n\n\nThe doctor removed several freckles for no reason at all apparently, because she didn't explain why, leaving me with scars that I did not want.\n\nCan't say this was a good experience and I won't be back.\nLook for a doctor who thoroughly explains what she is doing and why.    I prefer a doctor who answers questions thoroughly, especially since the wait time was so long.   I expected better quality of service during my visit but was very disappointed.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 1, "date": "2009-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "MeGCFB0rLeT4NOCDjEoOfg", "review_id": "NKZz0kWrIGcm2ITD0tGZAw", "text": "I have had numerous appointments here over the past 4 years to treat breakouts, and I am less than impressed with the PA's and tx methods. You never see a dermatologist...only a PA. They don't ask questions about your skin, their exam of your skin is bare minimum, and they prescribe topicals and send you out the door. No education about possible causes & possible preventatives (other than their topical meds). This past experience with PA Kenan was ridiculous. He wouldn't prescribe oral meds, stating my skin wasn't bad enough. Well, in my opinion it is bad, and topicals are not working, and how would he know anyway because I had make-up on and he barely looked at my face. He offered nothing in regards to treating the breakout problem other than prescribing topicals & referring me to their aestatician, which neither have worked for me! If you need acne help, go to a real derma, not a PA, and another clinic if you want treatment for acne.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 1, "date": "2009-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "diIeHQyCBG-rkcSxp5NGKA", "review_id": "OjIYKjF17jgfqf4mnUXMtQ", "text": "Dr.Romine is wonderful. However if you ever have to interact with Riley the woman that does the laser skin procedures I highly suggest going elsewhere. She was rude, abrasive, and poor communicator from day 1. I came in for a spot on my face that had been there since last year. She set up a series of procedures and did not realize until the 3rd one (2 wks apart each, costing $100) that was not the treatment I needed. She never seemed to recall our initial consult and concerns and was so wrapped up in \"knowing it all\" and attitude she never took the time to listen to the patient and what the presenting complaint truly was. The incorrect treatment was for depression or differences in the skin texture of a scar and did nothing for the actual problem, her excuse being I termed it \"a scar\" so that's just what you get. They are the professionals and they should know what treatment to recommend and that the brown pigment was the initial complaint which I said several times since I walked in the door. To top off the attitude every time we spoke- she canceled an appointment the day before which I had planned for over a month and was the only day until November I could do it because of the down time after. When I walked in for the appt and asked why the law was in place (doctor suddemly not in the office building that day so she couldn't do it) she just stated I don't break the law for a procedure instead of explaining the reason behind it.  Extremely poor commuunication and listening skills- highly suggest going elsewhere!!", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 1, "date": "2012-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "AA26ZVCnCMxxS_rRpEwcxw", "review_id": "DlZnPdlj4ZqjxlArY0fSXg", "text": "I have been to Camelback Dermatology about 8 times and they have all been for acne except for the past couple of times. I will keep this short. I have a small cyst on my eye. I wanted to see Dr. Romine (and thought I was) but saw a tech or PA and was given a steroid injection and put on Solodyn to take inflammation down, was suppose to reschedule to have Dr. Romine remove the cyst. So, this is what's happened. I took Solodyn, (it's a horrible medicine) and yes, it has cleared up my face but had caused me to break out in little red dots that didn't itch, it was just ugly. So, I waited a week, still had them and called Camelback Derm. The assistant I explained this too said, no, I'm sure it's not an allergic reaction, I would just keep taking it. So, I kept taking it, two weeks later, I have hives and swelling and joint pain. I called Camelback Derm. to explain I needed to get in. I go in, and was told to stop taking the med. and they instead prescribed me a topical cream for my hives and said go home and just use the cream. What they should have done was given me an oral steroid, not a topical cream!!! So, I get the prescription filled and go home, rub the lotion on and the swelling and hives and pain get worse. I ended up driving myself to the ER the same night (last night) and was given iv fluids and benedryl which did not help. The dr.s there were convinced I had an autoimmune issue and to see a specialist. I went today to my PCP and was told I have had a severe allergic reaction to Solodyn (which contains Tetracycline) and that I have Steven's Johnson Syndrome and dermagraphism. Google it, it's pretty nasty. I was put on oral steroids and have to see a Rheumatologist as I may have developed Rheumatoid Arthritis. How can the dr's diagnose me but a skin specialist like Camelback Dermatology can't! I'm going to call and complain and let them know I shouldn't be charged for my last appointment because they diagnosed me incorrectly and I ended up in the ER. Not happy at all. Yes, everyone there seems friendly, but every time I've gone in, I'm ALWAYS being \"sold\" on prescriptions and \"you should be taking this\" or \"have you tried this\". It's really getting old.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 2, "date": "2012-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_6seymnSl8rS-pw801ENAg", "review_id": "doK0Hjhe8XDFqkB96nRAdA", "text": "I asked a friend of mine if she had a good dermatologist, and she goes to Camelback Derm.  I made an appointment (dealing with mild acne), and was optimistic for some new treatment as well as to get a prescription for a topical I had already been using.  I knew going into it I would be seeing a PA first and then meet the doctor.  I made it clear on both the written forms they have you fill out as a new patient and verbally stated to the PA that I have an autoimmune disorder and cannot take certain medications with antibiotics.  I met the doctor for only 5 minutes.  i was still given a prescription for a topical with an antibiotic in it and when i got home, after doing more research, it was highly suggested on many websites (including the drug company's) to not use this medication because of my autoimmune disorder.  This was the first frustrating issue.  I called the doctors office and left a message with the nurse's line, and they did call back pretty quickly saying they would change the prescription.  While it was nice that the doctor gave me samples and coupons for the prescriptions, one of them was expired, and could not use it at the pharmacy (though I did end up later finding one online through the drug company).  I also found that frustrating-but only because it costed me an extra half an hour of going back and forth to the pharmacy.  Overall, I felt most bothered by the fact that I expressed more than once that I have this pre-existing condition that should be taken into consideration, and the neither the PA nor the doctors seemed to take notice.  I do understand that this doctors office is very large and busy, but being that I was a new patient to the office, I felt very rushed.  But, this office location is very convenient to where I live, and for the most part do not have many other skin problems to deal with, so I don't plan on having to go to this office very often, other than to follow up on my progress with these medications.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 2, "date": "2012-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QhkKbMUgYSve53aBo7JgGw", "review_id": "hFBzdFxDvDkuSbTRw5O4zw", "text": "I was extremely disapointed.  I was not see by Dr. Romine.  The nurse was very rude and looked at her computer the entire time she was speaking to me while in the room.\nThe doctor came in and was not informed as to why I scheduled appointment in the first place.  I requested a full body check and to have some sun/age spots removed.\nI was told I would have to come because they were to busy.  BUT they did have time to tell me all about the  cosmetic products for sale  for 15 minutes.\nI didn't feel this was how I remembered her practice when I previously went when they were on 44th street.\nI will NOT  be back and feel that they hustled that side of the business instead of treating me as a patient first.\n\nSad to say this was a waste of my time and my money.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 1, "date": "2014-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "l5483pEya57EM9olp-LHFQ", "review_id": "uNsunERO58yGpkaJWKJLCQ", "text": "Referred to Dr. Romine for MOH surgery to remove a basal cell carcinoma. First time so I had no idea what to expect. The staff were all excellent, reassuring, compassionate, caring, cheerful, and kind. Dr. Romine was likewise and I found her to be extremely efficient, talented, gentle, and spent time answering my questions. In addition, I believe that her level of skill has completely minimized what could have been an ugly scar on my cheek. I highly recommend Dr. Romine, her staff, and the overall level of care and support I experienced.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 5, "date": "2015-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "NjnE6x-9PI_QpRZszO9miQ", "review_id": "3rNMJ_VtCHedsfVQ0W2zgQ", "text": "I spoke with most of the Dermatologist's in Phoenix who perform the procedure I wanted. They were the most competent on the phone and turned out to be just as professional and qualified once I arrived at my appointment. From the gal at the desk to the folks at check out they were nothing short of fabulous. Dr. Romine and her staff were all extremely knowledgeable and generous with their time and expertise. I will use Dr. Romine as long as I live in the area.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 5, "date": "2015-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "A2OUjjskwX83aBpUEq7mrA", "review_id": "cwZqn2e4zFwEg4a1eOSk2A", "text": "There's so much I could say....Long story short: DO NOT COME HERE FOR ACNE TREATMENT. I came here because I was having issues applying makeup. My skin was too dry and I wanted to have a smoother texture on my skin. I left here 4 months later with horrible, horrible acne. I HAD NEVER HAD A BREAKOUT LIKE THIS IN MY LIFE. Was told at first I just needed 2 or 3 chemical peel treatments for my dead skin. However I got about 6, because I was told I waited too long after the first one and I needed the receive the treatment every 2 weeks for it to \"work.\" It seems here their aesthetician is more concerned with having clientele come in every 2 weeks, rather than actually doing good and making the issue better, therefore the client wouldn't have to arrive every 2 weeks. (And I was commuting far...) Every time I left, the aesthetician always made sure to recommend me 5+ products to buy at the door. (None of them were \"cheap.\") When i purchased a suggested face wash that only made matters worse, the aesthetician, Kristel, and Molly refused to listen and believe me that it was making me break out. They would not issue me a refund, but my biggest concern was that they would not listen to me. They acted as if they were home with me every night, caring for my face at all times, washing my face and applying my make up and sun screen. As if they knew my own skin better then I did. The only thing that cleared my face back up was TO STOP going to them. They also prescribed me multiple antibiotics and hormone pills, which also made matters worse. But did they listen? No, instead of admit to trial and error EVER; all they did was try to convince me it was a hormonal issue. (They made matters worse, prescribe more pills my body could not handle, now I have been diagnosed with anxiety and IBD.) It's sad that I was so belittled and not even treated as a reference to my own skin issues by healthcare professionals, who I trusted and believed actually cared for my well-being, however, I NO LONGER trust healthcare professionals because of the staff here.) Bottom line, the staff here has an \"one size fits all\" treatment when it comes to acne, but that's not the way skin works. (Especially ethnic skin! If you do more research on chemical peels, birth control, and ethnic skin, you will find why.) There's so much more I could say... I am certain if the staff saw me now, they would not even be able to recognize me. Since mid treatment, I began to feel like they didn't even remember what my skin looked like on the first day I consulted with them as a new patient. Nor did I feel like my original issue mattered anymore, because they created bigger issues. On a positive note, isolaz does work, it's covered by insurance, and it doesn't take a rocket scientist to operate the machine :) There's so much more I could say about this business, if you have any questions, just ask, but I'm telling you with all good intentions for someone out there struggling with the same issues I had, do not come here! My skin is cleared up now, but I still have scars under my make up to show, and the emotional scarring this caused me will last my entire life. I use to cry myself to sleep every night. Not to be dramatic, but I did develop other health issues thanks to the pills Molly prescribed me, which will also last my entire life. I did look into filing a suit for my claims, however I know I signed a couple of waivers, so I don't think legal action could be possible, but I do know now to be a smarter and more assertive person in the future. I know I could also contact the BBB.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 1, "date": "2015-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HQY1Z3cZWegfxHkrvP2RGw", "review_id": "gLNQ2xk8qICmRJBJEAhx9A", "text": "Called to ask about the cost of an upcoming procedure and got the old slight o' hand trick.  \"Call your insurance company\", she said.  I countered with, \"The Doctor sets the price.  What is the price?\"  They wouldn't tell me.  Now, while I understand how the game is played, it comes down to a matter of trust.  If I am to trust this doctor with my medical needs, surely I can trust them to simply be straight with me about the cost of the procedure.  We're all adults here.  What other industry lacks transparency as much as healthcare?????", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 2, "date": "2015-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Soxfx97ytuioKALxKXKzlQ", "review_id": "-UWD9EOVoX82WO8gjWg5lA", "text": "I had this office as my Dermatologist for years... and I hadn't needed to visit in a few years (from the old office at Camelback).   \nThis time it was extremely frustrating. I had my appointment, and I arrived on time and had to wait about 30 minutes. Got treatment and was told to come back for a follow up in a few weeks.\nWhen It was time to return I got an unexpected emergency at work and was running about 20 minutes late or so. I called and they said \"no problem, just come down and it might take longer to see you but we will get you in\".  I confirmed, since I had a 40 minute drive, and I told them I had a long drive.\nWhen I arrive they had me wait for a good 20 minutes, and THEN they tell me they can't see me that I was too late. So after loudly asking them to honor their first message to me (that they would see me) and them saying they didn't even know who had said that from their office, they just turned me away.  They made me waste nearly 1 hour and 30 minutes I didn't have, and now I need to see a different doctor for the thing they started treating, that wasn't successful. \nTo cap all of this, they sent me a $5 bill on the mail, no reference to everything else that happened.\n\nSo recap: the doctor is Ok, if you ever get to see her.  The techs are pleasant and didn't resolve my problem.  The office staff is incompetent in my experience. \n\nNo good having a doctor that you never get to see because of his/her staff!", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 1, "date": "2015-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iyN7w7bAx4MTFmJDU_kidA", "review_id": "nMsBHBw52Vk0pe8kGP1UwQ", "text": "I manage an Urgent Care down the street and refer patients to this office frequently. Especially the new patients in town that have had the same doctor where they came from for 15 years and are looking for a new, well rounded practice and knowledgeable team of doctors that they can trust.  I call to get feedback from them about their experience, just like I do when I refer patients to a certain Orthopedic, Urologist, ENT, Imaging Center ect.....  and all the responses I get are all pleasant,  They like the idea of having x-ray and lab services on site, unlike most PCP offices in the valley that have to send their patients to a different location to receive those services. I have not been there myself so I cant give you a personal account, but from the feedback that I get I never have any reservation in recommending Dr. Wyse and his team of doctors and staff to any patient looking for a new PCP that doesn't treat you like a number and takes his/her time to address all your concerns.", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 5, "date": "2013-06-10", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "nosWyAOVzM9Ed68E2iutlw", "review_id": "8WE-EpjeFGS-J4l7a3Buhg", "text": "Well the administration fee is true and now I will not be going back.  You have got to be kidding me.  Like someone stated earlier, I pay a copay every time I go in there and they bill my insurance for anything additional they do.  This is total BS.  I thought I was going to the doctor not a gym.  The Doctors are good there, but it is soooo slow.  If you have a 10am appointment, don't expect to get in before at least 10:30am.\n\nI called and I was told this fee was to offset the cost of the Lab, EMR and Patient Portal cost.  I'm not sure what Lab they are referring to because every time I have blood drawn they send it off to some place called LabCorp.  Isn't this the cost of doing business?  So should I start deducting a set amount for the employees that work for me for the cost of internet and the payroll system we use?  I don't think so.", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 1, "date": "2013-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "hDKFaigJjgXFa8ieH4SyMQ", "review_id": "xYv07AmS6uMRjwjOJNuofQ", "text": "It took me several years to find a family doctor that I could truly trust. I found Dr. Goldman about 2.5 years ago after having a severe allergic reaction and he was able to help me pin-point the cause and put me on a path to recovery.  Dr. Goldman and his nurse Maddie are truly great!\nI am saddened to say I am now leaving this practice because of a silly Admin fee they have now introduced along with a calling list they put their patients on to receive recorded advertising messages of medical services they provide. Really, you want me to pay $49 a month so you can send me infomercial voicemails to spend more money at your practice?!?!  I am generally a healthy person and maybe visit the doctor once or twice a year.  They already bill my insurance up the wazoo and also charge me a co-pay every visit, is that not enough?   Maybe if this doctors office was a luxurious spa, with outstanding customer service, would I consider spending a yearly fee.", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 1, "date": "2014-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ni32cDsySmaWetmgYmcaYQ", "review_id": "5z1DB2sPVyMeoLdRlvgolA", "text": "The staff at this clinic are HORRIBLE. The receptionists ignore you. Dr. Clark's assistant did not wash her hands or wear gloves when giving me a shot. She even tried to wipe the blood away without protecting herself or me. Dr. Clark appears to be competent but basically he just sends you out to specialists since he can never see you when you are actually sick.", "business_id": "1GXycbqgmD9TfhQFoktSLg", "stars": 1, "date": "2013-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9EEQzDyzJgmjNNWLi-m0ag", "review_id": "-cby_sXWappxg4FuGfdEgA", "text": "My whole family started seeing the doctors here.  I really like my doctors and I've seen Dr. Clark & Dr. Corkrin. My grandparents started coming here and we all like this place.  All of the doctors I've had are really awesome.  So glad I switched doctors.", "business_id": "1GXycbqgmD9TfhQFoktSLg", "stars": 5, "date": "2014-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DrPOgnV9F077zbW-bD7jdw", "review_id": "nYGSMI7N9fPW9hFBiz1vdw", "text": "I'm surprised to see so many negative reviews.  I've never had a bad experience here-  Not that I'm here often.  But I've gone in for an annual checkup and follow up.  The office staff was friendly.  Dr Corcoran was quite personable.  The team that did blood work was friendly.  They have an app that lets you view your results and helped me register.  You can also schedule your visit from the app.  The whole process was pretty efficient.", "business_id": "1GXycbqgmD9TfhQFoktSLg", "stars": 4, "date": "2015-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 8, "cool": 0}, "user_id": "OrZxA912pFB2-sAkMdoZaQ", "review_id": "CG0AM6YxFnGAGHwmUUPtyA", "text": "What a great Plastic Surgeon!!!!  Dr Meger and his staff are the best!!! Family like atmosphere!!! I wouldn't go anywhere else", "business_id": "H8_d-SvwBz-Sd_ZTK7Kucw", "stars": 5, "date": "2010-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "zSFRBZcQMTH5Ane2onb3eA", "review_id": "7wpRcT3Rnjx3iAmMYLG6Pg", "text": "I researched quite a few surgeons for my operation and I'm really glad with my decision to go with Dr. Meger. Upon meeting him, he was very confident and answered each question I had (which was a list I compiled on my phone). The staff is very forthcoming with advice and support which was comforting being a person who had never undergone surgery. I scheduled my surgery a few months in advance so the anticipation was killing me. Luckily I had their email and any worries of complications or random questions I had, I would send over. It was nice being able to get a quick response to any worry I without feeling like a hassle. \n\nOverall, I think this practice has a knowledgeable staff and I really felt at ease and that I was in good hands. I am very pleased with my experience and plan to use them in the future if I need another procedure.", "business_id": "H8_d-SvwBz-Sd_ZTK7Kucw", "stars": 5, "date": "2014-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zx_y8mGEqnV02fe1KEF5fQ", "review_id": "ibdk_etC_Fb2nDx5NRPhkQ", "text": "Dr. Meger did a great job doing my rhinoplasty, Dr. Meger and the staff are very professional and they treat you with personal care and service.  The procedure was quick and my healing only lasted a few days, I was back to work in a week and a half with minimal bruising.  I would recommend Dr. Meger to any one looking for a great plastic surgeon.", "business_id": "H8_d-SvwBz-Sd_ZTK7Kucw", "stars": 5, "date": "2014-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Su5T9g-q1FGn1twaYt_jTg", "review_id": "zvBPIW0LQxNReJYwtynggQ", "text": "I have been married to my wife for 38 years (since 1977) and she has been stating to me from our first years together, she would someday be getting a facelift. I said fine and never paid much attention to it since. About 5 years ago we went to Dr. Meger for a consultation and surprisingly he told us that she did not need a face-lift. He indicated that that day may come but for the time being all was good. We left feeling like when the time did come we certainly trusted Dr. Meger as he didn't seem to be selling procedures. In fact he did the opposite. This past January, we had scheduled another consultation and he in fact said that a face-lift was now a viable option for my wife. We scheduled it and had some scheduling issues that his office happily worked around for our benefit. On the day of the surgery nothing was a surprise because the office staff routinely kept us up to date on all that would happen. I have waited to write this review because we wanted to see how the final results appeared and I am happy to report that we are both very pleased. The recovery time went exactly as indicated. The follow-ups have been routine and helpful. Both my wife and I have the highest confidence in Dr. Meger and his staff. All seemed helpful and attentive to the process. I read with interest the other reviews here and quite frankly was surprised by the 1 star rating. That reviewer states she is confident Dr. Meger is good at what he does but maybe he was having a bad day. We felt that Dr. Meger is communicative and straightforward in his opinion, which in turn helped us make a decision. A nurse/assistant was always in the room when Dr. Meger consulted pre and post surgery and answered all our questions plainly which some may find a bit off. We liked it.\nMy wife is absolutely tickled pink and while I have always thought her beautiful, she certainly looks 20 years younger. No plastic look whatsoever.", "business_id": "H8_d-SvwBz-Sd_ZTK7Kucw", "stars": 5, "date": "2015-07-13", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "gDWhbCu7Llc8wSYpmW4Vvw", "review_id": "2466cwlci9rBvyodArvQaw", "text": "Terrible place where the people make you feel like sh*t about yourself. But then again it's a place run by the church. They weren't supportive and almost made things worse with lies filled with fear. Not recommended at all.", "business_id": "8PnmGKOTyHKp0b04w62fMw", "stars": 1, "date": "2014-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gDVSujaf8xwx0vqLrYDHDw", "review_id": "0G9QoBpNKEaz9Ji5OdaYPQ", "text": "If I could give more stars, I would. This is the third OBGYN I've seen since finding out I was pregnancy back in April and I'm so glad I found her. She's an absolute wonder compared to everyone else. I got pregnant with an IUD and have had a rocky start. The first doctor spoke down to me, the second doctor came into the room after my 14 week ultrasound and said, \"Everything looks fine, any questions?\" \n\nI finally made it to Dr. Kwark at week 15 at the urging of my mother and she spent almost an hour to me telling me about the tests that should have been at least offered to me several weeks prior, giving me an exam and giving me expectations for the next few weeks until I saw her again.\n\nI'm not sure why the other reviewer had such a bad experience, but I can tell you that what she had is definitely not normal. I and several people I know go to this doctor and she's absolutely wonderful.", "business_id": "31wytPjgKJAf0QJov1Y4Tw", "stars": 5, "date": "2015-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "8KmHPVzyBW45_tXX8zU5mA", "review_id": "7FnJr5h2RchNWafycoQpLg", "text": "I've been in health care for a decade and THIS is the only pediatrician office I know of that is open 6 days a week year round and 7 days a week during the cold/flu season! Not only was my kid's appointment honored ON TIME but I was in and out in half an hour! Oh, AND the doctors are really nice! :)", "business_id": "lgyBsM93DBchuwU-_l0Sfg", "stars": 5, "date": "2011-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WGvTE5fGRdu0Nx3IHxe1Ew", "review_id": "Oc5_LTlDryLs7m1arrg02w", "text": "This is my pediatrician and I absolutely love them! I switched from N. Scottsdale Pediatrics because I never saw the same Dr. twice there. It felt more like a clinic and I wanted to establish a trusting relationship with my Pediatrician who would be there consistently for my children.\n\nI couldn't be happier. It's not as fancy with flat screen tv's and decor as the N. Scottsdale office, but the care my family has received has been stellar. Pretty much everyone I know goes to them know and I haven't heard anything but positive stories.\n\nDuring flu season, they're open on the weekends! Who does that? I feel 100% confident about recommending them.", "business_id": "lgyBsM93DBchuwU-_l0Sfg", "stars": 5, "date": "2013-07-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LrMZYbnZ-_FhndRvpYd3kA", "review_id": "3j23W-RBvtiED8o0X5APaA", "text": "Terrible experience with Dr Lersch and referral specialist. First time visit with Dr Lersch for 11 year old check up was okay. Everything since then, including spending hours on the phone following up on a referral, false promises to send to referral dr.s and finally a decision Dr Lersch would not support a referral to a speech therapist even though he diagnosed him as tongue tied. What a run around!", "business_id": "lgyBsM93DBchuwU-_l0Sfg", "stars": 1, "date": "2014-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EvLrwy9D3BfcMRueO8iOdg", "review_id": "to27qXU6i22cFS4-PmLkVw", "text": "We have been going to Dr. Lersch for 12 years and we love him.  I don't love the PA they have there.  She has been rude and not very helpful every time I have seen her.  The first time I saw her was the first time my baby was sick enough to bring her to the doctor, and I felt she really bullied me.  I was a new mother dealing with my first infant illness - so, that was weird.  Now when I call to make appointments, I just ask for Dr. Lersch and if I have to wait an extra few days - so be it.", "business_id": "lgyBsM93DBchuwU-_l0Sfg", "stars": 4, "date": "2014-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QA0QYsUHyNkL8GyUOiVEAQ", "review_id": "hTBhw84v6gLdl_L06bS_OQ", "text": "This was the third pediatric office we decided to try after being unimpressed with others. I'm so glad we did. Dr. Lersch is wonderful. He actually listens and takes his time and he explains what he's doing throughly, during the well checks. He remembers all details from previous visits. Highly recommend bringing your babes to Dr. Lersch.", "business_id": "lgyBsM93DBchuwU-_l0Sfg", "stars": 5, "date": "2015-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "TCEqENMcnIjsBCjlI_Stzg", "review_id": "PsJQjWqsqPqGBsos7BBdDw", "text": "Not bad. This is one of the upgraded older hospitals, and a Level 1 Trauma center, so you know the ED staff knows what they are doing.", "business_id": "Z9ogOCIkHasuKVELa8mQ_w", "stars": 4, "date": "2011-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8N3ORTs6KsZTnHgd0obT5g", "review_id": "7cM3M4iVEH4bt9u2Clny5g", "text": "Office is pleasant and organized. Great experience with new doc - Dr. Joshua Millstein. He took the time to listen and explain things.", "business_id": "_SZwP-ddcBpw7aZsCQKSww", "stars": 4, "date": "2012-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uRbF9JOrkuK0khJSm0DMhg", "review_id": "s1KPDhv29yHwpwyb8hEzvA", "text": "Over the previous 2 years my wife has gone to see Dr. Shucker three times for abdominal discomfort. His first test was to have her hop up and down to rule out the appendix.... REALLY!? As she is over 50 she felt it was prudent to request a colonoscopy. He agreed and said they would contact her...nothing was done. Instead he scheduled her for what turned out to be an unnecessary mammogram at, you guessed it, a JCL facility. Finally they scheduled her after 2 more visits. The gastroenterologist found stage II colon cancer. She went back to him and reported the finding. What does his staff do? Schedule her for ANOTHER mammogram. The man is a bumbling idiot...do not place your life in his hands, you may lose it.", "business_id": "_SZwP-ddcBpw7aZsCQKSww", "stars": 1, "date": "2014-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ai6wsk1VurY9o6zEuRG11w", "review_id": "OZrltihKf1mCxqW_XXoLEg", "text": "Dr. Joshua Millstein is AMAZING! He is a wonderful doctor and a kind man. He is the kind of doctor that legitimately cares. If you want a great doctor he is the one!", "business_id": "_SZwP-ddcBpw7aZsCQKSww", "stars": 5, "date": "2014-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h1x2-IA54VjXtqBmblSffw", "review_id": "695bQYNLTBzdkMzW30EpLw", "text": "I recommend Dr. Joshua Millstein ANYTIME!!  He is the best doctor around. He is very caring, and get this, he actually listens to what you have to say.  He follows up on his patient's. He saved my husband's life. If it were not for Dr Millstein, my husband wouldn't be around anymore. Dr. Millstein noticed that my husband was having a tough time swallowing, ordered an endoscopy, and found out that my husband had esophageal cancer (third stage). Thank God for Dr. Millstein. My husband is now cancer free, and we owe it all to our wonderful Doctor.  Thank God for doctor's like Dr. Millstein.", "business_id": "_SZwP-ddcBpw7aZsCQKSww", "stars": 5, "date": "2015-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZaTNpjk7-nGwCgAQdraT7Q", "review_id": "qZP7V0tJHhAouompNjPjow", "text": "Wow, can you believe there is a doctors office that still exists where they did not ask me for money up front? I was warmly greeted and did not have to show ID or give up my firstborn just to see a doctor, which is the norm these days!!! My 14 year old sustained a knee injury at cheer practice and the first ortho I brought her to would not see her without a $250 payment before she even saw him!!!  We sat in that first office with her crying in pain for 40 min while they haggled over her AIA school insurance.  We were first seen by Dr. Grubers PA, who immediately put my daughter at ease and explained her injury then did a set of xrays.  Dr. Gruber then came in and let us know the course of treatment. Orders were sent out then and there and the nurses were also fabulous!!!  I cannot say enough good things about this office and the way we were treated. Thank you Arizona Bone & Joint Specialists for restoring my faith in the medical profession!!", "business_id": "PzMU15mDNyXeH8p4_qm9PQ", "stars": 5, "date": "2013-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ob-aUBLAA9JhhwC4VUTQSQ", "review_id": "EGH0s0hadAiWNf9A61y6fg", "text": "I've actually had 2 MDs here:  Dr. Schafer and Dr. To.  Thanks to Schafer I am now able to use my right shoulder which had been frozen due to lack of good care from 2 other doctors.  Then Dr. To is my new \"hand\" guy-as I have RA and Dupuytren's Contracture.  He has fixed my trigger thumb.\n\nBoth men are fantastic!  Plus, Dr. Schafer sent me to the best PT around-Aris.  And Dr. To went to school and studied with the same surgeons as my hand MD in Orange County, CA", "business_id": "PzMU15mDNyXeH8p4_qm9PQ", "stars": 5, "date": "2015-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "21tKIwkUpJU4r75bYfR06g", "review_id": "Il_hNJ00Vo1NuvJGLd82LA", "text": "I've been going to Camelback Womens Health for over 10 years.  I see Julie Bergdale the nurse practioner and I cannot say enough good things about her.  I actually followed her from another office she worked in when she left and went to work at Camelback Womens Health.  She is in no way shape or form an in and out type of provider, she is very patient, caring, extremely thorough and compassionate.  \n\nI also saw Dr. Nelson at Camelback Womens Health when I was pregnant and he delivered my daughter.  He is another superb health care provider.  He was always patient with me, never rushed me out of appointments and never made me feel like I was bothering him when I called about concerns.  \n\nI will say that the nurses I've experienced there are a little short and lacking personality, however I'm not there for the nurses to provide me care so I don't think much about that.", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 5, "date": "2010-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "O0GQA7CYMXAhss8qIKA2sA", "review_id": "4A7I5dn_W5FJcQ-1xHjFQQ", "text": "I was referred by a friend and have had nothing but trouble with this office.  In November I found out I was pregnant and was having issues before my first appt; I had an emergency and had to get in right away and ended up seeing another doc.  I won't give names, but that doctor basically beat around the bush to tell me I was miscarrying instead of telling me flat out.  My husband literally played 20 questions with that doc to get a simple answer.  It was ridiculous.  Also in Novemeber I had the office call me on two different ocassions to reschedule because they made a \"scheduling error\".  As far as I'm concerned thats something they should fix since people take time off to make appts in the first place.  Fast forward to today, another emergncy appt and I just got a phone call from them that they canceled my appt. I am so furious with the way that they run this office.  Try and make your schedule work, don't cancel people.  I'm livid and would not return here if you paid me to!", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 1, "date": "2011-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "1tIoMneVWpNSu732A7c_nA", "review_id": "fNEwt7dF2jxDW-OMnFy6yA", "text": "I've been coming to Camelback Women's Health for over 10 years. I see Julie Bergdale for all of my check ups. For my prenatal care, my doctor was Erin O'Sullivan. While pregnant I complained alot about how she treated me coldly, but looking back I was just being pregnant. In the end, Dr. O'Sullivan was on vacation when Dr. Schwartz intervened and chose to induce. Dr. Nelson was the one who delivered my son. All in all I had a favorable experience, they were all looking out for the baby and my health- which is their job, regardless of how I felt. I had mastitis, and again Dr. Nelson took good care of me. Some of the medical assistants can be a little rude (which, not being pregnant anymore, leads me to believe I'm not imagining them being rude). Lastly, I do wish Julie could have been the provider for my prenatal care. Postnatal she was better than O'Sullivan, who kept asking Julie for answers to my breast issues. I'll never go anywhere else. Julie is so great during the pap exam, has always made me feel comfortable during an uncomfortable moment. Sometimes the wait is really really long which makes it tough for work. Stick with early AM appts and the wait shouldn't be too long.", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 4, "date": "2012-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "FYn3RH6ylugme8Bspjn8BA", "review_id": "aPO-TSU5av8RO31wF-dN5w", "text": "This place will make u upset every time u come because the wait times are excruciatingly long and nobody here gives a crap about it. The front desk is defensive and rude from the start. I have come here multiple times and waited upwards of two hours. Not exaggerating, and not a soul in that office ever apologized. Drs to be fair are good but u will end up bald from pulling your hair out from frustration if u go here.", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 1, "date": "2014-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z0o2zeSLuYwcIVR2k4is6A", "review_id": "IEqD-Vj6F1WmdR6_ZpvcKA", "text": "The doctors and nurses here are very good( Swanson doc, Lisa nurse)but the all the staff are just so unprofessional and not here to help. Hope the staff get there stuff together.", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 2, "date": "2015-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MbogV99-KSj_Iy1tLNMZpA", "review_id": "_gYJev21nZ0PC5lm3PnoUA", "text": "Julie is a true professional in her field. She is a competent and knowledgable Botox injector, trained by Allergan. She is a great injector with no pain at all and I'm a big baby. Moreover, she is very personable and makes you feel like an old friend when you come to see her. I would highly recommend her if you are looking to try Botox.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 5, "date": "2012-08-25", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "wSWjkL0UIzTovYpH3apvAw", "review_id": "2CTCjCBZMFXD6M3cfxVRgA", "text": "Never had a bad experience at this office.  Everyone was courteous and professional.  The front desk doesn't seem too lively, but they probably take a fair ration of abuse from people (usually the way it goes) so I can understand.  Otherwise, professional and nice.\n\nAlso want to say Tracy Innes is awesome.  Thanks!", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 5, "date": "2014-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "oPzHdfCrduickFJeLViJUg", "review_id": "Dh1d8vQjSyxatnQsSeVtWg", "text": "I wish I could give less than one star. There is no communication between the staff, their attitudes are poor at best, their reception is sloppy and they are commonly overbooked, and they frequently change insurance policies without contacting their patients about having to find a new office. I have never been so disgruntled with an office experience in my life and I would highly recommend finding absolutely anywhere else to take your business.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 1, "date": "2014-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sf7RGVy6NwfncmlKYoM-GQ", "review_id": "qx8DfwbYFhw7Hdr76A9Hrw", "text": "The nurse practitioner, Stefanie Davis, cancelled on my first appointment about 30 minutes before I was supposed to arrive.  I rescheduled with her and patiently waited 4 more weeks.  When I arrived to my second appointment, I was 8 minutes late and she refused to see me, which I find a bit ridiculous.  That was twice that I had to rearrange my work schedule for this lady and still didn't get an appointment.  And of course, the receptionist is pretty smug.  I would NOT recommend this office.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 1, "date": "2015-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uXOr7GadqQbU5VZhEDxn3w", "review_id": "GDZYdMM0Ad8tdKRrZaKLcQ", "text": "I give the office 4 stars because I like Dr. DeSanto.  He answers my questions thoroughly.  He seems to be very calming.  The front desk can be unfriendly at times, but they do always get back to me when I call.   I do have to wait about 45 minutes each visit, but I hear this is not uncommon with prenatal visits in general.   The NPs are pretty good as well and knowledgeable.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 4, "date": "2015-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j41_GkgQolZ5LeBn9-0vtw", "review_id": "D4fAMGiIcwDhIQmBryBfFA", "text": "absolutely love this place.  I feel comfortable and listened to which is important when choosing birth control. \nI see Dawn and she is just wonderful.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 5, "date": "2015-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6m_udDRnUR6GI53FVF8fFw", "review_id": "bsHabJKjzOs49shnYk2m0g", "text": "I saw Dr Lykin and thought he was very professional. He'll take the extra time needed to answer any questions and he's very friendly. He took the time to checkup on me at the hospital the day after the surgery. The scar after my surgery was very small and other medical professionals have commented on how good it looks. The office does offer forms on their website that you can fill out prior to your visit which is great way to save time. The biggest surprise was the refund I received because I was overcharged for my surgery. The office probably could have kept the amount which was over $100 and I wouldn't have known. So I think their name is fitting.", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 5, "date": "2012-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "UXeOYq4pUlp28HNP-pSBvQ", "review_id": "B7dsCz6TZs0af_39Vc7NUQ", "text": "Entegrity...hmm...a play on words for Integrity?  I don't think so, not even close.  For this office, it's all about the almighty dollar. \n \nI have no issue with the mounds of paperwork I have to fill out each time I come in....but really, how many copies of my insurance card does your office need?  I don't even get upset when I have to sit for 20 minutes before and after I get taken back to see someone.  I'm a bit unnerved when the original issue I came in for is not addressed by the doctor and instead I am herded into other treatments.   I get a little frustrated when I have to jump through hoops to get a refill on my sublingual meds.  I get upset when I get charged a co-pay for a \"check in\" visit for the previously mentioned at-home self administered medication every 3 months.  I get angry when I am charged a $100 fee for rescheduling an appointment.  Had I been dishonest regarding my situation and kept the appointment instead of informing the office (who did not mention the fee during the reschedule), I would have only been charged my normal co-pay.   However, I get REALLY angry when I am condescended to by the staff.  I agree with the other reviewers regarding the staff being snippy, unaccommodating, argumentative and downright RUDE.   They will not listen to explanations, instead they will site \"notes\" that were written by their incompetent co-workers.  Entegrity, do you call all of your customers liars?\n\nBottom line....This office does not value its customers, only their wallets.  Take your business and hard earned cash somewhere else.  I know I will.", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 1, "date": "2013-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zF51JvI4lWvS0jcxWju1Bg", "review_id": "oz5haoHrtZYj83Ey5CV_xQ", "text": "Office staff sucks! The pdf online was not even fillable and the lady behind the desk tried to argue with me about it. They want you to come in every time just so that they can get paid by the insurance company and the rip-off copay of $40. to be in and out in 5 minutes. Also they had the nerve to invite a student doctor without asking me in advance. Stay away from this place.", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 1, "date": "2013-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5p9UTlABk_cJF2TGb95x6A", "review_id": "kGs6DixvNc3P8TyoTb8R4A", "text": "I had a surgery performed by a physician at Entegrity Ear, Nose, and Throat about three years ago, and I am still in pain. In fact, the pain in my throat is far worse than the painful tonsillitis I suffered from prior to the surgery.  When I went back and told the doctor about my pain, he said pain happens to some patients and there is no telling how long it will last.  I can tell you, the pain radiates from my neck up to my ear and into my head bringing tears to my eyes, and this practice wants me to think this is normal!  I would be wary of ever, EVER, becoming a patient at this practice, if I were  looking for a good ENT go somewhere else. My physician was Jeffrey Dyer, and I think he is arrogant, incompetent, and unwilling to deal with the mess his unprofessional surgery creates. Find someone better!", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 1, "date": "2014-06-11", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "d5LQvGD1x00DvX_WBVgAeg", "review_id": "VgmqCAygjr4k1GkTH4aE1A", "text": "Well this has been my first visit to entrigrity and I wish I had more to review, but I'm still waiting to be seen! Like most doctors offices, they asked me to arrive 15 minutes early. I did. It is now 54 minutes past my appointment time and still waiting to be seen. Hopefully, the doctor can make up for this. Still waiting...", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 2, "date": "2014-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "FTwlBBkE0ADg-hNEznS1-g", "review_id": "LEXDiq8dpr30_qnBl3aDTA", "text": "Don't go here. I had a lot of issues with the front office lady. She was rude about my records that should have been transfered to the office. She pretty much did not want to deal with me. \n\nDr bailey was nice but really didn't want to listen to what i had to say and had his own opinions about my vertigo issue. After that visit i never went back.\n\nHe was highly recommended by my doctor but too much hassle and too far for me to drive.", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 2, "date": "2014-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RmiR-4M-OkQXuMdL1yyFGA", "review_id": "ghkwmWL8G27gQN4UAw2HCA", "text": "SO MANY MISTAKES!!!  Stay away from this place and it's doctors!  Don't risk your health and well being!", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 1, "date": "2014-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uXUEZbISNPdxqhfuRpMKuw", "review_id": "gc3S7JKmy2pVE8hZbyHyVw", "text": "This office is absolutely a 1 star!  I haven't even had a chance to see the top ENT doctor of the valley, because of his poor choice of office staff especially Jackie the office manager.  I called over a month ago to schedule an apt and was scheduled for Aug 3 @ 810.  Was extremely happy with the scheduler although they booked  me out over a month.  My ear began bothering me with extreme pain.  I called to see if they could get me in earlier.  I was placed on hold for 17 min with a a loud annoying tapping noise over the \"we will be right with you\"  sang to me.  I hung up and called back and asked for office manager.  I was transfered to Jackie who I asked why I was on hold for 17 min and was forced to listen to an annoying sound.  She ignored me and asked what I needed.  I told her I needed the answer to why patients are played around.  She hung up on me I called two more times as she knew it was me and she hung up.  I called amd acted different and got  a scheduler.  They told me my august apt wasn't even scheduled, and that I had been waiting for three weeks and another month to see a doc that didn't even expect me.  They said they would figure it out and call me back.  They didn't so 8 AM next morning,  I called back and asked for Jackie.  The operator sensed my irritation and started negativity back.  She placed me on hold to find the office manager in this small facility,  for 14 min.  I hung up and called back telling  her that it is unacceptable for the office manager to not be found in 20 min. Since I couldn't get a hold of the office manager I was going to come see why all this time I thought I had an apt, and why I was being played by Jackie.   I was told by the operator that she won't take the threats and hung up on me.  An hour later I got a call from Jackie telling me she had called the cops. These phone calls were all recorded and they will be reported to whatever board I can. NOT How you treat patients.", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 1, "date": "2015-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QYBAVVWoDgVopuUz2iIWyg", "review_id": "gFgAIah4ZI8CoRtHVi0F6g", "text": "Entergrety is a great place and the doctors there are always incredible. They are very hands on and they are always in contact with the patient to make sure that they are always understanding. The office staff has also gotten much better. Trisha, the receptionist is very excellent and very capable of making sure you're all set before you come in, and before you leave. Very knowledgable and extremely friendly. They whole staff at ENT is very inviting and caring of patients needs. The only medical office I'd ever go to for ear, nose, and throat care.", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 5, "date": "2015-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cc2eTX0wPFUiz5l_UEFCTg", "review_id": "R0H53HbVyCc1uLP-R-4Vdg", "text": "NO - NO - NO  Dr.. Chad Campbell moved to Mesa from PV Family Medicine.  My family loved him.  He was just a rare medical man - so caring.   I assume he is that far away because of a non-compete clause.  Good thing because I would have followed him if it was closer.  NOW what do I do????????\n\nLucky Mesa people to have him.", "business_id": "0-KOpYSe9aQTAfM38f47HQ", "stars": 3, "date": "2014-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oBPFww8jYkof_bJpOu_6eQ", "review_id": "qbaHo5sTGJ5ikCeKv3qlLw", "text": "My wife and I have been going to Dr. Paul Coulombe for 15-20 years now (it's hard to remember). Everyone to whom we've recommended him loves his thoroughness and bedside manner and has stayed with him for five to ten years now. When our children were born (four of them), he \"visited\" them in the hospital even though he didn't have rights and he's been their doctor ever since--they're pre-teens now. Point is, he's a wonderful doctor and we trust him entirely with our medical care.\n\nHis recommendations for specialists have been impeccable, his advice on all facets of our health is wise and up-to-date, and his services never seem money-driven.", "business_id": "0-KOpYSe9aQTAfM38f47HQ", "stars": 5, "date": "2015-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NRzUGfFH5yXzs31zF5RK2Q", "review_id": "OyerKsa15RwAIZDAQCQI_A", "text": "This place was great. They were a little behind when I got there at 9am, so it took longer than I expected. But thats how these things go usually. I had to get an MRI of my shoulder with contrast because I likely have a torn rotator cuff. The radiologist who injected my shoulder was nice, not overly talkative, but he was nice. They had a difficult time getting the dye in the right place because my joints are very small. However, they explained everything they were doing in full and made me feel very comfortable. Then, I went and had the actual MRI done. The guy running the MRI machine was AWESOME and super nice. He made sure I was comfortable and would be able to lay in that position flatly. He also stated that since the shoulder joint is close to the lungs, I had to breathe normally and not take deep breaths. I had gotten an MRI in Manhattan in July, which I was unable to complete because I was screaming in pain from the way they had me positioned. These guys were awesome and took good care of all their patients. I would definitely recommend them.", "business_id": "5HVmR0I_MUcpwKcne8zfBA", "stars": 5, "date": "2015-08-17", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "PS0lCxjGNeUrKxYSdpW-Aw", "review_id": "Z6hfNeGIVeE_ku90TXDYuw", "text": "Great no maintenance skin is unfortunately just not it my genes. I have to work at keeping my complexion oh so lovely, and the dermatologists at this office have been helping me do just that for about five years. \n\nI love dermatologists. In fact I don't understand why most people don't go see them. I only go see my current doctor about every three months, but every time I do we talk about exactly how my skin is doing. Once we do that she might recommend skin tips for that season of the year or new products that have come out. Dermatologists also have a butt load of samples that they really do want to get rid of. Last time I was seeing my dermatologist Katie I had mentioned to her horror that I was going on a weekend camping trip. She of course was sickened by the fact that there are no showers in the woods, but she loaded me up travel size samples perfect for camping so fast! Whether we talk about healthy ways to be in the sun or how many times your should really exfoliate your skin I aways feel better asking a doctor my weird skin questions. \n\nNext time you have any kind of skin or complexion problem, invest your money in seeing a doctor! Your a lot more likely to solve the problem the right way and quicker.", "business_id": "6r8KHqgmlM3PWVZ7suyQ6w", "stars": 4, "date": "2007-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "bcvhLHYRdcjo0MHmQnM7ZQ", "review_id": "DXLn-dTg168QhI4JYJE0zw", "text": "I have been going to this dermatologist's office for years. However, as long as I've gone there, I haven't ever been completely happy with the experience. It just seemed easier not to deal with the hassle of dealing with switching, until today. \n\nI called and asked the woman at the front desk if there were any available appointments in the next couple days. She made the hugest sigh I have ever heard and said, \"Well, uh, um, we don't even have any physicians in the office until I don't know when.\" She said this is a really rude manner like I was bothering her. Then I asked, \"Well, I normally just see one of the physician's assitants, can I get in with them?\"  She says , \"(scoffs again) No. No one is in the office. What is it exactly that you need?\"  I said, \"I just need an appointment! I need a prescription refilled and somone to look at my skin!\" She then RUDELY told me that nothing was available until the end of August. I just said thanks anyway and she hung up. She really made me feel like I was out of line for asking for an appointment at all!\n\nThis is only one of my rude encounters with the ladys at the front desk at this place. One time I got yelled at for quietly talking on my phone in the waiting room. Also, I got two moles removed here by physician's assitants, only to later find out later by the doctor that it should never have been allowed. PS~ The moles ended up taking WAY longer than normal to heal, and have awful scars that are way worse than the moles were themselves. \n\nDON'T GO HERE!", "business_id": "6r8KHqgmlM3PWVZ7suyQ6w", "stars": 1, "date": "2009-06-15", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "hQLrMAZwxKlg6ovFg5ToCg", "review_id": "oy2urg-JM5t8RbVD7GK1OQ", "text": "I saw Courtney this afternoon for botox.  I've been getting botox on a regular basis for about 10 years & have never had an experience like this.  The ENTIRE appointment lasted about 6 minutes!  With the proper consultation, botox appointments typically last about 30 minutes.  \n1.) She did not discuss ANYTHING with me (other than to not exercise for 4 hours after the treatment)\n2.) She did not have me make facial expressions to determine where to put the product (EVERY Dr./nurse makes you do this, EVERY time)\n3.) She did not ask me one single question about what my concerns were\nShe basically came in, plunged the botox into my face, and said \"ok, you're all set\".  I was shocked and literally speechless & will never step foot into this establishment again.", "business_id": "6r8KHqgmlM3PWVZ7suyQ6w", "stars": 1, "date": "2011-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "N07kJoo2gkEaDVubNYcTHw", "review_id": "6qV-sAi22Laot5J-rPAxfw", "text": "I have been coming here for awhile. The only reason why I go to this doctor is because of Becky . She is awesome !! The rest of the business works like this.. receptionist are rude !! They forget to do stuff like fax paperwork to insurance companies. They lost papers out of my file !! The doctor rushes you out so they can make more money. They don't really care about how you're feeling. They don't figure out what's wrong the first time so you can come back the second time to spend more money !! Very unorganized!", "business_id": "Dqr1eP7wpo0BnWdMp4ViNg", "stars": 2, "date": "2013-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "q8TkzHEPpjYeoF1KPq2GLg", "review_id": "4DL066nViDt3UVIcMFpwdw", "text": "Terrible \"doctor\" and a terrible staff to go along with him. The height of arrogance and mis-management of patients is the bottom line when dealing with this most unfortunate place. They fumble just about every single step of the way. Do yourself and your precious health a favor and look elsewhere. Long wait times, RUDE staff, and privacy issues are just the beginning with this place. On my second and final visit to this place the women on the far right window spoke very loudly to a woman who came to the window to ask about her blood results. She couldn't of spoken any louder when answering, \"you have Syphilis\". The poor woman turned around and noticed everyone was looking at her in the lobby and left crying.", "business_id": "Dqr1eP7wpo0BnWdMp4ViNg", "stars": 1, "date": "2014-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XVXPoNh_NYSGE7AJtIqIbg", "review_id": "PjZAxdQ0cj1i-B_At8oQog", "text": "I could go over all the ways that this doctors office is the worst office I've ever personally been too but I think I can sum it up pretty well. They have long waits, very rude receptionists, unfriendly nurse assistance, doctors that do not care about you after you leave the office and won't call you back with test results. I've had these problems on THREE occasions and I can say that there won't be a fourth.", "business_id": "Dqr1eP7wpo0BnWdMp4ViNg", "stars": 1, "date": "2015-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dvc2W9d23q5uj_7sUtTz4w", "review_id": "g2KheRQaOQMCUy6LITSE_A", "text": "Absolutely horrible!!!!! A family member and I were treated hostilely and unprofessionally for their mistakes and discrepancies!!!! His assistant Richard called screamed, talked down to my family member and I on many occasions for their mistakes!!!!! The worst experience we have ever had with a doctor and their staff!!!!", "business_id": "NfxNNSzUUSza3AJTMmUsrA", "stars": 1, "date": "2013-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-WDIKh0cXhKCiUPJ9Tudjg", "review_id": "gwRkvBu3pEVrYxFF9wdtvg", "text": "Four stars? Seriously!\n\nToday that is a yes. Actually I was expecting far worse. I have been going to Dr. Drury for more than 12 years, and almost every time I have been kept waiting, sometimes for more than 45 min. \n\nToday however was different. \nToday they get 4 stars. (It would be 5 but for my past experience.) \n\nThe waiting room, as always, was packed. But we moved quickly.\n\nI was there for an annual physical, but I also was able to talk them into doing my bloodwork at the same time. In house lab rocks!\n\nI hate needles but Jen (?) was great at calming me down, and getting it done.\n\nAnd Dr. Michael Drury was his normal quiet professional self. \n\nSo congrats today for being the medical profession we ask for.", "business_id": "9f5WxUG_Vc-PzBmX6SeTew", "stars": 4, "date": "2013-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "ynbYfudmDw3iwZpptU-KrQ", "review_id": "EjsZF92df8lCQmqRLAlL7w", "text": "My grandparents went here, my parents go here, and now I go here.  That should say something in and of itself.\n\nThe staff here that I've dealt with have always been pleasant.  Plus, he's got an in-house lab for all your blood draws and UA's and such.\n\nDr Drury himself is always pleasant.  He takes his time with patients, answering all your questions and never making you feel rushed.  Because he does this with all his patients, sometimes you have to sit in the waiting room a little longer.\n\nOverall, top notch.", "business_id": "Kpl6cUmrYMczTDY_2RnctA", "stars": 5, "date": "2012-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wqQ-50Sjf9ol3SYaPbA1YQ", "review_id": "H7XbU1GO6gpuZe2wJErZpg", "text": "I love this guy! He's old school and a very competent Dr.!", "business_id": "Kpl6cUmrYMczTDY_2RnctA", "stars": 5, "date": "2013-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vNywQ1wlpIlbgm7J5AEX1A", "review_id": "Ll4kyGRwZfT33wzDtWC4qQ", "text": "Why does this place have such bad reviews?\n\nI've been going here since I was kid. Sure it has it's problems--which I will get to in a second--but this has been my favorite doctor. I've tried numerous others, but have always found myself returning to this site. The main perks is that this is the only doctor that I have been to that will see you the same day. That's crucial when you're really sick, and for me I use it a lot with my children.\n\nYes, some of the complaints other Yelpers have posted have their merits. You do have to wait in line even with an appointment. And there is shameless marketing in some of the offices with the head doctor's--Dr. Celaya--son race gear stuff. But for me, they're all small little inconveniences (the shameless marketing I found just plain out funny).\n\nThese doctors were with me when I was fairly sick in 2007, and they were there for my mom when before she had to head into surgery. For all their small faults, they're there when it matters most.", "business_id": "C-eUCr7R-76YFPpdpMj_vw", "stars": 5, "date": "2015-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gZYqb80zY0Td004gDtblmQ", "review_id": "LVIPM-prDzbfBlliGXl_Ug", "text": "Worst place to receive medical care. Unprofessional individuals that lack of knowledge. I had to wait hour and half after my appt time because the Dr was at lunch according to the assistant. Air conditioning wasnt working in the patient room. Dr. didnt take the time to acknowledge our concerns instead prescribed antibiotic without further examination.", "business_id": "C-eUCr7R-76YFPpdpMj_vw", "stars": 1, "date": "2015-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Mb7_MY7qorb3B7TfaPAWAg", "review_id": "BWY03r56BWDsY78-hcLXmw", "text": "I waited for two hours to be seen by a doctor and it was only because I told them I was leaving and that the wait was completely unacceptable. Before the two hours they were stalling me by having a RA take my vitals, then an intern asked me a few unecessary questions. When I finally did see the doctor he rushed through some questions for about 5 minutes. There business model seems to overbook people and make them wait like cattle. They feel like they can get away with it because most of their patients are Mexicanos who speak English poorly or don't know how to complain. I cancelled my follow up appointment and switched doctors because I don't fee like being treated like a second class citizen. Son una desgracia.", "business_id": "C-eUCr7R-76YFPpdpMj_vw", "stars": 1, "date": "2015-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ylWCBeDw8MY4xNMYz0ajTA", "review_id": "w7cK9hityUV0xkH8SMUyNA", "text": "Avoid at all costs. If you go there for an eye exam they will robocall you every day a year later reminding you for an eye exam. Also, I was given a prescription that was way too strong. I had to throw my new expensive glasses away. I ended up going to Q Vision for LASIK. Couldn't be happier. Go here and expect a robocall every day at 5:05.", "business_id": "E82fr756dDwiuqsFqkeZbQ", "stars": 1, "date": "2013-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "k1coIN6KCohR0lc2LxWv0A", "review_id": "wUY9r_zXrUrpebXBWfs0CQ", "text": "Couldn't tell you a thing about the care quality...\n\nCalled and scheduled an appointment for our 6-year old.  Had a very specific conversation about how young patients can be.  Told that it would be fine as long as she knew her letters and shapes.  Great. No problem.\n\nShow up at the appointment and told they will not see her because they don't see patients under 7. \n\nSeriously?  I understand the challenges with pediatric patients, and thus most practices have specific policies.  Apparently they do, too, but they can't seem to communicate that to their customers (or even to their own front office staff).\n\nNice.  I hope they're great eye doctors because they're not so good at the basics of running a business.", "business_id": "E82fr756dDwiuqsFqkeZbQ", "stars": 1, "date": "2015-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LnfCuYCwwAJUsiDfl2dt2A", "review_id": "2v3SXzzFfsqiq-vA27ZEJA", "text": "The doctors seem quite good, but the gatekeeping system is such that you can plan on waiting a half hour to speak with someone on the phone, and then you'll come for the appointment and wait until you're called, then see a tech and wait  (AND WAIT, AND WAIT) until you're called, and finally see the doctor. Figure at least 45 minutes from the scheduled time of your appt to the time you actually see the doctor. They have no respect for the patient's time.", "business_id": "E82fr756dDwiuqsFqkeZbQ", "stars": 2, "date": "2015-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q6n5dIDt7niea9gsiJlFCA", "review_id": "PTEfnLFPxN-g7tDNvtkvYg", "text": "I wasn't able to see the doctor due to the fact that he wouldn't even let me set an appointment with him even though he was my assigned doctor through my insurance. His staff was extremely rude and insisted that because i was in my second trimester that they could not set an appointment for me because Dr. Holemon does not deliver. I am extremely upset with the way they treated me and handled my case. I would not recommend him due to the fact that they were so off-putting towards my situation without even considering my situation. WORST EXPERIENCE IN ANY OF MY EXPERIENCE WITH MY ASSIGNED DOCTOR.", "business_id": "8f2fPQG6iykHJ4EKVnV8wQ", "stars": 1, "date": "2015-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p8mXatpKVeCcXL8AKgA63A", "review_id": "tSJZ16zaHONeNDHyyYqCXg", "text": "I have been seeing Dr. Holemon for 20 years. He is an absolutely superb doctor. He delivered both my boys and was kind, gentle, understanding, and supportive. Both my sisters chose him because of my excellent experience and they were happy as well. Dr. Holemon has retired from baby delivery but still does Gyn and I would never leave him. If you get a chance to see Dr. Holmon I highly recommend him. His knowledge, experience, and professionalism can't be beat!", "business_id": "8f2fPQG6iykHJ4EKVnV8wQ", "stars": 5, "date": "2015-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "6ts41fCsDKHbFZaKOMNmVQ", "review_id": "V9ZKQ95fzieFVnfUbkQ8Hw", "text": "I have been going here for a good 10 years (followed them from their old location) \n\nThe girls up front are always so friendly and even though I only see them once a year they know my name and genuinely seem happy to see me. Rosey is so nice! \n\nThe nurses are nice enough from the interaction Ive had with them. \n\nI generally see Gretchen and she is AMAZING! She is like the cool aunt you love to go shopping with! She answers all questions thoroughly and really makes the whole experience as easy as possible. \n\nGreat office! I recommend them to anyone who asks!", "business_id": "9xpYUYI4wbNA4XufvVfKzQ", "stars": 5, "date": "2010-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hwB4sfkn9oKhFcoIOj66Vg", "review_id": "-H9Fbnn4LtGur8lXjKY4GA", "text": "I have been a patient of Cornerstone Women's Care since I moved to AZ in 1999. Dr. Lance Holeman is fantastic. The NPs are wonderful and caring, especially Gretchen. And when Dr. Holeman stopped taking new pregnancy patients, I absolutely loved Dr. Castro. She was actually pregnant the same time I was. She also filled in for my first baby's delivery because Dr.  Holeman was out of town. For anyone who complains about seeing an NP, please realize that they just as qualified to see you and the doctors oversee all patient documents to make sure things are going right. And the gal at the front desk is so pleasant to people who come in the door or call on the phone, even when it seems things are running behind (which does happen in a doctor's practice.)", "business_id": "9xpYUYI4wbNA4XufvVfKzQ", "stars": 5, "date": "2012-07-03", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "_QZYIlJHDWJnqIMtTGm2sQ", "review_id": "dbz-6pWKt95r9AxGtNMDlg", "text": "I was referred to Dr. Holemon by my previous doctor of 20+ years after finding out that he was retiring.  I was nervous about seeing a new doctor since my previous one is the only GYN doctor that I've ever been to, but after meeting Dr. Holemon, I was extremely comfortable and at ease.  He actually took the time to talk with me (which some doctors do not make a priortity) so that he can explain his background and to get to know me and my concerns.  He is extremely knowledgeable and gave me very important information that I need to know as a woman at my age (38).  I highly recommend Dr. Holemon for his experience as a doctor, his great bedside manner and his genuine care and concern for his patients!", "business_id": "9xpYUYI4wbNA4XufvVfKzQ", "stars": 5, "date": "2014-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "N6UMFLbwyCTTjXViWcgfCA", "review_id": "p8x3cUXVL46Eeaz-JtJ_NQ", "text": "Unfortunately this isn't a happy review like the others I write. I am a front office patient coordinator for a dental practice, I know what customer service is. This place is lacking, I will not be going back. I was initially referred by my mother, she had raved on and on about how great the doctors were with patient care. It was also 30 minutes closer then where I was previously going, so why not right? Last year my first visit went well. This year, it's been nothing but a disorganized mess. I had my annual women's exam scheduled for a month then the doctor was sick, I completely understood and let the lady know I will need a birth control refill since the appointment is being booked another month out. They said they can do that. A week goes by and still nothing at the pharmacy... So I called the office again and spoke with another woman and let her know what was going on. She said \"no we don't do that. You have to have your pharmacy send a fax request\". Again I explained to her I was told that it would be done and she said \"well that's not what we do\". After I finally went to my annual exam, I needed further testing for an abnormal pap. I got this scheduled, they called 2 days prior to confirm. When I went in there they collected the payment and I asked if your monthly cycle is okay while doing this procedure. The ladies said they didn't know and they will find out. Come to find out it impacts the results so again needing to reschedule. Why wouldn't they mention this when confirming or initially scheduling? They wasted my time. And if I didn't say anything I'd have to pay again due to false reads. That's absurd. I called them before the rescheduled appointment with my new insurance information, cool they accepted it. The day I go in, they don't have my current info. I don't have an ID card and I offered to email it with the lady telling me no. Then after the next results I had to go in for another procedure where they need to get a preauthorization or benefits. Again they don't have my updated insurance? After playing phone tag for 2 weeks, I got them the information and the procedure scheduled. When the day finally came for my 4:00pm appointment I got there at 3:55. I get told my appointment was at 3:40 and they won't see me because they filled the time with another patient. I let them know I had this scheduled for the time that was arranged and that I didn't even get a confirmation call. The office manager didn't do anything to fix the situation and the doctor said she wouldn't see me even though it was their error. The best thing they have done for me was give me a records release form. Let's see if they can get that right.", "business_id": "9xpYUYI4wbNA4XufvVfKzQ", "stars": 1, "date": "2015-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vTqIQXtnJvC_iHY07gAULA", "review_id": "sV6YRYWzaPVRr57juyQBDA", "text": "I have had the same gyn for since 2007. Since then I have only seen her 3 times. Everytime I go there the doctor is \"at the hospital\" or \"on the phone\".  I end up sitting for almost an hour everytime and get stuck seeing the nurse practitioner.!!\n!", "business_id": "9xpYUYI4wbNA4XufvVfKzQ", "stars": 1, "date": "2015-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "C0zRBVYFqJaVt-CmWukQXg", "review_id": "hfR1xpOs6JCfHr65oCAGtA", "text": "I found this practice when I got pregnant and needed an OB since I had moved a few months prior and my OB was far. Based on reviews I chose Dr. Pelopida and I do not regret my choice. My first appointment was with the nurse practitioner and even though she answered my questions and was very nice I felt rushed through the process. But starting at my second appointment until the end I was always scheduled with Dr. Pelopida. She did not make me feel rushed, she answered every questions, she even asked questions to me and my husband about how we are feeling, what is our profession and gave us good tips and recommendations on how to deal with the pregnancy hormones. I love her and I was so happy she was present at my birth. I did end up having an episiotomy which my husband felt it was almost forced on me but after pushing for half an hour and baby's heart beat dropping I said do whatever you need to do for the safety of my baby.\n\nNow to review the office, they were good at calling to remind me of appointments or re-scheduling. They were very timely in returning calls, even after hours, and for the most part they were friendly. My issue is with waiting, they said the appointment is at 10 am but sometimes I was waiting for an hour before I saw the doctor, and when I had to do my glucose test I told the receptionist at what time I took the juice and a little over an hour went by and I had to remind the nurse what I was there for because they forgot to tell the lab tech.\n\nI'm a fan because of the doctor and if she changed centers I would probably follow her. There could be areas of improvement for the center but because of how close they are to my house and hospital, the doctor, nurse, and the communication I stay.", "business_id": "9xpYUYI4wbNA4XufvVfKzQ", "stars": 4, "date": "2015-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "d7G5UmaTLSz6usEB00VpFg", "review_id": "Dhe9WSKQJHoZ9OlYN2FuIA", "text": "Couldn't even get past the extremely rude scheduling lady. My Nurse Practitioner  recommended Sylvia Castro after an urgent issue with my sonogram. I was told, that I could be seen for a month. When I told the lady it was rather urgent, she huffed on the phone and told me some other doctors were available in a couple weeks. I said jokingly \"Great. Good thing I'm, not dying.\" She huffed again. I then said \"Fine\" as in \"Fine\" schedule me, and she hung up on me. I started to call back and I asked myself \"why\"? Called my my doctors office and they recommended me to another fantastic doctor with a lovely receptionist that got me in stat. The doctor might be great if you could get past the rude staff.", "business_id": "9xpYUYI4wbNA4XufvVfKzQ", "stars": 1, "date": "2015-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F63wYiKgAoeoJZfDEVV7Cg", "review_id": "PgKQnutnZ7Mce8J_dQ7TFg", "text": "The front desk staff were very nice. The experience after I was taken back was not very good. I waited a very long time for the doctor. Once he came in, everything was very rushed. The whole exam was done in less than 1 minute. Also 3 other people came into the room during the exam which was uncomfortable. I did not feel like I got proper care and pushed out of the office. I will never return to this office.", "business_id": "Dh6c-WdiGeTHdJQWknJrQA", "stars": 1, "date": "2015-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wIslECDFU_lu9qOLqEn6Ww", "review_id": "PzfKb63-vg2_d-VVQFiArw", "text": "I arrived 15 minutes before my appointment time to fill out paperwork. The front desk was friendly and the only reason for the two stars. I waited over 30 minutes past my appointment time to be taken back to another room where I waited for an additional 30 minutes while the staff talked about me like I wasn't in the room. It seemed like they were training someone new but it was still awkward to be sitting less than two feet away from employees while they ask \"how do you spell her name?\" \"Are you sure she's not on any medication?\"\n\nWhen the doctor finally came in the room an hour past the appointment time he rushed through a two minute conversation where he made assumptions and was missing pertinent information about my medical history. He then hastily through a bunch of prescriptions my way and told me it was great to see me again even though this was my first visit. I was then scheduled a follow up visit although I, nor the front desk knew why. It could have just been an off day but I can't say I was impressed. I don't plan on returning.", "business_id": "Dh6c-WdiGeTHdJQWknJrQA", "stars": 2, "date": "2015-07-08", "type": "review"}
