{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E5O8wsWiGLqoOVBmG84wcw", "review_id": "boU6hZwK-As9Zf7YHVq4GA", "text": "I love everything about this place. The food is delicious (yes yes, the fish sandwiches, OK, I agree -- but DID YOU TRY THE MEATBALLS?? holy tamoley), I adore the staff, and I love that there are no windows -- it's its own little hermetically sealed 1950s world of delicious, real food and good people. Lots of places try to create this kind of ambiance, but it can't be manufactured. It takes decades of good food and good vibes.\n\nAlso, the food is really good. :)", "business_id": "mVHrayjG3uZ_RLHkLj-AMg", "stars": 5, "date": "2015-07-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PSbFVAJMrG0fvTv-Q9GI6w", "review_id": "vzZPpSvu8N0Yd6UP6bewPg", "text": "The chili dogs rock!  The portions are huge so come hungry.  Big selection of appetizers that go beyond the standard bar food list.  Great selection of draft beer.  Noise level is good for lunch but may be loud for dinner.", "business_id": "1qCuOcks5HRv67OHovAVpg", "stars": 3, "date": "2015-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VRB9nzZnYWB6WETk_QfIEQ", "review_id": "F2-NgUkU3FkBEIpOGyyRFg", "text": "I have been to Dave and Busters multiple times and i feel its a 2 star place.\n\nI can say the food quality is sub par.  In my opinion the food prices are expensive for what it is and quality.  They do offer a nice bar,but then again the prices in my opinion are a little higher.  Service isn't too bad, but could be better.\n\nD&B is a great place for adults for sure, but the prices for tokes or \"game play\" is a little ridiculous.  Some games charge 6.9 credits to place.  Thats almost saying $1.50 a game and some of those games are addicting where I know most of us keep playing.  \n\nI also thing D&B isn't the cleanest place either.  The bathrooms near the arcade are always nasty in my opinion.  Doesn't seem like they keep up with it.  To me, thats a big factor in rating restaurants.   \n\nAll in all, D&B is an ok place to visit, but not a place i would frequently waste my money.", "business_id": "sbW8qHJgzEIH42B0S-3New", "stars": 2, "date": "2015-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lAqoz5QTFxp3GDfpq0McRQ", "review_id": "Y3BpyRI-qZ29bMnbAkbBVQ", "text": "Came here for happy hour and a bite to eat on a Friday evening.  They have some great happy hour deals - $3 drafts (with a nice selection) and half off flat bread pizza. I believe there are three or four different types of the flat bread to choose from.  \n\nMy friend and I sat at the bar and I have to say the service was just ok.  We weren't given plates or silverware with our pizza, the servers didn't seem to know what the other was doing, and it was a bit haphazard.  I ordered a burger medium rare that came out so rare I could have milked the cow.  However, the tatertots served with it were delicious.\n\nLocated at the Waterfront across from the movie theater Bar Louie offers both indoor and outdoor seating and is a decent option if you don't want to wait around at the other restaurants (Burgatory is directly across from it!).  \n\nThis will not be a go to destination for me but it is a decent happy hour choice.", "business_id": "EoAY1JSVeJriBzId8lUQwQ", "stars": 3, "date": "2015-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bEyGMTOF8gcAwjNz_qXv-w", "review_id": "muLKm_5qUx768XZAH1NM_Q", "text": "Shadow lounge brings good music to East Liberty in Pittsburgh. For this, they deserve 3 stars alone.\n\nHowever, the one time I was there for a Reggae concert, it was incredibly crowded, but even worse, it was impossible to get a drink at the bar. There were two bartenders trying to serve 300 people. In sum, come for the music only.", "business_id": "ZDKi3qsO8lSSogrIdbLJKg", "stars": 3, "date": "2010-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kRa-sZPizt2EqWYVFZ6DGw", "review_id": "qkjNnLYw8zaL3pIgQCfo2w", "text": "We arrived late in the evening and had to ask our waiter about the \"pasta festival,\" which he mentioned.  It turned out that both pastas, the salad, the calamari, the cocktails, and the service were good.  \nCasbah would have been livelier earlier and more pleasant without a loud and persistent talker in the party of 6 at the next table.  \nI'd definitely return for the food and service.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 4, "date": "2012-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p6xdm1i8V5P5JiI0BzWXkw", "review_id": "8TYButxnx_Sj3vBk5JxmIQ", "text": "Started with the Cheese Plate then the Octopus then the Duck, finishing with the Chocolate S'More Cake. Great experience especially the service. Robert was spot on! I'll be dreaming about this in the future.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 5, "date": "2014-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bmy45XLtOomcc_EvC-lXRQ", "review_id": "d2_oDfU87uR37Cwai0plTA", "text": "Casbah is great! They always over deliver; whether it be the service, the food presentation or the quality, freshness and uniqueness of each dish starting with the appetizer all the way to dessert they never disappoint. Their menu is constantly changing so you never know what you'll get each time you go. \nI also love the atmosphere & eating outside on their patio. \nCasbah is a must try (and ask to eat on the patio)!", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 4, "date": "2015-06-28", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "6deaMWBaD4P3QjghDoWxrg", "review_id": "NWsVr0VpDEUg-SbA0UyUPg", "text": "Crap!  I can't believe that I missed a \"First to Review\" by just a matter of weeks.  Max's Allegheny Tavern has been a shining star and a \"must\" for my Pittsburgh rotation of places to visit.  Years ago, when I worked on the Northside for Heinz, I spent many a rowdy Friday night here in the basement with factory workers.  \n\nWhat's there to say?  It's a Northside institution and always has a mixed crowd that is super cool and friendly.  The bartenders are friendly and manage to remember my name and drink choice even though I'm here only a few times a year.  My Friday nights here must have made quite an impression!  I love the decor here, dark wood paneling with lots of stained glass, and the downstairs bar is where the naughty people hang.  Jukebox and room for dancing.  The food is very homey and very reasonably priced.  The German nachos are always worth ordering, and they are smothered with Gouda cheese.  The spatzle is also a creamy indulgent treat.  And for those seeking the real Deutsch culinary experience, they have a large variety of sausages and schnitzels.  So it's a sausage factory in more ways than one.", "business_id": "IxQ1ATP_Wg_QujO9nywzcQ", "stars": 5, "date": "2008-06-10", "type": "review"}
{"votes": {"funny": 3, "useful": 6, "cool": 4}, "user_id": "bhZ13wN_5lQrKX278AP_aw", "review_id": "IVLvOyds9KrxGIuAY2tcsg", "text": "I have been coming to Max Allegheny Tavern since I was still in my mother's womb.  But seriously.  This place has been an institution for my family, and I really love it here.  I feel like this is some of the only German food in Pittsburgh, and I think it represents fairly well.  My thoughts:\n\nBrunch Buffet- I love the Sunday brunch buffet more than life.  Omelette station, German and American breakfast and lunch foods, and lots and lots of beautiful, delicious, and decadent desserts.  It's heaven on Earth.  There is usually a decent selection of meats, and the potato pancakes are almost always featured.  They've changed it a bit over the years, but I still love this buffet.\n\nAppetizers- My family loves the soft pretzels.  They are so yummy and buttery, but a bit heavy if you are going to eat your entire meal.  So make sure to share.\n\nMeals-  I, personally, have never had a bad meal here.  The sauasages of all varieties have been great.  The weinerschnitzel also great.  Sandwiches all good as well.  I really like the cheesy spaetzle dish that is just like macaroni and cheese but with spaetzle noodles!  I don't get too crazy and order anything complicated, though.\n\nSides-  I love love love their sides.  I could live on the spaetzle and potato pancakes.  Don't pass the sides up!\n\nDessert:  Also love their desserts.  There is a chocolate chocolate cake that they heat up with homemade whipped cream that is TO DIE FOR.  Not so shockingly, the apple strudel is wonderful as well.\n\nBesides the food, the servers are always very friendly and efficient.  There is also ample street parking, which is really nice.  Definitley check this place out if you have not yet.", "business_id": "IxQ1ATP_Wg_QujO9nywzcQ", "stars": 4, "date": "2014-06-03", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "CHw1HVGJE0fDY_-5keDKGw", "review_id": "sssCE-e5lPObc9aqe5bjow", "text": "So apparently I have this habit, at least last week, of visiting a bar/restaurant during its most dead time. In this case, it was somewhat understandable for Clark Bar & Grill because it was a very uneventful sports week. Regardless, I wanted to check out this place, housed in the old manufacturing warehouse of the historic Clark Bar Candy Co. (RIP) just north of PNC Park.\n\nI wasn't overly impressed with either the menu or beer selections. In fact, there were only five beers on tap and one had just kicked. I ordered the special, a Reuben sandwich with tater tots, which were both decent. I washed it down with a Penn Pilsner (local brew) and then left to go check out another place on the North Side.\n\nThis may be a good spot to hit up before/after a Pirates or Steelers game because of its proximity to both stadiums, but I'm not sure I'd venture back otherwise.", "business_id": "k1A8pNspBPinGDivxkuDSA", "stars": 3, "date": "2012-07-16", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "SOl-_nATymJq6r0-NL7LgQ", "review_id": "wJVSCtZX1O5qrcFD20GTmg", "text": "Chose Bado's on a whim. Worst waitress ever. Couldn't remember anything. Husband ordered penne chicken vodka sauce. It was runny and bland. I ordered the veggie burger, which was nice and spicy, and came with delicious fries. The only redeeming part of our experience. A fly kept hovering over us, while children screamed in the background. Would not go back.", "business_id": "qemCNgjeYGcFsRwxW9x4xw", "stars": 2, "date": "2015-07-16", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "q7MrNVt1FE23rwtWmPYWHg", "review_id": "Kf35clHCp-tv8AGYA7AuwQ", "text": "The mac n cheese dog I had was just ok, but the Mason Dixon with its slaw and chili was killer. The fries and barbeque wings were just as good. I also liked the atmosphere, the mural, and the employees who were really nice and honest and helpful. It's in a cool neighborhood too. Go!", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 4, "date": "2012-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "24x4k1OPL3_WX-i4F-y4tg", "review_id": "m9ZCYvF6STyHEPRDvxbYqg", "text": "The most amazing food ever! Had the blue cheese burger and sweet potato fries and it was best I ever had!! Even the ranch was out of this world ! Service was amazing! Courteous and so friendly !!! Definitely coming back!", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 5, "date": "2014-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KNTs8PxhVKfRgdLFHAFuVg", "review_id": "47L8TXWl9BPQfKXJC7PO_A", "text": "Growing up in Swissvale, we got a battleship for every football game, birthday party, and so on.. now in my late 20's my mom and I still have a ritual of going out to shop and then to each grab a battleship for dinner at our separate homes at least once a month. In over 20 years I can not think of a single bad experience with the place, other than the long wait which I will forgive because it's totally worth it.", "business_id": "DzOPHyrG2XuVqKEvHCnN7w", "stars": 5, "date": "2014-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fI3a9HoBB7TWIZ5zVGIjng", "review_id": "3rdzmUFqXbxkcn3Dz21VaA", "text": "Good drinks with some run of the mill tapas. Nothing was innovative which I don't mind since it wasn't to expensive. My food taste a little burnt which is what cost it the fourth star. Overall it's worth trying and you may like it better than I did.", "business_id": "sbTF0cLKZH6_BP8BLARVDg", "stars": 3, "date": "2010-07-22", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "jcLNhGlrdkn-7-VjDQC3og", "review_id": "kK1CypUGAX-RbfP2FSujIw", "text": "In town on business and I always try to find places like this.  Wow, a martini bar not named the Blue Martini?  OK, I'm in!\n\nSo I strolled over and walked in.  First impression was it was a cool, cozy, and trendy joint.  Liked the exposed brick walls, lighting, etc.  Only problem is, I don't go to a restaurant or a bar to eat and drink the atmosphere!\n\nSo I grab a table in the bar.  It was about 5pm and there might have been 15 people in the whole place.  Two bartenders made eye contact with me so I figured they would be waiting on me.  I figured wrong.  I sat there for a good ten minutes and was getting ready to get up and leave when the younger tender came over and said with a \"deer in the headlights look\", do you want a drink or something????  Well hell, what was your first guess?  I refrained from quoting Foxworthy and saying \"here's your sign\"!\n\nSo OK we were off to a bumpy start.  I didn't have a martini, however there was a few options on the drink menu.  I was just here for a bite, so my review is based on that.\n\nA few minutes later the other bartender comes back with my water and gives me a menu.  I ordered some turkey wrap with a fruit salad for a side.  I say \"some\" turkey wrap because it was really that unimpressive!  \n\nIt seemed to take forever for it to arrive.  Given the fact that it wasn't busy, it did take a long time to arrive.  When it did, it looked OK.  The fruit salad looked as if it was ready for the trash, so I bypassed that.  The wrap just had zero flavor and was loaded with lettuce........way to much.  The only flavor that presented itself was blandness!  It was very disappointing.\n\nAll in all, I think this is probably a way better bar to have a drink in then a restaurant.  I will return to try a martini, but I will pass on the food.", "business_id": "OxIeMVcop5oxBUWANi-1Rw", "stars": 2, "date": "2012-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6xQnzz_TS0skNM1GIK8j8w", "review_id": "TgMQRUK4yM1Q3oItgHJqzQ", "text": "I not only expect to not like Olive or Twist, I also don't really *want* to like it. My one and only issue is that its kind of expensive. Martinis are all about $10, the entrees are all around $30, and unless you're going for happy hour, all appetizers are at least $10. I always start to wonder if it's really worth the cost, but honestly, I think it is.\n\nEvery time I've gone I've shared crab cakes. Before you judge the $27 price tag, just realize that they have the type of crab cakes that are actually made with real crab. These aren't $15 crab cakes that are half bread/filling, they are proper (and very large) crab cakes. This last visit we also split nachos and lobster mac n cheese. I've heard the buffalo chicken dip is good and every dessert I've tried has been great.\n\nIt's also a martini bar so you'd expect them to be great at them, and they are. Last visit I had the chocolate covered pretzel, but other memorable martinis include the birthday cake and strawberry short cake (please don't judge- these were actually enjoyed on my birthday.) And at although these drinks aren't always my favorite type of alcoholic beverage, they are soooo good. \n\nThe place is dark (in a good way) and has impeccable service. Or at least the server I've had both times, Jeff (per our receipt) is great at his job. He's exactly the kind of sever I would always want to have: nice, polite, and overall just generally good at his job with the timing of bringing food and checking on the table. \n\nI'd definitely visit Olive or Twist more regularly if they dropped their prices like 25%, but you get what you pay for and I'm willing to occasionally shell out the extra dough for a good meal with awesome service.", "business_id": "OxIeMVcop5oxBUWANi-1Rw", "stars": 4, "date": "2015-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "BMZMhev8QNd1WXDgawNpxQ", "review_id": "-OPD5xHbfJILwNJkmJFxJg", "text": "If you can find the place... Avoid it.\n\nIt's a tiny hole in the wall of a bar; which is acceptable, considering I live in Chicago and tight bars are our specialty.  I went with friends to see our friend Lola perform in her drag show of the evening.  It was fun enough as money and props flew around the bar's open floor 'stage' area.\n\nHad it not been for the somewhat under attentive bartenders and the overwhelming amount of cigarette smoke I would have had myself a fantastic time.\n\nNot being a smoker and living in a city where smoking is prohibited in bar and within 15 feet of a public building; I must say... It made me appreciate the Chicago law even more so.  If I were management; I'd figure out how to give your smokers appropriate areas to enjoy their death sticks, away from those of us who'd rather not die as a result of their desire to do so.\n\nIf you're looking for a good night out, somewhere you can let loose and enjoy yourself... You may want to venture somewhere else.", "business_id": "CoeLG9kcKiJQL3TfuAjQUg", "stars": 2, "date": "2013-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "KlnymTd5Odne3dSF7PRKJg", "review_id": "9fVMs1mFMErbI8XzotJ6eQ", "text": "This was really disappointing. I went out with three others on a Friday night to grab some dinner. Unfortunately, we were all pretty underwhelmed with most of the dinner. \nI'll open with the highlights. The potato balls were yummy. Crispy on the outside, creamy and cheesy on the inside. There were easily the highlight of the meal. Also our desserts  were good. We had a chocolate cake, tiramisu and the lemon berry mascarpone cake. The desserts were all flavorful, sweet and yummy.\nThe entrees, however, left much to be desired. The table order a penne Alfredo, penne malfalda, and the putenesca. I ordered the amanda pasta, which was a special. It was sauteed broccoli, zuchinni and sundried tomatoes in their aglio olio sauce.\nEverything tasted like nothing. I'm positive the pasta water wasn't salted. Even the putanesca, which didn't include any tomatoes, had no seasoning, which seems like an impossible feat considering its historically a salty dish. Everything was just bland and disappointing. It literally tasted like the place has given up.\nI likely won't go back, except maybe for some dessert, but even then, it won't be any time soon.", "business_id": "-Nanlb7SYXObqQ6dZ49UOg", "stars": 2, "date": "2015-07-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "XbzKoqoB_V1mWmilax4q-Q", "review_id": "I9m1_fU4cDDDSZtKs_JzIQ", "text": "Go there only if you want served uncooked fish, odd tasting salad, or way too sweet tea (btw - no unsweetened).", "business_id": "7XXmky6YYjsvKFwho_eavg", "stars": 1, "date": "2011-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dWrEeTrFNAQOxC030N7WMA", "review_id": "AL4QvyvA4zCnX9nlyhQoTw", "text": "This is the bar that will not die, nor should it with it's awesome outdoor space.  These guys have one of the best patio areas in the Burgh, second of course to Mallorca's outside area. \n\nThe food is creatively named but otherwise not their dramatic strong suit.  Granted, everything I've had there is good (pierogies, chicken breasts named \"Nice Breasts\", Turkey Burgher), but not overly spectacular. \n\nThe beer menu, however, is inspired.  These guys stock more unique beers like Omegang Hennepin and Victory Ales that are not usually on most bar menus in town.  \n\nAnd you have to give this bar credit for using a flame-logo after having burnt down 3 times.", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 3, "date": "2008-07-20", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "hru2IDwSyN61sgWPtJw_hA", "review_id": "1dKMnyanmNpz_LH2oitO-Q", "text": "I eat at the Harris Grill at least once a week.  \n\nTheir beer list is huge, the food is good, and with the exception of one server the service is fantastic.  If you go, see if you can sit in Justin's section.  \n\nThe Harris is one of the few bars in Pittsburgh open late night if you're looking for food.  While most area kitchens close at 11, the Harris is open and serving until 1 am--full menu!\n\nTuesday is Bacon Night and if you go for happy hour get there early, or be prepared to wait.  Bacon and beer are fantastic together until you have that moment where you realized, \"I've just had 15 pieces of bacon.\"  Order another beer, you'll feel better about yourself.\n\nPeople rave about the frozen cosmos and they're ok but not really my thing.  Try the drink with the muddled cucumbers--it is fantastic.  \n\nThey also have a good Sunday brunch.  In the summer months its a buffet which I dont like as much as the regular, menu style brunch they have in colder months.  Bloody Mary's are half off after 2pm, so I often like to work out in the morning and then spend the afternoon having a \"Sunday Funday.\"\n\nThe food at the Harris is generally good, but they change their menu a lot and while that can be a good thing I've found it frustrating as several of my favorite menu items ie Shawshank Redemption and the Crawful of Falaffel are no longer offered.  The food is somewhat consistent, although sometimes it is over seasoned.  I ordered the meatloaf once and it had so much rosemary in it I found it almost inedible--although my boyfriend tried it and loved it.  The DelMonico A Go Go is so fatty I don't recommend it.  It's a good sandwich, but it owuld be better if they made it with different/better meat.  Several times I've gone to order a menu item and they're out of it.  The staff is usually pretty good about letting you know what's off the menu ahead of time but sometimes you want to ask.\n\nWhat the Harris does well they do fantastic.  The Lasagna, the burgers, the greek salad, the gazpacho, the fish tacos, the steak, the hummus-- all excellent.  Try the gazpacho, it's excellent!\n\nThe staff is fantastic.  I think the Harris has the best bartenders in town.  If you get to know them, they'll take fantastic care of you.  Even if htey don't know you, you can expect to get your drinks quickly, and your cocktails mixed correctly.\n\nThis place can get expensive.  If you're drinking craft beers be careful bc your bill can creep up on you quickly.  It is, in my opinion, priced right for what you are getting.\n\nThis is my favorite bar in Pittsburgh and I hope you check it out if you havne't yet.  Wait for the patio, it's worth it!", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 4, "date": "2012-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4DrkZqFqLcyRcLWuQUXFeQ", "review_id": "PmZXuPvaMbpSEdGLxgpbyA", "text": "Harris Grill is a restaurant in a house that looks like The Addams Family's home, but it doesn't mean you should be afraid to eat there.\n \nYou can either sit out front or hide away in the inside OR sit at the bar with giant TV's that usually have on something more interesting than the latest game, sometimes Discovery Channel or Animal Planet.\n\nThe food is a little pricey but the quality justifies the cost.  The mac and cheese is amazing and made fresh there.  The presentation and plating felt high end but the place is very casual.\n\nRumor is Tuesday night is all you can eat bacon night, I'll have to make it for that.  If you go or it's another day, let me know!\n\nTellem HITTofMCM sent ya!", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 4, "date": "2014-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4htH8kIpBee8XS8L7Y4E3A", "review_id": "DRqke5mViT-owW0nzcf7Wg", "text": "Came to William Penn Tavern after an incredibly long day of work and met friends to watch the women's World Cup on the back patio. It was raining pretty\nhard and the satellite feeds to the game and ninja warrior on the TV next to it were in and out at times.\n\nThe bartender was very nice, and although she didn't ask us about ordering food, we eventually discovered that it was $1.25 taco night because she was eating some at the bar while watching TV with us. The tacos were good for the price. Small flower tortillas, ground beef, lettuce, and tomato. Salsa and sour cream in the side. \n\nThe atmosphere was very relaxed and welcoming, and although on a busier night I'm sure John Taffer might have gone ballistic, there was not much to fuss about as it was basically just my small group of friends and a few others watching soccer on a rainy night. \n\nWhile I would certainly like to explore more of the menu and drinks offered in the main bar, I'd certainly give William Penn Tavern an A-OK thumbs up.", "business_id": "vSZDiKiF8vf9zt_BcDL7GQ", "stars": 3, "date": "2015-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "D1G8W0SgCbsKTv7cAqKcNg", "review_id": "Z93KLneztbzOIrd0UWxm9w", "text": "I've enjoyed Doc's Place for what it is - your average \"Bar\" - nothing spectacular but nothing excessively horrible.  They are very accomodating for throwing parties or events in their location so that's a huge plus.  I've had numerous events there and it's always turned out great.\n\nThe food is average and I don't pay much attention to the price of drinks b/c I'm usually with a large group and we take turns purchasing pitchers.  All in all this place is \"A-OK\".  As most people mentioned the deck is fun and its a great place for groups.", "business_id": "Oq5MyNxNi-xuXdPOWR9O_g", "stars": 3, "date": "2010-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q7MrNVt1FE23rwtWmPYWHg", "review_id": "xuNGK8DV0OfkUNbkjNxQ4A", "text": "Loved our server Jaime!\n\nLoved their Brew Pub Pretzels!\n\nLove their Take Two Seasonal Menu, the Green Goddess Wedge Salad, and the  Lemon Shrimp Fettucine!\n\nRocky Bleier was there! Yay!", "business_id": "PFAOxw4Gl8gm7PGWvohCWg", "stars": 5, "date": "2013-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kJVOCQwdmjYcioGJCCW3Iw", "review_id": "MYTu1POC0eRLL7YmHDFfxA", "text": "From the time we walked in to the time we left the staff was extremely friendly. The new \"small plates\" are a great addition to an already great menu selection. Try the crispy asparagus!!! Only 2.99 to add to an entree. My wife had the steak Gorgonzola and it was cooked a perfect medium. All in all I felt like it could not have been a better dinner date night!", "business_id": "4WsTFTH8GgnyFHwrH9nHzA", "stars": 5, "date": "2014-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "NzWLMPvbEval0OVg_YDn4g", "review_id": "WXyIF61D8G2bb-cc366Xzw", "text": "My first impression was what a cute neighborhood! The historic and charming homes are such a treat in a city where everything seems brand new. \n\nUpon entering this pub-like restaurant/bar we were seated and greeted promptly. \n\nI ordered a cider on tap (a favorite of mine), a side salad, and the \"What it is\" . The star oddly enough was the salad, she said all their dressings were homemade and it certainly tasted that way.  The \"What it is\" was just ok in my opinion. I have had my share of amazing pasta dishes but never have been much of a rotini fan. The dish has a lot of dried herbs and I just prefer fresh...the chicken seemed almost too rubbed in cajun spice for my taste. That being said, I would like to give it another shot and order something else besides pasta ..I really am a tough critic in the Italian department. \n\nMy biggest gripe of the night was the pace of service. I don't know if the server (or chef) had somewhere to be but she was going a mile a minute. I wanted to relax and enjoy my meal not be rushed in and out in less than 45minutes. My dinner came as half of my salad remained uneaten...and the salad was literally brought out in less than a minute after I ordered it. I realize its a small venue with limited seating but there wasn't anyone waiting for a table and last  I checked this was not at a fast food joint.", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 3, "date": "2011-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "89RxJtp2wPpud6S-cZHE0g", "review_id": "rlTB6Y0OuE_qS2ASDp-tfA", "text": "This place is located in such a great area! Parking can be a little tricky but other than its awesome. The menu and beer selection had a great range and the staff was friendly and make great suggestions. Also my boyfriends family is from Baton Rouge and this place does a great job of incorporating the Cajun flavor in its foods! I will be back!", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 5, "date": "2014-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sSnDdLv1C4LiSF_oYXjyMw", "review_id": "TWUY8MKH4EG8mg6PVtGEjQ", "text": "Ri-Ra's is an Irish Pub and Restaurant that becomes a popular nightlife spot in Uptown Charlotte after dinner hours.  The food is good for the price level, and eating on the 2nd floor patio which looks onto the Hearst  plaza is a great experience during the warmer months.  At night Ri-Ra's has live music and a DJ which alternate floors depending on the night.  The bartenders are excellent, the atmosphere fun, and the drinks strong.  A great place to go to have a few drinks with drink specials every night of the week and a great place to grab a meal with specials depending on the time of day.  Cover for guys is $5 on the weekends, free for girls.", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 4, "date": "2006-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kozm9qP_VKlmi90fZRXbhg", "review_id": "5da-9hR4LeMQ4cFygYABXQ", "text": "Our group was in Charlotte for a conference and came upon this bar. The first night, we drank our weight and had a great time. The atmosphere was typical for an Irish bar, and we found the staff friendly and amazingly quick for as busy as it was. Two nights later, we came back for dinner. The right of us all loved our meals. The shepard pie was especially good and the sweet potato tater tots with a side of Guinness bbq sauce was a hit with entire table. We will most likely be back here again this week.", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 4, "date": "2011-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "o6uMBpmtzxI2pe2uTORLKA", "review_id": "Wx5nQoH7398la5iTBPhoUw", "text": "This happened a while ago (several months), but it still haunts me today.\n\nI ordered a portabello mushroom burger (I know, not really Irish, but don't judge). When my burger came out, it was not a portabello mushroom patty, but instead, a pile of sliced mushrooms on the bun. I asked the server, why it was not a portabello patty, and the server told me it was because they had run out of portabello patties, and this was what they were using instead. Interesting. I told him I didn't want this, and wanted something else. He obliged, took my plate of sliced mushrooms, and went to place my new order. I called the manager over, to let them know the situation. When I explained my side of the story, he rebutted with something \"Well the server told you we were out of portabello mushroom patties, and said you agreed to sliced mushrooms\". WHAT?! I told him, no, that was incorrect, and that I was unware of them being out of portabello patties until I was brought a plate of sliced mushrooms on a bun; my wife agreed. The manager stood by his server. I firmly told him again, that I did not know/agree to having a sliced mushroom sandwich, and that the server conveyed no such message of running out of portabellow patties. I asked him how he could rectify the situation - free meal or something? No he would not, because I was aware of the situation (but I wasn't!), although he did comp me the original portabello mushroom burger...gee thanks.\n\nNow I'm not the type of guy who tries to find fault at every little thing to get a free meal. But come on. I would assume, after having worked in the restaurant industry for several years, that the manager, regardless of how much/little he believed the customer (me) would side w/ me, or at least try to rectify the sitatuion for future business. But no, instead, he stuck w/ his server, made an unhappy customer, and now I will not visit there on my own volition (my wife enjoys the place, so I will go back w/ her, only urging).", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 1, "date": "2014-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "qLwVOEkBMy89qyeLZuZSjA", "review_id": "RRtoE-qXjLkNC7bwBWTepA", "text": "not thrilling, not disappointing.  RB is average across the board.  Try the Hazelnut Crusted Chicken.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 3, "date": "2008-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h6oheaOHMbGtbE24pIlTDA", "review_id": "1e2GUTEJJG4x6J4W3W-kSw", "text": "This place wasn't bad.  If you live in Charlotte and have tried the other local beers in the area, check this place out.  If you're from out of town and want good local beer, I'd recommend somewhere else.  While the beer was good, it wasn't memorable.  The food was good, but again, nothing super memorable.  The waitress was friendly and attentive.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 3, "date": "2014-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "D-2f-UUrCVhzVSGyGzUvjQ", "review_id": "SX5lxJoCdmI3CBKsR0-SeQ", "text": "I have eaten here several times & always find it disappointing. Tried a variety of foods & none have been particularly good.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 2, "date": "2015-08-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "jY5lDpTGBNYvpMu4hJCIkA", "review_id": "N4GCkGCtXNFiI2JucbX_Pw", "text": "Until Del Frisco showed up, best steak and best wine list in town!!!  Now...it's a toss up.  Wait staff is extremely knowledgable and friendly.  Go light on the app's, everyone...the steaks are ridiculously large.  They've got one of those wine lists that is made for every single person that can walk through that door...great whites and great reds...excellence whether you're staying under 20 bucks, or if you're budget is big time.  Also, the bar out front is a great place to enjoy some happy hour and watch the cougars on the prowl...fun people watching.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2007-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8AqgT-Y4YSM_keyT6doN0g", "review_id": "IxjMkgdo5c5WnO4AuS821Q", "text": "Went last Thursday for restaurant week.  Claim chowder...perfect.   Creme brûlée...perfect.   Sirloin special....grissely and disappointing.   My guest got the same and got the same grissely disappointment.    Atmosphere was nice and service was excellent.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 4, "date": "2012-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CUZz-vXoTggr6BGsD-aqzw", "review_id": "LxRcjI-D8Pd4F_LNIUmFvw", "text": "I was Extremely disappointed  with Capital Grille. I dine there during Queen's Feast Restaurant Week yesterday. i was very excited because i only heard good things about the place . To Start the evening off there weren't any seat left inside the restaurant so we were escorted to a dining room outside the lobby. There were so many terrible things that occur that evening where do i begin. First the ceasar salad was the worst salad i have ever had it taste like a 2 day old bag salad you get at your local grocery store. it wasn't fresh, i was missing courton in mine. Next it time for the entree.  2 of my  guest ask for a med-rare skin their  steak came   super well done . so dry i didn't know if i was filet mignon or A cheap dry roast beef.  She returned her and it came back out much better . I had the chicken breast that  once i got to the bone it blood and under cook.  and to finish the even off they were out of the cheesecake, and some of the guest  got the flourless coco cake which had molded rasphberry on her plate. yikes . it almost went in her mouth. I would have expect better quality of food for a 4 star restaurant.  She got her meal for free due to all the mistakes. but i didn't get antything for my bloody chicken. I will never go here again. :-(", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 1, "date": "2014-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eUbqvGfxtGQ3W6rH-dnsZA", "review_id": "fiUmmvh5152iULmuKlAcRQ", "text": "Had never been to Charlotte, NC before or to this restaurant but all I have to say is Wow!  Amazing meal as I had the Filet Minon and it was one of the best meals I have ever eaten.  As and added bonus the waiter pointed out that the DT Suh from the Miami Dolphins was at the next table over and when he got done I went and asked for his autograph and he was very nice and gave it to me.  This place was incredible from the moment we walked in to the moment we left.  It is on the very expensive side but well worth every dime we paid.  I would recommend this place to anyone visiting who wants an upscale atmosphere and a great top notch dinner.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2015-08-24", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "irp52lkFjRyQq9JIW8VseQ", "review_id": "Jiz6_sq4vxdjsZALPAGi2A", "text": "I haven't been to Buckhead Saloon since 2/09. Me and a few friends decided to go last night. I usually have a good time when I go to Buckhead. If you don't wanna pay a cover, get there before 10pm. I believe it's only $5 after 10pm. They had Coronas for $2.50, so that was definitely refreshing. The employees/bouncers/bartenders (male) were all meatheads though...not trying to hate or anything. They must have some rule when hiring that says \"you must be a workout buff to work here,\" haha. Anyways though, this was definitely COUGAR CENTRAL, if that's what you're into. Unforturnately, I got hit on by a cougar....appeared to be about mid 50s and I just felt violated for the rest of the night, haha. I had to use a female friend to kinda shield her off me, haha. The live band that they had was very good, playing the usual popular classics (3am, Sweet Home Alabama, Play That Funky Music, Don't Stop Believing, etc). I think what impressed me the most this night was the upgrade in the music selection. They went way beyond the typical top 40 that they usually play when the live band isn't performing. The DJ kinda sucked though....he was mixing in other songs halfway through songs that just didn't blend in well, and he played some songs twice within a 30 minute time frame. There was some really good hip hop (some old Snoop, Luniz, etc) being played that night. I'm really hoping it's like that from here on out b/c although I believe I could dance to any genre of music (tooting my horn a little), dancing to hip hop is a lot more easier, haha. This is a must go place to hit up if you just wanna have a good time without the pressures of having to get fully decked out like you're going to the Epicentre.", "business_id": "GK6RBUJUBScobbF1oE5iuw", "stars": 4, "date": "2009-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cfLb0vyYOsnjMqhrbTJuwg", "review_id": "T8zfOFB3f4BaApXJ0k57yg", "text": "Worst service I have ever had two visits in a row. Service has always been around a 2/3 out if 5...the last two times I went I'd give then a 1 and only because our food actually came out. Our waiter was awful. Had to track down another server twice for drink refills and our check. Rude employees. Will not be back to that location!", "business_id": "ePogmFFQkAy68Ne0VVUGBg", "stars": 1, "date": "2015-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wGWFzdgnSEe7C6UjoW8Q3g", "review_id": "PFCzl6qSMjmyTcOAmtGdMg", "text": "Took quite awhile between my review of the bar and live music part of Blue and the restaurant side but, here I am and boy am I glad.  Went for dinner with my wife and a couple friends from work ahead of a Charlotte Squawks show and every bit of the meal was fabulous.\n\nIn terms of service, I have to say that I believe this was as professional as I've ever experienced in Charlotte.  From tableside manner to knowledge of the menu, past and present to attentiveness.  Just spot on.  Thank you Scott.\n\nSuffice it to say that everyone was very pleased with what they ordered but I'll stick with what I ate.  Started with the seared Hudson Valley foie gras and it was the perfect, fatty, savory bit of heaven with which to start the meal.  For my entree, I got the whole Branzino which was served with some risotto.  The fish was perfectly moist, simply seasoned and filleted tableside by the aforementioned awesome server.\n\nMy only regret is that I was not able to order my first runner up on the menu, the duo of wild boar and I can only hope that it's still on the menu when we visit next.", "business_id": "eaqJQP6bp7rQJQt5KqfvxQ", "stars": 5, "date": "2013-06-22", "type": "review"}
{"votes": {"funny": 4, "useful": 0, "cool": 0}, "user_id": "jp5lBxgdCpDRhSeEuRK_kA", "review_id": "gRzoZzcIDFERflgPgVM-TA", "text": "This place is huge and spacious, making it a perfect venue for large events as they serve food and drinks and it is very spread out......it has an upper level with pool tables and a bar but it's not as spacious but is perfect for people watching.  That being said, this place gets very hot as the crowds pile in.....I mean they were passing out fans and towels for goodness sake.......now I'm not sure if that is a problem with the cooling system or what but for a natural chic with a blowout these are unacceptable conditions and conditions my hair cannot withstand for an extended period of time.......definitely not a good look.", "business_id": "76lSMjkrbLxTWeylGZvjhw", "stars": 3, "date": "2013-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gQlLuTUG49u3z7bI1ySKmw", "review_id": "YsfDNbSAWFEI27kDKBAdAg", "text": "Situated on the corner of a strip mall, this place is fairly easy to find.\n\nThe atmoshpere is that of a fairly traditional pub. Lots of dark wood lines the walls and the place is covered in saucers, some merely decorative and others representing those in the \"UFO Club\". There is an area for live music, and a couple of dart boards, I did not wander around or to take in the entire place, but I was told that there is an area with billiard tables as well. Really, it's a nice change from some of the Charlotte area drinking establishments that lack character and are littered with TV's...\n\nThe service was terrific. The waitresses are wearing school girl outfits, complete with tiny little plaid skirts, knee high argyle socks, and skin tight tank tops. Somewhat similar to the outfits worn by the Tilted Kilt girls. Quite appealing. Aside from thier appearance the wait staff seem to have at least a rudimentary knowledge of the beers on thier list.\n\nThe beer selection was outstanding, somewhere around 100 taps, and at least as many bottles covering a wide array of styles. If only they planned thier food menu as well.\n\nThe food was uninspired, and fairly plain. Fairly standard chain pub fare, and not terribly well executed at that. Not that the food was bad, just not terrific. And definately not worth the prices.\n\nThey do have some specials, I think they have a couple of days a week where drafts are $3, but overall I found the beer and food pricing to be a bit high.\n\nOverall, I would definately go back. The atmosphere and the extensive draft list are alluring, even if the food is not.", "business_id": "F-e-sWfVd3eCYll3BP1QFA", "stars": 4, "date": "2011-07-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "1QNyeXl4AEizT2FWs7gNBg", "review_id": "N0QKo7pvDWLFUzCl9BqAgQ", "text": "Oh yeah.  Even the pubs in Dublin aren't as merry.  Lots of beer and menus is mostly german food.  \n\nThe waitresses are really cute, lots of beer to chose from and the food is good. I had their German plate. It comes with German Potato Salad and it was tangy, warm, and there was some herb in it. Plate came with 2 sausages and a heap of saurkraut. I will likely eat it again.\n\nThis place is wonderful. People are relaxing, the beer is cold and the waitresses add to the fun.", "business_id": "F-e-sWfVd3eCYll3BP1QFA", "stars": 5, "date": "2013-08-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "vE4TIv-AEsFalZ4faTRH-g", "review_id": "rFhHvncaPz-NC7bZ69v21Q", "text": "I haven't been to this Hickory Tavern in years.  We used to go hit buckets of balls next door and then swing over for some drinks and dinner.  The years have been fine to this location, it was just as I remembered.\n\nLocated at the end of Rea Crossing shopping center just past the 485 exits on Providence Rd, if you are heading towards Waxhaw, it will be on your right.  If you are leaving the shopping center during peak drive times, or would rather not cross 4 lanes of Providence Rd, you can drive behind the gas station and hang a left, which will take you to a stoplight for safe crossing.\n\nI was greeted by the hostess and after asking not to sit at a high top (I realize I am alone and will take up a table probably meant for 4, but I typically have on a skirt and no one wants to see that while they are trying to eat) I got a little bit of an eye roll, but that's okay.  Some girls get mad at how pretty I am, so I am used to eye rolls (ha).  Hickory Tavern is FULL of large flat screen TV's and usually have whatever the prime viewing for the time is on a huge projection screen on a rear wall.  When I was in around 6 on a Thursday night, it was SportsCenter (da na na) so I could read the crawl along the bottom of the screen.  I was quickly greeted by my server, Katlyn, and she was fantastic - my drink was kept filled and she checked up on me periodically without helicoptering around me.  As I put in my Tip for this location, I believe she said on Thursdays that shrimp were $.60 and oysters were $.75, bit since I don't eat either, I wasn't exactly tuned in.  The table next to me got oysters and he commented that they were tasty.  \n\nThe food:\nTurkey Club w/ Tavern chips ($9.50):  Turkey with melted cheese, bacon, lettuce and tomato, served warm.  The bread, if you are a Costco person, is one of their torta rolls that are deee-licious.  The sandwich was good, and I like that it was served warm, but it needed a little more flavor to it.  Maybe next time I will ask for a side of BBQ sauce or the like to punch it up a bit.  The house made chips were thick sliced potato chips, crispy, but not hard and served with a slightly spicy dipping sauce - they were good and not overly salty, which was perfect.  \nKey Lime Cheesecake ($6.95):  This tasted like another Queen City Pastry dessert and was delicious.  Served with several swirls of whipped cream, this light key lime cheesecake, on a graham cracker crust, with a thin layer of lime sauce on top, was the perfect somewhat light dessert the finish the meal.  \n\nExcellent service and the food was slightly above average for this type of restaurant.  As it is close to home, I shall return.", "business_id": "r-pBY6vR_Iu5XhPRvPnquw", "stars": 4, "date": "2013-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yWA7f_LvBDINUF6KYvBhvA", "review_id": "XeEutxF7KY-UlOpPck4H1A", "text": "Just spent $27 for two people at lunch. Ordered the Sante Fe salad.  Cost was $10.29.  Looked nothing like the picture.  Chili dusted chicken breast on top of pale green salad and dotted with pink tomato chunks and fewer pieces of avocado.  The salad was tossed in a milky bland ranch dressing.   Bluck. Won't be doing lunch here again.", "business_id": "i-cEO98lTS10WH30FyKvGA", "stars": 2, "date": "2015-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "hvJP2aqd91M4iFriEWGkIA", "review_id": "nK7DtcBDzd-gY5Lh7e8Apw", "text": "Stopped in Sunday after the recommendation of a friend.  It was blazing hot outside and the A/C in my house wasn't keeping up with it, so I needed a cold beer, cool air, and sports.  This is the place.  I would call this a true sports bar.  Great atmosphere, very friendly and attentive bar tenders, and pleanty of TV's with a wide variety of sports shown.  Just what I was looking for.  Oh yeah, the A/C worked perfectly too. \n\nI had a pizza while watching two baseball games and the golf tournament. The pizza was pretty good, not great, but I ate it all so it was good enough.  Great crust.  The menu seemed to have some other things that looked good. I heard somebody down the bar mention the Calzone was good so next time.  Another guy had some good looking wings too.\n\nJust as I was leaving, a major thunder storm blew up so I turned around and had another beer.  \n\nGreat place to hang out and have a few brews and a bite while watching a game.   I'll be back very soon.", "business_id": "3xdV-7di_YD3MVqs3Pa7-g", "stars": 4, "date": "2012-07-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E4IqBgoqbEZY6CtRZHqoZA", "review_id": "R3UtgBWmc5H5VNljN04DDQ", "text": "I went to Picasso's Uptown all the time for their buffalo chicken roll and lemon pepper wings! So when they closed I was sad I knew there was one in University so I decided to give it try and it was AWESOME! The service was great and the food was great I sure did miss those lemon pepper wings!", "business_id": "3xdV-7di_YD3MVqs3Pa7-g", "stars": 5, "date": "2015-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zokyFsdxi_x2sGxDuVvy1g", "review_id": "jwkLy9Iic4wNysvisrD9iw", "text": "We have eaten here several times and the food has been good - the blackened prime rib on Saturday evening is to die for. So we thought we would try the Sunday breakfast buffet and Bloody Mary bar. My advice - go to IHOP or Denny's instead. The breakfast \"buffet\" was no more that a glorified lets-throw-some-typical-mediocre-breakfast-items on a couple of tables and call it  Breakfast Buffet. I went expecting rather a brunch - i.e.: breakfast AND lunch items - after all, they weren't even open until 11 and I'm not much of a breakfast food-type eater anyway. For the price they charged the following was served: fruit (nothing special- cantaloupe, strawberries and honeydew), your typical institutional scrambled eggs - rather plain, bacon, sausage links & patties, biscuits and gravy- thin gravy, short on any sausage mixed in, frenchtoast sticks - which were hard as rocks already and they had only been open 20 minutes! It took a while, and I do mean a WHILE for our server to even show up to begin with and she didn't come back to check on us very often. I had to ASK about the Bloody Mary Bar to which she replied - \"oh yeah it's in the back there\" - this server was NOT really hawking the attributes of the restaurant like one would expect - even when we mentioned it was our first time for the Breakfast buffet. It's an eclectic place, and the food is typically good for the most part - but the same old thing menu. Ribs are good and as I mentioned earlier the prime rib is excellent... but that's probably all we will get there from now on, if we return at all. This could be a weekly haunt for us, but it's only become essentially a once a month thing - and now DEFINITELY not for the breakfast \"buffet\" - I do a better spread at home!", "business_id": "Zc2IwSzGY63zkyhfNrr7HA", "stars": 3, "date": "2014-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "knwVXVWbiRUEKIubnKl4Sw", "review_id": "HZ2wAWfo04xfjIJDtFi3qg", "text": "I really enjoyed the view if the lake, but the service is slow and the wait staff is not attentive.  Thankfully, the food was good.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 3, "date": "2014-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "74rE2heR1pLCjgebF9r7iA", "review_id": "JLzP270LbTGloEZRwITfiA", "text": "\"The Green\" has the best burgers in the Madison area.  It's simple bar food, but done perfectly.  They know what they are doing here and they are doing it good.  The Nachos are pretty awesome too.  They deep fry tortillas for the chips.  If you can, get a spot at the bar.  It's good times.  \n\nI don't eat fish, but some of my friends and my girlfriend do, and they like the fish fry on Fridays.  I'll stick to my cheeseburger.", "business_id": "G1qUGBNYNS220jKlPAlFsA", "stars": 5, "date": "2013-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4X8IgTyk09uIktc0jwCUZg", "review_id": "LkikknITCQoBRVyFjjjFOg", "text": "Good place for lunch if you are looking for a burger.  Not a flat little prepackaged slab of meat, but a burger pressed by hand, seared, cooked and juicy.  Not fancy.  Truely dark, but it's a tavern.", "business_id": "Nj0vQjUYjaa7qbvZlEr2jQ", "stars": 4, "date": "2012-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_TtfC3h0mdRO8Apb6jlHcQ", "review_id": "c52tLPRnPaFHcp3PDUChLw", "text": "Service was great and quick. Our drinks arrived quick and our server Melissa had honest and accurate suggestions.  She was really friendly and fun!  Only problem was that it was really cold because of the air conditioning.  Otherwise it was a great experience!", "business_id": "JdCFcgw4yk4M1ZRhAhBIag", "stars": 4, "date": "2011-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FC-1_Bq7K0Mr01e7-kpkhA", "review_id": "ZRPiJ9D6_cWs7Nd0jDgNaw", "text": "Had the gulf shrimp po boy for the first time. I knew Dexter's was great, but now I'm planning to go here every Friday I can! And the beer selection is incredible. Great place with friendly service", "business_id": "HTplzElel_F_U_qhWuDKdg", "stars": 5, "date": "2014-08-16", "type": "review"}
{"votes": {"funny": 3, "useful": 0, "cool": 0}, "user_id": "pOmhEB7tBWhYofKPixLfNw", "review_id": "uH79FIy8H-040R3r1PvQQQ", "text": "This place SUCKS!  Every time I go in here it depresses the shit out of me.  People say it's haunted and I would agree - haunted by degenerates and meth heads.  I always say I'll never go back but that never happens...", "business_id": "TLjnOhDnazyPJmI8LqU5-g", "stars": 1, "date": "2011-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "_Y-egttPajYipG-NDXx-NQ", "review_id": "n5lf4MK-vwPcTouCV4MM7g", "text": "Poor service by the wait staff is my biggest complaint. We were there at 5:00 (and it wasn't busy yet), and it took probably 15 minutes to place our order. \n\nFinally, $16.95 for a fish fry. Yowzers!", "business_id": "JJFoeKZXgi2_LeECDMkkoQ", "stars": 2, "date": "2014-08-15", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "wE7kSbc96IIXpQxJgLrGMQ", "review_id": "G4cIQatcNJ-rZYNWcRVHng", "text": "What's the first thing that comes to mind to have for dinner before going fire-dancing with friends on the summer solstice? Brats, right? Of course! What? No? It's just me? Well, that's what happens when you're at Olbrich Beach catching some rays and are subjected to the craving-inducing scents from 1,000 Father's Day celebration BBQs going on at the park. \n\nSurprisingly it's not that easy to find a local place on the east side that you can just walk into and order a brat. Enter Harmony, the harbinger of good things to come. I'm not one who enjoys going out alone, especially to bars, but that's something I'm trying to get over. So it was a relief to see the place only half filled with low key, relaxed people who barely noticed I was there. I was however, immediately noticed by the friendly, smiling young bartender (who looked all of fourteen), so I was put further at ease. Also delightful was a live band playing happy zydeco music in the other room, a genre which I adore. I sat at the bar and ordered my 'beer brat'. With sauerkraut, it's only $5.25. Win! They also had a fairly good selection of craft brews on tap, and mine was cold and delicious. Brat, beer and fries for $12.\n\nThe brat is pre-cooked and then browned in the tiny kitchen just off the bar, and it's always fun to watch food being made (if you're me). They also grill the kraut, a nice touch. It's served on a big, somewhat fluffy sesame seed bun, which seemed like an odd choice, but it worked. The fries are good, too, and the order is huge. I would have sprung for the deservedly popular pub chips and bleu cheese dip, but they were twice the price of the fries. It was a lot of food, and totally satisfying, and I finished every last bite. I think this is a place I can feel comfortable going to alone or with others in the future, and I plan to, often. :-)\n\nNote: cash only.\nFive stars instead of four if only they had a fire grill and not just a flat grill.", "business_id": "KHOHjA8HOcTlFBCtMQFv8A", "stars": 4, "date": "2015-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "yhiI9vgYduyDPyp-mmW8xQ", "review_id": "boXzB32bzXAAJLUzpG2tCQ", "text": "You never want to be \"those\" people who show up on a Sunday about 5 minutes before the kitchen closes and there's only one person in the joint and they might be the bartenders boyfriend...and yet... we were. It's my Husband's birthday and they give you a complimentary burger and beers to celebrate another turn around the sun. Sweet deal! Delicious burger! Friendly staff...even if you're the last at the last minute on a Sunday. \n\nWe're looking forward to going back! Nice place with great friendly faces behind the bar!", "business_id": "cRqZ_w9ImfYYIXTHpJMv0Q", "stars": 4, "date": "2015-08-16", "type": "review"}
{"votes": {"funny": 11, "useful": 6, "cool": 3}, "user_id": "G73eGQJg3F_gvDYnlgWVMw", "review_id": "53Y-elEbTKWefxOi4MCekA", "text": "You know there's a problem when you've never been in this campus bar, but your 60-year-old father has read about it in Playboy and shouts from the psych building across the street: \"THERE'S KAMS! WOW!\" So then, of course, he wants an up-close view of it even though it's butt early in the morning and there's really nothing to see. Half asleep, you agree, trot across the street and then remember that overwhelmingly volatile vomit smell... All day, every day.", "business_id": "RwhUzMEG2tVnZQY9dEuXzw", "stars": 1, "date": "2007-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hLZ80f3JWYV2hdSuEmPc8A", "review_id": "VQxZ1ZlT9GOwkqUXx2WjDQ", "text": "Last chicken fingers I had were a little salty and overfried.  Plus, they charged me $0.50 for more sauce.  Seriously, how can you win the hearts of your customers with stinginess.  Anyways, I still love you Geo's..but you are no longer in my selective 5 star club.", "business_id": "iCOvcfVRfi-f05aeqBLpKg", "stars": 4, "date": "2009-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lB6ykNiO-Sbn46rmffd7dg", "review_id": "cgeiHYD1GQtkFTLbRMPnrw", "text": "The little point of sale device on the table was a waste of space and only a way to sell game play time. They are so inn our face saying \"make sure you pay\". I hope they removed these so Olive garden will return to being a nice friendly place to eat instead of money grabber.", "business_id": "H0D2HYqLd9MRCq68rtbTyQ", "stars": 1, "date": "2015-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NyDNMYh9OGlPA4FZF_S_LA", "review_id": "lW9nT2cQdm9gErNVl8iFZA", "text": "Old people on the college strip had a blast,,,we just gambled on machines,had good drinks and good service.", "business_id": "MVH3JOKpQvMTP4jxwBUhkA", "stars": 4, "date": "2015-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "0EfU6vvU7buXmTc3LPsnNw", "review_id": "CJ8goLCz8iq16N_MTiMDwQ", "text": "Amongst the many other campus bars, Legends is truly a find - a not so well hidden diamond in the rough.\n\nThe drink prices are reasonable for campus and amazing when compared to Chicago.  The food here appears to be your regular run of the mill bar grub, but alas, there is something special about those loaded fries.  Their half off appetizer deal on Fridays is pretty sweet too.  But my all time favorite is the Legends Ranch Chicken served only on Mondays.  I'd call in sick for that.\n\nDon't miss out on their Long Islands ($5 on Mondays)... they're seemingly innocent which makes them all the more lethal.", "business_id": "05FJCAvUFOAk8B_nIOqt7A", "stars": 5, "date": "2009-06-08", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "9FOYCNxxGDlBRfAgK3IB7A", "review_id": "Qc-ltJK_iRQoOVHS5XBO0g", "text": "Packed. Lovely. The bar is full and the drinks are strong. The music is loud and the people are...well..cute. lol Or usually not. But that's just me. Clean the floors. Remodel the bathrooms. Keep on GETTIN it with the drag shows.", "business_id": "RdDRWuHNZVUCY6t-VkVsAg", "stars": 4, "date": "2014-07-13", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "T79mohKIt7Ad9-KjVkxMfQ", "review_id": "lvOzOCnGZWTJdmslZLGltQ", "text": "Wildly overrated.  Everybody says that it has the best burgers in town, and the place suffers a little from excessively high expectations. I've only had the burgers, so I can't speak to anything else.  In brief, the burgers are bland, just plain patted beef patties on a griddle. There is nothing exceptional in the seasoning, preparation, quality of beef, toppings, etc. It's nothing special, neither good nor bad.  The dingy atmosphere (a staid lunch counter in a basement that had leaking ceilings both times I went) might be considered cool in a kitschy or hipster way, but I found it unappealing.  If you want the crappy ambience to be a selling point, then the food has to be good.  I tried it twice, it underwhelmed on both occasions.  Maybe I'm missing something...", "business_id": "IUhO58Il7gUEjl1RMEncHA", "stars": 2, "date": "2013-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "LPfRK0V5EsYG8DvsaXj7ng", "review_id": "_1VX54xA6IDeSBTujnU0YQ", "text": "The best burger place in Illinois. The burgers are cooked to perfection and the onion rings are too good. It is in a weird location but I guess it works. You have to go here!", "business_id": "IUhO58Il7gUEjl1RMEncHA", "stars": 5, "date": "2015-08-13", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "4UpCBfRXULqQ0GaZTnG9Mg", "review_id": "DNH_UbejlPk6ZnebRHm2Kg", "text": "These folks have somehow commandeered a square mile of formerly-public outdoor space which is probably the best reason to go here.  Unfortunately the food is only so-so, though I do like that the sandwiches do NOT come with french fries!.  Mediocre draft beer list (especially for Champaign), but decent martinis.\n\nUPDATE: Forgot to mention this place deserves 1/2 more star because they replaced overrated PBR with HIGH LIFE for their ultra-cheap draft beer!  Yum!", "business_id": "mJxu0USvbwSHcGsmwWh22A", "stars": 3, "date": "2007-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "lq-5vv0dfRgPh_ccDzlUpQ", "review_id": "QQ_UmqOIWSvzyuwcMkJVSQ", "text": "Tasty Pizza, nice beer selection.  Perfect for watching sports and playing pub games.", "business_id": "6U94ybDpNd0fTL7TIzb5Kg", "stars": 3, "date": "2008-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Zlv0pkBoJBJoRaPo_CyjDg", "review_id": "sXsgje5d2biZT0NIXahKiA", "text": "I rather enjoyed Bacaro.  It had a really nice atmosphere, quality food, and good wine.\n\nI was impressed that time was taken to talk to my wife and I to find a wine to pair with both of our meals.  The pairing was correct and the wine went well with our meals.  It was somewhat amazing also the fact that it wasn't a very expensive wine that was suggested.\n\nThis is a very good place to eat in the Champaign area.  The reason I gave it 5/5 (instead of 4/5) is because even though the food is a little over priced in my mind, the service, atmosphere, and location lend to it receiving a 5/5.", "business_id": "h9xdY1NO4GnNijNChTy-8A", "stars": 5, "date": "2011-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8d1nedCL138yygcwMsZ2Kg", "review_id": "6dSu-QPMcSfEF9TCBFRhXg", "text": "This place is one of our favorite places to eat!  The service is always spot on, the waitresses are always so knowledgeable about the food and extensive wine list!  We first started going here five years ago and we have the most amazing oatmeal cream pie with sea salt.  My husband remember how much I enjoy that dessert and called them and asked if they would make that dessert for my birthday.  It was so thoughtful and sweet!  It is hard to find a restaurant that cares this much about it customers!", "business_id": "h9xdY1NO4GnNijNChTy-8A", "stars": 5, "date": "2015-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0N0ngSQ8Njxfuvdxm1RpFA", "review_id": "vXjuFx_as_BApXWsLV8sUA", "text": "We visited Majerle's to kill some traffic time leaving downtown. I came with no expectations and only wanted a drink and some downtime to cap off the evening. Well, this was accomplished! And well might I add. \n\nWe sat at the bar, were greeted prompty and served politely. Both bartenders were personable and efficient. The crowd around seemed upbeat, business casual and relaxed. Decent, though not overly crowded scene for a Saturday night. \n\nThe menu looked diverse and varied drinks available. Decor was clean, modern, and comforting. Prices were on par for the area and venue. \n\nReally not a ton I can comment on as it was one drink (It really was, too!). No, not \"two\", TOO! \n\nSeems like a nice place to relax when downtown. Would I drive here just for Majerle's? Nope. Would I pop in if downtown wanting a drink or some food? For sure.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 4, "date": "2011-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AefRoI7j0OXlnMi8LtqaLg", "review_id": "PQmlZJ4ABklDGj3vur6jMA", "text": "Definitely a cool spot.  We live downtown and were looking for a place to watch Game 1 of the Cavs-Warriors game and stopped in last night.  It was packed.  We were fortunate enough to get a couple barstools as there was some convention in town and it appeared everybody was flocking here.  The bartenders were great.  We never ran dry on drinks and were able to get some good wings on happy hour.  We tried boneless wings and their \"Gorilla Wings\".  The boneless wings were great but we were not a fan of the Gorilla Wings by any means.  They were tough and not very tasty.  It was almost is if we were eating deer jerky.  But the boneless wings were great.  \n\nThe vibe in here is what made it fun.  There were a lot of Golden State fans a lot of Cavs fans.  There was a lot of cheering and booing going on but not in a hostile way.  It was  good time. \n\nThis will definitely be our go-to for games and drinks.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 4, "date": "2015-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xfz_Bb4RIYH7N3luWqbyHQ", "review_id": "8fp65d6QJZs2Yl6mtfDcJA", "text": "The food and service were both great, even though it was MLB All Star week. The waitress was on the ball and made sure drinks were refilled. \n\nI had the Italian Stallion sandwich and it was pretty good. It would have been better if they sliced the meat Jerry Mike's Style (nice and thin). The thick ham and salami slices made it tough to bite and hold. Oh well. We'll be back the next time we need to pregame in Phoenix. The large covered patio was a nice break from the heat.", "business_id": "j8nyAaN_w5t6wYv-ni23sg", "stars": 4, "date": "2011-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "AGUzvg1XorMJpcVG-N0ZOw", "review_id": "iVTBGLbh2M7LmS-M0USapA", "text": "Stay away from this hooters. Bad food, bad service. Bleh!", "business_id": "qsWxbgQwuomXvMseg23DGg", "stars": 1, "date": "2010-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "1cKTUGVPmRJRrihjdxbPlA", "review_id": "g9fnYLSWmczLviLV57RUbQ", "text": "WATCH OUT FOR THE TIP AUTOMATICALLY CHARGED BY THE SERVER IF YOU ARE THERE FOR THE GROUP GATHERING!\n\nI have been to this place twice (Happy Hour and Dinner) and the food and wine are generally decent. I can't complain much about the ambient, cheese, food, and wine, but when it comes to the time to pay, some server charges excessive amount of service tip on your bill. You need to watch out for this and need to sober up!\n\nOne of the servers told me that the tip amount for the group gathering (6 people or more) is 18% out of the total before Tax, but when I received the bill the gratuity was 23% AFTER THE TAX amount. (I realized this when I saw the bill next day). So I over paid the tip although I thought the service was OK. (I asked for a glass of ice water several times, but the server was keep forgetting my requests).\n\nAgain, if you are planning some group event here, please watch out for the tip unless you believe the service is superb....", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 2, "date": "2008-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "f5CqKZlqK9Sox9z9wuooCQ", "review_id": "w50TPDmitmmI6kEQiHN0Yw", "text": "Been going here for a few years and always loved it.  Yelp typically doesn't let you down.  Instead of going to many of the crappy joints downtown before concerts and sporting events we go here.  Even on the way out to Cricket for a concert.  Nice wines, cheese for all you cheese lovers, salad nicoise awesome, empanadas very good, and I could go on.  Jeff is usually at the bar and he is awesome.  Go there, a great wine option in the valley.", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 4, "date": "2011-06-30", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "usHaK3jzQqIBTNJjv_ugVQ", "review_id": "5BdAUF9JEO2Re0WipGB36g", "text": "Alice Cooperstown is the place you want to go to once and then remember it fondly from a distance.  \n\nWalking inside you'll find that the wait staff is decked out with make up ala Alice Cooper.  The drinks are overpriced and seem to lack, well, alcohol.  Some of the menu items are good, others merely seem like a good idea at the time.  \n\nCase in point:  The Big Unit, a 1.5 foot long hot dog served rarely enough that the wait staff celebrates by sounding a buzzer when one is served.  Unfortunately I wanted onions and Relish with mine, which they tried to settle with relish packets.  I don't know if you've ever tried to spread 10 relish packets on a foot and a half long hot dog before, but it's not really a reasonable proposition.  (And of course, once you've finished 2/3rds of a 1.5 foot long hot dog, it honestly just isn't fun to eat anymore.)\n\nAs long as you can avoid the more ridiculous menu items the food is actually pretty excellent, if somewhat pricey.\n\nThe premises have 4 extremely large Big Screen televisions above the bar, a no-name brand ATM machine, smoking allowed outside away from entrances, excessively large t-shirt selection, and two levels of indoor seating as well as outdoor seating.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 3, "date": "2007-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 2}, "user_id": "R9n2K6acBRqMjLVCUxgfOw", "review_id": "HYrAgP7WLFtCjjdDIa9DzA", "text": "We stopped here before a D-Backs game on a Saturday afternoon. We liked the idea of the baseball theme before a game and the dual reference of Alices last name and the home of baseball's hall of fame was not lost on us. All around you are the double references of rock and sport. On the wall are signed guitars, in the lobby is a basketball floor and actual backboard from the Suns. Large and spacious with many places to eat. Brick warehouse feel.\n\nOur server was friendly and attentive. All the servers sport a small version alices trademark \"black tear\" eyes. I ordered a Kurt Warner Reuben ($9.99) and my wife ordered the BBQ platter sampler ($13.99). The menu has lots of fun names for it's fare.\n\n Our food arrived in what seemed to be 2 minutes. The fastest I've ever experienced. This is a jeans and beer place. Your food will come in a basket lined with paper -- diner style. My sandwich was piled high with tender corned beef and toasted to perfection. The fries were crispy and hot. The slaw was crispy and fresh. The BBQ platter was delish and will definitely take a couple days to eat. Washed it all down with a draft Blue Moon. Often, celebrity-themed restarants have much to be desired on the food front -- overpriced for what you get -- but we were pleasantly surprised. \n\nOnce in a while the classic rock music background is punctuated by a ringing school bell and everyone shouts \"The Big Unit!\" which signals that someone has ordered the signature monster hot dog as featured on Man vs. Food on the Travel Channel.\n\nOverall a fun good time. Good place to bring visitors. We were here on a Saturday afternoon but I'll bet this place rocks at night on the big outdoor patio.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 4, "date": "2011-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QsMCulNkOazaGtyC-e8Fvg", "review_id": "RpKBuQQIo2s1N9OTdiPeLA", "text": "After watching Man v Food I really wanted to try this place. My sister and I shared the big unit and have to admit, its really GOOD! The prices for 2 was great. The only down side to the restaurant is that the service wasn't all there. Its a great place to have good food.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 4, "date": "2012-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DYRtBSE9kSW9ZHZllVP00A", "review_id": "lRD2oSbf78z_TVkHW4FEgg", "text": "It was okay. We stopped in on a Thursday on the way through Phoenix, and there were only a few people inside. It's actually a sports bar, with dishes named after various sports figures, with some Alice Cooper stuff mixed in. Someone told me this was supposed to be the best hot dog on the west coast (it was on some show?), so we got it-- the 22 inch \"Big Unit.\" It was just okay-- a lightly grilled hot dog, just warm-- I split it with my husband. It was $16.99. You can get it with all the fixings but we got it with relish and onions. Nothing special.  I also got a dinner salad (mostly iceberg with rings of red onion, standard). Two of my kids had the ribs, which they said were dry and just okay. My other kid had the kids' chicken fingers, which came with 2 or 3 fingers and some fries. The service was good. Overall, if you're passing through, I honestly wouldn't make a special trip here unless you are a huge Alice Cooper fan.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 3, "date": "2013-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "dDkfLQU8X2sNJmute38yHA", "review_id": "FkwdjVO5orkK8zltA8avpw", "text": "Awesome place. Great food. The Service is great.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 5, "date": "2014-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5RxpP2Woo7CpOGUmKgDyAw", "review_id": "OIu74PtGlNOyO0rrpEVaaA", "text": "Absolutely adorable!\n\nThis place made our 5 (yep you heard it here...5) hour wait much more enjoyable.  I think it we had to sit in the same building as the pizzas were being made and had to smell the delicious aroma of others pizzas for 5 hours, I may have gone nuts.  Bar Bianco was relaxed and had everything anyone could ask for while waiting for your meal.  We loved the Arizona wine and enjoyed a tasty plate of cheese and meat while lounging in the cozy chairs in the corner.  \n\nNot only is this bar a great 'waiting room' before Pizzeria Bianco, but I would consider coming here just to relax and have a drink.\n\nCheers!", "business_id": "JR95uaM82xBUIZ-kQ785iA", "stars": 5, "date": "2009-07-09", "type": "review"}
{"votes": {"funny": 14, "useful": 16, "cool": 12}, "user_id": "kgyv3ctYEZ0ACslpoakunw", "review_id": "JT2j_Q418lCKu62yH1mKqA", "text": "So a couple of months ago my co-worker and I were on a dangerous mission to find the one great burger in town. After months of search and going into some of the seediest joints in town, we arrived at Welcome Diner, I was a bit skeptical that this place could produce a burger  that my co-worker and I were so desperately seeking, but oh how rad being wrong is, they knocked the shit out of my taste buds with there burger, I got a double with cheese with a fried egg on top (old school son), I literally finished the burger before my co-worker got his (which was like 5 seconds later) , a true delight. \n\nIf you go bring cash money thats all they take, also its a small joint so don't go brining like 40 of your office buddies you'll look like a tool.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 4, "date": "2008-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "k3yuawPEvzlAJPj_RMO0MQ", "review_id": "TMZOs5Q98s1VczkA6G5fSA", "text": "This was an excellent adventure. The service is super friendly and the food is unique and deserves more praise. I ordered the fried chicken biscuit with gravy and cheese and bacon. That was the best choice of all the meals I tried and will be what I order when I return. We started with pulled pork fries that were BBQ flavored with a mustard twist. It was bold but I would try something else next time. The burgers were great and the fries were too. Great late night food, I would suggest this to my yelper friends.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 4, "date": "2013-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GFdpTUzwC2lNIqGg4VaVig", "review_id": "4qBzcb6SRFcCvCcK9ovdFg", "text": "Love this place. Awesome eats. Kick ass staff. Late night hours. Fabulous Tuesday night.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 4, "date": "2014-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WPHH9HL-BucnQUIvmnSGLQ", "review_id": "PpvzjapRt_xUhcrbcmILGQ", "text": "Definitely off the beaten path! Loved the big joe so much I had to try the carol. Then the no way Jose burger, then the grilled cheese and fried green tomato sandwich! Loved everything but the AZ heat. Go inside! ALL the staff is friendly. A must visit in Phoenix", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 3}, "user_id": "qfKtIq30I6wzbokZ4IZ7VQ", "review_id": "MVZ4ft6ZUmrrlu9WdHGVIQ", "text": "I can't say enough great things about Welcome Diner.  It has my type of feel. I've been a few times and I love bringing guests from out of town here. The counter service outside is outstanding. The guy, I forgot his name, generally works the window and is patient and helpful. He's cool. Like the hip friend that knows about good and drink and can guide you around a really fun menu to get you what you want. \nWent with the peanut butter burger, one of the fried chicken biscuit plates and a jackfruit French fry dish that just murdered my expectations.  There's a cool inside spot but it's always full when I get there. I have sitting inside at welcome on my bucket list. The bartender is always entertaining a fun crowd. \nKeep opening up fun places and turning around Phoenixs food culture!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-07-28", "type": "review"}
{"votes": {"funny": 3, "useful": 7, "cool": 4}, "user_id": "vF4B6eFdoDmyV_l7MLHMzw", "review_id": "FH3-rNeOQWidy7T7MUmj4w", "text": "The first time I went to Karamba's it was for Pride. I went for after hours and it was amazing! I paid my $5 cover fee and went into what looked like an industrial style bar. There were tables being hung from the celing and there were also a backdoor to the outside patio as well as a the ladies restroom. When we went deeper into the club, the blue hued bar gave way to the deep red dance floor. There were tables for dancing on as well as a plush looking chill section. \n\nThe dance floor was PACKED with men grinding up on men, with women griding up on women and the ocassional straight couple peppered into the crowd as well as a few large groups of women dancing together. Oddly enough there's often a lot of straight women who go there with their bffs so they can dance in peace. There's some chairs and more hanging tables surrounding the dance floor. \n\nThen there's the outside patio... there's a few water foutains and a ton of patio chairs, benches and tables. Sometimes it feels like the patio is where the real party is at! \n\nSince that weekend, I've been a regular there. I'm sure if you venture there for afterhours some Friday or Saturday night you'll see yours truely tearing it up on the dance floor to some of the hottest hip-hop and reggeton around! If you do, pull me away from my friends and say hi! Hope to see ya'll there!", "business_id": "0VpsHbGLHDVKIKAi0ZliyQ", "stars": 5, "date": "2008-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W3Py4bv597iIMaiTxtcyhA", "review_id": "NnIKx2m_3-9GnJ6qBTm5dA", "text": "A little bit of a dive bar but I come here primarily to shoot pool. A little rough around the edges but supporters of O-sports (Ohio State and Oregon) hang out here so it feels like home in some ways.", "business_id": "W41CEzdKJe8wdDB-Rd6KJQ", "stars": 4, "date": "2015-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mMSWtsCiMkzGtd1aMhh5VQ", "review_id": "UD5H6c85HroZQRQptcgEnw", "text": "Yep, a solid 3 stars for this Applebees (which in yelp speak means A-OK)\n\nI like the 3-7pm happy hour and the late night happy hour is good too.  The late night happy hour and trivia makes this a nice break if you want to hang out with friends, but still have a conversation which can be all but impossible at a sports bar.\n\nPluses:\n- Recently this location has been getting busier which is a good sign\n- Food is better than Chilis\n- The new campaign to serve lunch quickly has suddenly made this a practical consideration for lunch that has to fit within one hour including driving time.\n- Beer is cheap in happy hour\n- Friendly staff\n\nCons:\n- It's an American corporate chain restaurant, so don't expect gourmet ingredients.", "business_id": "hzUOqxpcnYYBgLlrgvjQYQ", "stars": 3, "date": "2011-08-19", "type": "review"}
{"votes": {"funny": 6, "useful": 6, "cool": 5}, "user_id": "wNqwKWaRjClmcKsoJJRFow", "review_id": "fVOI-qEPc86hfJgnI09xgw", "text": "Despite the Union Jacks and other signage of British Origin, you will never lose yourself and think you're in a London pub. However, this is a fun lively place with an orgasmic selection of beers and a wonderful atmosphere. It will NEVER be London, but it's about as close as you'll get in The valley. HIGHLY recommend it!", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 5, "date": "2008-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "wiEfzNFLpSEEGfP87PSs2Q", "review_id": "f4pkL5esYG-PeAw4pm5prw", "text": "I've been frequenting the George and Dragon for a little while when I pass thru Central Phoenix. The food is excellent, especially the cornish pasties. I enjoy the atmosphere, darts, and booze but I got to say that the service is hit and miss. There are 2 servers that are polite and most the rest aren't happy to be there. Sometimes there attitude goes hand in hand with the quality of service. I will continue to eat and drink there though the service is hit and miss.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 3, "date": "2011-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F6WEkj_t1y_cOwTVyqZhPg", "review_id": "8E0R0ZO7df4Mq5Q7VPzedQ", "text": "If you're looking for a good bar in the downtown area this is definitely the place to be! Their massive selection of beers and cocktails is endless. Although their food is not my favorite, the service and selection of beverages makes up for the 'meh' food. \nI have met the owner a couple of times and he definitely is a good time, I love how interactive and attentive the bartenders are and even on their busiest days, they find a way to accommodate you. \nDuring the winter/spring time, you can grab a nice refreshing drink and make your way to the park festivals available at Indian Steele Park. My favorite drink to order is the cucumber vodka and soda. I think this is the only bar that has cucumber vodka, anytime I've asked for it elsewhere I get a crazy look. Their TV's around the bar area are spaced out nicely and the outdoor seating is awesome during the fall/spring months.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 4, "date": "2014-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jcY4s6J7NdRRi-prS-LQ3Q", "review_id": "nfYnHUD-hdBjQJjn3ztvXA", "text": "The quality of the food was excellent, the server was very on top of it with getting our drinks and order. It was loud, but that made the atmosphere fun to me. The only down side was the wait to get in was at least 20 minutes to a half hour, but maybe it's to be expected on a weekend night.", "business_id": "cjUmPLRT43wN9Z87A9BOpg", "stars": 4, "date": "2011-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OS63iMlPfjGOaz7gO-t5RQ", "review_id": "SGfU6tdPC_228IRJOHz3qQ", "text": "Brunch burger was great service took long seems to have not enough waitress's, but food was good", "business_id": "cjUmPLRT43wN9Z87A9BOpg", "stars": 4, "date": "2015-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "cZEVW_x0NKI69Xm55tknBg", "review_id": "prGmMcqeqO3KiqJuoGU6vA", "text": "I love this spot for happy hour. The beer prices are great as well as select apps. I am very fond of just about any stout or porter that sonora brews as far as the others I can't say. I have friends that like some of the other selections they have. A decent micro is hard to find in the southwest but this guy has been at it for a while and does a good job. The food has always been good. They have your typical bar menu as well as some better food choices. The patio is great as well. I have also found the service to be no worse than good!", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2008-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8LAf67lQTjtsS98E55MYrg", "review_id": "kKl2uP_R4MypiBmBrNsPhA", "text": "I have been going to this establishment for years and I still love it. The food is fair bar type food. Although they have changed ownership and brew masters they still make good beer. I have to say though the former brew master had a wider array of beer and was a better brew master. The new brew master is really good at IPA's which is good for him since they are what is in demand at this time. I so miss your pot belly porter and your midnight porter.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2011-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tXhlRAnR3_GoWvewfQni4Q", "review_id": "XgVLsTpzZetaBSGRAu-y7Q", "text": "Sunup is the best brewery no one knows about. It's been there forever but we all just drive by not even noticing it. I go about once every 2 weeks. The beer is good the seasonal beer is amazing. But I don't go for the beer or the food, I go for the staff. The servers and bartenders are genuinely friendly. I know that one of the bartenders, Emily, recycles all the bottles. \n   I recommend ordering the wings and a seasonal beer. Sit at the bar and chat up January or Emily. I don't think you'll regret it... I almost forgot Mollie is awesome.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 5, "date": "2014-06-24", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 5}, "user_id": "jdeNI5TTTuM6mj3HTgstRA", "review_id": "7j8PSPtvLykkAsuEIRnViw", "text": "The bacon and blue cheese fondue burger with parmesan garlic fries is my favorite burger/fries combo anywhere. Ever. Without rival. I find a few of the mainstay brews to be rather pedestrian (I'm looking at you, Light Rail Cream Ale), but their strong ales are great to drink with such a hearty meal. If there's a cask IPA, you NEED to go for it!\n\nService is still awesome, and there are two separate rooms to dine in, as well as a patio. I prefer chilling at the second bar while watching some sports. \n\nTheir happy hour is still legit, and IIRC still all-day Sunday. $4 pints is OK with me for local crafts, and while I still am not a fan of every appetizer they have, they've definitely improved while staying at a very low price. Definitely a great supper spot for me, and sometimes I have so much fun I catch a mighty buzz from day drinking. While I wish that Uwe guy would bust out with more imperial reds and coffee stouts more often, Sun Up definitely has what it takes to keep me coming back.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2015-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VURvHke7yvGL673wgcp9nA", "review_id": "XfIax05c_hFtFpmboinykQ", "text": "Tonight I met 20 new Meetup friends at Christos for dinner.  What a great experience.  It's always challenging for a restaurant to handle large groups - but especially large groups with individual checks.  Our Service Team was outstanding and it was seamless that they were handling such a large group.  I had the cioppino with a variety of seafood that was clearly fresh and yummy.  The complimentary soup and bread were memorable on their own.  The only disappointment was the extremely strong fresh pepper on the salad.  The lemon cake...to die for.  Dinner was delizioso.", "business_id": "3CSaqRNvYg7ZdN2zwxwzVw", "stars": 5, "date": "2014-08-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "7geT4TAPqDBYw3X8iAKjjA", "review_id": "qNHCPuP4tXS9grg-X7rPXw", "text": "One day we were really bored and wanted to try a new gay bar for an afternoon drink.  This place was close to another favorite bar of ours, so we figured we'd give it a try.\n\nWe walked in and Jakob, the bartender, was very friendly.  He instantly remembered our names.  He also makes the best margaritas.\n\nWe have returned a few times since then, but Jakob only works weekends.  The crowd is friendly and the drinks are strong.\n\nOverall, this is a great neighborhood unpretentious bar.", "business_id": "lF1xl8uiYRSLCibhb31sew", "stars": 4, "date": "2013-08-03", "type": "review"}
{"votes": {"funny": 26, "useful": 20, "cool": 21}, "user_id": "C8ZTiwa7qWoPSMIivTeSfw", "review_id": "k88tG1o_7ZYBilSZoOyzrg", "text": "Picure it. Roscoe's. Saturday night. 11:00. Deadsville USA = Crabby gay ass bartenders. Me and Rickie? All pumped up. Having fun. Celebrating a fantastic evening we had with CeCe Peniston earlier with a couple beers and a round of darts. I won't tell you who won, but he is NOT a fashion designer. While we did have fun, the bar staff was rude, rude, rude. And when you're not even cute, really, there's just no excuse ladies! Sorry I put my Corona on the pool table. I'm sure that's NEVER happened before Mr. Passive Aggressive bartender with the oh so contrived messy hair! Drop the tude and lessen the hair gel.", "business_id": "7srDFwPPnzBaQoPW55Dc8Q", "stars": 2, "date": "2008-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qKqvVFP6PmxlS7-u0xjs3g", "review_id": "-CUQ8JHomQiBKQa2kvxyOA", "text": "We can debate the \"Dive-bar\" Vs. \"Pub\" on this one, but if your looking for quick bar food and good prices on drinks then this neighborhood bar is it. It's friendly, fun, and a good place to stop of and hang out for a bit on a hot summers day.\n\nWorth a stop if your in the area.", "business_id": "s8KRwTTrQDSKrS3hOjwYLw", "stars": 3, "date": "2014-08-06", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "3uU_6L8GnFOHTsO4I3oedg", "review_id": "lnAJP8S9pD-ooedZYsYKHA", "text": "Best Dive in Phoenix. Good people & drinks.", "business_id": "ntJAKLAq0cXzzdFgPoo0Iw", "stars": 4, "date": "2013-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "D9aj6AjCyLp-zp8fozL8aQ", "review_id": "cq4ZcJwr-MUYgxLuWElA2g", "text": "PCG is the restaurant by which I judge all others. PCG is totally dependable, always excellent. Service is always good, food excellent. i have eaten here probably 20 times and have never had a bad meal. \n\nAlthough the food is not \"challenging\" in that there are no weird flavors or textures, if you want a great nouvelle American meal for a reasonable amount of money, you need look no farther than here.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 5, "date": "2007-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pEVf8GRshP9HUkSpizc9LA", "review_id": "P2EGXLIDfFrnfuZGpWVGJg", "text": "Nice, neighborhood place...wouldn't suggest people go out of their way to check it out, but good if you are in the neighborhood.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 3, "date": "2010-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xOl9XXCTHvvEAmorU83myg", "review_id": "i8-SvTbIY9mlLXNvvJCU6w", "text": "Continue to be impressed with the very creative weekend specials....a really good restaurant with a unique neighborhood vibe.  Not pretentious, just great food, served well.....highly recommended.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 5, "date": "2013-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZJnJvJ8DNWyYbG20OsM6Bw", "review_id": "3UEk_83NrrOlEoJXHVGN8A", "text": "Excellent gourmet-level fare served up with friendly and professional service.  Great business lunch spot!  Everything we had was tasty and spot on.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 4, "date": "2015-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wdByEB9mGvH1WLjYeMb4xw", "review_id": "321Wmfi4kTZPNN1ir6_2uw", "text": "Tasty local grub. Not cheap but fresh and delicious.", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 4, "date": "2011-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Jsj_4S-Jee7gKanYIuMSBQ", "review_id": "iE4GqpUlg_1oirq__2MzPw", "text": "Great place for lunch!  There is a cool market with wines and foods that are a true treat.  This place is old Phoenix but still hitting it out of the park for lunch.  I would love to come back off of the clock to have wine and access tot ehir menu off the cloce.  I look forward to my next trip back.", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 5, "date": "2014-07-02", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "5TgO3sLlKdIlZXgP6U27NQ", "review_id": "ep6IOSGNHY_J1a0tPG5Dog", "text": "The magic of Christmas is over, but the magic of the Swizzle is not!   My little neighborhood watering hole is always a good time and the bartenders make you feel at home.  Always highly recommended.", "business_id": "mgllPJA6NQXlJurFWAkqQg", "stars": 5, "date": "2014-06-23", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "8rHnrPtIi1LC7KI2X9eIBA", "review_id": "02NvBadjV0TVdnAAAi_U7Q", "text": "Armadillo grill is usually a place my\nCoworkers and I like to out out together after work. The spinach dip is great and the servers are nice. Recently, I tried joining them at the bar and had the worst experience, I will not be going back. The bartender was very rude to me and after six times of asking for a menu I had to flag down a server to get any help. It took 2 hours to get an order of wings and I was very unhappy with the service. Armadillo is great if you go during happy our and sit at a table, but I would never recommend going to the bar.", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 2, "date": "2012-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GSuh2QXnaZIWr4DgFldNvQ", "review_id": "jNMRfuj2T7jOVtVHibGxyg", "text": "This place is the best for everything , food , customer service , and just too notch !! The staff is exceptional and they always make me feel welcome ! And are very personable which I love ! The ranch dressing is the best ever and the burgers and hot wings and chimichanga and also the calamari are all to die for !!! I love the iced tea as well ! Best ever ! This is my favorite spot to go period and I've tried a lot of places.", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 5, "date": "2014-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 3}, "user_id": "90a6z--_CUrl84aCzZyPsg", "review_id": "KUI6-fcbhqSmEG5uisKvCQ", "text": "Tried this again recently and really enjoyed the ride.\n\nThe atmosphere is lounge-like and upscale, the tunes are perfect, and the service is top flight. I don't  appreciate going outside the bar to smoke (no patio), but overall it is a nice place to hang out in the Biltmore area.", "business_id": "peA3F-PnIfijYr8HuG-A-Q", "stars": 4, "date": "2008-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rRiBDH2U_IlydXTh2a81Rg", "review_id": "_IQJJmvlAta533jPNL1dzg", "text": "one of my go-to cocktail spots in the biltmore area.  this place has been here forever but somehow manages to still maintain that \"cool\" appeal.  they have great cocktails and their weekend djs always play a good mix of songs.  the darkly lit interior and low-seating definitely help create a timeless feel when you're there. \n\nmy normal drink is a moscow mule, but the sweet little sixteen and the blackbird are tasty as well.  they also have some upscale bar food if you're interested in snacking while you throw back your 4th old fashioned.", "business_id": "peA3F-PnIfijYr8HuG-A-Q", "stars": 4, "date": "2013-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SKiYEYqlkAlbPdFPwZ5ymg", "review_id": "p2zz2jm8Naa4QljLZTfEqg", "text": "Loved the atmosphere and the spicy mandarin!", "business_id": "peA3F-PnIfijYr8HuG-A-Q", "stars": 5, "date": "2015-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "jer3FVxRRuCLLQowhLpcag", "review_id": "7a-LjsKuAonH23d4hEGNuA", "text": "First off,  I went here during restaurant week.  Restaurant week is the greatest thing in the world because you get to eat at places like this for $30 a plate instead of the standard $50-$60.  That being said... this place is fantastic.  The meat is cooked perfectly, the french onion soup was great, and the creme brulee was the best I've ever had.  I've noted a few people say their meat was cooked improperly... I've never been one to send back food but at a steakhouse of this caliber, do so at anytime.  That being said.. please no wtf a medium rare steak looks like and what a medium well steak looks like.  \n\nWill be back.... during the summer when they have essentially the same deal if you dine after 8pm... otherwise the bills around here tend to look like car payments.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2012-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "8u1S0fMFpa8R4UihJuo7XQ", "review_id": "OkBA5U8ObxDYxHTJkP-aLw", "text": "High quality in both service and food. How do they not have 5 stars? Some people are just too picky... I'd hate to see how they act at Chili's. \n\nAnyway,  came here for a work lunch today and could not have been more impressed. The size of their shrimp for the shrimp cocktail was more than adequate,  they were fresh, and the cocktail sauce was deeelicious. Had the Mediterranean salad which I also thoroughly enjoyed. They were very generous with the servings of the chicken on top- it was hot, moist,  and sliced thin enough to be enhance the salad but not too thin where it was skimpy. Loved the pickled red peppers and heirloom tomatoes as a twist, too. Feta was fresh and the dressing was great.  \n\nDessert: coconut cream pie and creme brulee. Both were fantastic. I don't normally like coconut, and I had 2 helpings! \n\nService: great, great, great, and even had a nice chat with the new manager. \n\nScottsdale location is closer, but I'd definitely like a \"next time\"... my husband's birthday is coming up!", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2014-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "el_BsZHqhCZK_VG27TyPBA", "review_id": "iHsauxbtMT7FN740tMVqog", "text": "I came in for dinner last night, had a good experience. The place was busy but still had a few seats open at the bar and a few tables open.\n\nI ordered the grilled pork porterhouse, with the green chile mac and cheese and baby dill carrots. The sides were nothing special - the mac and cheese probably could have used a little more cheese or chiles, but the carrots were about what I would expect. The pork was excellent, and came with a side of a weird blueberry applesauce which was very good.\n\nFor dessert, I had a carrot cake, which wasn't on the menu but must have been a special or something. To be honest, it didn't look that exciting on the outside, but it actually tasted very good. One of the better carrot cakes I've had.\n\nSeems like a friendly place, a good place for either happy hour or a meal.", "business_id": "rVUEZpHQfWI_3kt0lBwaxQ", "stars": 4, "date": "2013-06-29", "type": "review"}
{"votes": {"funny": 1, "useful": 6, "cool": 2}, "user_id": "9ebaAGLVIgGKpDLFwmvaiQ", "review_id": "4zMAFaOsyI2rZ57UBP3OEQ", "text": "NASTY! Gordon Ramsay would have ripped this place apart. I'm imagining that's why there were only 6 people in this fairly large awkward restaurant on  a Friday night.  Completely outdated overpriced food. $26 for the grossest chicken Francese I have ever eaten. What a ripoff! Also their house wine is $10 a glass ( barefoot brand) will never return.", "business_id": "vvA3fbps4F9nGlAEYKk_sA", "stars": 1, "date": "2013-08-10", "type": "review"}
{"votes": {"funny": 9, "useful": 10, "cool": 10}, "user_id": "4UUIpbOTPmu43wuC2aSGkg", "review_id": "nt32lve8xdZYeY7oWGNFKQ", "text": "4.5 stars\n\nI had my first date with Jessica F here! It was supposed to be a big group (yeah you FLAKES) but it ended up being just her and I and we were treated like ROYALTY!\n\nLet me get some disclosure out of the way: Thomas was our server, and he is also a friend of mine. That being said, he was professional and courteous. He definitely had his \"Top Notch Waiter\" hat on that night. You probably wouldn't have been able to tell we are friends.\n\nWe indulged in some of the wine specials for their happy hour. Each glass I had was only $6. We decided to try the escargot (nice and garlicky), the pate (delicious) and the frites (they were frites). \n\nThe main event of the night for me was the Beef Bourguignon. Omigosh, friends! I dream of this dish to this very moment. The beef was perfectly cooked and the burgundy sauce was FANTASTIC. WHEW! Did it just get warm in here? I was so full and happy after that amazing meal!\n\nI will most certainly return to Sophie's in the hopes of giving them the 5 stars I'm sure they deserve!", "business_id": "PuHucejs4LG3hSXnrwi9-g", "stars": 4, "date": "2010-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "BgrClRsZ0LoC1NrCtNaTNQ", "review_id": "b2nMc6nQXTDqKumdfE3nhg", "text": "Swing around the loading docks behind the Dollar Tree, or head down the service corridor from Wal-Mart and you will spot a charming lit sign that reads BAR. Once inside, before your eyes even get used to the dark, you are greeted by the lone barmaid. Just put your hands out in front of you and follow her voice to a cushy brown vinyl seat till your eyes adjust to the neon and the bright white of the ice hockey rink that's separated from the rear bar by double-paned plexiglass.\n\nIt's a unique experience to enjoy a craft beer while amateur hockey players smash into the glass, or while watching the slumbering pace of the Zamboni machine as it sweeps in between periods. The bottled craft &import beer selection of the Ice House is very impressive and nightly specials can be super cheap. And it looks like they've just added several taps. \n\nI always get great service from the staff, usually a solo barkeep. Sometimes they even put out hot dogs or other munchies, cooked on the patio. Whenever there is not a band or comedy night going on, it is quiet enough to have a conversation with someone from across the room, or to hear the TV audio -- take your pick from continuous int'l hockey coverage or classic movies /cable dramas on the two sets. Feed the jukebox, it's got some killer classic rock cuts.\n\nThis charmer of a dive is one of the Arcadia area's best kept secrets.", "business_id": "yb17xHvhDJthJGS10uhFeQ", "stars": 4, "date": "2012-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "KnutNOkfu5t1XA8rEhiq2Q", "review_id": "uGi3lzBdKmEvSBoBv5RTDA", "text": "Met up with a new friend and an high school classmate there last night. Didn't feel like I was in Phoenix, which, no matter where you live, on occasion, can feel like a really good thing. More like being in Ess Eff...very urbane. Their crostini were great--brie and apple (not super imaginative, but still good), and ricotta/fig/pistachio--excellent. If you go on a 110+ day, be aware that their a/c system isn't up to handling it. We sweated it out last night until enough people left to help cool the place off. We're new to Phoenix, so we'll be trying the other La Grande Orange eateries on that corner.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2008-07-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "qYvz3hKtDlPGcU7r03lWyg", "review_id": "mJlXmVJyHMm0-Yn7PpXOpg", "text": "Danielle and I decided to check this place out after it was highly recommended from one of the guys at the Montelucia pool.  It's a good thing we did since it was pretty awesome!  Cute lil place...very romantic if you were on a date.  The menu is very simple ranging from paninis and salads.  Since Danielle and I wanted the same two paninis from the menu, we decided to get both and split it.  We ordered the mozzarella/basil/pesto panini and the chicken/mozzarella/spicy mayo.  We loved both and the side salad that accompanied the meal was delicious.  I also highly recommend the mimosa with the fresh squeezed orange juice!  It's AMAZING!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2009-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ptu9rQnWLEzll7O2bNj0Xg", "review_id": "EjQ-lznVjOEd6u8R_zz_kw", "text": "Postino Winecafe remains very close to my heart. In a foodie way, too.\n\nMy boyfriend and I came here on a hot humid Thursday night. The lightings were great to bring a date or to catch up with a friend and there were fairly good amount of room noise to keep your conversation on the privacy level. The service was just lovely. Oh, the little \"Gum\" note-card was utterly cute. You can either spit your gum on the note-card or exchange phone numbers. :)\n\nThe first time I visited Postino, I wanted to come back for more of their bruschettas. My boyfriend and I shared the various bruschetta platter: \n1. Brie & Apples with Fig Spread - He quickly picked this because the first time he had it became his favorite and was confident that I would absolutely love it, and I did -- I loved the sweet taste of the fig with the crunchiness of the apples. yummm! The composition of the brie, apples and fig gives this bruschetta a sweet taste.\n2. Fresh Mozzarella with Tomato & Basil - Since we had 3 more bruschetta options to pick, we went for something light and simple. Everything was fresh! The combination of the mozzarella, tomato and basil was simple yet blended wonderfully together. \n3. Smoked Salmon with Pesto - This was probably my least favorite out of the four, but it was okay. Although the capers were mouth bursting with favors -- which was delish, but it didn't do much justice for the slight fishy taste of the smoked salmon.\n4. Ricotta with Dates and Pistachios - By the end of the night, he declared that this became our favorite bruschetta, evar! I think they toasted the dates a bit or something of that sort, but it was perfect. The pistachios weren't dry and the ricotta wasn't an overload. All three components made it tasted like sweet heaven in your mouth. When I think of bruschetta, I immediately think savory, but there's nothing wrong with a dessert bruschetta, right? I think not. The texture of this was just perfect. No complaints here!\n\nHe and I tend to order enough to feed 4 hungry men when we dine out. So we also called for the Panini -- the Vegetarian Panini on ciabatta to be exact. We had the side salad with crumb goat cheese. Meh, I didn't care much for this panini, maybe because I was already full off of the tasty bruschettas!\n\n\nThere's a $3 charge for Valet. But it's all worth it!\nI am definitely coming back for their bruschettas once I fly out there.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2010-08-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "TL9z1PDMhLuByf_x08VZ_w", "review_id": "C36hE1A-gQUn1niTiYF1Tw", "text": "Who hasn't written a review on this place?  What's another 5 star review going to prove? LOL\n\nAnyway, everything on here is true.  The bruschettas are simply heavenly.  It's as simple as that.  When you combine locally baked breads, with the best toppings around, you just can't go wrong.  The bruschetta and bottle of wine special can't get any better.  Their soups and cheese platters are yummy too.\n\nBeware, parking stinks but they do offer complimentary valet during limited hours.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2011-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8U6I0GuBasZa9rapy2H-8A", "review_id": "w8tpt4mg3nlYXoG7LC6cVg", "text": "Great food, great Sangria, great live music, great vibe, great service EXCLAMATION MARK. Overall it was a great way to spend a Sunday afternoon.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2011-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6RYvMmECRELfhTY3mUAFJQ", "review_id": "YUyh8HQDdwvvg5wXE3Znog", "text": "I was visiting a friend for the weekend and didn't have much time and wanted to go to my favorite places that I've already tried and liked.  She suggested we try Postinos but I whined because it meant we would miss one of the other places I'd been thinking about for months.  I'm so lucky she pushed the issue and took me here!  I don't even remember those other places and want to visit her again so we can eat at Postios!\n\nWe were there before 5 and did the $5 wine special and a bunch of the bruchettas plus a salad.  All of it was delish.  I didn't want to share!  I will say the food combos were fantastic but simple enough to try at home.  I grabbed a take-out menu and brought it back to Los Angeles and have been making my own bruchettas that taste pretty close.  My whole family raves about them.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2012-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5kGY5JRYQgMFWzMgdLFS1Q", "review_id": "Oq7nMKcvtAVKMjVUbEGhUw", "text": "Bruschetta is amazing!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2013-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "hn_DclKLzdxABRGGAuqKgg", "review_id": "dSsrZhXVZiqVh_a9jfAdFQ", "text": "Beautiful restaurant, with a friendly staff. Extensive selection of wine, and reasonably priced beer. I'm a big fan of the happy hour specials.\n\nThe bruschetta is delicious. My personal favorite is red bell peppers with goat cheese. I really like that you can pick for different toppings for a single serving - it's a great way to sample all the different types of bruschetta. The bellinis are also really good if you're not in a beer or wine mood.\n\nI really need to go back and try more of the menu. Can't wait!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2013-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1g8Crb6WGQUsA2l2X3yVGA", "review_id": "Hm-8jwgqLfyqGkKS_-AuHA", "text": "Fabulouso!!!!!!!!!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2013-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "O8Uz_WbwYVawW_PrFwCk3w", "review_id": "_ySR7eZLsAxZETOD4A0JJQ", "text": "Exceptional restaurant, great atmosphere! Can get busy on weekend evenings but otherwise a relaxed modern feel with plenty of room to invite friends for dinner. We love the Apple+Fig bruschetta paired with your favorite red wine and we are greatly looking forward to our next visit!\n\nA Favorite for Brunch/Early Dinner in Phoenix  - 4.25 Stars!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2014-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8JH9U2b0di9qqMUw_NRfMA", "review_id": "em8L_Wpp7cA70HiZexNM2g", "text": "Coworkers and I go here all the time for a quick lunch or happy hour. Great atmosphere, great service, great food.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2014-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MkpMDl_T9PcV1b8GG25VKg", "review_id": "wZ53Er0ijTH1i-zawv4wIA", "text": "LOVE this place. The food is always fantastic! Try the bruschetta board for sure, and usually the seasonal option is great. We went there last night and the service is simply amazing. My water was full the entire time I was there and the food came out very quickly. We arrived around 6pm and they were decently busy, but we didn't wait for a table which is nice. We have been to the Monday/Tuesday 8pm special before and that gets extremely busy. Make sure you arrive a little before 8 and you will probably wait a bit for a table but it's worth it! A board of bruschetta and a bottle of wine for $20... can't beat that anywhere! Maybe one of the best aspects of this restaurant is that they do not upcharge bottles of wine 90% like many others do. The bottle is 3x the glass price, pretty great if you ask me!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2014-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cqGfzsEKJzcZyGNDu2svNQ", "review_id": "wIl8vw2mon8o0oiZ-vdbpA", "text": "Its a nice place. Go on week days for discount on drinks. They have got really good collection of wine . i love the decor and outdoor seating with candles on every table.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2015-06-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "wj9wbBQPOQ9RG44d1XEl1A", "review_id": "fVbbIXtGTidzpid9X7HB7Q", "text": "This place has an amazing selection of wines and he bruschetta is delicious! We ended up ordering a bottle of wine and two bruschetta platters for 3 people.  The white bean one was delicious! Definitely one of my favorites! The apple and Brie was on the sweeter side, the mozzarella and tomato was also good, on the simple side.  The bacon and tomato was a superb flavor and the prosciutto and fig was also good.  I think the one with pesto was also wonderful and may have been my second favorite! The bread was soft, wish it was a little crispier but it makes for easy eats cause it's not hard to bite into! They also cut each bruschetta into quarters so it's easy to share all the different ones! Great for a wine night and bites where you just want to hang out and chat! The atmosphere is also good.. Very dark and candlelit inside and there are misters on the outside to keep it semi cool!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2015-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IF7OP38zqk8Du2F6Mm53PA", "review_id": "VCxPlCgyVRSo2PFN_PSOEw", "text": "Classic dive bar in the east coast sense of the term.  Not many left in the world.  If you like wings than you have to stop by at least for a taste and the rest of the standard bar food is rotated as daily specials and are very generous and filling (especially steak night!).  Lots of regulars who appear to be very welcoming and deferential to newcomers (i.e., giving up bar stools or tables when needed).  Always say Hi to Julio at the grill - he's been there as bartenders have come and gone; then there's always JT himself (DUH!)", "business_id": "qz4ZOcv-840UjfCEYI4qZg", "stars": 3, "date": "2013-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UdFFbZnPUPZMrZyx7cb0Tg", "review_id": "ma_0XVJV5UpP3hvWkyrItw", "text": "This place is great!  If I want breakfast (served until 2pm!) it's hard to come up with something that sounds better than the Brass Rail.  It's cheap and it's straight forward, delicious breakfast!  I've had the eggs/bacon/hashbrowns/toast meal, which is hard to beat, and the pancakes, which I scarfed down without giving a second look a the appetizer that I had ordered (which was also very good).  What more could you want than delicious, traditional breakfast, very low prices, and friendly service?  Try it!", "business_id": "RIeWXLMHZQlYprYt1x2f1w", "stars": 4, "date": "2010-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LL5VZd-Hy3BQrLUypv6fNw", "review_id": "5BwZuOP4aKzVahcxqwNisA", "text": "Big Daddy's is always delicious.  My favorite is the Time Out turkey burger.  You can order it with just about any topping, as with all the burgers.  I get it with jalapenos and American cheese.  The buns are soft yet grilled so you bite in and it smushes down with your burger just right.  My boyfriend enjoys the ribs, sandwiches, chicken strips, fries and whatever special is on the board.  Another bonus is the new gaming tablets from Buzz Time.  We played some free poker with others across the bar while we ate at our table.  It was really fun to have a game at the table while eating.  We plan on doing the Trivia next.  The beers are always cold and there is a good selection on tap.  Employees are friendly, prices are low, and you might even spot Big Daddy himself there mingling with the customers who are also really easy going and welcoming.", "business_id": "rwT9wCyXNATA36yqcb4JSg", "stars": 5, "date": "2014-07-26", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "iTMXsybE3KB0kALbjmF_Eg", "review_id": "z8Yw4u2nAgyI_Qv6FQ78oA", "text": "Food was good, service was good, price was rite. They had this raspberry mayo for the sweet potato fries..really creative and yumny. Lots of chicken wing sauce choices...i like to try new things. I will go back.", "business_id": "F-ykHfGY9lWr12OJ_Ofy7A", "stars": 4, "date": "2011-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xxG66VFJ3y3DOrgrS98e7g", "review_id": "cMeNy_2CxagRuG9y9ds73w", "text": "Ate here with a friend because we were starving and it was easy. ...not so fast. The place was filthy, wait staff ignored us for 15 minutes literally...I had to do the \"hey miss can we get some service thing\" when she began helping people that had just sat down.\nThe food wad meh and frankly I couldn't get past the dirt factor. ....tables, floor, etc.  Neither one of us could continue.... her", "business_id": "_BU867oRCLZnDIRmg7S6Wg", "stars": 1, "date": "2011-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OBIytx-sgiS82WbI7De72Q", "review_id": "1TfzvXfPzXE4q6dmg4SwNA", "text": "Not impressed.  Ordered medium-well (some pink) patty melt and fries.  Fries were not fresh but frozen junk and burger was dripping in so much blood the bread was soaked through.  Lost my appetite and left.", "business_id": "kvxrjOmicwb2njvXOJsZRw", "stars": 2, "date": "2015-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9Tnds0bhPScGEBXbKn4HqQ", "review_id": "vAMdPZ_s8TxXawv8Qa3u3w", "text": "The service was excellent and we felt very welcomed.\n\nI really enjoyed the salmon picatta. When I go to an Italian restaurant, I generally order veal picatta to compare it against other Italian restaurants. This one was up there with my other favorites.\n\nMy wife had a butternut squash stuffed shells dish and it was very good. This is a good dish for vegetarians.", "business_id": "jq_YnMQjcArdBWuwRospFg", "stars": 5, "date": "2015-08-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "jE5xVugujSaskAoh2DRx3Q", "review_id": "9csINGZ6xQwsROmvYEaSHw", "text": "This is the definition of Dive Bar.  Small selection of very common beers, no food except when the hot dog truck is outside.  I come to see Rocket88 on Sundays, not for the venue.  Good Blues music Sunday nights.\nThe AC is very good and parking is easy.  Not the nicest part of town I have been too, yet it feels very safe.", "business_id": "f_leeIRar8uNCkk5sAmHRQ", "stars": 3, "date": "2014-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NUiVlWhZ2-q3qHsMCMZ5sg", "review_id": "w5JS5whTJ6ok_vQBcGI35g", "text": "The best part, was the music. From what I understand, it is under different management? I lost a big part of my appetite when I received my order. Why? The plate was dirty, underneath, on the back of the plate. I could feel it when I took the plate. It looked like the chili had been spilled & only the front off the plate was washed.\nThe hamberger bun was soggy on the bottom, the hamburger was fair. Would I go back? Probably not.", "business_id": "JImJictLIE48_O1z-l2TGw", "stars": 2, "date": "2015-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d39jwWpRWRD9GusB2Ixakw", "review_id": "R7x8pPvpuFyG_4laDPqRsQ", "text": "Love this bar. Mike is the best bartender here! Karaoke on Friday nights and awesome drink specials. I always have a blast here!", "business_id": "vFJmFFfPVhHkC3bWOeZnNA", "stars": 5, "date": "2014-07-03", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 2}, "user_id": "0qbfCsqgn7ol9m9CgAJ3WQ", "review_id": "7l9qtoxVVdl-cRDcUAVqIQ", "text": "Ghetto biker bar. Okay place to hang out if that's what you are looking for.  I don't like how the shower curtains they use for bathroom doors in the lady's room touch my knees when I sit on the toilet.  Gross.", "business_id": "-xLwGUmmyKgsTtFOOXzjeg", "stars": 2, "date": "2008-07-25", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "IT6B2emjeGT4FRSEMGZ-LA", "review_id": "nBU7R3JGtvzotNEe-k9leA", "text": "They over serve.", "business_id": "-xLwGUmmyKgsTtFOOXzjeg", "stars": 1, "date": "2014-06-27", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "4E_nPWw89FLFHdNsEgMH-g", "review_id": "MRXEdiTfnULBvoTQ-oTYug", "text": "I danced for almost 4 straight hours!!! Talk about crazy. The music was a great mixture of R&B, Hip-hop, country and pop. I mean it was something for everyone. They have some awesome drink specials on Saturday night in which most drinks and beers are either .50 cents or a whopping $1.50 until 11pm. You can't beat that! I will definitely be coming back to shake my groove thing and pay the price in the morning as I am not the young tenderoni I use to be. (ouch)", "business_id": "gOlJQuE3WYeMgXXDKYfdeg", "stars": 3, "date": "2012-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "_LGc_12v8LaaOdz0mdYkXQ", "review_id": "_jUcN9lvzWk2KThGLyhisg", "text": "Tucked away nicely in a strip mall across the street from Paradise Valley Mall, its' almost hidden door keeps out most of the riff-raff.    So, what you end up with is a solid neighborhood bar in a pretty nice area.    Large, enclosed smoking patio for those so inclined, fair drink prices, assorted board and table games, the largest Jenga game I've ever seen, darts and especially Golden Tee. All of these things add up to a pretty decent place to go while away a couple of hours.", "business_id": "1rOQVIlUlLBcf1EDj_n4Vw", "stars": 5, "date": "2012-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0N0ngSQ8Njxfuvdxm1RpFA", "review_id": "XdfSO4yIZZm61LEONRTaSQ", "text": "RJ's has closed and is now Over Under Sports Grill. New ownership, spiffed up interior, new menu.", "business_id": "W_ZcIQiI6waQu1UZxXnKbg", "stars": 4, "date": "2011-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DhmTnRzhuzOLgo_RdQcYtA", "review_id": "BJ0QK-CHUs94-UFK6ZlWAQ", "text": "I like their food menu but the service wasn't great and their happy hour was seriously lacking selection! Nothing was very clear and our waitress seemed as though it was the worst day of her life and waiting on us was the cherry on top. My girlfriends and I won't be going back for happy hour.", "business_id": "SgGINtDKQgoXoAnQgrDKDg", "stars": 2, "date": "2012-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aJKkRL5b1EOxmsyEGDilAQ", "review_id": "vgsNvAYxaqmNc5yVbQCMcQ", "text": "Have been eating at this location on Tuesday nights for over a year. Tuesday was wing night and wings were 30 cents each for a limited time during their anniversary celebration. They eventually raised the price to 49 cents each. Prior to this celebration period the wings were a reasonable medium size. After the celebration period and when they increased the price, the wings were very small. I even joked to my waitress that it must have been difficult to find all of these pigeon legs. On one occasion I had a wing that was only a small piece of meat. Our group of Tuesday night eaters have since quit going to Native wings because of this change. Their other menu items are good, but , when you bill yourself as a Wing House they need to be the best item on the menu. By changing the size of the wings they have cheapen the total restaurant chain.", "business_id": "SgGINtDKQgoXoAnQgrDKDg", "stars": 3, "date": "2015-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "tPIz4JEMQ0oS3xEvUutDeA", "review_id": "GaQGR9vt_7IvYc4WZDwkaw", "text": "A great neighborhood spot!  I often pop in for the after-work happy hour and fell in love with the atmosphere, the great wine and the staff.   I have even been participating in their monthly wine club -- a great way to expand your wine repertoire. When the weather is cooler, grab a seat on the outdoor patio for some amazing sunset golf-course views.   Be sure to try the spiced nuts!", "business_id": "Our6bzte5W1wlIeOu9luug", "stars": 5, "date": "2014-06-12", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 1}, "user_id": "LPz0dNf2FbHJ0Hzz3lWKHA", "review_id": "Id_rumtTKYbodwYETc0f3Q", "text": "if you're on social security, or your kids and grandkids have left you alone for the weekend ... you should bring your AARP  card... yes you will still have to pay a $5 cover ..... but.... dont worry the smell of the B.o., Vicks,  and Tacos will surely either send you to the promise land or Revive the dead", "business_id": "Lk-FP6yxYRTcU52SaTx2EA", "stars": 1, "date": "2014-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3EcKgWGt3u0cEE6qMfiKxA", "review_id": "ekz0UL-gDQMFSzzT4tswMw", "text": "Amazing! Delicious! It was our first time here and we were very impressed! We came here for our anniversary & had an amazing dinner!    Everything we had was delicious and the staff was exceptional! Will definitely be back! Don't be fooled by the outside or the location- the inside is superb!", "business_id": "S3FhtwXuiGMlGdBNtmiiSQ", "stars": 5, "date": "2014-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tr67vqpaw9YdXG1ljOcVvQ", "review_id": "V_0eF_c3CByZ4R0OXoaPCQ", "text": "The pros: friendly, personable service\nAmazing fries and fun atmosphere\nThe cons: can be a bit expensive \nAbsolutely not healthy and very limited healthy options.", "business_id": "e0vubCKi8KD8zC2C6FdbuQ", "stars": 4, "date": "2012-07-05", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "-W5cmxmNtDeLiJ4c_Zxojg", "review_id": "yIlOX6gmRgh4ZswP5pT8DA", "text": "What a joke. We were seated right away, waited a minutes for our server who walked up and didn't even say hello to us. He asked what we wanted to drink came back dropped the drinks off and walked away without a word. We wanted to order an appetizer but were never given the opportunity to ask for one.\nWe left , talked to the manager and he offered to sit us with another server, but at that point we were done so we left. Terrible service, and the washroom was disgusting. Never again.", "business_id": "e0vubCKi8KD8zC2C6FdbuQ", "stars": 1, "date": "2015-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "mejx9Ya_tOvFRBosjPqfKQ", "review_id": "CXr3HZBy09MIBe8JwRZmtg", "text": "Love it. Great variety of food and everything on the menu tastes good! They have delicious tropical drinks. Awesome service. Great coupon club, too!\n\nMaybe the decor is cheesy, but that's part of the fun!", "business_id": "QzXFdjIbFRGhzL83goPPLA", "stars": 5, "date": "2012-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mGhgVFl7_CCINpFWJdzjuA", "review_id": "V0tmALB3hwXxKlZJvHo7yw", "text": "Great wing specials on Tuesday and Thursday and their bottle beer specials make it for a cheap and very good night. We usually go to the Tempe location on Broadway but it is crammed with college students during the year. This location is much easier to find a table and the service is better as well.", "business_id": "G7-NoraGlmzwO0sgs4fbmQ", "stars": 4, "date": "2011-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mICp2bqrAhs-WwX55KieNQ", "review_id": "CVmDguFL3CXOB4-q_pfXvQ", "text": "Love the ReUnion Thursdays.  It's the best 80's music in the Phoenix Area.  It's great to dance and watch movies on the big screen from back in the day.  Reasonable drink prices and really good food.  I highly approve and I'm glad it's every Thursday too.", "business_id": "Cp5_NSJFNgylD5SUdmT8nQ", "stars": 5, "date": "2011-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8UKAJqWdeJ9Cb_gU6QFGNQ", "review_id": "qavNlkac_yV7R1Rz1wZRuQ", "text": "Man, my visit here was sad.  2 for 25 deal is a great deal if you get good food.  Didn't happen this time, maybe next time.......\nI'm gonna say the reason I am even writing this review is the pasta I received.  It was unforgivable.   Pappardelle portobello Alfredo was the name of the dish, it had three mushroom bits on the whole dish.  IA had to ask for more sauce because it was so dry, and the pasta was mushy.  What a tragedy to have overcooked pasta at a pasta place.  :(    Rosemary chicken needed more sauce as well.\nThe tiramisu was gross.  Tasteless except for the old coffee mush underneath the mascarpone.  \nI am so glad that the salad was good and never ending, otherwise this pregnant mama would have been a bear.  \nI was peeved at the service time, it took 10 to 25 minutes to get water.  What was so irritating about that was that there were four or five servers hanging around the bar shooting the ship the whole time I was there.  \nI called and talked to manager Lisa and she listened attentively and offered an apology.  I appreciate her listening and empathizing so they've got that going for them.  She offered a gift card, so we will give it another try and hopefully it's better this time around!", "business_id": "scVOmQsf5HSY3n9CG06tFA", "stars": 1, "date": "2015-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lOBGoDGwfo4osyqyFdPEfw", "review_id": "FwP6PxuBiC4feD0mJbIAPA", "text": "If expecting carside to go don't count on it.  I waited 20 minutes before going inside and finding out my order was ready. They asked for the type of vehicle I drove and the color and last time I ordered online I went for just to go and they didn't ask that question. I waited there and they never showed up so I went inside to get my food and it took them 2 minutes to get it. Seriously I asked for Carside to go and they don't even apologize. I still like Applebee's but the chances of me coming back to this one is a No.", "business_id": "bNGR0iQTx8hXRmQv4hV5gw", "stars": 2, "date": "2015-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iIQbATX70Jsbosv4OE2tHQ", "review_id": "dOdssmId2Tw1hC2UOs9CfQ", "text": "I went here tonight with my kids, sister and her boyfriend only because Zipps was packed. Right off the bat you can tell this is not a new Native or a very nice one but we wanted to eat. First noticeable thing was the smell. I am actually not sure how to explain it but it sort of smelled like cat urine when you walked in the front door. The entrance is not very welcoming at all, and sort of leads you down a hallway where they seat you. We were seated at a stand alone table, preffered a booth but you can't always get what you want. It was just a wide open room with tables, a bunch of TV's. Waitress came out and took order. It became obvious this was not a traditional Native Ny'er but was previously called something else and was in the process of being changed over. I think they were struggling with an identity crisis as this place is simply not up to par with most natives we have been too ( like the one on Gilbert and Germann) and even the one in Dobson Ranch is nicer than this one. We ordered wings for the kids and us adults all got fish n chips. wings came out and could not believe how small they were. I will call them micro wings. Service was slow. The Fish and Chips actually took 20 or 25 minutes. I expressed a bit of concern with the server on how long food was taking. It was finally delivered. Fries were a little soggy but fish good. They took a whopping 10% off the order for the delay. \n\nThis location has a long way to go before I will eat here again.. With so many other Natives and sports bars close by no reason to come to this one.", "business_id": "zBGfa6Vx4K59v8OR81gzJg", "stars": 1, "date": "2014-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Oyctz1JkvJ5ocIAVDQRQXA", "review_id": "HW_Fa1sejdYIxwMalFn82A", "text": "Your chicken fajitas taste like hot dogs and also have a hot dog consistency.  Manager said it was from the new marinade. Do you soak the fajita chicken in hot dog water? Smelled like boiled hot dogs too. GROSS. Won't ever be back.", "business_id": "cF0k2s8qq7c2qT1yBofuyg", "stars": 1, "date": "2015-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "MGkQP3dmk2YID4HZvPi1cQ", "review_id": "c-aGpAZHkAfLvdJQ6096Fw", "text": "It's a dive bar but it's a GOOD dive bar! $.50 pool and $6 pitchers of Bud Light. This turned out to be a great little venue for guys night out! Rock and roll playing on the jukebox and friendly staff.", "business_id": "g8ewG8o0ubTUTAUDj7UZLQ", "stars": 4, "date": "2014-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Nvd6mGOX8qKgKzqhODKp3g", "review_id": "hQRdhjEkQ-irl3rt0hTz2w", "text": "The best burgers in town, they're made from scratch and taste like homemade unlike the fast food places around. Tried the bacon cheeseburger and it's great with French fries. The beer is served cold as it should, tried a guinness beer, It was great nice and foamy. \nFast service, clean place, decent pricing and friendly staff. I highly recommend this place for big crowds or just to hang out and have a beer and shoot some pool.", "business_id": "7ozgY7HgsQMhpIgPyenTuQ", "stars": 5, "date": "2015-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vJZtiMtXJL0GHl8AzsKAFg", "review_id": "WNTvdo9WAtiaqG_yToAAhg", "text": "The food, service, and atmosphere is fantastic here. I have never had anything I didn't like. YUMMMM", "business_id": "a9Wk44qJLWoJQT-_H8MB-w", "stars": 5, "date": "2011-07-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "SPeuH2CqtJrQly5g_aGCCA", "review_id": "ZV_mGkjM_1TpxfwIsjTghA", "text": "This place looks a little plain from the outside but the interior is really nice, well decorated and very comfortable! \n\nThey have an awesome wine selection and the food is really good! The eggplant appetizer was AWESOME. They have an extensive pizza menu as well as a lot of regular entrees.\n\nIf you live in chandler, Mesa or tempe I would recommend giving it a try!", "business_id": "a9Wk44qJLWoJQT-_H8MB-w", "stars": 4, "date": "2014-07-10", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "LqgGgWi3FLHBViX9tmZ9sw", "review_id": "f38tMDIrQnOozX80M1WIbg", "text": "I did go mainly because the coupon I got by mail. The coupon served it purpose! \n\nStarting from dark warm bread (YES), then to the appetizer (we had the home made potato chips) and finally to our main course. I ordered the prime rib eye with salad and cream spinach. The taste was good, not covered with annoying sauces or similar. To finish we had the desert included, but we had to take that home as it was too much. \n\nIt is not that cheap for students budget, but once in a while it is good to have a good steak.", "business_id": "OjNTZTZ6HYQghJN-3jmwnA", "stars": 4, "date": "2009-06-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-Wipkr9x2FbYMvCPDwewBA", "review_id": "11rgmA1c80H-3LpHkXq9Iw", "text": "We went back tonight to celebrate my 9 year wedding anniversary and again great service as always. I had the prime rib with Cesar salad and potato soup ( Delicious ). The prime rib was once again cooked perfectly ( medium ) it melted in my mouth. For dessert we got a big chocolate chip cookie for our anniversary and the mud pie for our dessert that came with the meal. Again the manager Michael came and checked on us and welcomed us back and made sure we were taken care of. Great meal. Only bad thing is the campfire meal for two is HUGE. Couldn't finish it. Had to take it home. Will be back.", "business_id": "OjNTZTZ6HYQghJN-3jmwnA", "stars": 5, "date": "2015-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eHMGNnjnB6tsDk-ecWuwcw", "review_id": "0ig6Bdm2NUKxfnn_H9RCbA", "text": "Where to begin? Our party of only 4 got bumped twice by hostess. After finally being seated, I asked 2 different people 3 different times for a booster seat. It was twenty minutes for our drinks to arrive. After we had to clean up a drink spill and used all our napkins, we asked for more. Instead of bringing more napkins herself, she tried to find someone else to bring it. After the wait for that, i got up and got them myself. During the meal, our waitress was pretty M.I.A. We spent the whole time wondering where she was and if we would ever get what we asked for. Had to get up and have another server run our card to pay. Waitress got our take-out order wrong. This was not even the dinner rush!! And they didn't look short-handed. Lots of workers were standing around all the time. They all looked like chickens without heads. By the end of the night, we were running out of this place. Someone from corporate come in and re-train. FAST!!!!!", "business_id": "AOTOKHGbEorQSWr-KVmHZw", "stars": 1, "date": "2015-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "Xm8HXE1JHqscXe5BKf0GFQ", "review_id": "k7JBR7MTruVEvRX6mJdNiw", "text": "I had to give this place three stars as an average of two and four from the two times I have eaten here. \nThe first time service and food were beautiful. Actually, both times service has been top-notch. Never a problem with service. \nI again had the seafood enchiladas which are stuffed with tuna, salmon, spinach, and shrimp. This is really a delicious dish and full of flavor but the second time I had it, every other bite was cold (one hot, one cold, one hot, one cold) - weird. Also, some of the people I was with ordered steaks medium rare. Both came out well. Disappointing. \nThey do have this different version of a mojito made with pineapple-flavored rum and mint leaves, with brown sugar. It tastes like candy.", "business_id": "z1Np8_oQECKWGCwJJ8864w", "stars": 3, "date": "2011-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4xZ6JPl1DZTujlDHej8vNg", "review_id": "nL_GHEirJTRiOAPL5HwIkQ", "text": "Happy hour gets crazy busy! Must be the fantastic chambord margaritas (limit 3) and appetizers! I'm a huge fan of the Tejas trio dips and the pecan crusted chicken salad.", "business_id": "z1Np8_oQECKWGCwJJ8864w", "stars": 5, "date": "2014-08-14", "type": "review"}
