{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BShxMIUwaJS378xcrz4Nmg", "review_id": "PU28OoBSHpZLkYGCmNxlmg", "text": "I am a big believer in first impressions, so when I go to a new business I pay close attention to how they treat me and how they run their business. Joe was very polite and friendly as soon as I met him, as was his shop assistant. I needed a CV joint installed as well as a new transmission mount. Joe was nice enough to estimate a fair price to install both, he honored that price, was fast, very friendly, and treated me like he knew me for years. It's a great neighborhood shop and Joe is a real nice guy who could have easily raked me over the coals, but he didn't. I know quite a bit about cars, and everything he told me was true. He's earned my repeat business immediately. Give him a call, you'll be glad you did. Thanks Joe!", "business_id": "3eu6MEFlq2Dg7bQh8QbdOg", "stars": 5, "date": "2015-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1Il8aVEWbHbZ8cickppiiQ", "review_id": "aIGlWuOcewm6-gzh2HEV0g", "text": "Seems like a decent garage. I was really in a jam and needed a repair done and had already bought the needed part. However they would not install it. I'm not sure why their policy is this way perhaps there's good reasoning behind it but it left me in a jam. Most garages mark up parts 40% maybe that's why? Or maybe they don't want everyone walking in the door with their own parts? I wasn't expecting a warranty I just wanted to part put on the car", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 3, "date": "2015-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EkJzvP-MdNTdPB_dsx-e0g", "review_id": "NccxjBckPEr5WeAH3dU9Qg", "text": "Went here to get 4 tires and they were extremely quick! Within one hour, they quoted me (a great price) and had the tires installed. Was surprised that they came in lower than other competitors, so definitely check them out.", "business_id": "zKGGHa7AXr4EnPvBAaum5A", "stars": 4, "date": "2012-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UqvbQf6a82RWYW131dmqIw", "review_id": "qooz7JK4pC_-CMhXXf9KHA", "text": "The service here is not great the  waiting time is more and my service for car given wrong estimation more than $1000 bucks went to local auto service got repair with in $300 bucks.\nThey give wrong estimation to exploit the amt.", "business_id": "-_SZy-tV0oNRiFgMStMdyA", "stars": 1, "date": "2014-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 3}, "user_id": "S3bzNa2KUQ69Q7Lazq6PBw", "review_id": "whLyzku2FHArJWGK0wdw0w", "text": "From the time my parents moved to Charlotte in the early 80's, until they moved in 2001, they brought their cars here. Any time  I was in town, I always did the same. There are several reasons for that.\n\nAfter moving back to Charlotte a couple of weeks ago from the West Coast, I heard a funny noise coming from the rear axle of my '05 S2000. Even though it's clear on the other side of town from where I'm living, my first thought was to take her over to Compact Car to check it out. Even though I walked in during a pretty busy afternoon, I was helped promptly by a service tech, who knew exactly what questions to ask about any other problems I'd had with the car, and inside of half an hour he was pulling it back up in front of the waiting area.\n\nThe diagnosis was what I had pretty much suspected- a loose axle nut- and when I asked him how much I owed him, he shrugged and said not to worry about it. This is how customer service is supposed to be done, and needless to say I'll be bringing my baby back there for an oil change next week. \n\nHonest folks, more than fair prices, and quality of work. That's why my family's been going to Compact Car for 20+ years, and as long as I'm in NC, they'll work on any Hondas that I own.\n\nOne more thing: I just called here to schedule more service on my car, and they had me in their computer system from the last time I had a car worked on by them- TEN YEARS AGO. Now that's dedication in my book.", "business_id": "F5DJEqbNveNq8x94XU_Vqw", "stars": 5, "date": "2011-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lP-DVgxFSebI_Fk19ZCTLA", "review_id": "OejbFxzIBOxG0tpFvwMTDw", "text": "I went in for an oil change and an inspection. i receive close to a thousand dollars in \"recommendations.\" The next day, I decided to get the breaks serviced as they told me it was the most pressing issue with my car. After fixing my breaks they refused to put my tire on because they decided it was not road worthy, but for an additional 200 bucks they would fix it for me. \n\nPerhaps I would have been more understanding if :\n\n1) This had been in the original inspection (it wasn't) \n2) I hadn't had the tire looked at on several other occasions including them (twice! Once several months ago and once during inspection) \n3) They hadn't decided for me what is and is not acceptable - (ask first then together we make choice).\n4)They asked me to sign a new inspection ticket as if they had brought up wheels initially, smeared with capital letters and exclamations as if that would help send it back into the past. I found it so antagonizing that I decided to share the experience here.\n\nIt was shady business. it made me feel like they were trapping me into spending money that I did not have. There was a better way to express their concerns, if they were legitimate. In the end, I had someone else call on my behalf because I was so confused.\n\nThey get two stars because the person who called to inform me of the debacle tried to sound understanding and because my breaks seem to be in working order. \n\nWith all this stress perhaps I should have gone to the dealer. Turns out they would have charged me less for my breaks.  (that almost never happens)  Just be careful and shop around.", "business_id": "Yn89vJYXcdprx9U_w1qmMw", "stars": 2, "date": "2012-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "1_CjHZLHzNaKIFFIAcZFuw", "review_id": "AMkDDleFVKzLeZQktDLA7A", "text": "These guys are great.  Knowledgeable, helpful, dependable, and great communication.  They do their best to provide great and complete service while minimizing out of pocket expense.  It is hard to find a trustworthy mechanic.  I am glad i found Clausen and have referred them to friends and neighbors looking for the same great service.  Thanks to Nick for providing the communication that is much appreciated when you are considering repairs on a budget.", "business_id": "8E1EzFMYtuJdrOfgft_nMQ", "stars": 5, "date": "2015-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "FjMtU0gUdXU0QC9KU6uzZQ", "review_id": "6xB4fMeGPBQQNggO8qzDag", "text": "Shane, the manager, has been very patient and friendly. I was in a hurry, and had to get the car fixed by the end of a Saturday. Normally, business closes at 3 pm, but in order to get the job done, they kept working on it and made sure everything works right until 4 pm. I had been a very annoying customer - calling them every other hour since 9 am to keep track of progress, yet Shane has been patient and friendly all the time.", "business_id": "UvQCdPSXUdnmzbDEtUaoXQ", "stars": 5, "date": "2013-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "NNdfPF-UhvLB8FxbsuSC5A", "review_id": "il6pdh1oZIFfZsZXpkT2Sw", "text": "Went there an hour ago to purchase a battery for my boss' vehicle, my boss paid cash for it and waited for the change from the employee there, but nothing happened because the employee doesn't want to give the change back to my boss.\n\nIf you do go there, DO NOT purchase anything from Veronica.  She's the most dishonest employee ever.  She acted all sweet and nice in the beginning, but later she lied about it.\n\nBe wise about it, go shop somewhere else for better services.", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 1, "date": "2012-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3a3lWVHBp3kKk6h5uEy2Dg", "review_id": "i4FYbqyT6N2u4pkTE5vP1Q", "text": "MB Motors is a great shop!  The owners and staff are extremely nice and knowledgeable.  Great service and reasonable costs for repairs.  Bud worked for dealerships for almost 20 years and he brings all of that expertise to the table, including the latest tools like Star Diagnosis System, WIS, and more.\n\nIf you have a Mercedes and like saving money, make sure to give them a call.", "business_id": "0Xnduj9w6aYHOtN_RlHUng", "stars": 5, "date": "2012-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "15J3D1xNze1NbO2SoqAQfg", "review_id": "6kPtjRqQKjeogi5DAW5jSg", "text": "I couldn't be happier with my experience at Coulter. This is the kind of dealership that earns your business for life. Thank you for a pleasant car buying experience.", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 5, "date": "2013-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wlX_UJq6_ESk467zT_yOlg", "review_id": "4JU_5eVKYNmmCvIStRQyMg", "text": "I recently moved into the area and noticed this place driving up 7th Street; since I have a Honda I took notice.  Eventually I needed service, brakes to be exact, and took it in.  Met Frank (who I'd read about here) who assured me it would be done before lunch.  Lo and behold, it was finished at 11.  No up-sells, no hassles, for a price that was competitive.  Not only that, but being a first time customer he threw in an oil change fro free.  We also have a Toyota and I'll be bringing my  cars here for service from now on.", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 5, "date": "2015-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "J_n70YbHOLw5rkPrwhSoEQ", "review_id": "TwmbNfTyRXkPPTe5z-gweA", "text": "THANK YOU TOY BOX!!\nI took my car to the Toy Box to have them take a second look at $800 worth of work - strut replacement - that another valley mechanic had quoted me.  Turns out there was nothing wrong with my struts and they saved me $800!!  Their honesty and integrity will be remembered and they have gained a customer for life!  Thanks again Phill and crew...you guys are the best!!", "business_id": "m6vwfpZSuAdsArtbVZ4-NQ", "stars": 5, "date": "2013-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JmDc6UkIDopy-kQT5YZdEg", "review_id": "MEXLgri7SB_Va475Nynahw", "text": "I was driving on the 51 freeway today and my car make a weird noise, so I exited Indian school and my steering wheel started to lock up and I turned at the first right I could, which was 19th St. To my left was a car dealership, but I saw the service bays and figured I would ask if they could help me. Ricardo immediately came and looked at my car. He showed me that a belt broke and then told me the reason my steering wheel locked up was cause my pulley broke as well. He was able to get the parts and fix my car in under an hour and charged me less than any other shop would have. I am definitely coming back next time I need repairs!", "business_id": "3jBkt2zeO1t0mUUBJMzTJg", "stars": 5, "date": "2015-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "s2iiKjtj-56aW1-7Crh5ag", "review_id": "l5gPsfaJL2SpKRFkThcBhg", "text": "I was given a quote for work on the AC on my 2007 Jetta at the dealer for $1900. I was told by the dealer that they were being generous with the estimate. Fortunately, I had enough sense to go for a second opinion with the guys at 25th Street Automotive. From the beginning the service was friendly and there was no pressure to perform service that was not necessary for my car. The total bill came out to $ 90!!! Yep, they have now will have me as their customer and I have already referred a few friends to them.", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2015-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3vDuLN-oR3PSkhTbE27Jhw", "review_id": "pVFut9OMTChUSewAYVeafQ", "text": "I've been a customer at Tony's Auto Service for years, and I can't say enough about how professional and knowledgeable they are.  Their mechanics are extremely competent and are able to pinpoint the problem with my vehicles very quickly.  They keep both my cars in excellent condition, and I have come to rely upon their expertise.  Their office staff is courteous and helpful as well.  I've never had a bad experience in dealing with Tony's Auto, and recommend them highly.", "business_id": "S1q51o5JqD5rzzDq_WD5_w", "stars": 5, "date": "2011-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4-BWgOkP51QJjFJEGWHuIA", "review_id": "1ZjNAoKEhDNbE809Gb1aJQ", "text": "brought the 4Runner in @ 2 on a Saturday, had it back @ 5:30. I knew the roters were warped, i needed an oil change, and I had a brake light out. They called with a few options on the brakes, changed the oil and brake light, and didn't try and sell me a bunch of other add ons. Friendly service and did what needed to be done.", "business_id": "5m1L5l_k2xFTZO3jttmVOg", "stars": 5, "date": "2012-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xAJWLfVe5BIif09p-XRXUA", "review_id": "RXH2I2Bbgxt3-dS1UotCsg", "text": "James has always been very helpful and kind, and will always try to help come up with more affordable repair options if you can't afford the full ticket. He's fixed my '00 Explorer several times like a champ. \nI can't say for body work because I've never had any done, but I've had good results and service for my radiator, engine, shocks, and brakes.", "business_id": "lxloQZzZjX6ftk-SipI1wA", "stars": 4, "date": "2015-08-26", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "oD04YGAZEm_ygAOFwsdkUg", "review_id": "nP5w1708JV5QjEil9vgTDw", "text": "We have used Crutcher for years - they are always honest and professional. We have takens several cars to them over the years, and I feel like they always give us an honest opinion of what really needs to be done, and what can wait. I have never had to take my car in twice for the same issue, and they try to get me in when it is convenient for me.", "business_id": "u_NKrPlsO_EOp9aCWfcr3Q", "stars": 5, "date": "2012-06-03", "type": "review"}
