{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bmk46CeiMrga526ZX0eXsQ", "review_id": "Rs20vOpOt9dskZCXWSfbiA", "text": "This is my favorite spot in Pittsburgh!!This was the first time i drank grass tea,and it was pretty god.and the food was spicy and yummy.\n  We went there on a Saturday,walking through the busy streets the name did catch my eye,and i still pronounce it in a funny way as-\"My Nockh\"(Try the nasal sound,its funny)\n   Its a simple place with simple people and great food:) \n-Smriti", "business_id": "GQloL8yRHymE0SGZq-B0zQ", "stars": 5, "date": "2009-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jYGvK7ZS3glK-LHoWcGjSA", "review_id": "Y0jbjnlFSpih0nX_lrzghw", "text": "Do not go inside!\nif the sandwich lady is not outside the place back away...\nthat said, she should be there everyday before 3pm.\nchicken, pork, vegi. $5. worth it. made me pine for San Francisco where there's a Vietnamese sandwich place on every corner, almost.", "business_id": "GQloL8yRHymE0SGZq-B0zQ", "stars": 4, "date": "2009-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "QE6vmJ3_MiBZD2o6uN1ZAQ", "review_id": "QJgTyVVTrFWOUsOn7iXRKw", "text": "A total dive, but worth it. Service is good and the Pho is authentic.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 3, "date": "2008-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3ymHWaMe40Jzkvlo4L_Ogg", "review_id": "99w_YLRtAv9HQtF44Yl4VA", "text": "Maybe I went on a bad day but the food was pretty darn terrible. The spring rolls were falling apart and only filled with noodles and a couple of sad looking shrimp, no thai basil or mint leaves or cilantro to speak of. I also got some crispy noodles with seafood which I only ate because I had been sitting on a train for 9 hours and was starving. And the whole thing was seriously overpriced for Pittsburgh, New York prices for extremely subpar vietnamese, meh.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 1, "date": "2008-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dyFP7vRPhUofhQMzID_h_g", "review_id": "oTOl5eIDPrTH3neChsvaeA", "text": "Glad to write this review to counter the only other one which is not so enthused... Pho Minh is a small family run place. Family is usually present and it's nice to see the kids hang out and help in the restaurant from time to time.  \n\nMeal starts with free tea served as you are seated. Food is slow to some out but they make it to order and it is a small staff so it's to be expected. It is definitely not a place to go if you need to get in and get out fast. This is a sit down and chat kind of place. \n\nThis is another of my \" I'm sick and need a spicy soup\" strongholds. I suggest the vermicelli soup. I used to stop in here just to buy a few fresh rolls and know I am among several others who do this.\n\nPho Minh won't blow you away it's just a good place to get some Vietnamese food and meet with friends- which is reason enough for me to return.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 3, "date": "2008-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wZx9FnJ5ikaRwZgRqSgZkg", "review_id": "FmPsEESV7WfMobrvOr9WiQ", "text": "when tram's is out of the equation, this is my backup. just as good.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 4, "date": "2010-07-13", "type": "review"}
{"votes": {"funny": 5, "useful": 0, "cool": 0}, "user_id": "pb-v4zMXSnJ5AnblhBkWCQ", "review_id": "UpDbVkTYPTpcZRNMbA7GUw", "text": "Yea yea yea Tram's is great tra la la but the pho here is better! The broth, noodles, and beef are all tastier. And their other noodle dishes have always been delicious. My first choice for Vietnamese food in Pittsburgh\n\n\nAnd everyone knows the main reason you go to Tram's is to see the  one-armed dude.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 5, "date": "2010-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b3BvMKv2t-l_wPebAGEwvA", "review_id": "eJQaMJX4V4TvF831l3j5cw", "text": "The pho here is decent, but the portions are small. The broth is good. I'd come here before Trams. But after reading all the reviews on Vietnamese restaurants in Pittsburgh, I have to say that the majority of people in Pittsburgh have no idea what they are talking about when it comes to Vietnamese food particularly pho. I would say that Pho Minh so far has the second best pho I've tasted in the city after Pho Van. Unfortunately this city is not a pho city.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 3, "date": "2011-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bT0gr_O7w_XNq1f1_U92nw", "review_id": "fmiV2b0mhVpXGiqSjHektg", "text": "I just graduated from CMU and the thing that I miss most about Pittsburgh is Pho Minh.  Their pho is unbelievable and their #4 (pork spring roll) is equally as amazing.  Moreover, Pho Minh completely trumps Tram's Kitchen.\n\nI took my parents here for my \"last meal\" before leaving the City and they loved it, too.  They aren't into 'ethnic food' at all.  That being said, I would take ANYONE here.  Their grilled chicken (#30 something) is perfect for people who dislike pho.  \n\nIt's a must if you're anywhere near Pittsburgh.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 5, "date": "2011-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 1}, "user_id": "F5WW6egmmUrIWRI_ZNpbEA", "review_id": "SAvlBqiRrr057dCTbROS6g", "text": "Had dinner at Pho Minh again last night, after having had a wonderful time meeting some of the Pittsburgh Yelp gang and Rachel, our new local Yelp ambassador. I didn't say much about the food in my previous review, so thought I'd rectify that. \n\nI'm a big fan of Vietnamese bun, which is a dish made with rice noodles and some kind of grilled meat, usually served in a big bowl with sprouts, cukes, scallions, peanuts, cilantro, lettuce and carrots. What I'm looking for when I order this is meat (I usually get chicken) that has been well marinated, as this lends alot of the flavor to this dish. Pho Minh marinates theirs in hoisin and maybe other things, and it's delicious. They add a little of this sauce to the noodles and garnish with the salad, then serve it with their wonderful fish sauce. This is a dish I crave. Their veggies are really fresh, the meat is succulent, and all of the flavors complement eachother so well. I like a deep fried spring roll with my bun, so I always order one, and they slice it and serve it right in the bowl. These are great here...really meaty little rolls. They use pork, and it's almost like a pork meatball filling. When you order these as an appetizer you get 2 of them and a side of their molasses/fish sauce combo. Doug had the Hu tieu xao, which is chicken, shrimp and veggies stir fried with rice noodles. This dish has some funky Vietnamese flavors, and has fish sauce as a base for the stir fry sauce, so you have to like that, but if you do, this dish rocks. Like all of their food, it was very well prepared and delicious. The woman who waits tables here always offers us their traditional mung bean pudding dessert, and we always say yes. This is a sweet and starchy treat served hot with a lacing of coconut milk. I love it. Tea comes to the table automatically and is free, and they offer some nice hot and iced beverages in addition. We didn't have the pho on this visit, but I will reiterate that it's great. I think this is the best Vietnamese restaurant in Pittsburgh.\n\nThis is a family owned and operated restaurant, so you will see the same friendly faces when you become a regular. Early on we learned to say hello/good afternoon in Vietnamese ( xin chao, pronounced shin chow) and we always get a big smile from the older gentleman who owns the place. Cash only, closed on Tuesdays.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 5, "date": "2011-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CDN6dzeT7IAOdfTbGp_5iQ", "review_id": "EGYwSXdy5JJojrfdsnNvdQ", "text": "I would review this place in depth, but I really have little experience with Vietnamese Food.  When I said this to the owner/server she babbled something back to me that wasn't in american except for the numbers (number of the dish she recommended).  She went so fast I felt like I was on some type of opiate and it was just me.  Nope, no clue what the chick said, so I ordered one of the numbers she suggested and another.  \n\nMy wife and I love Thai food and this stuff lacked flavor and spice the way Thai food has.   Pretty awful honestly. But hey, gotta try new foods!", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 3, "date": "2011-07-10", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "Whz0oyU8_sBeckFA1aSWOA", "review_id": "YDSLd-EpMxYz15zKkHKSmg", "text": "Best Pho in Pittsburgh. Way better than Tram's kitchen. Must try the fried shrimp roll.\n\nWarning: closed on Tuesdays. Seriously, WHAT THE PHO? Don't make the same mistake as me, so check their website first to find out which day they close since it might change. And cash only!", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 4, "date": "2011-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "aLfrA93fHFVRIIdAFvviEQ", "review_id": "mPCdlnCg4sp-AMCYOIjTiQ", "text": "I, straight up, love Pho Minh. This is one of those places that I would go to every day if I could. I love Vietnamese food, and have tried it in a fair number of cities. This was by far better than the best Vietnamese in Boston (Xinh Xinh) and a close second to the best Vietnamese in Seattle (Pho Bac). \n\nI found Pho Minh, sort of on accident, my first trip to Pittsburgh. The owners were very kind and attentive. The food was delicious, fresh, everything was clean. The pho broth was the best I've ever had, delicately spiced and flavorful. They don't pre-cook the beef, which is excellent, so it doesn't become too chewy (it cooks in the broth). The second time we went to Pho Minh was the first night we got to Pittsburgh when we moved (this should tell you how excited we were). Coming from Boston, it didn't occur to us that it might be closing at 9pm. We got there at 9:15pm and they kindly asked if we wanted them to make us up some food to go. Even that was good.\n\nWe kept hearing, over and over again, that Tram's was freaking fantastic and we should go there instead. So we did. It was a mistake. I have no idea what everyone is talking about. The ambiance? What ambiance? It smelled like urine. Seriously. \n\nNeedless to say, Pho Minh for life.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 5, "date": "2011-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 1}, "user_id": "oc4Ne7SJo4WGdzbm6jtCXg", "review_id": "XMb5OSZnCJGt6BxpqCPnZw", "text": "This is the best Pittsburgh has to offer in authentic Vietnamese.  I have eaten here several times in the past 7 years or so and have tried several of the items on the menu with success.  I like to order bun with chicken and pork spring rolls.  I also like the Hieu Tu.  Basically chicken pho but with chicken broth instead of beef.  This is typically my go to dish here and it's very good.  It's a small family run place without a lot of slick ambiance.  I wouldn't say you'd be wow'd by the decor but the service is friendly and efficient.  I am always glad I dined here.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 4, "date": "2012-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VAGihg-EbniaW8E5jS5G0g", "review_id": "A5M-FSJj_ulDVptyDJUATw", "text": "I was expecting more meat on my pho ut it ends up can't fill me at all.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 3, "date": "2013-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6bhk4vGHBHpB7Eyq61fs4Q", "review_id": "hmySWTGqZ3hVZcB31Ax2lg", "text": "One of my favorite Pho places in the burgh!   Service is always fast and friendly and I've never had a dish I didn't like.  A good amount of GF friendly options.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 4, "date": "2015-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r1N-nVTDmDXgSBGzZVhKOQ", "review_id": "AWq5XaQ8Vuk4PgQhPYYzAQ", "text": "In my opinion, this place is sub-par. The broth was fragrant, but a little bland to my liking. I've been in Pittsburgh since October and I've tried most of the pho in this city and I'm my honest opinion Vietnam's Pho is the best. This place is comparable to Tram's, but being that I live in Houston which has plenty of amazing Vietnamese food to choose from and I end up always going back to Vietnam's Pho when I'm in Pittsburgh. \n\nIf I rank the places I've been to in Pittsburgh , it would be as follows starting from the best: Vietnam's Pho, Pho Van, Tan Lac Vien, Pho Minh, then Tram's Kitchen. \n\nI know this isn't consistent with the Yelp reviews, but you can't go by the number of stars a place has all the time. If you're a transplant like me and always looking/wanting good Pho but want to avoid the trial and error like I did there's my 2 cents.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 3, "date": "2015-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s4z4-WNLlx3IEDSOW_FmEg", "review_id": "R5e30SL_sV8ssjFcNGIKKw", "text": "I've moved to Chicago, where there is excellent Vietnamese food, but I still dream of Number 40 with tofu.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 5, "date": "2015-07-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "65j7bRPXJUkrUCQ7XGteDQ", "review_id": "eET05IcEw7HEaIfm1zXMAw", "text": "At 8:45pm, Annie and I decided we absolutely had to go out to eat. Utter necessity. It turns out that everyplace she visits, she makes a point of getting Pho, whether in DC or Istanbul, and she had good things to say about the Pho at Tram's, so we wandered over (even though I have never liked the flavor of Pho.)\n\nWe walk in and the owner looks sternly at us:\n\"It's 9 o'clock.  We close at 10.\"\n\nWe promise to be quick, so so quick, because he was clearly displeased even though the place is packed and no one looks in a hurry to leave. And I have never fit so much food into my body so quickly as I did that night.\n\nThe second time we went I ordered the mixed meat vermicelli, and he looked at me with approval. Yay! He didn't hate me! I actually felt proud of myself for my efficiency and preparedness.\n\nSo, it's a little bit off-putting at first. Abrupt. He'll inform you about what you are ordering, not always as a suggestion, but more as a command. Be prepared to order the minute you sit down. And bring cash. The trade off is good, because he gets more friendly and the food is always good. Especially the spring rolls.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2007-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EGxr8yyC8FO4ki55Xd3j5w", "review_id": "mJL_JVbgWH8qSZTCQczTTA", "text": "The tablecloths change every season, cow print, leaves, retro stripe and um, that other one. I'll be honest, Tram is crabby, but it's charming, somehow. He always frowns at me but smiles at my girlfriend. I just assume he's homophobic, but I only think this because he watches \"Fox News.\" The tv is always on, but when you're seated, you can't really see it-- it's for Tram, situated just so he can watch it. The elementary school-style milk glasses are amazing and the perfect thing for the wine you should bring to eat with number 17, or the spicy peanut curry, or the saigon or sate soup.\nThe fresh rolls are amazing. This is the best Vietnamese food I have ever had, in any major American city.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2007-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "PK_GC19zTM6jNTH5zNCFng", "review_id": "PDpp7WnkRADBhaIGHfhpZg", "text": "Like a couple others, I'm really not sure what all the fuss is about this place.  I moved to Pittsburgh from Seattle where you can find some of the absolute best Vietnamese food.  This place is a hole-in-the-wall with a very brusque owner/waiter and kind of dingy decor.  I don't mind any of these things actually, but the food I definitely took some issue with.  I ordered a tofu-veggie dish (can't remember the name) served over rice.  My boyfriend ordered the pork rice vermicelli bowl.  Our food came fast enough and it was served hot.  However, my dish was nothing to brag about.  It was pretty average tasting Asian fare.  It didn't taste bad by any means, but not restaurant quality.  Good thing it was only about 6 bucks.  My boyfriend's dinner was a real disappointment, however.  My favorite Vietnamese restaurant in Seattle had HUGE vermicelli bowls with absolutely fresh lettuce and onions, piled high on top of perfectly cooked noodles.  The meat/tofu you ordered with it was never sparse and it was cooked to perfection.  Everything was doused with some sweet fish sauce and presented with some sliced egg roll.  The pork vermicelli that came to my table did not resemble this at all.  It was served in a rather small bowl with just a few pieces of lettuce and onion.  The \"pork\" that was on top amounted to about 1/4 of a cup of weird texturized, shredded something.  It almost looked like boiled ground beef.  I felt sorry for my boyfriend because he had never eaten Vietnamese food before and I had recommended a vermicelli dish to him because they are (usually) delicious.  As a double whammy, his dish was about 9 dollars!  Neither of us were full when we were done with our meals, so we ordered some spring rolls, which were supposed to be what they are famous for.  I don't understand this either.  The rolls were extremely bland and chewy.  The sauce that was served with it didn't do much to save it.  Overall, I wouldn't recommend this place and I will continue my search for good Vietnamese food elsewhere.  Also, please take note they only accept cash and no cards.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 2, "date": "2008-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "Yoiwn_5Zz-K0dDqDtp1Xmg", "review_id": "ltlViSjKKFqe18HN0c8O0Q", "text": "I see a lot of confusion in the other reviews; people seem to either love or hate Tram's.  I think I can help explain this issue.\n\nTram's has a fairly full menu, but there are two things on the menu that you should be ordering:  the soups (particularly, the beef pho) and the fresh spring rolls.  That's it.\n\nIf you've had Pho in other cities, you might not understand Tram's.  There's no Vietnamese community in Pittsburgh, so you can't get all the trimmings you might have come to expect:   no tripe, no tendon, no other strange meat parts. Just beef or chicken.  But what sets Tram's apart, in my view, is the quality of his broth.  I have eaten Pho all around the US, and Tram's broth is, in my view, the very best I've had.\n\nSo get the pho (or, if you're in the mood for something different, the Saigon Soup), get the spring rolls, and skip everything else on the menu.  Then you'll understand Tram's.\n\nIncidentally, the owner's name is not \"Tram\".  His name is Le Thao.  Tram is his daughter, who was left behind in Vietnam for many years, when his son needed a kidney transplant in the US.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2008-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dyFP7vRPhUofhQMzID_h_g", "review_id": "NSIJ6jdi23-RtNvWoL0siA", "text": "Like the owner. Informal atmosphere- almost Asian cafeteria style except the food is really good. Decor is a little disjointed. Cheap prices so I'm not complaining. Always fast service. Good place for a casual hang out w/ friends or a not-out-to-impress date. Do not add fish sauce to stuff- it almost ruined my Tram's proclivity forever.\n\nGood place to get a spicy hot soup in the winter if you're cold.\n\nSeems good for large groups. Cash only I think...", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2008-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "EY2M507w8246POHv37TLyA", "review_id": "A7LJ3kHB9a1GtP8E6QZdtA", "text": "Was craving Pho while in Pittsburgh - and so on to Yelp I went and found the reviews for this place. So off I went in search of Tram's.\n\nTram's is located in a section of Pittsburgh that is a little on the run down side - the area has seen better days. But that did not phase me - adds some character to the place!\n\nIt was about 1:45 pm when I rolled in. Was given a choice of where to sit  - a little old man with one arm (or perhaps he was missing just the hand? - could not tell) took my order. He did not seem to friendly - I asked him a couple of questions and it was hard to get anything out of him.\n\nI ordered Pho Ga with white meat (although their menu lists it as \"Pho Hanoi\") with garden rolls and a glass of water.\n\nI suspected that perhaps their approach to Pho was going to be more Northern Vietnam based on the name for the soup - and I was partially correct. When the soup came out - the noodles were the slightly wider ones rather than the very thin ones.\n\nNow I'm guessing that many of my Yelp friends from the DC area that like Pho would not have liked the Pho here.  Unless I'm mistaken - most of you folks seem to prefer to have all of the fat skimmed and strained out of your Pho broth - which I am against. It makes the broth to clear and light and there is a significant reduction in flavor and richness when this is done. And they certainly weren't doing that here. In fact - there was a slight oiliness or greasiness to the broth - but not overly so. It gave the broth a delicious richness and subtly in flavor that was just so damn good!\n\nI added all of the aromatics and veggies. I will say that the amount of Basil, and the quality of the Basil were the low points of the meal. The poor Basil had seen better days.\n\nI then tasted the broth and was floored by how good it was. I detected light, rich hints of star anise and cinnamon, which when combined with chicken essence fat globules and onions - was just outstanding. Rich, savory, wonderful!\n\nI added Sriracha sauce to individual bites of food as I went - and only added a little to the broth at the very end. I really wanted to savor the broth the way it was.\n\nCons:\n- The rolls were not very fresh - in fact I did not finish them because they weren't very good.\n- The Basil was not crisp and fresh\n- The restrooms need to be gutted and retrofitted\n\nSo I'm only docking them one star for the cons - the Pho was outstanding IMHO - so four stars overall!\n\nCash only - no credit cards. I had a bit of a hard time finding parking - so beware of that.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2009-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Q6PGJ1UylVz9bby8wQqEPg", "review_id": "YYzcnbhgTJNk1RrfGbJpYw", "text": "I am also somewhat conflicted about Tram's.  I have been a few times now, and it seems to be somewhat hit or miss.  I've had the Pho a few times, and while always fairly good my satisfaction largely hinges on the amount and freshness of basil and mint that is brought out.  The other dishes are usually well made and well seasoned.  \n\nI enjoy the short menu and the waiter who is fun to interact with.  This place is usually pretty busy even on a weekday evening.  Surprising given the location.  Definitely better than Pho Minh up the street, but I still think Spice Island has the best Vietnamese dishes in town.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2009-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q01EJuVT9tCHS_kO1qsTJw", "review_id": "FSxBwV8XA5sfR8Lc9MtDcA", "text": "Great Pho. Go here for fresh soul warming food with unique flavor.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 3, "date": "2009-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8Dfb9_1axVxQjG-qOdxM0Q", "review_id": "ckOma_XGF807MwmBFYBn9g", "text": "Spring rolls with dipping sauce. Huge bowl of pho, with plenty of chicken (or beef; I've gotten that before too), crisp and flavorful veggies, with basil and bean sprouts and lime for you to put on top. Very, very filling, fast service (when avoiding busiest hours), no complaints.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2009-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "go2dZIDfrEBqfsGKnA4m7g", "review_id": "r903uTPziaZ1ZE80TYlscw", "text": "Best pho I've had in ten years.  I want to try something else at Tram's, but I can't help but order pho every time I'm in there.  I agree with other reviewers: they could definitely add slightly more \"fixin's\" for the pho (can you tell I'm Southern?), and the fixin's could be a little fresher, but the pho itself is excellent.  The spring rolls are excellent, too.  I just wish they served 33 beer to go with it all.  \n\nService is good, if a bit gruff.  Don't screw around chit-chatting at the table when you come in; you need to be ready to order when the waiter (Tram?) gets to you.  Failure to do so will expose you to his withering scorn.  (Seriously, he'll hang out, staring at you, until you make up your mind.)  \n\nPrice is right, too.  With spring rolls and an entree, you'll get out of here for under $10/person.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2009-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_UOzP4r4Jwf35VNQ-hTGxg", "review_id": "d1ZTO23MNdk0mu6A0mti5w", "text": "This place isn't much to look at, but when the I'm talking about a restaurant ambiance falls second to good food. The pho here is great. Really flavorful with a great balance of ingredients. I need to go back and try the Bun.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2009-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RL2AGNJcUOnlUp45gF1avA", "review_id": "4p-Y71w-iq77uDYnPfslqw", "text": "Best pho in pitt", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2010-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wZx9FnJ5ikaRwZgRqSgZkg", "review_id": "TDLFdwaXY3PgClPwhOmYSQ", "text": "i love the pho and spring rolls.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2010-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RVBYIQj1UYEQZgecM-rxyg", "review_id": "qcBW2LcYlL73OdiHXDKDcQ", "text": "They have the best Pho (I get the vegetarian version), vegetarian spring rolls and tofu w lemongrass. Those are the only things I order there bc they are so delicious I can't bare to order anything else.  It's not the best atmosphere, but the food is delicious.. and that's what you go to a restaurant for!!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2010-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "HZ3IuSFmigXSL1FHY424vA", "review_id": "B2VgUIOnKeNEWO0oya4vlg", "text": "Visiting Pittsburgh for a few days and wanted some Vietnamese so we stopped by here expecting to find the best pho in Pittsburgh. \n\nThe restaurant setting is very typical of a vietnamese restaurant. The menu is small with very limited choices. Service is minimal. \n\nWe ordered some spring roll appetizer which was pretty good. Then we had 3 different kind of pho for our main entree. We ordered a \"sate\" soup, a Saigon soup and a pho Hanoi soup. Only decent one was the pho Hanoi soup which isn't really like the typical pho. No beef tripe, tendon or beef balls in the soup and the noodles are fatter then what you'd find in typical pho. There was also excessive MSG in the soup dishes.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 2, "date": "2010-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "ZR2cXikq0PprQVfEXLjifg", "review_id": "3Zea0mhIc8I-3u2DXWqTZQ", "text": "awesome vermicelli with coconut milk. if i lived around here i would eat at tram's every day. actually, i live in san francisco, which (obviously) has excellent restaurants, many of them vietnamese. i would put tram's up against any of them, any day of the week.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2010-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "TtShekSOnfL-56maxx-rTw", "review_id": "SdHn_UYsqreokPG410W_bg", "text": "Tram's is lovely for what it is -- a hole in the wall Vietnamese no-frills noodle shop. The table service is spotty, but colorful. The menu isn't extensive, and really, I don't know why anyone orders anything other than the following things: spring rolls, Vietnamese spring rolls, vermicelli with onion (pork or tofu), vermicelli with coconut milk (pork or tofu), Saigon soup, pho, satay soup. Things are served with the right accompaniments and things are always fresh and well-prepared. \n\nTram's isn't a place to take your boyfriend's parents to impress them (unless they like good Saigon soup and plastic tablecloths), but it is a great place to take friends. Smile at the staff and they smile back. The food is delicious and the place has charm.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2010-08-25", "type": "review"}
{"votes": {"funny": 7, "useful": 5, "cool": 4}, "user_id": "qPGLUQUG43b3aBZKDUBlMw", "review_id": "s3TAWdhxHvUcMwttgnrFMg", "text": "I'm no expert on Vietnamese food, but methinks the folks who are all \"OMG I AM FROM (name a coast) AND THIS PLACE IS TERIBEL OMG OMG OMG!!!!\" need to put a plug in it.  If it's so great there, STAY THERE! We don't want to hear it.  Nobody logs into Yelp and says \"Well, Tram's sucks, guess we have to go to BOSTON now to get Vietnamese food.\" \n\nNow, the review.  \n\nI am a curry monster.  If a country makes a curry, I want to eat it, and once I've eaten it, I want more.  Not all curries are created equal, but the curry you get at Tram's is pretty damn good.  And that's why I go there, but it's not the only reason to go there.\n\nThe spring rolls are pretty good, as well.  What I like about them is that they're fat, and packed tightly.  You have to appreciate it, because it is no easy task to wrap one of those things really tightly without ripping the skin.\n\nThe service is sort of no-frills.  They're not overtly friendly, but definitely not rude either.  Just quick and businesslike.  I love the ambiance, too, because it reminds me a lot of east Asia.  Cheap tablecloths, pastel-painted walls, and until recently, it was organized in such a way that your table and the folks next to you were so close together you may's well have been dining together.\n\nWhat's a real complaint about this place? It's what I say about every place that's cash only.  They need a credit machine.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2011-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4gMSumI9V_jiVapsp99aOw", "review_id": "Y1j1Y6Loxf94HMAe0wmJgw", "text": "Tram has great Pho, and enough of it to feed all of Pittsburgh when the next fake Armageddon rolls around.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2011-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "j0QCSpo6B3nBGCwwFC4JcA", "review_id": "rk2dpxFvj6DkeE3qM-xDCw", "text": "I only had Pho so I can't judge the rest of the food, but the Pho was the worst I've ever had. Biggest let down ever, as I drove here once and it was closed and came back excited to get my fill of Pho at what's apparently the best place in Pittsburgh, but  left feeling sad. The broth tasted like water, and amount of beef and noodles you get was pathetic.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 1, "date": "2011-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "JLS56V5lhErpFUjZ8N8VrA", "review_id": "CFR4ctEzIuOcAn2neNa0pg", "text": "The best Pho in the Burgh. It is INCREDIBLY flavorful, despite what I've read in some people's reviews. I cannot count how many times I've been to Tram's... over 50 at least. I recently had Pho in Los Angeles and San Francisco and it paled in comparison to Tram's. The rice noodles and chicken are always perfectly cooked, the spice is just right, and it hits the spot every time. I always get the vegetarian fresh rolls as well, which are huge! The prices are also amazingly cheap.\n\nThe place is one of those hole-in-the-wall joints and that just adds to the experience. Love it and will always be a loyal patron! Pho Minh down the street is terrible compared to this place!\n\nEDIT: Someone sent me a comment saying that they preferred another place to Tram's. That is totally fine, but I also love Tram's because THEY DON'T USE MSG! Yay!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2011-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "fW1AwXrDQ8fyhMA62jKH_w", "review_id": "8V8BH8F7GnakutLUV78JeA", "text": "Ate dinner here on the 3rd of July. Still dreaming about the Pho from this place.\n\nNot the greatest part of town, but well worth the risk in my opinion for the goi cuon and Pho. By no means do I claim to know everything about Vietnamese cuisine or even anything more than a 'fan,' this is one place that when I make the 100+ mile trip to Pittsburgh, I will definitely stop to make sure I visit. Even if it's just for something to take home (Nothing beats cold Pho to cure a hang-over).", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2011-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "JLS56V5lhErpFUjZ8N8VrA", "review_id": "w7WW4bFdrBzkxecBWYZOrA", "text": "I feel so sad having to bump my review of Tram's down, considering I've been going there for years. However, recently, they underwent a closure for health code violations and the food has not been the same since. A few co-workers of mine got food poisoning there prior to the closure. After it reopened, I went back and the food was very lackluster. The spring rolls were still my favorite in town, but the Pho was mighty disappointing. I hope it improves.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 3, "date": "2012-06-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "3c4kOmumROM7ZEfYAdDwRw", "review_id": "PdZL_3hUIEV4kFbPXtuMJQ", "text": "I really want to give this place more stars but the food at Pho Van is so much better. Tram's Kitchen tastes like home cooking, and it also feels like home with the owner's kids running around. \n\nBut the bun thit nuong (pork vermicelli) was pretty sub-par, even with my already low expectations for a Vietnamese restaurant in Pittsburgh (we're Vietnamese from Cali so our expectations are usually really high!). The pork was so dry and tough it was inedible for me (though the bf ate all of his). The egg rolls were okay but just not the kind I'd sell at a restaurant. The spring rolls were edible yet I have to say the worst I've had (even I make way better ones). \n\nThe waiter/owner(?) is really sweet, and I feel a bit guilty for not supporting the restaurant but I'm sure those that love this place will keep it going strong. I'll try this place once more and hope to give it a better review next time!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 2, "date": "2012-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ukrBUZXE5K1J57FI7ve_RQ", "review_id": "o3rBko_AxVqIu22UZIqlHg", "text": "Great hole-in-the-wall Vietnamese joint. They serve all the standard fare, pho, split rice, vermicelli. I usually get the split rice dish with pork and at 8.95 the portion is very large. The only thing I've been slightly disappointed with at Tram's is the spring rolls. They weren't as fresh as I was hoping and some of the produce was slightly wilted. \n\nIt seems to be a family owned place, the service is quick, and the food comes out even quicker.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2012-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fhNxoMwwTipzjO8A9LFe8Q", "review_id": "l_zCCVGQX2Zlv7TUygjyuQ", "text": "It might be a \"hole-in-the-wall,\" but it's a pretty nice hole with some decent looking walls and amazing food.  Tram's has, arguably (though it might not be much of an argument), some of the best tasting food in Pittsburgh, period.  An instant bonus star for being extremely vegetarian friendly.  \n\nMy date and I split tofu spring rolls which were fresh, delicious and went well with the peanut based sauce provided.  For the main course I had tofu vermicelli which was by far the best item of food I've had since I've moved to this city.  With generous amounts of tofu, vermicelli and whatever coconut based heavenly sauce they put in it, it's hard not to finish an entire bowl.  Throw in some Sriracha and garlic hot sauce and It's almost too good to be true.   For desert we split an order of \"banana cake,\" which sounds kind of stupid, but is actually incredible.  I have no idea what they put in it--maybe a rice based cake, with some beans cooked in, topped with coconut banana cream with sesame seed garnishing?  Really though, who cares?  You just accept it for what it is and eat because it's delicious.\n\nAll of this food for two people with prompt service for $25.  How could you not give this place 5 stars?  A big shout out to Tram too.  I think he's the dude with with amputated arm. He's the man.  \n\nDon't' come here dressed to the nines, expecting a ritzy meal.  Do come here for great food in a casual, yet clean and hospitable environment.  You won't be disappointed.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2012-08-15", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "-OUKIatcSXuF-40IHcarwA", "review_id": "AFsoskpdN087kYDnsCkAfQ", "text": "My favorite pho resturant in town the fresh rolls are great the pho is very tasty.  The prices are good and the food is great.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2012-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DM0YNmkDjdmC1jvGvZq4VA", "review_id": "jzj32ebsCeN1jy6C8gkIew", "text": "If you can get past its humble appearance, Tram's Kitchen has the best pho and fresh spring rolls in Pittsburgh. \n\nThe restaurant, which is owned and operated by a family of Vietnamese immigrants that left the old country in the early 1990s, is very down to earth and low key.\n\nThe service is primarily provided by Tram's father, who has one hand but somehow manages to seat, take your order, pour/refill your water, brings your food, clear the table and cash you out. He can be moody at times, but I have never found him to be rude even on a bad or busy day (he probably just doesn't have time for slowpokes who can't make up their mind). I would cut him some slack if he doesn't appear to be the most patient person in the world. \n\nParking in Lawrenceville can be iffy at times, but if you drive west a few blocks past Tram's there are usually many streetside spots. Cash only. BYOB.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2013-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "z4PkzgCCNJFxlybpkbCSHg", "review_id": "_8nbnNBvEK1lKtM9g5JuYA", "text": "1.5 / 5 - Beef Pho: Kind of bland tasting\n2.0 / 5 - Pork Chop: Not much meat and as much flavor as I'm used to, but still good.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 2, "date": "2013-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Uz6_95dTMr1uvqLFNRB_vQ", "review_id": "fa652U-OvDCf_4b_8zj2ZA", "text": "Being Vietnamese I've had tried tons of Vietnamese Pho restaurants and Tram's has to be one of the worse place I've ever been to. The food was mediocre and full of MSG. I ordered a rice vermicelli dish with egg rolls and they were oily and greasy. The Pho was nothing special and place was small and looks dirty. \n\nMy total bill doesn't reflect the price of the dishes I ordered. My bill came out to be higher than what's listed on the menu. Maybe because I'm vietnamese and being a visitor to Pittsburg for the first time, they think is ok to overprice their dishes on a Sunday night. \n\nAlthough the old man at the place is nice, this place doesn't deserve the stars that's given. I don't recommend this place to anyone especially my Vietnamese comrades whom may visit to Pittsburg looking for good authentic home town cooking.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 1, "date": "2013-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rwhOoAM7lfcwKufFXc8NNA", "review_id": "nLqX84tAkxfXb4_EnkJThA", "text": "Saigon Noodle Soup and Banana rice cake are my favorite here.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2013-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "xoix4JcS1xjK2SWK6N_tdA", "review_id": "VRlIoafXefo_1o7Jr1lprw", "text": "Location:4050 Penn Ave Pittsburgh\nPrice: $ 1/2\nService: Good\n\nMy family was really hungry and everywhere my parents visit they always want to try native food. So, I search Viet restaurant on the GPS and it lead us there- I mean if it was apart of the GPS' top 10 it must be good. I feel like being Vietnamese made me more critical on the food when I do go to Vietnamese restaurants. \n\nIt is in a residental neighbourhood downtown.You're able to park along the streets. It was a very humble environment and very cute. The service was okay, they were really nice and never rude. \n\nWe ordered Pho (of course...), com tam, pad thai, and bun. It all tasted plain;the Pho was a little off, the pad thai wasn't spicy or had enough of the sweet/sour taste to it. The portions were really small. I definitely feel like my GPS lied to me and that I've experienced better.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 2, "date": "2013-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "2UC3rwRm6swuNFt_GhKOhw", "review_id": "tscPqPukkN-dfAi2WvJldg", "text": "Had a great meal here! The food was authentic, delicious and the older man who was our server was adorable!  I loved watching him joke around with the kids at another table who seemed shocked and intrigued by his heavy accent. My friend and I both ordered noodle dishes and were very pleased with our selection. I will definitely try this place again!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2014-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9OZH1Ecw-qUkCW5MS0NefA", "review_id": "eaqd9MaOUhmK-nj7o3NKsw", "text": "I came here awhile ago and ordered one of the rice-based dishes with chicken (can't remember exactly what it was, and there's no menu posted online for me to figure it out).  The dish was dry and lacked flavor.  Perhaps I ordered the wrong dish here, since the Pho seems to be what they're known for.  As it were, I wasn't impressed. I don't remember anything being off about the service, so it must have been fine.  If a dining partner specifically wanted to try Vietnamese, I'd come back and try the Pho, but otherwise, I wouldn't go out of my way to come back here, given that there are many better dining options on Butler St.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 2, "date": "2014-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8FAsGvINcWM6rqWwo3Vsgw", "review_id": "H8Yon238z1V_RCHCXsMnSQ", "text": "I've gone to about five different Vietnamese restaurants in the Pittsburgh area, and Tram's kitchen tops them all. I am a vegetarian and love getting spring rolls and pho. I ordered both which were delicious, as well as coconut vermicelli noodles. The pho had just the right flavour with a generous helping of greens and tofu in the broth. The spring rolls were great, and I believe filled with tofu skin as well as greens and vermicelli noodles. You can also order the spring rolls individually ($1.95) which I think is a plus. The dipping sauce was great! We also had the vegetarian wontons as an appetizer. Everything was fresh and came out very quickly! The restaurant is cash only, but it's helpful that there is an ATM right inside their doors. I will definitely be going back!!!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2014-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "olPcqUp0SEDRY_-8gxk5kQ", "review_id": "MbCtxcxRSh6d6zCgCh4pEQ", "text": "The spring rolls are out of this world. The pho is good. We went for lunch and had no problem getting a seat. Cheap and delicious.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2014-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "b7UDy85TWojW6yhYrVz_Rw", "review_id": "h-4eUHUx5EP8LYSdTYOpkA", "text": "First time here, mid afternoon so I had the place to myself. Given the condition of most oriental restaurants this one was spot on...more on that later. \nFriendly staff, funky atmosphere and patina, good chow at dirt cheap prices. Since funky and offbeat doesn't normally have a negative effect on the food coming out of the back I don't ding them. \nHowever, my trained nose picked up the odor of roach crap. Not strong, but there and it didn't make me bolt. Smell test is one of my criteria and usually I get a phone call and walk out, but I obviously gutted it out and was happy with the outcome. Use your own judgement. As for me I will return for the authenticity.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 3, "date": "2014-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bx4w_8XdeMl7aO5qFa1twA", "review_id": "HA1wrRk9y7K6r7iF7wx3Tw", "text": "This place never disappoints. The Pho is served on very large bowls (that is just the small).  The food has the same quality and taste and for some dishes even better taste than those trendy Vietnamese restaurants in NYC. The fresh veggie spring rolls are def the best way to kick off a meal. This is a small , family run place tucked away near children's hospital- but it is worth the trip.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2014-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FZNhEkiibTsFluG22UUmOA", "review_id": "5uympePLhibIZwOTbKuP1g", "text": "I'm Vietnamese, worse viet food ever! Beware, I don't know how they are surviving here in Pittsburgh . One of our soups looked like it was curry and its suppose to be a clear soup. Please save yourself the trouble, I'm really surprised with the 4 stars.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 1, "date": "2015-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4C4Cq13qfyrScq7jM3V6Fg", "review_id": "nh8EPxTGBm8wKFseKDH28A", "text": "I've heard so many good things about Tram's but I wasn't very impressed. Maybe I just didn't order the right dish. I ordered the beef vermicelli bowl, one egg roll, one spring roll. The beef in the dish was tough and poor quality cuts off meat (lots of cartilage) and too many noodles not enough greens. I love little ma and pa shops so I'll have to give him another try, maybe something vegetarian.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 2, "date": "2015-06-27", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "3klCtdbZ6NqaaqXXbcmBRg", "review_id": "dJiSVecf-9gfIhMD9Z94tw", "text": "The food is delicious, but the service isn't the best at Tram's.\n\nIt was my first time back in several years. I recalled it being a divey type place with meh service and excellent food. My memory served me right. We were welcomed with bright blue vinyl cupcake tablecloths on all of the tables. Heh.\n\nMy sister and I hadn't been sitting for more than 30 seconds when the waiter asked what we wanted. I said we needed a minute, but he came back 15 seconds later and hounded us again. It was lunch rush, sure, but there were plenty of open tables. I didn't understand the urgency if there wasn't a line going out the door.\n\nI hastily made a decision of pho while my sister got a dish he suggested, the curry chicken. Both dishes were great. I am not normally a curry fan, but the curry flavor was dulled with coconut milk. And the pho made excellent comfort food. Spring rolls are also awesome, although I prefer veggie over the regular pork ones.\n\nOh, and it's cash only. Ugh.\n\nSo yeah, there are some drawbacks, but probably one of the best Vietnamese restaurants in the city.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2015-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1Ng6BPhzBmCkjTrqQE8dsA", "review_id": "tcUgYZ3S5j-o49O6mlLR5w", "text": "should've come back for its desert. When we arrived they only had banana cake with coconut milk. You can't miss pho and spring rolls here.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2015-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "btXdcK7A8UYbq4r0--m7DA", "review_id": "rtqVYw6yKe_26ExRflGRZg", "text": "Not as good as I remember it being the first couple of time I've been here so I think I will try a different Vietnamese place next time I'm in Pittsburgh. Still good though.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 3, "date": "2015-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MvacyOnOil2BDx9Buw5wJg", "review_id": "GxG9us0TyX2RgJ6fwFMHUw", "text": "I love pho. I visited many pho restaurants all over the nation. Honestly, pho and fried rice here are below average. The serving size is small as well. I am disappointed.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 3, "date": "2015-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ebsr5Hg2hE99-iEzSRPdBg", "review_id": "O_XTZ-Zd1lw0ioez7D3EvA", "text": "This is a wonderful independent establishment in a sea of corporate-bland food!  \n\nThe food is very fresh and quite reasonably priced.   I almost always order the pho, but the steak salad is just as good on a hot day.  Like all great soup bowls you are encouraged to add as much spice, basil and lime as you like.  Don't let the small size throw you off, this place is GREAT!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2008-06-24", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "kj5O3qxSmXlPIWxiD9Evdw", "review_id": "5ENu3wHvd7qBKTyVF0M0pA", "text": "I've been eating here for over a year now and the food has always been consistent and fresh. The broth of the pho has always been one of my favorites and the marinated beef Bahn mi (vietnamese sandwich) is out of this world. It's very easy to feed 2 people, a filling meal and healthy meal for less that $20.\n\nI've noticed that the place has definitely more customers now so that tells me that the cafe is doing something right. The service is always quick, kind and mindful.\n\nI will always be a customer as long as they are in business..", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2009-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_l26-ZZq6PVZt6NdF_KNDw", "review_id": "WE3NRf-JmiPfounmEKA6kg", "text": "I miss this place! I used to get lunch from here quite regularly when I worked in the area - excellent noodle bowl with imperial rolls, fresh veggies, and great tea. Well priced. Friendly and quick service.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2009-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gP-l_Gb8PWTsqupoKqsccQ", "review_id": "KO6EHxKxnJMK21CmMvQuIg", "text": "I'm vising from the Bay Area, where great Vietnamese places are on every street corner, and I've been searching for some local Vietnamese places for some time. I was VERY happy to find this place!  If there's one thing I don't like about Scottsdale, it is that most 'good food' places are way too fancy; I want 'holes in the wall' with stellar food and this place fit the bill.  \n\nI'll be back to try their sandwiches, but the Pho (soup) was a good start.  Everyone seemed to know the owners, who obviously take care of their clientel.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2009-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "OTs44TUNInIwVDX4JkYFgg", "review_id": "dc0bRcdmfyA95QfXXpRYlA", "text": "This was my first visit and I've been wanting to go for some time. It was well worth the wait. I enjoyed it very much. It was a lot of food but, didn't sit heavy on you at all. Very simple food with very fresh ingredients. I had the beef noodle bowl with the egg rolls, next time I want to try out they're soup.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2009-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cOfNTptaK6p5oUq5_ROokg", "review_id": "y4j3erwsCx85ebKMWAgtRw", "text": "First, overall impressions are very good. This is a nice, simple, hole in the wall. It's a simple, friendly introduction to Vietnamese cuisine. It is what it claims to be - a \"Vietnamese Deli\". You order at the counter and your food is brought to you. \n\nI had the Beef Pho which had a very nice broth (once I added the requisite amount of chili sauce - personal preference) with tasty meat and rice noodles. The amount of meat was a bit skimpy, but ok. My friend had the chicken salad which was basically a salad topped with grilled chicken meat, which was accompanied by a very tasty dressing. I had a nice green tea with pomegrenate that was very tasty. Didn't sample the Vietnamese Coffee as I didn't want to have a particularly late night. This is a place I'd come back to for a simple meal before or after a movie at the nearby Harkins Scottsdale 101. \n\nSome of the possible negatives are price (a bit high, but heck it is Scottsdale, and the rent must be a small fortune at that shopping center), and the lack of choice. \n\nGrades (a new tradition in my reviews) \nOverall:  B  (there is only one grade for food, and nothing meriting an \n                      overall grade reduction)\nService - No Grade - as there is no real table service here. Folks at the\n                 counter were nice though\nFood -     B - Above average. Good, fresh, simple Vietnamese food, \n                 albeit overpriced. \nDrinks -  No Grade - as I didn't sample the Vietnamese Coffee, and\n                no alcoholic beverages are served here.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2010-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YVoYGVIlQpsxmiAFBiltgA", "review_id": "_HHHSX0WZF1KkdIMF2X3PQ", "text": "I only give this place 4 stars because I am not sure who to compare it to. I have not branched out and found other convenient Pho places near me since I moved to the Valley 2 years ago. This place is right near my work, and I can get in and out for lunch in well under an hour. It is a 'mom and pop' place and the owners are always manning the register or serving the food. I like that. I have had both the chicken and the steak Pho, and the steak kind of turned me off. The beef looked very unsavory and didn't taste great, but the chicken is always good and never too dry. All in all, a good place to try.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2010-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JkUJz70emHJOM8XVF-stTA", "review_id": "B4E43kWawno5cfp4gmmvvQ", "text": "Love me some pho!  Good stuff here, no bells and whistles.  I come here a few times a week.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2010-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "HJnszqeMUpFiWshaAswueQ", "review_id": "wseLNUhEe2uCAC5-wQqdjA", "text": "Love this place! I love it so much that I'm very surprised at the tepid reviews. A cozy Vietnamese deli with warm, fast and efficient counter service, this is exactly the kind of eatery I regularly seek out. \n\nI tried the vegetable sandwich and the Vietnamese coffee. The sandwich, served on French bread, was topped with fresh veggies, including shredded carrots, cilantro and mint, and a sweet aioli spread. It was flavorful, fresh and filling. The coffee, mixed with condensed milk, was sweet, but not too sweet -- just the way I like it.\n\nMy only complaint: it's a bit on the high side for this type of fare. My meal came to $10; at Lee's, the tab would have been $7 tops. But this a nicer place than Lee's, where the service and atmosphere leave something to be desired.\n\nI will be back. This place is a new favorite.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2010-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "omuO9FVYAVRTybkSc4a4fw", "review_id": "yDlX1RqNnXsq5czkuL8b1g", "text": "As far as a variety of Vietnamese restaurants to choose from in North Scottsdale, there is none.  Just the fact that this place exists where it does warrants at least 1-star!\n\nI've been here a few times and it is always good.  The menu is not very big...but everything I've had is always good.  It always bothers me though that they don't call their pho by its real name, or their sandwiches as banh mi.  But oh well, this is NoSco...have to cater to culturally inept folks.  I've had their beef pho, and it was decent.  Nothing to rave about from what I remember, but it definitely works.  I'll need to try it again to give a full report.  Recently I just tried their #7 \"Marinated Beef Sandwich\" (Banh Mi)...and it was delicious.  Thinly sliced, marinated pieces of beef (grilled), with lettuce, cilantro, shredded carrots, cucumbers, and a yummy mayo sauce.  I'm not as well versed with Banh Mi as I am with pho (im a \"pho-natic\" lol), but as far as my taste buds could tell....the sandwich was darn yummy. \n\nThe owners are always there and as others have said, are super nice.  Although I don't find it to be the most authentic Vietnamese place, definitely stop by this place if you enjoy Vietnamese food and need your quick fix.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2010-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bq1fa6fmeFPXa7qe2pU1Hg", "review_id": "wS1dEYeEtPbcNtLmOj3x4w", "text": "Absolutely delicious.  Quality materials, phenomenal flavors - everything to love.  It has a nice mom & pop feel despite being in a strip shopping center in Scottsdale.  It's hard to decide between the beef noodle dish with eggrolls and the sandwiches - so I rarely choose - I just get both and take it home.  This is the kind of place where you order extra to have for later!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2010-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JkUJz70emHJOM8XVF-stTA", "review_id": "trbXS_dkW8yg6R0knD5XLA", "text": "This is the best Pho I've found in town yet.  Good spring rolls to, the sauce was a little to runny though.  I hit this place up 3 times a month to get my vietnamese fix.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2010-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BMaSKG7JmKK1-YumiegGTA", "review_id": "6_r_m_1rhuojX46cgfAJew", "text": "This place is awesome! I have been coming here for years, and have never had an experience that was less than stellar.  The pork chops frequent my dreams, the egg rolls combined with the fresh mint are incredible, and all the soups and sandwiches are great lunch options.\n\nWhat makes this place so great? Well, first and foremost is the freshness of the ingredients.  Second is the simplicity of the menu, there are not a ton of options, but everything is excellent.  Third is the service; always friendly and efficient.  \n\nIf there is one problem it is that seating can be limited during busy times, but that just speaks to how awesome this place is.  I have recommended Tea Light to many people and they have all loved it, so if you haven't tried it, you missing out.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2010-08-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "AvzoWeiZ1yMZKlYU8jB2PA", "review_id": "xHXVJV4jc_34_cs6bb35QQ", "text": "I'm giving Tea Light Cafe an extra star (well deserved) for being an independent restaurant in the middle of corporate-eatery-Scottsdale. But rest assured, the food, value and experience merit a solid 4 stars if not higher. I dine here often and every meal has been spot on. Ethnic food is a staple of mine and Vietnamese dining is always a treat; I think it's healthier than other varieties, but what do I know. I'm still eating off value menus.\n\nI've had the Pho several times, and it's very good; but I'm not a big Pho fan. It's soup. I don't care how big the bowl is... soup is not a meal. It's an appetizer. If I want a light meal, I order their Spring Rolls. They're loaded with shrimp and some other meat (I think it's pork) and the wrapping is see-through. I can see what's inside the roll.  I love them. Yes they are appetizers too, so if you follow my philosophy, they should not count as a meal either.  But they are shaped like hot dogs, which are a meal. Are you following this?\n\nMy favorite dish is \"The Number 3\" which is a huge bowl filled with rice noodles, grilled beef, lots of veggies and it's topped with an awesome egg roll. See the pic uploaded by Renick T. That's my dish and I'm sticking with it. This dish is featured at many Vietnamese establishments.  Tea Light does it very well. When I eat this dish, the entire world comes into balance and I feel an inner connection to the universe.  The Buddha statutes in the shop come to life and smile lovingly upon me, my meal, my table and my pals.  OOOOOHHHHHMMMMMM.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2010-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1ykGYq1ERicaZWCl5-Vi0Q", "review_id": "e356FVhNxcLhwexx5P2Ang", "text": "Incredible chicken sandwich.  Go for it!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2011-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1dBSo9Ko5is2X51zgb-YcA", "review_id": "k46X2eFY9OI5TLxSzQO_ww", "text": "Although my Vietnamese friend informed me this particular place wasn't completely authentic, we both agreed that the flavors were fresh, simple and yet still rich and full bodied. I've come here on several occasions, and I'm always satisfied and pleased. All the dishes are I've tried have been pleasing.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2011-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "GrSixRnGIxNUJ1Cn5DNX9A", "review_id": "bYcGdXl1KLCf5lyHv2LbSQ", "text": "A tip of the hat, make that a Non La, to these folks and to Vietnamese food in general.  The perfect place for a quick and filling lunch that's easy on the old wallet and gentle on my diet.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2011-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OAOLns-lBot5ady6a852jA", "review_id": "cn-E3HueV5TsQL8t4x7T4A", "text": "I have to say that this was a great restaurant. My partner and I went there for dinner today, and we both enjoyed it immensely. I chose the beef pho, which I had never tried before, and was very impressed. The flavor was very good, and it was filled with lots of great ingredients. My partner ordered the beef and rice bowl, also very delicious. The beef had great flavor combinations, sweet and salty, with a nice kick to it. It came with two egg rolls on top, which were some of the best that I've ever had. For these two entrees and two small drinks, it was just about $19.00, which I think is quite a considerable bargain because of the huge portions that you receive. We will definitely plan on returning to the wonderful establishment, and recommend it to anyone who is willing to try something different!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2011-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kro2HFG_Kt4E_Er_efkTuQ", "review_id": "zAXNBCrfsbuw_-8ND7tLDw", "text": "Fantastic beef noodle bowls. The beef is perfectly charred and delicious. My only complaint is that the staff isn't always super friendly and sometimes the wait is a bit much.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2011-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3zKT-gMYsUmoOT7ffc76dQ", "review_id": "GEvx4rx6BGfB-zUbzIOBLQ", "text": "It is my favorite vietnamese restaurant.\nIt's small but clean. Their soups are great. They serve fresh and tasty foods.\nPortion is not big enough for me though.\nI wish they serve bigger size meals.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2011-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "L87hrFVD-53NV8xRvoWfUw", "review_id": "5YraqgNnsFvh6Vo0Xlv7oA", "text": "I am definitely not an expert in Vietnamese food, just to put that out there.  That said, I really enjoy Tea Lite Cafe.  My co-workers and I go here regularly, and it is a staple in the portfolio.  \n\nI get the #1 and honestly don't remember its name, only the deliciousness of the rice noodles and beef.  The beef has amazing flavor and I wish there was about twice as much included in the dish (not just because it tastes good, but also because I could use a little bit more protein to get me through the afternoon).  We often get an order of the shrimp spring rolls to help supplement the lunches here.\n\nThe service is very fast.  Important tip for weekday lunches:  get there early!  This place fills up quickly and does not have many tables.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2011-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "OPStKHloEOVxcBtFgkzh2A", "review_id": "C-LArid4oXa0JG_uL25p7A", "text": "This is Vietnamese food for North Scottsdale white folks who have never had Vietnamese food before.\n\nIt's a fast food style place that gives you food with very little flavor and tells you to start adding sriracha and oyster sauce util it starts to taste good.\n\nReally really bad.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 1, "date": "2012-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z-FMZxH6n4EjQefRC1BFcw", "review_id": "DGX48WOM0BFpEipCADQJmw", "text": "Great place, cheap, clean, healthy food served fast and with a smile. Nice place to have in the neighborhood.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2012-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NkxFV7RefN87jL_LeVlIPg", "review_id": "Le6lmQkaPC2jV6aJHbmVnQ", "text": "Super friendly staff great food! The Pho is great for first timers and the Pho lunch special is hard to beat. Also love their #3, noodles, egg roll and beef. And cant say enough about their porkchops.\n\nIt can get busy at lunch but the outdoor seating is great when the weather isn't scorching.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2012-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FCVknrnKGWvHx3nyprHC-w", "review_id": "YuFp5YhnRTzXVxql7Jyk7w", "text": "oh boy, I guess if you haven't had much exposure to Vietnamese food then it would be decent.  I'm from San Francisco and this place would go out of business in a heart beat up there.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 1, "date": "2012-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eZZwcrpbf9M8AlEQT3DsCA", "review_id": "-lE4nGvaYFAFmn1cmncE1w", "text": "This is a great Vietnamese find!  I have been a loyal customer over the years and even though owners have changed the great quality of food has stayed the same. Everything is so fresh and service is exceptional. It's a nice casual feel and a perfect place to go before catching a movie next door. Prices are reasonable as well!  The pho is in a good size bowl, enough for someone who is very hungry.  My personal favorite is #14, grilled beef and rice. The spring rolls are delicious as well.  This is an all around great restaurant!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2012-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SPm5FDNORF6LMyt3FII7WA", "review_id": "2Sho3E29C1ntEYmfKmWXvw", "text": "Where to begin.  The beef sandwhich is just awesome and tasty.  The beef is juicy and the sauce is good.  The bread is crispy on the outside yet soft on the inside, combined with the fresh greens on the sandwhich, it's my favorite thing on the menu.  The chicken pho is right up there with the sandwhich.  The broth is just delicious as is the noodles and chicken.  You also have the choice to spice it up with a side plate of other ingredients that accompanys the dish.  The staff are very friendly and nice.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2012-08-19", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "DU-t8kK8HJKZ3iGDi63sJQ", "review_id": "d7e4XufpKzaD_BuSMTiphA", "text": "Hands-down our favorite fast Asian restaurant.  My husband and I love Asian food and their food is awesome.  The spring rolls are soft, not fried, which we love and the soups are favorites of ours.  Service is fast whether you're taking out or dining in and we love that we see the owners there often.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2013-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Jmfjq2QR2PmMBl7NOy2z9Q", "review_id": "0loGNpvpTlRNUzV-4omtrA", "text": "The best Vietnamese restaurant in Scottsdale.  Great Spring Rolls, Bun Ga and Pho Ga.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2013-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "1diI7PX0AxbbtiUB7nPbuQ", "review_id": "LY4OlZmRYt0UtZRBm-74Xw", "text": "Had the best chicken sandwich in the valley, really popular item.  But mysteriously they've now stopped making sandwiches.  Pho and grill are great, but I'm traumatized by this puzzling loss.  Maybe they just want to be a pho bar now?", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2013-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lJwkB4mnLdHdgeUtJsVGsQ", "review_id": "ItaTZ4w_ApOnlyTPsHHWpA", "text": "I have never had pho... But my buddy Jesus eats it ALL the time! So when the team decided to try pho for lunch today, I was in! Get this... Didn't order pho! I asked the cashier what I should get. She compared pho to soup, and well... I don't like soup. So I ordered a chicken and rice noodle dish. It came with 2 egg rolls, and was delicious. I ordered a Taro Bubble Tea, too. I am pretty sure I can't eat again today, but it was delicious. They have three sauces on the table, too. I tried them all, and my favorite was the sweet almost plum sauce. Will definitely go back. Hidden gem, really.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2014-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5oLRbdwcpgAcFaqr2A8BDw", "review_id": "5JR9OOOlgNkZ6ZUVX84MRQ", "text": "Tea Light Cafe has been one of our few go-to eateries that has been consistent and dependable in providing us with meals that are delicious and satisfying.  We've tried just about everything and love each and every dish. Whenever I have the sniffles, I want their Pho that comes with the freshest condiments. Their broth is so flavorful all on its own but blends beautifully to all the condiments.  My personal favorite is the grilled marinated pork/pork chops. Whether it's served with rice or on vermicelli, it's a win! The finished product after grilling is just amazing with its sweet & savory marinade caramelized to perfection. This will have you craving for more again and again.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2014-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yP4n2ktMbnMarZQslHEZuA", "review_id": "Lya0GyHh89bE-ANzxP2TUg", "text": "What a huge disappointment. Was really in the mood. First the guy gets the order wrong and is slow to correct the mistake. I order grilled chicken. Seems  simple.\nI have never seen or tasted chicken that looked more like sundries dog turds.\nDry, causing me to choke. You can tell I am loving this place. The man behind the counter seemed mildly annoyed taking our order. The girl was sweet if not somewhat clueless. Sound good? Took two bites and left. Wondered why I took a second bite.\nSick. They could have cared less. Oh the rice was mushy. Slice of cucumber", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 1, "date": "2014-06-30", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "kGwY9AcytkJGLAM5qIx48Q", "review_id": "LhW6hm4CTqYAYiC9v_YobQ", "text": "I've been here three times, the food is okay.  The prices are good and the customer service is okay.  If you want a quick, Vietnamese dish such as Pho, give it a try, the prices can't be beat.\n\nOne thing that disturbed me as I noticed on my last visit, the owner dumping the remaining customer's water into the money plant that sits in the front when you walk in.  It kind of grossed me out.  As you know our mouths breed bacteria, and it's being mixed and cultivated in that money tree plat.  Yuck!\n\nFor that reason alone, I may not come back.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 2, "date": "2014-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DV7XGdZZT-7nOIF2cSXoWg", "review_id": "i9UiluXmPCAYRM3eH3HIwQ", "text": "I was pleasantly surprised to have received a bowl of pho that hadn't been Americanized! Was it as great at Pho 43 in Phx? No, but, the best in Scottsdale so far!!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2014-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oRyOHyNcQs0W2zRIYArmaA", "review_id": "rfL5CLONje3lrBbwK9GX3Q", "text": "If you like Pho and going to movies, this is a great place. Right next to Cine Capri movie theater in Scottsdale 101. The Chicken Pho was tasty with a great broth and plenty of add ins. Good sauces to add some kick as well.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2014-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tEKNyp5s2D42y7Iz5cIWUw", "review_id": "-_gKherFIOnifVPoAmSc3g", "text": "I have nothing to compare this too as I've never eaten Vietnamese food ever. I've also never tried pho. Stopped here for lunch on a whim and it was delicious! The place was packed (good sign) and my husband and I got the sampler thing (pho, egg and spring roll). It was all yummy although we had no idea what to do with all the extra - the sauces and things that came on the side- we needed a tutorial! We will be back!!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2014-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fiLa1_QvZKpkWQfJXVpLsw", "review_id": "ZyXrgCzXv6SWxLBwyB_EOg", "text": "We had a great beef pho.  The owner was extremely kind and let us grab some takeout even as they were closing.  We sat outside and enjoyed a great meal.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2014-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SKqR-l-Dmy0grYfeF9ECAg", "review_id": "F7mrYiEtBCcLa67IwF47zQ", "text": "I really enjoy eating here! The price is very reasonable, the cashier and server are very attentive and helpful. I only wish they were open on Sundays! Have the delicious chicken pho and taro bubble tea!!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2014-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pprq_7lgBT-WDFGPQe1a_w", "review_id": "cNk0jifgzj6GZ6fys1-I3w", "text": "Great little Vietnamese spot has excellent pho as well as the vermicelli noodles, great egg rolls and spring rolls everything is fresh and made to order.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2014-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "4CgusCZkipvUhvBZrRD46w", "review_id": "s0RZqCEXfkcIpKZBAmdSDw", "text": "My review is only for the spring rolls which I got as take out.  I asked that tofu be used instead of shrimp.  They were $6.99 for 3.  Nice size and full of fresh greens and enough tofu.   I checked out their menu and plan to try their PHO.  I have had PHO in many places (worldwide) and I know what a good PHO is.  I will report on my adventure with PHO at Tea Light Cafe as soon as it happens.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2015-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "cXnWZPcrtHjKXbcNzulg2A", "review_id": "nsj2ss_e_y4ZqKH7z9xwFQ", "text": "Uh oh... Last two visits have been sub par. The noodles were gummy and seems something is off.  I always get #1 or #3 beef. #3 comes with egg rolls that are really good.\n\nSeems having two locations is starting to put pressure on consistency. I hope my next visit is better.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2015-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JX8-wnpNLp0PONYA7NzMRQ", "review_id": "yCs8RCbNib5Yj7-0dXfAoA", "text": "Found this little gem with an entertainment book coupon...it was great! I had the tea light special with beef pho noodles and the flavor was awesome! The egg rolls were excellent too. Crunchy, fresh, and hot just like they should be The pho broth was flavorful and tasted very rich and smooth. My mom had the number 1 with grilled beef and it was amazing too. Tender beef, crunchy cool veggies, and a nice sauce that complimented the dish well. Great location right next to the movie theater so it's convenient for dinner and a movie. We will definitely be back, thank you for a great meal!!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2015-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xFYguuRPof7hLuWfLbQEZA", "review_id": "UojahsY1ckSnkUGteolPBA", "text": "Good food, great services, good people! Definitely give it a try! Pho, bun, rice! They got matcha tea, boba drinks, Thai tea, Vietnamese iced coffee. This is the real deal PHOSURE!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2015-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VmMFY0D9cOMXLnRBVci7Ag", "review_id": "8vx805NUK8IfE5336UgnEA", "text": "The pho was delicious (i got the beef) and of course, it was a generous serving size. It is a very cute environment with gorgeous tables. It's a neat place to go if you want an adventure. Also the Thai tea was an orange cup of deliciousness! I recommend going!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2015-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ms5nnil4OSdRJGS-fI5Svw", "review_id": "4au70LZuIfWCfxQGNS6v6Q", "text": "Awesome food every time.  I've tried several places for pho around Phoenix, Scottsdale and Paradise Valley and this is by far my favorite.  You can taste the difference in the quality of ingredients.  Yum.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2015-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6Vo79hXzzmL7lRKsDlKJZA", "review_id": "Mx_BzpnxQ3mz55bKzobJPw", "text": "I can't believe this place has such high ratings!!! You people need to try real Pho. I just left out of there disappointed! It was sooo Americanized, as I expected but hoped I was wrong. The beef in the pho was tough. The boba pearl was under cooked and hard.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 1, "date": "2015-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "aanQAeF8EDsbZ6l5YddEsQ", "review_id": "UXt8VeV9WpTPnmjbL7AFzw", "text": "HIGHLY NOT RECOMMENDED: \"They\" say there is a first time for everything. And there is also a last time. Today was probably both times for me at the Tea Light Cafe. \n\nAfter ordering our food, we were presented with the option of eating outside in 100+\nDegree temperatures or waiting for someone to clean the only 4 top table open. We elected the latter of the 2 options. After patiently waiting for someone to clean the table I finally cleaned it myself. Ok. Not too bad but not what I expected. \n\nOur food came out lightening fast!  As I took the first bite of my egg roll, I was in heaven!  It was delicious. Next, I took a bite of my beef and it was ice cold. I asked my wife how hers was and she said cold. It dawned on me that while I was putting the dirty dishes left on the table by the previous occupants, I noticed a cart with 2 pre-made lunched that were exactly like ours. Seeing this was my first time to Tea Light Cafe, I thought maybe our meals were supposed to be cold. I asked the guy that dropped them off if that was the case. He said no and that he'd be right over to fix it. \n\nHe scooped up our meals and came back a few moments later. Our meat was warm but it was as tough as shoe leather. My wife stated the obvious, they reheated our meals and presented it to us. Too bad, as that is the worst thing a restaurant can do. \n\nI think we caught them on a bad day, as the foot traffic was nonstop.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 1, "date": "2015-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "N98mJQDzTjzT216SFVeBDQ", "review_id": "4_zLYxoWrEHZSbrm52BcMg", "text": "It seems to me a strange decision to take your typical vietnamese restaurant and turn it into a not-so-typical vietnamese restaurant and then raise the prices, but not the quality. The old vietnamese restaurant that stood in the same place was typical and nothing to write home about. When I saw the new place pop up a couple years ago, I was intrigued but never thought to go there, being that there are at least 2 restaurants in that same plaza that I would much rather go to. But I had the urge to try it with a friend and I came out unimpressed. There are about 5-7 Vietnamese places within a 10 mile radius of this place and I find it strange that their prices are higher than all the rest. Their soup in pho wasnt especially good, though it was passable. Their rice dishes seemed to be on par with others but for the price you would expect more. The only redeeming thing about this place would be the more contemporary decor that you don't see in most other Vietnamese places. It was cleaner and from the table setup you could tell they are aiming for a higher echelon of clientele.  \n\nThe bottom line: The food was ok. The ambience was better than most. If you care about such things then this may be the place for you. As for me, I'd rather save a couple bucks, endure a nondescript dining area and go to one of the many places just minutes away.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 2, "date": "2008-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "fUs5XxOR82Hfrnyl4wi2QQ", "review_id": "PkopbOVw-RVq1VrIMI67Yw", "text": "Went again for lunch on 6/29.  Only one gal waiting tables and they were pretty busy for lunch.  But she did a good job and relatively speaking the service was good and our food came out fast.  We ordered about three entrees again and two appetizers.  As usual, everything was good and the prices are still \"right\".  I guess you can say that this place is not the greatest Vietnamese restaurant in town, but it is pretty good, the service is good and friendly, and the prices are great.  More people should give it a try!!", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 4, "date": "2010-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "WgX4RZT2nbqXcJclDWHWYg", "review_id": "MesV8TLYjvsgKzaqnVyWbQ", "text": "In short? Great food! Bad service. However I can't look too far down on them seeing that it seems they are recently under new management & seems to be run by a little old couple. Very friendly owner! Best of all they had vegetarian pho with huge pieces of veggies and tofu. Actually if there was one complaint about the pho, it would be there was just too much going on in it! Huge chunks of bok choy, carrots, broccoli & cauliflower florets... I didn't even come close to eating it all. Pho is one of my meat-weaknesses and I can't express how happy it makes me to find a delicious veggie pho. Makes me want to move to Mesa! I wanted to give it 5 stars, but I took one star due to the lack of efficient front help.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 4, "date": "2010-08-01", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 2}, "user_id": "Phj1jHdpcPPBE1hNg9-Tqw", "review_id": "2zsckTWgmxxbWm-SqekMIQ", "text": "Nirvana in a Pho Bowl! Absolutely breathtaking broth chuck full of Sirloin and what they bill as \"well done brisket.\" Enough meat to have meat even with the last mouthful. Manager told me they \"stew the broth\" for 24 hours before serving. No jalapeño necessary, although they serve plenty. Nice hotness, lots of bean sprouts, etc. MAGNIFICENT! Can't imagine anyone is going to find any better in Phoenix, although Pho Ao Sen comes very close in their broth quality and is a much prettier and nocer Restaurant. A relatively nice bargain at $6.50. They have an even bigger bowl at $7.50, but can't imagine it! Have had the Seafood Pho and it was Phabulous! The lady in the \nkitchen is a \"Master\" and she ran a Pho Restaurant in Saigon in the eighties, serving 600 Bowls of Pho a day. The Father of the Owner has recently taken over operations, but as long as that little lady is in the Kitchen (The owner's Mother!) all will be well and nothing will change! My #1 best Pho in Phoenix, but only by a little over Pho Ao Sen, also in Mesa!\n\nAsked for a Spring Roll recommendation, he recommended the \"Roast Pork\" and it too was Phlavorful and Phabulous! \n\nThese folks are very nice an accommodating and put out a PHABULOUS Bowl of love!", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 5, "date": "2010-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mE2ll6yfwUvy-W7To3E0AQ", "review_id": "hcPQ8PVdK0VUFahxT99cMA", "text": "Pretty good little pho joint. My regular lunch posse (that is what I like to call them - because it sounds better than me and 4-6 engineering dudes) wound up here today somewhat by accident, but overall I think we were very pleased with the service and the pho. \n\nThe gents all ordered their usual beef pho and I had a chicken in a beef broth. The servings were huge. One of my companions ordered the large bowl, which would have been enough to feed three small children (or this guy). We eat at a lot of Vietnamese restaurants on our lunch outtings and one of my regualar cohorts recently made the best Pho I have ever tasted - so our expectations may run a little  high. So, a 3 star review from me for pho is a pretty good one. I'll definitely head back to try out some of the other menu items soon.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 3, "date": "2011-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y4q0itayukTXnRNo-yXbWQ", "review_id": "KWVSkZ1auFW0MtStf2aJRQ", "text": "I used to work here when I was going through beauty school and I'm pretty sure it has become my golden standard for judging Vietnamese food. Nothing measures up to the flavor and freshness of this place. I still love it and will travel from central Phx to mesa just to eat there. \nOpen one in central Phoenix, I swear it'll take off!! and I will work there a few shifts again too :o)", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 5, "date": "2011-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Xekh5u-_EjwKcL18YrYaVg", "review_id": "3JWZI88ngjKvtZ1S65urew", "text": "It is under new management.  The food is not quite as good as before.  The spring roll wrapper was dried and hard as if it was made a while ago.  The pho soup was too peppery, which is very unusual.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 1, "date": "2012-06-10", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "Ac_4U3LDCrNgf6Z9OP3kXA", "review_id": "n7h6DQVlEr5WLZZn068M_Q", "text": "BEWARE THE FISH MINT!!!!\n\nThis was a new experience for me.\nI've been to oh-so-many pho places all over the country, and not one of them used this traditional (but disgusting) herb called FISH MINT.\n\nSpring rolls - basic - can't go wrong?  oh but it could...\n\nEveryone kept tasting this fish taste and we thought maybe the shrimp had gone bad (we are in AZ, folks).\n\nThen my friend's salad came out.  FISHY.\n\nThen my bun.\n\nI put all the leafy greens in there liberally (I do love my greens), and then I got this big mouthful of... ROTTEN FISH.\n\nBLECH!!!!\n\nI literally spit it out and almost gagged.\n\nFinally I called the waiter over cuz I was bankin' on a free meal (what with the vegetables being left out with rotten fish, or something), and he just laughed and said,\n\"Oh!  That's diep ca!  It's very good for you.  Some people don't like it... Next time we'll leave it out.\"\n\nand that was that.\n\nIck.\n\nWho likes the taste of rotten fish?  I actually like the taste of fish sauce, so it's not like I'm a total nay-sayer on all things fishy... but DAMN... that $h!t tasted NASTY.\n\nI had to google it, cuz I thought he was just making it up.  But there really is an herb called FISH MINT.\n\nBEWARE!!!\n\nThe Pho is safe.  Apparently they don't serve it with pho.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 2, "date": "2012-07-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lJ-ekmTgccWZm6ByUbIeDA", "review_id": "RYMfUPzOcNMalbkTXZYfcw", "text": "This is our family go to place for Pho.  It's very good. Other dishes are also very good.  We are regulars with a half hour drive.  The best we have found in the area.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 4, "date": "2013-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rpg9s9cd4UXZwBl0t-vXFg", "review_id": "Tyn6E4wZE6sk5av6poQlDQ", "text": "Been going here for a little over 2 years and the owners feel like family. The food is always amazing and fresh, the owners are super friendly. You can tell the little lady gets joy out of making her food for people and she is damn good at it. \n\nI recommend the Pho, Vegetarian fried rice with veggies, Orange Peel Chicken and the Angry Chicken. Oh yeah, and the spring rolls are killer.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 5, "date": "2013-08-08", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "QUlZ0qEpV3eYeZx_jMtnoA", "review_id": "u0-ui8EL-GRGvcxmmm_GiQ", "text": "Being a huge fan of Vietnamese food and how healthy it is I tried this place with a friends recommendation. He had pointed this place out since it had the very same menu as my favorite place Da Vang. Knowing this I thought this place was maybe a family relative or something and might have a very similar food, which should be very good. \n\nBoy was I wrong! So wrong that I would almost have thought that my friend was playing a horrible joke on me. Had he not been sitting next to me I would have thought that he was not serious about this place. Almost so bad to the point that I had to question our friendship for a brief short period we were sitting there. \n\nTo start, the spring roll. One of the most popular Vietnamese creations that everyone knows. When done right it can cause overloading emotions of happiness and satisfaction. We all know that a good spring roll is a sign of a good beginning to a meal, almost like that first real good kiss you get. \nWell this one is not it, small, skinny and filled with nothing but lost hope and broken dream. Small portions of shrimp and meat, if there was any meat in it at all. Most of all the they even cheaped out on the vermicelli noodles, lettuce and mint. More like the worst kiss you ever got , bad enough to break up over. \n\nThen the pho, the staple of Vietnamese cuisine, the first thing that anyone thinks about when they hear Vietnamese food. Well upon ordering the food I expected a delicious and heart warming soup. Well the broth was flavorless, I could have made a better one with water and  a bouillon cube. The dish was beautiful though. So simple, and the onions and jalapeno cut thin as they can get it and the cilantro chopped roughly. The taste was just not there. \n\nThe service like any Vietnamese place was lacking. This place was the worst of them all. The server, a kid who spoke no English paying no attention to anyone and not caring at all.  He must have gotten suckered into free labor by his father or someone who equally didn't care about their patrons.\n\nAll in all the visual appeal of the pho was amazing in that the small details of the ingredients were executed nicely. The  spring roll was done poorly and you can get a better one from Trader Joe's. The flavors of the food lacking in all aspects, please someone give them some salt and pepper to cook with. Pho in it's greatness can be enjoyed with out all the sriracha or hoison we all love to ruin the natural flavor of the broth with, but this place it is needed to bring the brown water of a broth to life.", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 1, "date": "2009-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "LQHQiG2qnjqE64ioe060Hg", "review_id": "YX6jzWZKAGYUH-TSaZqDRw", "text": "After going to and trying many different Vietnamese restaurants, this hands down is my favorite.  Please note that the good stuff is located at the back of the menu under family meals.  Once there, try the Tamarind soup.  It is like nothing you have every tasted and will keep you coming back.", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 5, "date": "2009-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "xdWsnbaTEfBMVHttqZDHxg", "review_id": "a70HGg1aJypJxJMp4Wz3Og", "text": "My fave place for Vietnamese...  also being Chinese myself, I adore won ton and I can combine my love for noodle soup and won ton here.  #22 is my fave for pork/shrimp won ton and noodle soup (#23 is more won tons, no noodles... might be a new tactic for the 3 of us, get 2 bowls of #22 and 1 bowl of #23 and divvy the noodles and won tons accordingly).  Their broth is very good, not oily and greasy on top, and something I'm willing to sup down with edible ingredients (I tend to leave broth in the bowl at pho shops).\n\nIn the summer, I always get one of the refreshing \"desserts\" which I really treat like cooling drinks... the seaweed or longon versions.", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 4, "date": "2010-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "xdWsnbaTEfBMVHttqZDHxg", "review_id": "N_lhitnkv369dZR1NqxRbA", "text": "Moving the review to Phu Thanh... this one is a misspelling.", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 4, "date": "2010-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "xdWsnbaTEfBMVHttqZDHxg", "review_id": "_xlPlaTOYSVFtVGX_H-uFw", "text": "My fave place for Vietnamese...  being Chinese myself, I adore won ton and I can combine my love for noodle soup and won ton here.  #22 is my fave for pork/shrimp won ton and noodle soup (#23 is more won tons, no noodles... might be a new tactic for the 3 of us, get 2 bowls of #22 and 1 bowl of #23 and divvy the noodles and won tons accordingly).  Their broth is very good, not oily and greasy on top, and something I'm willing to sup down with edible ingredients (I tend to leave broth in the bowl at pho shops).\n\nIn the summer, I always get one of the refreshing \"desserts\" which I really treat like cooling drinks... the seaweed or longon versions.", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 4, "date": "2010-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l2qZm-1Q39u-IJ3jBhgf6Q", "review_id": "uNHV9pWq24VU2ceaGg67cQ", "text": "Love it here. I like Thit Nuong, the best. The staff is slow because there are only one guy. The other guy is the owner. Think they should hire more people. Otherwise, anything else is good.", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 3, "date": "2010-06-22", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "7RBSJeEQRCnlzaIIo8FVXg", "review_id": "GJRCwBteIkB1hT-tNWArag", "text": "My first impression was not good already. The food does not have good quality and NOT fresh. But we gave a benefit of a doubt because it is VERY cheap. Appertizers for $2 is a good deal I admit. The second time we came, the customer service was BAD. We ordered a vietnamese sandwich and it never came, we had to tell the server to ask when our order came. And still we had to wait 10 minutes, my husband waited for his sandwich the whole time I was eating my food. Recommended if you want cheap food and dont really care about the quality and the customer service.", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 1, "date": "2010-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vArhfZStEAv8is9SM_YOOQ", "review_id": "SbxP01nQsu5IDP1A5krSYw", "text": "This is my old review so I thought I'd update it since this place is now closed due to a tragic incident that happened back in March 2013 -  an employee was shot by her husband then he shot himself inside the restaurant. It was on the news: (http://www.abc15.com/dpp/news/region_southeast_valley/mesa/fd-shots-fired-at-mesa-business)\n\n\nAnyways, they have a new location that's owned by one of the brothers. Its located on Dobson & S. of Broadway, behind Domino's Pizza: http://www.yelp.com/biz/pho-thuan-thanh-mesa\n\nBe sure to order their Pho #22 with rice noodle. They use quality meat and you wont find anything weird like fish eyeballs in your soup.  It consists of quality thin beef strips, fish meatball (don't let this freak you out...its good), pork wonton, shrimp, crab & squid. \n\nMy other favorite is their fresh spring rolls (not fried) that come with Hoisen & Peanut sauce...super cheap & healthy. \n\nThey also have another location owned by their sister. It's located on 19th Ave & Camelback (http://www.yelp.com/biz/da-v%C3%A0ng-phoenix-2)", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 5, "date": "2011-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lvjvPFW1tBymHHN5Qank3g", "review_id": "aLJ6nFgDJdukcUfDLW1Erw", "text": "Phu Thanh is one of the better and cheaper pho places to eat in Tempe/Mesa. \n \nTHE GOOD:\nTheir food tastes good and it won't burn a whole in your wallet. \nThey are quick with seating you, taking your order, and giving you food.  \n\nTHE BAD:\nDon't expect for great service. The waiters are nice but will not come around to refill your water or give you a check in a timely manner. You have to ask for it.  \n\nTHE UGLY:\nThe whole restaurant is soo ugly. I was skeptical to go eat here at first because it looks like some dirty jailhouse. It's really old and it looks scary but you get used to it.", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 5, "date": "2011-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_uWc9mBsSXz1gQw3rf-1fg", "review_id": "DoNPD-u296Qua2jEV_qegA", "text": "Pretty good viet food for the price.  Usually get the bun (vermicelli) bowls, which are pretty good and have a decent amount.  The pho/mi are ok...wife order noodle bowl with duck and requested it prepared with no bone (wouldn't do it after a few request).  No biggie, but other places had no issue with it.  Her bowl was a bit bland, but the pho were good.  Egg/spring rolls were average.  Great affordable viet food, service is ok... Would avoid during special days (father's/mother's day, etc.)...takes forever.  Better to come any other time.", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 4, "date": "2012-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ANTrWPSoOqbXkvLvxes-aA", "review_id": "BNttLCOWbcIUV-V_tpM-cA", "text": "My second home. Love the cheap, hearty and tasty eats here. Owner and crew are very efficient and it's just the right amount of grunge to make it feel authentic. Favorites here are banh xeo, bunh rieu, hu thieu, com suon. YUM!!!!", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 4, "date": "2012-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JuTPZZS1hieijwl9l_mJdg", "review_id": "aIKbjObRpXvHuOswhQoxRw", "text": "My girlfriend was a bit scared, but she is now a regular. This place doesn't disappoint!! I order the 1b like all the time, love the spring rolls, egg rolls, lo me in, and the bun xiao. I NEVER go anywhere else but here!!\n\nThe Goods: FOOD, PRICE\n\nThe Bad: most vietnamese places that serves good food, are too busy for you, so get used to it, they dont care, and know youll come back anyways. But the service isnt bad, they are VERY friendly, just busy.\n\nOverall:\nMy girlfriend and i have tried other places, NO ONE BEATS This place as far as TASTE and PRICE! Great combo!", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 5, "date": "2012-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "JuTPZZS1hieijwl9l_mJdg", "review_id": "10gcC5X9g8l7gszin3C2Qw", "text": "closed, but reopened in Lee Lee's Peoria.\n7575 W Cactus Rd\nPeoria, AZ 85381\nWe still go there, maybe once a month rather than every week. =(", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 5, "date": "2013-07-03", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "4_YfcfHkCem1onJFkItxjA", "review_id": "K0s79Zdz-3F_rq9YckWWcw", "text": "Stevey does Chandler, Part I.  I know, can you believe it?  I do know how to go south and east of Tempe ya know?  I actually go there quite frequently (but not as often lately).  Where else am I gonna go to get my Asian grub on?  The area around Dobson/Warner is an emerging hub in Arizona for some bomb-ass Asian cuisine, and Saigon Pho is helping lead the way.\n\nThis place is crazy busy - especially on weekends - when I am usually able to hoof it down there.   I've been coming here for a while now.  The shrimp and beef bowl over noodles and the hot pot soups are both only about $5 - and a very tasty $5 at that.   An A+ for the smooth, but not too sweet Thai iced tea.  One drawback over the several times was finding a little gnat critter kickin it in my shrimp summer roll - an isolated incident I'm sure - but you should def.  know.\n\nIt's a bit nicer than most, inside it's little restaurant strip mall.  It looks kinda like it was an old diner in a previous incarnation from the naugahyde booths and cheap tile floors throughout.  They even have a fish tank, but it's not full of tropical fish, rather it's full of we're-about-to-cook-you crab.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2007-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "6wpEHXevnaIZp2kUTUfhxQ", "review_id": "mH5SxQUOwMK-S9fJU05j1A", "text": "Best Pho in Phoenix and the best price.  No place better and no place cheaper.  Me an My wife go back again and again. Very Very Very good.  12 - 14 dollars two people with water as drink. you can't beat that.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2008-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "jdoGEEy5s-5L1O_lNzEi2g", "review_id": "T6LZm-eqLj0rugVDZ96_ZQ", "text": "I personally think that their serving sizes for pho are larger than most other places.  What may be a regular bowl at Saigon can be a large bowl at other Vietnamese places in the area. Plus, I'm a big fan of broth and it's pretty decent here.  All this for not a lot of cash.  It's just about the best bowl of pho you'll get in Chandler.\n\n*Update*\nDropped it down a star because the last few times I've been there, the pho has been a bit sub-par (noodles were weird and they were stingy on the beef).  You really should only eat here if you live in Chandler and don't wanna drive up to the better places in Mesa, Tempe, or Phoenix.\n\n*Update 2.0*\nThey've really gone downhill, based on the last two times I've gone.  I wouldn't even bother ordering pho here anymore.  The rice dishes may be it's only saving grace.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 2, "date": "2008-06-20", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 1}, "user_id": "4MnVm1LWQ2ZXso4ORe_fZA", "review_id": "Sh7lxJDR_IB9W6kra3iaag", "text": "Forget the pho; their spring rolls are unbelievable.  Okay, don't forget the pho-- I would recommend getting it with charbroiled shrimp.  Mmmm.  Service is speedy, prices reasonable, and the food is tasty.  No complaints here.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2008-06-23", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "xW5ajZ7ke4IeRmJylPKagg", "review_id": "d0f24y4tihjRlnJNmdF79A", "text": "my brother and i did a drop in on a wednesday night in june.  the place was nearly packed (with asians) and people kept streaming in during the 1.5 hrs of eating some of the tastiest pho.  how many places in AZ can boast those kind of numbers?\n\nif you go there, ask for Lauren or her sister  (daughter of the owners).  the other waitresses are all really friendly but don't usually speak as much english and usually will refer you to one of the sisters anyways.\n\nour 1st time there, Lauren stood at our table what seemed like 20 mins pleasantly and patiently describing all the dishes we were curious about.  she wasn't looking over our shoulder at other customers and she seemed to enjoy talking to us.\n\nwe've eaten at the old place next to Lee Lee, cyclo and this place is as good if not better and the service is exemplary of what a great dining experience should be.\n\ni reserve 5 stars for restaurants in heaven, so this one gets 4.96 stars", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2008-07-14", "type": "review"}
{"votes": {"funny": 5, "useful": 2, "cool": 2}, "user_id": "K2TQ1HBU51Y8i6MCDI7gLQ", "review_id": "G3PwsFoe9mjpcA8EZcG3uQ", "text": "You walk in, and it smells just like Lee-Lee Market. There is outdated furniture and decor.  There is a constant Din of Vietnamese being spoken in the back and front of house. The menu is covered in things that you cannot pronounce and quite frankly have no idea what they are.  There is something called \"Squid Sauce\" on the table.  This place has got to kick some serious ass right? NO! No. It does not have to. \n\nEnough already. Just Stop it.  Just because some place has a weird vibe and seams out of this world does not mean that it is amazing or even good. It means that you should give it a fair shake just like everything else.  When you look past the glamor of being unglamorous you soon realize that this place is mediocre at best.\n\nI had the Chicken in Lemon Grass sauce and you know what? It was edible.  And I ate it.   I also had the Thai Iced tea and I drank it as well. But that was it. Nothing more and nothing less.  I  know when something tastes good and I refuse to chalk this one up to being an unsophisticated dolt (In reality, I am am exactly that, but my tongue and tummy do not know me very well. So let's keep this between us).\n\nI have done it a thousand times before.  \"Well, this place is really foreign and weird, so let's go there and be hip!\" Well today I draw a line in the sand and make a stand.  \n\nHere is the beginning of my food manifesto!\n1.Good food is universal. If something does not taste good, it does not taste good.\n\n And...Hmm...Well... That got off to a good start and then lost steam after my first demand.  Well, Ted Kaczynski I am not.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 2, "date": "2008-07-23", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "G-_l9cBff45Aknkvkdp9xw", "review_id": "wHKcn1C6a-f9FMx9cgdy_Q", "text": "Great old standby for those of you who are looking for a taste of Vietnam at a great price point.  No frills, no fou-fou, little ambiance.  Just good solid flavor for super cheap.  We eat here just about every Sunday.\nThe Pho is very good, but I would not say its the best the valley has to offer.   There are other places, but they are usually more expensive.  Where they really stand out are with their other noodle soup dishes.  The #19 Won-ton Noodle Soup and #20 Spicy Clear Noodle Seafood.  For years, the #20 was only obtainable as an off-the-menu special.  You had to know about it to order it.  Due to demand, they put it on the menu for all to enjoy.  There is the curry noodle soup and the spicy noodle soup which are both excellent as well.  \nIf you are not into soup, the menu is expansive with options that leave Vietnam altogether (terriyaki, chow fun, etc.).  Their green beans and pork are great (look on the back of the menu).  Even though I haven't tried the house chicken (I'm too hung up on the #20), it looks fantastic.  As does the wok fried crab, steamed clams and whole steamed or fried fish.  Most seafood is fresh from the tank and sold by the pound.\nStarters are good.  The #1 - Egg Roll and #2 Spring Roll hit the mark each time.\n\nGreat flavorful and consistent place that will never hurt your budget.  \nHighly recommended.\n\n11/09/08 - Downgraded due to cleanliness..... while the food still is very, very good, I have noticed a steep decline in cleanliness.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2008-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "N-D-d1Z4UybdlkK1HxlNPA", "review_id": "sj1Ob1Twdnxf105s1ltlXQ", "text": "Hubby and I met a couple of friends here for dinner tonight. It is a small restaurant, nothing much to look at, but the service was super friendly and amazingly fast.\n\nI had egg rolls that were pretty awful- inside was a ground up unidendifiable mash. Really couldn't identify the tastes either. Hubby's spring roll was nothing to write home about, and he thought that the ones he had at Pholicious were far better. \n\nMy entree was quite tasty, though- the beef chow fun (dry) might just have been the best I've had in the Valley. Hubby had to add all the sauces given to him just to give his tofu and veggie noodle dish some flavor. One friend loves their curry pho, and the other friend just repeatedly called her dish \"spicy\" and didn't eat much of it.\n\nWe've had better overall and will keep searching for a good pho place- and one in our part of town.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 2, "date": "2009-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7PrE7o_AGp68uXQafeZg2A", "review_id": "ivmjxR6RGwYDrtj7NicNCg", "text": "I just moved here from California last week, and I was craving Vietnamese food REAL BAD.  I jumped on yelp, and found Saigon Pho.  We did takeout, and the food was pretty good.  Our order consisted of Cha Gio (Fried Eggrolls), Bun Cha Gio (Fried Eggrolls atop cold rice vermicelli with lettuce, cucumbers, sprouts and nuoc cham sauce) and Beef Chow fun (Beef with wide rice noodles, stir fried).  Everything was delicious, and our order came in under $20.   I will definitely be back....", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2009-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5JFYQ3opmAGFWvMGvK7ltw", "review_id": "czywPvLUE25t7BYPNqRmPQ", "text": "great food, good prices. Huge portions, amazing egg rools and spring rolls. i have been going here for 7 years and its never dissapointed me!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2009-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "K5ELQJBhgNTexIvKfZdGCw", "review_id": "5oBtu0KOUR7isTZQmJc10A", "text": "I have been to pho saigon several times and have taken out few times.\ntheir food is always consistent, quick and good.\nanytime we are in the mood, we always go there.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2009-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Fvr8RmAQ4z1E7Ca1CA8mQA", "review_id": "F06MLDEzpuST_oGtHen3QA", "text": "This is consistently some of the best Vietnamese with great pho. The service is fast and you cant beat the price. The staff is genuinely friendly, providing excellent service. Go for the crispy duck...yum! Not fancy, but really, really good.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2010-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "K1ujGjyAj6iQFjLRF4QFRw", "review_id": "qGhVI9naIi31_d5wfOKWOA", "text": "The pho here is pretty good for a pretty cheap price. Unfortunately, the eggrolls weren't the best. It tasted like Chinese eggrolls. I've had better.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2010-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Phj1jHdpcPPBE1hNg9-Tqw", "review_id": "WVnWXgou2rMD4Xnobx9OMQ", "text": "Knock out flavored Pho broth with usual assortment of lime, bean sprouts, cilantro and jalapenos on the side. A couple of sliced jalapenos into the broth for just the right amount of heat and ate down to the last drop. Could have had a little more meat (sliced very thin) but no complaints. A BIG repeat for a Great value at $5.50 for a Bowl of Pho.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2010-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "WcnFWEVx9HO4eplGqvvr1w", "review_id": "oPM1uamNcC-u4TZaWoS9Gg", "text": "This is my Pho restaurant of choice in AZ.\n\nI've probably tried half the menu in the 7 years I've been a patron on Saigon Pho.  Other than the regular pho choices, I'd recommend the Spicy Grilled Lemongrass Chicken, Crispy Chicken, Salt & Pepper Squid, and a host of others..\n\nIf you are in the mood for soup, but not the usual pho, order the Beef Stew Noodle Soup w/ egg noodles.\n\nSaigo Pho has very good portions.  You've probably tried your luck with other pho places and have felt short changed as the quantity of noodles in your bowl.  you won't have a problem with that here.\n\nThe prices are fair.\n\nThe wait staff is always friendly and attentive.  It's not like the usual Asian places where they don't ever come around and refill your glass with water.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2010-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vArhfZStEAv8is9SM_YOOQ", "review_id": "z5vkAf1n4cw51i-Ne3EN0w", "text": "Don't order their combination Pho - it comes with actual balls of fat, tripe and tendons! Instead, you'll want to order the ALL rare beef Pho and you have to tell them that you don't want any tripe, tendons or fat. This place is much nicer and cleaner than my favorite Phu place in Mesa but the food, portion and price isn't as good.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 2, "date": "2011-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "rlcJkEoYzuiS7iF5XfXCMA", "review_id": "uVLXN8916txvPChHsq0PBQ", "text": "At the suggestion of another yelp review, we ordered the salt and pepper squid (9.95) which was very good albeit... salty. The broth of the pho wasn't as rich as some places but still tasty.\nService was great and quick.\nBen for some reason really likes tendon so our server recommended the combination which he was thoroughly pleased with. He'd never tried tripe and now I'm afraid he likes that as well... We also ordered spring rolls, which I think are exactly the same regardless of restaurant.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2011-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EQZjeyvQRe0xnEYcV_eK0A", "review_id": "kDXTGvo9qhXO3nYxsK1m1A", "text": "I've been here numerous times through the years and always get either the Pho or the Bun. Everytime it is delicious, fast and inexpensive. It's a great place to take a group of people. I recommend this place for sure.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2011-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ka45PYSjG3AyGf3p4hxBtQ", "review_id": "KxGC4FYpxYoDk6B0cluZng", "text": "I have been eating there since before I can remember. My mom used to take me and now I bring my bf there all the time.\n\nThe waitresses are always very nice and they know me so well they know our order before I even have to look.\n\nWe always split two order of the egg rolls and go back and forth between sharing the charbroiled pork, egg cake, and (I always forget what it is called but the cold pork with noodles).\n\nI also love their rice noodle salads, their chow fun, tofu, summer rolls, and wonton soup.\n\nI have never seen any bugs and it's always clean.\n\nThey remodeled a wile ago and though the booths are new I don't like how short they are. It makes the meal less private.\n\nIt's the one place my mom and sister miss the most after moving to Oregon.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2011-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5aIwvlUsOqUZexGEc-iVjA", "review_id": "oxw6tl16JVNISdbgndEr6g", "text": "Good food at the cheap price. I always order the fresh rolls and Pho#13. Service is quick. Water is alway filled. By far the best Pho I've found around this area.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2011-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "a1DUUGOKHbjuoL_Z90AnuQ", "review_id": "ckMS7Twj1YMiMGiMCMIC5Q", "text": "Some things never change... and for Saigon Pho and their customers, that's a Good Thing!\n\nThe first day in the Phoenix area... more specifically, Chandler, brought me the ONLY Vietnamese Pho place I have ever frequented in Arizona... really, I have yet to try another Vietnamese Pho restaurant in this state!\n\nAnd... without a glance at my previous reviews... I virtually ordered the exact  same combination of entrees...\n\nChicken Rice Soup #51 (***** $4.95... increase of $0.50) After two years, there only has been an increase of just fifty cents for this Rice Porridge Soup.... JUST FIFTY CENTS! I have no doubt other Yelpers have noticed portion reductons and / or price increases in their favorite restaurants. In just two years an increase this infinitesimal is a bargain!\n\nYou'll receive your Porridge, which is just boiled Rice to a glutinous consistency, in a 6-inch wide bowl, with the addition of pulled Chicken meat, fermented Turnips, bits of Ginger, and Green Onions. A very simple Soup, don't you think?\n\nAlong with either Porridge or Pho, I also order...\n\nBeef Chow Fun #39 (***** $6.50-no change in price) A very, very affordable Chow Fun... as inexpensive as you'll find anywhere!\n\nStir-Fried wide Rice Noodles with marinated strips of Beef,  Bean Sprouts, Yellow Onions, Green Onions in a Sweet Soy Sauce! Delicioso!\n\nMy friend, whom I visited on this trip... even though he is Chinese, never had Chow Fun of any kind in his life... stated this is one of the best Chinese entrees he ever had! I had to remind him that this IS a Vietnamese place... and Chinese would never make SWEET Chow Fun, even though it was VERY, Very good.\n\n\nI, initially, wanted an order of Oysters in Black Bean Sauce..  but the waitress stated the restaurant stopped serving Oysters because customers started returning the entree... Saigon Pho, the last time I ordered it in  Black Bean Sauce, then had the LARGEST Oysters I had seen short of seeing it served in a coastal city like San Francisco. The Oysters can be very intimidating... they're HUGE! I kid you not, if you special order it now... you would think the Oysters were aided in their growth by artificial means. If my stay in Arizona were longer... I would not hesitate in ordering this. But I had to resort to....\n\nClams with Basil Leaf (**** 1/2 Market Price) A HUGE order of Clams cooked with Basil, in a sweet Soy Sauce concoction! The PILE of Clams musta been over four inches high!\n\nSaigon Beef Rice Noodle Soup (Not Rated $5.95) My friend's order...\n \nIce Coffee with Condensed Milk #54 (***** $2.50) WAAAYYY better than that Italian stuff... Way, WAY BETTER!\n   \n... And you get to percolate it yourself at the table... if you want to, that is. This is one of the very few Vietnamese restaurants that will let you \"do it yourself\", as most restaurants want to \"turn\" your table as fast as possible.\n\n   Some views of the Viet Coffee dripping, and dripping, and dripping...\n      ( http://s3-media2.px.yelpcdn.com/bphoto/bI04rKTCweVgKITJ1QkZKA/l.jpg  )\n      ( http://s3-media2.px.yelpcdn.com/bphoto/VNQLgijYek1UNPAhiBNc3A/l.jpg  )\n\nTotal: $33.12 (including tax & including my friend's Pho order)\n\n\nMy server was a young woman, whom I have got to know since she was working here as a high school teen. On my last visit a couple of years ago, she just graduated with a degree in Business Administration from ASU. She was very enthusiastic and positive about her future... and was thinking about opening up her own Asian restaurant or taking advantage of her degree and attaining a position in a big corporation... or even marriage! I was very surprised to see her still here.\n\nAll in all, still a very popular destination among residents in Chandler... about 80% of capacity at 8pm.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2011-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "pTzdWFmI3E01SaGcf4W3Ug", "review_id": "MO-4xZexjOX-4HXGYanwkQ", "text": "Saigon Pho has some of the best Vietnamese food I have ever had. \n\nTheir lemon grass chicken is spicy, but oh so good. Their Thai iced tea is not watered down like other places. \n\nThe staff here is quick on the order, patient, and super friendly.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2011-08-03", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "LJPvRgTZWHlwpaYBauOOkw", "review_id": "jtMo3CvjsORGTU-gJOhwnw", "text": "Pretty standard.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2011-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "_WsYM2E-FxTfUvpjMNq99w", "review_id": "4CdQcywZvHCzd_0ItLSU6Q", "text": "The broth is good, the smells are incredible, and the servings are generous.  The only downside I have to this experience is that it just isn't QUITE there in terms of full pho flavor.\n\nI tend to be overly critical of VIetnamese food in general since I always had high quality authentic food at home growing up.  I was skeptical when my co-workers suggested it. \n\nHowever, good experience, good atmosphere, and a GREAT price.  Bigger plus for being close to work AND for having Vietnamese soy milk!\n\nOh it's a bit hard to see, but it's in a strip mall on the East side of the road next to a Mexican restaurant.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2011-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "oKzkyfGalJC3-BOeLLCcIw", "review_id": "y9ogX4ibBRKQoKEaLNs-Ng", "text": "I can't believe I still haven't written a review for Saigon Pho...\n\nI have been going here for about 7 years and their prices still haven't changed. That 7 years mark should tell you how great they are. I have also been to about 5 other Vietnamese places in the East Valley, but Saigon Pho keeps me coming back.\n\nSpring Rolls - Amazing\nAnything else - Amazing\nService - Fast and Friendly\n\nThe food is cheap, and the portions are large. \n\nBoom.\n\n::drops mike::", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2011-08-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "9jNo5zFLhdR57uFh1y-4kw", "review_id": "ThHu6wPzqYvxvflMBkAvkA", "text": "I love this place.  We eat there 1 to 2 times a week.  I suggest you try the combo fried rice which is an off menu item.  Also the curry chicken noodle soup is excellent.  Lastly, if you have enough money, spring for a robster, think Americans pronounce it lobster.  \n\nnom nom nom", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2012-07-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "297YbqONpiHbijo7MQmEEQ", "review_id": "9IGbJwgWwREji9dZuh1kmw", "text": "This place is great.  It is the best pho I've had in Phoenix and it is cheap.  You can have a meal, plus tip, for less than $10.  My favorite is the curry pho, I believe they call it Thai style.  It has some heat and some sweet from coconut milk.  I add in the jalapenos and basil and enjoy.  All their dishes are great so don't be worried about ordering something new.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2012-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cavJUMP2BExeGXfOHnGpWw", "review_id": "aFR-S3sVaFsA4U2K4GfShg", "text": "great food and prices \naround $6 a plate !! \n\ntrue taste and flavor !!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2012-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "weYT-xJwz8o7mLNWIhD6HA", "review_id": "wAZPCbhkaj-i8g48XN1ImQ", "text": "Was disappointed that Chandler Pho wasn't open on Tuesday when I tried to go check them out, and once I'm craving pho nothing else will do.  So I drove up to Saigon based on a friend's recommendation and since I hadn't tried it before either.\n\nWas surprised by how BIG the place is!  Looks smaller from the outside.  It was lunch time and it was packed!  I thought service would be slow, but I was pleasantly surprised when I was given water as soon as I sat down, a menu just moments later, and they came to take my order within minutes.  Did I mention the place was PACKED?\n\nGot my pho in less time than I could do an inventory of the table to make sure I had the soy sauce and sriracha I needed.  I asked for extra onions/cilantro and again, less than 2 minutes later they were at my table.  Whoa.  These people know how to be quick.  Love it.\n\nMy pho was delicious.  I always get the pho ga (chicken), and this one was among the tastiest I've had.  \n\nOnly knock on this place is that they have Pepsi products (blech) vs Coke products, and I didn't notice if they have beer/booze since I was there for lunch.  But otherwise it was awesome, and I will be back.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2013-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "sxYpaV_iI2uz_CfwUeVa-w", "review_id": "jIURppQUGzU1l0q2UlmK-A", "text": "For East Valley, this is my favor place for Vietnamese noodles.  Saigon Pho is Amazing.  I love their egg rolls, spring rolls, and my favor dish is their rice noodles.  Every time I visit there is packed.  Very very tasty.  Outside it doesn't look anything special.  Inside is surprisingly spacious and comfortable.  They have two dinning rooms.  On the right when you get in, they have a dinning room that most of the time empty, which I actually preferred to be more quiet and enjoy my dishes with friends or family.  Thumb Up!!!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2013-06-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "3wWLL2RDEZ9GgU0rNxyyXQ", "review_id": "Kjf4GfRtFgnEyYmLk3T_jg", "text": "Saigon Pho isn't the most glamorous restaurant on the inside or outside, but when you're so hung-over from last Friday night all you really care about is downing that bowl of Pho. What I like about Saigon Pho is that the staff is very friendly while giving efficient service. I did not think the broth and the meat is in the Pho is up there with the other good Pho places I've been to, but the price is spot- 6.50 for a bowl of Pho. I believe Pho Saigon won't blow you away, but will satisfy your Pho needs at a fair price point.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2013-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XfUbS8krsXec3nKYA63jrQ", "review_id": "Y1DVJonjFTMwSKXxdXycRw", "text": "This is still one of my two favorite Viet restaurants in AZ, this and the little food stand in the Mekong Plaza, Hue Gourmet.  My favorite here is the duck with wheat noodles.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2013-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b55NYJJavY4rXXx8V3HaFQ", "review_id": "14nBOgqzAyc_S09pBDp_Kg", "text": "This place is a lot bigger inside than it looks like from the outside.  That was kind of startling.  The food is good and I look forward to going back.  I think my ordering could have been better but what I got was enjoyable.  The service is spotty and we had to wave down our waiter whenever something was needed. The kitchen was able to turn out our order quickly though.  Everything on the menu is reasonably priced.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2013-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WoRAtKhYfYHmzEUx8TWOgw", "review_id": "OR158Nt3KEHKJOkZSI8iGA", "text": "Best Vietnamese restaurant I have ever been, every plate is awesome... Best Pho!! I come to this restaurant at least twice at month ... 30 miles drive from were I live to get there all worth it !!!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2013-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "opRpFLEoCjiPNVawlzaW0Q", "review_id": "LqJ2ghykUEFY-pkzgfW6mA", "text": "Best pho place in the east valley and prices are fantastic. I am a huge fan of the fresh spring rolls. I ordered a seafood pho, meatball pho, shrimp fried rice, and order of fresh spring rolls for $25. Definitely a favorite!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2013-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "3_8untI8raobTohnLsLAIA", "review_id": "vJE1dDK5mzsxxtTYAp9gng", "text": "We went here after purchasing a groupon.  The service was so strange.  I ordered veggie pho and substituted the noodles for extra vegetables.  My boyfriend ordered pho Thai.  When our food came out (brought out by a cook, i believe) it came with two sides of the normal pho-fixings (bean sprouts, mint, etc etc).  Well the woman, who I pesume is one of the owners and happened to be our server, quickly came over and took my plate away... Not sure why.... We didn't get refills on our drinks the whole time we were there either.  The woman just sat on her computer (right next to us).  So strange.  My pho was really bad, too. But veggie pho is a hit or miss.... The biggest disappointment was the service.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 2, "date": "2013-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "d3zdSjCALm1bg5WJ7wVJLw", "review_id": "AnIWmLJhLFlM3fjhd4LZYA", "text": "Great Pho. Very good prices as well. Definitely coming again!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2013-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5prrQ3dl8qBOSLNVfgpaoQ", "review_id": "kpgmGs8kEUP0AKRt99G3Dg", "text": "This place has the best Pho in town. Actually everything here is amazing! I would of gave this place a 5 star but the servers are always unhappy. Most of the staff are very rude.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2013-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uM-Vc-yM0Gr3MJRfZPeIwA", "review_id": "LhEMstpyx1LEkkWJyUew0g", "text": "Love this place. The staff is super friendly. The food is great. And inexpensive. Order anything from a bowl of Pho to salt and pepper shrimp and it is first rate.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2013-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pJ3kMwJQJsSZmewt_wzPPg", "review_id": "i1xPLMnRFBc_jm8ywx9BrQ", "text": "I absolutely love this place!\nGood affordable Pho.  I can't really try anything else due to a fish allergy, but the PHO is awesome. \nThe broth is light but super flavorful. The meat is tasty, and the sides are just right.\n\n 4 stars because my allergy fear keeps me from being able to try anything else.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2013-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "U2EdDc1GyaO8PiQJpk6qiQ", "review_id": "dQVkqT26iTtixPBSdw3o0A", "text": "I ate pho almost every week for 5 years in Richardson, TX. That town has the highest number of Vietnamese people of any city in Texas. So I know pho.\n\nI haven't lived in Arizona for long, but to my knowledge, this is, by far, the best pho restaurant (of the 4 I've been to) in the Phoenix area. For a fact, only La Me is the only Vietnamese restaurant I've ever been to that is THIS good and it's not even namely a pho restaurant.\n\nMy opinion is based on the overall combination of quality and creativity of the food, restaurant, price.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SmRBVEjnmeRmI-YvxR41xQ", "review_id": "W6wwLlKWfC8vQz7iW7esyQ", "text": "Anything you get here is good, trust me! And they have very good prices... Can't beat that!  My personal fav's:\n#10 w/no meatballs\n#25 \n#41 (i think) crispy noodles\nSalt & pepper squid w/rice", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wzXwoh970XrhQK7Wp_6VkQ", "review_id": "d05OtjpwgOl8S0SZ0kjHnA", "text": "TERRIBLE SERVICE! Waited 20 mins for food. Had to ask waitress for water and she stared at my husband for the longest time and then said, \"yea\" after he had to ask her again while pointing to the water. It was ridiculous! Got our food and it was the wrong order. The pho noodles were not even soft and were hard. When I went to complain to the head waitress on duty, all she said was, \"ok ok ok ok\". No \"thank you\" not \"I'm sorry!!\" NOTHING!! It was HORRIBLE service!!!!!!!!!!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 1, "date": "2014-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ixgYqRHucl21_3-qtPcVoA", "review_id": "N4zWdWLbVM86fHY3FWsh7w", "text": "Very good food; beef chow fun, fried tofu and fried rice", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2014-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JLtCcaVqPgUHqvldZIt6Ow", "review_id": "O0cfVJtgaEHvNXWpTPJgxg", "text": "Been here many times and the food is good the prices are affordable and the service is outstanding the place is busy every time I go in so you know the food is good", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TyzoHZ3Fo80gP2ezEzp2zg", "review_id": "qYJsPCP8QoQZqoouuicl6Q", "text": "I forgot to edit this review!  I had lunch with Christine at Saigon a couple of weeks after my 4/4/2014 visit and had a better experience.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2014-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5h4MXNnvYQw7caN8VY8IuA", "review_id": "RxH8EEPdWuz7lK9cMZInOw", "text": "This is a staple in local eateries.  We love the spring rolls and you can't beat the service here.  You'll never have an empty water or have to wait long for your food.  I tried multiple crab dishes here as well for dinner and they were delicious.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4I3lSlfXHFjNV_ypdL2J9A", "review_id": "5YTCRjXdLXoymU7T3DodtQ", "text": "Had a friend introduce me to this place and had the PHO and it was delicious . Huge serving all the trimmings and at a very nice price. Service was good and we had our fill. will definitely be returning for the PHO more often", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "6XJfj4qjQlxjT-nPw4MSUQ", "review_id": "DWKlbm9Sknqe4ZDBYEfnVw", "text": "The best Vietnamese food on the east side! My fave dishes in no particular order are:\nAppetizers:\n-Pork egg rolls not like Chinese egg rolls but 10 times better! Comes in 2 with the romaine lettuce and mint leaves to wrap it all up ready to dip in that pungent yet flavorful saltiness fish sauce -nig mum sauce. \n-Vietnamese shrimp & veggie rolls made of shrimp, vermicelli noodles, mint leaves, cilantro and sprouts. This is dipped in the peanut hoisin sauce. Yummy! \n\nRice dish:\n- charbroiled beef and shrimp with egg cake over rice dish. The beef is marinated really well and tenderized to anyone's liking. Comes with their pickled shreds and slices of cabbage, cucumber and carrots. Again, the nig mum sauce to pour all over the dish. \n-charbroiled curry chicken and lemongrass over rice. Strong flavors make this dish tasty!\n-house special fried rice was an all around great staple for those that are afraid to try anything new. Mix in a bit of Siracha sauce for a little kick. \n\nPho (soup)\n-Saigon beef rice noodle soup aka pho. An assortment of beef and its counterparts. Such a nice comfort soup especially on a rainy day!\n\n4 stars because the decor has been the same for at least a decade. But the food is definitely a 5 star in my book.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2014-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "N5EAqMAj0TfmFhD1RfDR_A", "review_id": "5Nhn34sN2gKUtAJxSwIq2w", "text": "Im a pho snob and I give this place a 5. The spring and egg rolls are excellent as well. There may be a wait but its well worth it. There are 2 bars next to the resturant so its an easy way to kill tine :-).", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-08-09", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "EYJKCjwcazliLeHqW3dK2A", "review_id": "lkK-OnC0_Y3trXxtvRxSug", "text": "Oh Saigon Pho, how I've missed you! My favorite of Vietnamese restaurants, so good no amount of scraping off that hateful cilantro will make me stop coming here. \n\nOnly losing a star for adding this new egg cake thing to my plate (kind of yucky, really). But the braised beef and shrimp is still great. And no one else has the crunchy pickled veggies I've become so accustomed to. If only you would open a location in Phoenix!\n\nTwo years living in the land of zero Vietnamese food was enough. I know where to get my fix now. :)", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2014-08-15", "type": "review"}
{"votes": {"funny": 17, "useful": 17, "cool": 12}, "user_id": "ODhV53XhesCBLJVfGsJGNA", "review_id": "bemKaRo4fr2Q6ip5qSu9cA", "text": "I've eaten here at Saigon a few good times but never by choice.  Mr. W.'s family loves it here but I really don't care for the place. \n\nThe servers [and owner too I believe] are all Chinese who love to stand around and gossip about their patrons.  Don't be fooled by their friendly smiles.  They talk a lot of smack.  I ran into my mom's hair stylist friend whom I've known since birth once and who is also my grandmother's god-daughter when a nosy waitress walks up to me as soon as she left and asks me if her ring was real with the snobbiest attitude.  Okay, excuse you.  Go away you rude old woman.  \n\nThe food is mediocre at best but it's super cheap eats.  You get a lot of noodles for your pho and plenty of herbs and condiments but the broth is bland.  The spring rolls are served a bit warmer than I feel safe but their egg rolls are delicious.  I'll probably be stuck coming here again and again because of Mr. W.'s family but I'll always eat it with a pained smile.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2014-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "j5NEIHQ-HyOPVxcf-n71wA", "review_id": "ZGKe8TrYUZR1iFWHTesQvg", "text": "I have been coming here with my family for many years now. I love their food and prices but is it me or do they put less meat in their pho now? I wanted to get their special pho a few times before actually writing up a review. Each time, I was left with much less meat then there use to be, yet the price is still the same? I feel like there is only noodles and perhaps 3-5 pieces of meat. Really? Please don't be so cheap. I am sure you can add more meat, after all, I did order the meat combo special. The broth use to be something to be desired but it is now more bland then ever. Don't be fooled my fellow yelpers, there are far plenty places around town that have more pungent and flavorful pho with MEAT (I mean, if you're into that). \n\nThey've gotten better at filling up our waters, thank goodness because it use to be God awful when they'd never come by to fill your water and you'd have to LITERALLY chase them down just so they can fill a tiny cup with water. \n\nTheir bean and jelly sweets are great. Thai tea is wonderful. And the price is just right.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2014-08-22", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "kyXK79FRxnFgNfZP3GUrGw", "review_id": "o1LVppWEj2eJ21FGUedTjg", "text": "When you gaze upon it the aesthetic of the piece has a simplistic almost minimalistic feel to it. But on second glance, you realize the work of art is a masterpiece. It has tons of details with eye catching colors. The lines flow so fluidity. Some may say the work could have come from the pre-Raphaelite era while others argue it could be comparable to postmodernism. However when the piece is placed juxtaposed with a similar piece it is easy to see the differences. It doesn't end there with the visual appeal but it arouses the other senses invoking emotional reactions to it. For me i felt the warmth and comfort which followed but the tingling of my taste and nerves. Yes i am talking about Saigon's pho. It is a masterpiece, a work of art.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2014-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "o56VvjGJOu6mD2zr6kGA9A", "review_id": "XOj9LdSljAtB4xVZ6kSXmQ", "text": "This has quickly become our go to local restaurant for the wonderful food, the variety of options, and the great price. I have no complaints about the service either. \n\nMy one complaint is that the booths are a bit poorly built, which sometimes leads to jostling from other parties from behind. But this is relatively minor and I am happy to simply try to avoid booths which have rambunctious parties on the other side.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2015-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hH4DclHlmxSbI_qiUl4F1Q", "review_id": "AgSt4zNemSKNqo-43BknGg", "text": "I am a huge pho fan, so I have tried a lot of pho places. I have been coming to this place since I was little with my family almost every Sunday. Having said that, I just came back to Saigon a few days ago for the first time in a long time. The pho is still good, but the broth was too salty. I got the number 12- sliced beef and meat balls, I personally was not the biggest fan of the texture of the sliced beef, but my sister liked it. \nI also got the the chargrilled beef and shrimp with fishcake over rice. This was significantly better than the pho. The beef and shrimp was grilled nicely and the beef was the perfect amount of savory and sweet.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2015-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EPyG0KTR4lL85yyLEHXgGg", "review_id": "UtXkL67OgUJFbUMMS16yXQ", "text": "This place is always friendly and appreciates  any customers that walk in the Doors. Been going for years because the food and the service", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2015-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UNo6Ud3KFdzCncEo13Xhxw", "review_id": "Vc8QZenqr0ivnsxj06nfMA", "text": "Very VERY disappointed in the service. This was the second time I had been here this week. Yesterday I came in, they sat me in a booth, I ordered immediately because I order the same thing every time. The waitress was very short and rude, ok.. Bad day. Then she delivers my food to the imaginary person sitting across from\nMe in the booth?!? Really, can't even go as far as to set the bowl in from of me huh? Maybe you should talk to your waitresses about at the very least trying. I asked for change, that ticked her off. I still tipped her $3 on a $6.46 bill. I will be back, I just hope this reaches someone who cares. This was uncalled for.. Now that I have read more reviews, it seems I'm not the only one getting bad service. Most of the more recent reviews have complained about the same thing! There are plenty of restaurants in that area that make the same food you do.. In that General area even. Better step up your game or I, as well as other loyal customers will venture down the street.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 1, "date": "2015-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cwuUQTMsiMcGX4t6sjtGow", "review_id": "b5eWJ3X2na6JYX2zEX0SdQ", "text": "Food was alright. Not the best pho, in my opinion - though not the worst I've had. I'd definitely recommend Pho Van that's just down the road from it (on corner of Dobson and Warner) instead. MUCH better pho. The rest of the food was good - according to the rest of our party. I didn't pay so I can't comment on prices, though from what I saw, it was reasonably priced for the portions that you get.\n\nOur waitress was INCREDIBLY rude. And the service was extremely slow. Both of which means I will not return.\n\nOverall, I wouldn't recommend.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 2, "date": "2015-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hHf6qpfE8mxH5avvSWGesQ", "review_id": "rX7FvJRJTGhC6zttVPBr0w", "text": "I went on a kick for a while searching the valley for the best Vietnamese food possible. Hands down this is the winner! The soups are amazing, actually everything we've had is amazing. And we always see a lot of people eating there does seem to enjoy the authenticity of the place. Mostly it's all Vietnamese people that are eating there. Everything on their table looks amazing, but I have no idea what it is! I keep wanting to go there to try new things but everything that I've tried it has been so good that I just keep ordering the same few things. He is good, as are the spring rolls.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2015-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9VPNlcKsL99FvKtz1r9qJg", "review_id": "gmy4UivYLiKw67mkPxxZ8g", "text": "Very cute place, in a strip mall, oh well, it is Phoenix.  They papaya salad, awesome!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2007-08-16", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "T7J9ae0wTskrI_Bgwp-4cA", "review_id": "HM0QRGVqimmO_E-aufVgrQ", "text": "I was NOT impressed.  The only two positives were the no corkage fee for BYOB and the made to order lemonade.  The food was bland and boring at best.  My friend had to send back her pan fried noodles that tastes like sawdust.  I would not go back.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 2, "date": "2008-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "6wpEHXevnaIZp2kUTUfhxQ", "review_id": "l6abno7ZRps5grndlFOfCg", "text": "don't like, i ask for spicy not a jar of red chili pepper.  one person wating on 20 tables. you think about how quick you get serve.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 1, "date": "2008-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "lcgUBCrznwC0FohI4jgMyg", "review_id": "mcx3ynjEIymMxS75wMbA7A", "text": "crappy food and crappy service", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 1, "date": "2008-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "nnNooAawbkLp2cTJFKgQ_g", "review_id": "nUUgu9e0YFJVMcY_UEVnpg", "text": "Tried Cyclo about four times.  I really liked it the first couple times.  But this last time I went, I brought a friend along who had never tried it.  I was kind of embarrassed by the service.  The food is consistently good as is the lemonade.  Their new decor is nice also.  But they really fell flat on their face with their service.  It seems like the waitress only takes the food orders, one of the cooks brought out the food so of course he don't know who gets what, they brought mine first, then a few minutes later my boyfriend got his and then our friend got her food.  When we finished eating we had half of our food left over that we were going to take home.  We asked her for boxes and she proceeded to stack all our plates on top of each other.  She brought our check and my boyfriend told her that we wanted to take our food home and she says \"sorry, I didn't hear you\" and left it at that.  We were disappointed and won't be back which is a shame.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 2, "date": "2008-08-12", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "WCBz-xTApNh4u1VA_HKNLQ", "review_id": "k-VRfxYDUubjAkQfVo4lBA", "text": "4 times I was there, the food was satisfactory. As a Vietnamese from Saigon, just came here for school, I have to say Cyclo is the one that is clean, in good neighborhood and still has the most authentic Pho. In AZ, most \"authentic\" places, for some reasons, are either dirty or in sketchy neighborhood. The clean and nicely decorated ones tend to \"americanize\" Pho to please majority of patrons. \nOther dishes are delicious, maybe a bit varied from being authentic, but still amazing: Pork Short Ribs, Crispy Rice Crepe, Green Papaya Salad (my fav, and pretty close to what you would find in Vietnam), Spicy Garlic Green Beans.\nAt first I was surprised, and rather amused to find guests bringing wine here. I guess certain reviews molded this restaurant into a fine dining. While the place is quite chic, pairing wine with Vietnamese cuisine like the ones here is .... very very odd. Heineken beer perhaps, but wine? Better save that bottle for a French-Vietnamese fusion bistro.\nOne thing about Cyclo that bothers me is they need to turn the AC lower. 3 out of 4 times I was there, our group ended up sweating.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2008-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "LWuH2QSx5alleE0G2bRjHA", "review_id": "5yqbYG7kBcplrrqtjx7mKQ", "text": "Best Vietnamese place I've eaten at outside of New York City.  Maybe even the best Asian food I've eaten in the Phoenix area.\n\nAnd it's inexpensive!\n\nI would be a regular if I lived out there.  It's really one of the better eateries in the Phoenix area.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2009-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "cMmQsFyrYBv6hIE6NffqZQ", "review_id": "SpdZDF1DqgoEx_C48xitSA", "text": "I've been eating at Cyclo for many years now and I have never had a bad meal. \n\nI always start with the black pepper shrimp and since I've switched to a mostly vegetarian diet the past two years my choices have narrowed a bit, but Justina always modifies the food so it fits. \n\nOver the years I've had pretty much everything on the menu and whenever a friend asks me what to get I say, \"Close your eyes and point, you won't be disappointed\". \n\nThe Vietnamese coffee at the end of dinner is a perfect ending to any meal. \n\nThe desserts are great and when I do get it I like the Mango Sticky Rice or the Creme Brulee. Both will not disappoint. \n\nJustina is a great and I think it is funny when people take her too seriously. She has fun with her customers and they should have fun with her. She can take it as much as she can dish it out so just relax. \n\nThere have been some comments that when Justina is not there the experience is not the same. How could it be? There is only one Justina and once you get to know her you'll realize she is really much more than a crazy hostess. She is a really nice person. \n\nI hope you enjoy Cyclo as much as I have.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2009-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VJ05maUdbK30dU9PqkOhyw", "review_id": "bziEPrsBjXzwfgfI-QbeuA", "text": "Wow~that really is too bad that this place was put on the Dirty Dining list!  But then maybe all those roach legs are the \"secret ingredient\"?  hahaha i'm just kidding.\n\nIf I were to take the Dirty Dining aspect out of the review, I would recommend this place to people who are venturing out into Vietnamese cuisine.  \n\nThe owner is very friendly and knows my sister and her friends pretty well.  Whenever we go in, she takes our bottle(s) of wine (gotta love the BYOB!) and immediately opens them up.  She chats with us for 10-15 min., and always takes our order.  When it comes to cozy atmosphere, this place is definitely at the top!\n\nThe reason I stated that this place is a good introduction to Vietnamese fare is that I personally felt that the flavors were more suited to a Westernized palate.  Their spicy chicken dish (the name escapes me!) is quite good, but reminds me of Orange Chicken: it's not Chinese-Chinese, but Chinese-style American!\n\nOf course, the dish I always get is pho.  The broth is not as pungent as the broth you might get at the pho shop next to LeiLei's, but is savory and allows you to taste the basil and bean sprouts and lime you put in!\n\nI give it 4 stars because of atmosphere, the very accommodating nature of the restaurant owner, and the general cuisine.  I don't give it 5 because of the essential nature of the pho itself.  To me, pho is the perfect hangover food.  The pho at Cyclo is light and perfect for dinner, but not for the morning after a rough night!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2009-07-29", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "i0A-c2yoHySmFhRV2sDR1g", "review_id": "TSEEvdQs6CcMGidyqWrG8A", "text": "While I'm reviewing pho's, I'll give my review on Cyclo. This is where I'd take that cute Vietnamese babe I met last week. It has great atmosphere and the food is awesome. I ate here about a week ago and had their pho bowl and it was one of the best I have tried in the valley, I really loved it. The girl who seated us was really nice and gave an enjoyable contribution to the dining experience. Yes this place cost almost twice what I pay across town but worth it with the right company. My brother and I ate here and we both agreed we would probably not eat here together much but we will both be eating here again. AKA we thought this was alot better place to take a girl or a business associate than our fav pho in the area to have lunch together.  Cyclo has a more upscale atmosphere than the average pho and we both thought the food is above average.\nI don't agree with another reviewers post that the portions here are small. I had one appetizer with a pho bowl and left full.  I'm 6'3\" 230 and like to eat ALOT and my brother who is shorter but heavier than me was complaining he ate too much after we left. One of the best phos in the east valley!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2010-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jlXbohgL1d8Yg4uPY9KOvw", "review_id": "vVDIO8iPtH0s3SaOLIwYzg", "text": "Yes, I'm giving them 5 stars. I know their prices are a little higher and people complain that it's more fusion than anything. I want to tell you why I love this place. \n\nBefore Cyclo opened I used to go to the pho restaurant on Apache. I would get my customized fried rice-- chicken, shrimp, beef, eggs, and vegetables. They put a charred grilled pork right on top and I was in heaven. \n\nJustine worked at the Apache restaurant. What a character. I love her attitude mixed with charm. She has a good humor and fresh outlook on life. I always looked forward to her crazy stories. More importantly she gave great advice on how to deal with boys. Cyclo became my comfort food therapy sessions. And that is why Cyclo gets five stars.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2010-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Phj1jHdpcPPBE1hNg9-Tqw", "review_id": "HqC_xsyQXLzukDadRsc1MQ", "text": "This is my second favorite Restaurant in Phoenix (behind only Tarbell's) and receives consistently Phabulous reviews. I have had much on their menu and have loved almost ALL. \n\nI have become a \"Pho Aficionado\" and I love the strong flavors in the best Phos. Cyclo's Pho leaves a lot to be desired! Broth is generally too thin, although the service is beautifully done. Plus their Pho is expensive when compared to other \"Pho Joints\" that I believe have better Pho.\n\nEverything else I have eaten on their menu (and I have eaten most everything!) is indeed PHABULOUS, so I will just go elsewhere for my Pho Phix! Besides, I would miss NOT seeing Justina (Cyclo Owner) who is a delightful experience, not to mention the delightful experiences available on their menu, other than the Pho!!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2010-08-13", "type": "review"}
{"votes": {"funny": 6, "useful": 11, "cool": 4}, "user_id": "WcnFWEVx9HO4eplGqvvr1w", "review_id": "iIB4kBcwKboTdtsEJnyirQ", "text": "What the pho, man?!\n\nThe food is bland.  It tastes like they cater to the elderly.\n\nThe prices are high for the type of food you are getting.  Nobody should have to bay over $5.75 for ANY type of pho.  \n\nI've gone there 2x and I don't know if it's just me, but the hostess there just rubbed me the wrong way both times.  She was cracking jokes and making comments that were borderline inappropriate.  \n\nThey focus more on decor and trying to \"entertain\" their patrons rather than focusing on what's really important... the food.\n\nYou want a really good, AUTHENTIC bowl of Pho?  Go to Saigon Pho on Alma School/Knox.  It's not as ritzy and refined, but the pho and other menu items there are less expensive, tastes better, and they serve you much larger portions.  \n\nEat at Cyclo if you want to have a SEEMINGLY over-attentive hostess bothering you while you try to eat.  (I say \"seemingly\" because while you may think she's over-attentive, in reality, she hasn't even done as much as refill your water glass.)", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 1, "date": "2010-08-27", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "0_9g0TXf8vrp1np9U2Inew", "review_id": "xP5gu83_UApoC8H-wuW-eg", "text": "The best food served up by the BEST owner.  This place is family owned and run.  Half the fun is meeting Justina and enjoying her style and sense of humor.  Order ANYTHING and you will enjoy it.  If you love Pho, then this is the ONLY place in AZ where you can get a bowl that lives up to the name.  In a state that has very few truly GREAT food options, this is one of the FEW that is truly great.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2011-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "bDHJ7WRFSQr2m-jzmkx82Q", "review_id": "vmBar4k3N2NaPU_ebVIQ0w", "text": "This is one of my favorite restaurants in the Phoenix area, and I've taken several friends here to share it with, both locally and from out of town. In fact, I would like to go there today! I love the Lemongrass chicken, spicy beef salad, Seafood Pho, and the garlic green beans. \n\n I absolutely love the food, and the only reason it doesn't have five stars is the service. It's not terrible and they've never screwed up my order or anything, but it's not the greatest I've ever had. I recall waiting a few minutes with an empty water glass before I could resume eating because I was thirsty. I'd rather wait for a refill than not eat at this restaurant though.\n\nOne thing to keep in mind, this place is small, and it gets busy, so if you don't want to wait for a table, go at an off time like during the week or for lunch. Dinner time on Friday or Saturday night fills up pretty quick!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2011-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iJUVamUkqL6VfEMfyQoujw", "review_id": "g9AtdPad-zT7KCobY1cHgg", "text": "So my buddy brought me here as a get way from  he corporate world.Hmmm very orangy type of place and the owner well......very enthusiastic. The place is small but nice. Now the food was good....spring rolls were interestingly yummy and the noodle bowl i had was actually not bad at all (bun sai gon?) it was a big bowl as real Vietnamese restaurants do. They even had a chili at the table and not sirachi sauce...so thumbs up.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2012-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Fjsu8MNJ50zDO-01bR9vtA", "review_id": "vpg8_E-gNyfyEUHutmkdtg", "text": "Wonderful Vietnamese food with an atmosphere that is made delightful by the cute and fun owner, Justina.   Besides the food, the BYOB feature with no corkage fee keeps us coming back often with our bottle of Sauvignon Blanc or whatever goes with spicy Vietnamese food.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2012-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "17hvQV55h5Ul0hgOQyG8fw", "review_id": "DBaa4uyZxcQyyuF86qY0qg", "text": "wonderful food - hilarious owner - and great decor and ambiance!\nWell worth the long trek to get there ~ delicious!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2012-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "uZbTb-u-GVjTa2gtQfry5g", "review_id": "Mff4bSiLpQQ31lnXLRPdIg", "text": "Cyclo is like the cooler, hip younger sister restaurant of Khai Hoan in Tempe (They are literally sister restaurants, as stated on their menu).  It exudes the exuberance of youth, but doesn't quite capture the authenticity and depth of menu that Khai Hoan does.  The interior is similar to a funky little boba shop, with lots of bright, pop-star colors and design, and those that are unfamiliar with Vietnamese cuisine may find this as a good stepping stone.  The menu is very limited, and portions are smaller than Khai Hoan, albeit more fancifully decorated with flair.  Prices are also higher.  The papaya salad I had was good, and had a good balance of tangy, spicy, and sweet.  My husband's mixed grill entree was decent, but the strips of meat were slightly overcooked so they tasted tough.\n\nJustine, the owner, was here and she is charming, vibrant, and always has a funny story to tell.  I do give her props for creating a more welcoming atmosphere for those that are usually afraid to try different foods, but for me, I'll probably head to Khai Hoan for my Vietnamese fix.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 3, "date": "2012-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KFLg5vUZm8TV4deHGzUoMQ", "review_id": "wLxIA-iXloYuCZI6gZ_7Rg", "text": "Super yummy, cool ambiance. I had the Bun Sai Gon and it was SO GOOD. Can't wait to go back!!!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2013-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DmCNbKch6lHjmibb5Ulaqg", "review_id": "KI6rQXlOm4gp0eROntGt5w", "text": "Awesome service. Try the beef chow fun and spicy garlic green beans, they are amazing.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2013-06-24", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "lOvgjEkecLfVJwJriEjt2w", "review_id": "FJgW5HjY3hvr3dPjq5Fu1g", "text": "Some friends of ours had been trying to convince us to come to Cyclo (pronounced SICK-lo) for a couple of months, and I'm so glad we did. All the food was fresh, and very authentic, according to our friend who has been to Vietnam. The spicy green beans were amazing, I could eat them like french fries. I had the pad thai with tofu for my entree and it was SO GOOD! The noodles tasted freshly made, the tofu was crispy on the outside and soft on the inside, and the sauce was not overly peanutty or overpowering. My hubby had a giant bowl of pho soup, which he thoroughly enjoyed. I liked that they had so many vegetarian options. \n\nAs for the ambiance, I really enjoyed it. The lighting, decor and music was happy and modern. We met the owner, Justine, and I was actually scared to meet her based on the previous reviews I had read on Yelp. Well, turns out the reviews couldn't have been more wrong. She is sweet and personable and she lightheartedly joked with our table. She gracefully floated throughout the tables the whole night, making people laugh and making sure they were taken care of. In my opinion, more owners should be this way, because it shows that they really care about their customers and their experience.\nBOTTOMLINE: I will definitely come back!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2013-07-15", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "VPXgY9lGJF3XC4ZpusxNuA", "review_id": "8AA7PEUjkxJ_fFcgc3buPw", "text": "I've been wanting to try this place for a while now because of all the Yelp reviews but when we went there for dinner last night I wasn't that impressed. Maybe because my expectations were too high. We started with the pork spare ribs which had a really yummy sauce on them. But the sauce was a little too thin and didn't really adhere to the meat and the ribs themselves were chopped up into bite sized pieces which made them somewhat difficult to eat. I ordered beef pho for my entrée and of course it was delicious (Is it possible to have bad pho?) but I found that the broth had less flavor to it than other places I've tried. Like some spices were missing or something. My hubby ordered the mixed grill with rice and he was pretty happy since it came with a lot of meat. We also split the flan for dessert and it wasn't anything special. The fun and funky décor was cool but I found the plastic chairs to be pretty uncomfortable.\n\nI thought that the prices were pretty reasonable. We spent $35 for a fairly large amount of food. I am surprised by some of the other reviews that said Cyclo is too expensive. Who says authentic Asian food has to be dirt cheap? The owner has created a cute little trendy restaurant with a loyal following (we saw lots of regulars greeted warmly) and so she can charge a little more than your average strip mall dive.\n\nIn summary, I enjoyed my experience here but was not overly impressed with the food. I might come back if I was in the neighborhood but I wouldn't go out of my way to eat here.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 3, "date": "2013-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "vstykCRNqYzz-2bSss8mHA", "review_id": "3n2FWfzfl5LeGrCElhW-Eg", "text": "I normally don't take the time to write reviews on anything but my experience at this place motivated me to create a yelp account.  First, the owner was irritating and sarcastic. I almost wanted to tell her to leave us alone so we can eat. She must think she is something. Second, the food was average, I have had far better vietnamese food. Third, servings were small for the price we paid for. Fourth, this place is RIDICULOUSLY expensive for a vietnamese place. Last and certainly not the least... I don't recommend this place. Went there once and will never ever go back again. Bad place guys, not worth your time and money.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 1, "date": "2013-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CWZqxm2oR2g3_7oDA7yV-g", "review_id": "3YgOGT30x6isgAsI2ZfeSA", "text": "I've been a customer here for a few years now and love the food!  We usually get the pho noodle soup, banh xiao, and sometimes the spicy beef salad....all to die for!  I wanted to mention how sweet the owner is.  A friend of mine met me for lunch there with my very picky son. I was ordering a plain bowl of rice for him...and she intervened, lol...she told him she would make him something special that he would like.  He told her he liked chicken, so she went into the back and made or had someone make him a version of the lemongrass chicken cut into small bites without too much spice or seasoning...on top of rice.  My jaw dropped to the floor when he enthusiastically ate almost every bite.  She didn't want him to be hungry at her restaurant.  I just thought that was above and beyond....loyal customer for life!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2013-08-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "dr7yIIVmIyiD17fy9QCQrg", "review_id": "LfJ20qMlMCIksHuHaj9uLg", "text": "I'm not a big fan of vietnamese food but I have found several tasty options in my travels. This restaurant had some of the best entrees I have had in a long time. It was plentiful and extremley good. \n\nThis did not help the location and decor. When you go somewhere that is trying too hard to be trendy there are some expectations. The plastic seats made it feel like I was at a Burger King. That made me feel like I was over paying even though the food was real good. I would go back for the food but the sad truth is as good as the food is, I would want a better environment.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 2, "date": "2013-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "sWh4Tjwa8ch_rziHtTN9LA", "review_id": "WN2K7CmyqWa1mpxrJv1Hgw", "text": "Pho ga chicken was dried out. The spring rolls were the smallest portion I've ever seen & the peanut sauce was watered down. I've tried eating here twice. I give up", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 1, "date": "2013-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "4QBvwxT1JxSc-VlSYw3kdg", "review_id": "XliSayjtWepKzfcX_pe_jA", "text": "The staff, service and food are AMAZING!\nThe atmosphere is modern and no- frills nice.\nThe seating is limited, be prepared to wait for a seat or take it to go if you hit during M-F lunch rush, but whatever you do, don't bail...this is a great dining experience.\nThe spicy garlic beans are delectable!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2013-08-28", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "UnEMelzpvkw2elqPTfNa5g", "review_id": "HNLdR0qzQiprFeDGVYOAsw", "text": "I'm conflicted in writing this review.  There are large varieties of unique menu items to choose from and the few that I've tried are fairly good.  The only complain I have is the owner and hostess who seems to use foul language from time to time.  The last time I was there for lunch, she drop by our table unexpectedly to chat and badmouth one of the customer who was asking too many questions about the menu then not ordered it.  My friend and I didn't know what to said then later left telling each other to scratch this place from our lunch list.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 3, "date": "2014-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QhfaeEbQFaiNeiZS5nEM7Q", "review_id": "keJf10ud0_BjSqF1c4uBHA", "text": "So far, so good, I had the veggie spring rolls. The wrapping was nice and moist, the filling of rice vermicelli, fried tofu, and lettuce was moist and delicious. The dipping sauce was also excellent. If I could change one thing, I would add some cilantro inside the spring roll. I wouldn't mind trying a main dish here.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2014-06-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QFgQBx3hi-YfFf-T_G_txg", "review_id": "hPm75-YJ7n1xLr4GO8NcxQ", "text": "I love love love this place!!  The pho broth is made with OX tail and you can tell. The garlic green beans ROCK!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2014-06-24", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "5FqdhIqZIlTXLU41OA7DsA", "review_id": "RTn-Cl9zPT7x5p48Wrd4KQ", "text": "Everything about this restaurant is amazing! The decor and food is fantastic and the owner is fabulous - love her! \n\nWe sampled quite a few things and while I loved it all, my favorite was the beef salad. Can't wait to go back!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2014-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IpqnWVaukMrS_F9-WgfwpQ", "review_id": "8izR8GdNmNroRvD9cLHjSw", "text": "This is a great place to go with friends. The decor of the place is great and the owner Justina is worth stopping in for alone. She kept it fun and energetic and did a great job explaining the made to order menu and helping us decide what to get. \n\nAs for the food I really enjoyed the Crispy Lemongrass Chicken, Spicy Green Beans, and Beef Carpaccio. The Plum Soda was interesting and a bit strange [in a good way].\n\nI will be back for sure. This is what more restaurants should strive for. Fresh, lively, and with a high attention to detail. Having an owner running the front of house with that kind of enthusiasm for their restaurant is refreshing. I saw some other reviewers post that she may have used some salty language...f*ck yeah she did and I loved it. She read the table and was very playful and charming. \n\nThis is one of Chandler's best restaurants. It is BYOB so be alert to that.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2014-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "rn3kE2LSki7EM8Lklh47zg", "review_id": "ulgVb_n6KBtpaT8Gyf84IQ", "text": "Justina is such a good friend. She always makes me laugh and makes good conversation. The place can get really crowded for lunch but the service is quick. I have never been for dinner.\n\nThe chicken wings, spicy ribs, and pho are super good.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2014-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1H2EoisjocvvLSoKy8xUeA", "review_id": "Ze1FHuybJixxx4pnHcgv3g", "text": "This is on the SOUTHEAST corner by the walgreens. Not the north east as the map shows.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2014-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fLjjtm4beQfqPxLfeuqboA", "review_id": "FvzvQCg8A0vH4s8z14xggA", "text": "Lunch out today with a group of former coworkers, and we decided on Cyclo. Two of us had been before and loved it. Justina is always so funny and entertaining. Decor is modern. Today, I decided to try the lemongrass chicken, and was it ever good. =) I do wish that I had ordered a side of the green beans, as another table had them and they looked delish. We will certainly be back. \n\nI also really loved the addition of fruit to the water. It made it taste fresh like the food. \n\nGreat job Justina! Keep it up.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2015-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eqbSEn9DqziYpCmBZd7Ipw", "review_id": "gAgcXJnWHRbdKhL1EC8NPg", "text": "Upon the suggestion of a friend we stopped in for lunch. What a pleasant suprise. We were greeted by an owner and had 2 delicious meals! The Pad Tai noodles were very tasty and I even enjoyed the tofu. The house Lime-aid was fantastic and the location was nice.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2015-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8nltjuse1izC-phpxoNTmA", "review_id": "81M-9d9evGui8FNs9j5z1g", "text": "ha not only is food great,but the crazy little justina is a gas", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2015-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SNBJb9xiaRJ0ohHhugwn_g", "review_id": "YV95NG3PzSHiwwAS6z8i9w", "text": "I love coming here right after partying or the next day when I have a hangover.  The pho here isn't bad at all.  The place closes late.  However, the egg rolls aren't that great.  A bit over cooked sometimes.  Service isn't too great either.  It's hard to get a cup of water sometimes.   The rice dishes taste good.  Always a place to go for inexpensive food.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2007-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BnYUMeLAoRVmtQVr-zTxnw", "review_id": "dNNhhU9mlMXiBEFGLQglGQ", "text": "i've only ordered pho from pho kim long so i can only comment on that. with that being the case...i've tried about 4 other vietnamese restaurants, and this has to be my favorite place for pho. whenever i get pho i'm never able to finish it, but i always seem to finish the pho at pho kim long. if someone can recommend another place i can try, please do. i usually order pho tai chin (rare beef & brisket) or sometimes just pho tai (rare beef).", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2007-06-25", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "pD8KAGn8KsObzdGBMPzSfw", "review_id": "6m-0nC2ICeQNtqsmR6eN4A", "text": "The vermicelli with egg rolls and pork was wonderful. The food was delicious. It felt great to be able to walk into a restaurant that was clean, roomy, and cool. Finally, my friends and I have a good place to hang whenever we are craving for pho/vietnamese food when we're in Vegas.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2007-08-25", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "GXbWmjzW9aCFf6BKqf_0aQ", "review_id": "7tt_MIi-LrJbQB0YxdVcRw", "text": "Lily L I hear you, I ordered \"canh bun\" which is similar to \"bun rieu\" and the broth is too salty.  I poured ice water in it and it was still too salty.  I hope the owner reads this and give that broth a taste to see what I mean.  When the bowl is brought out, the smell was very delicious.  It was too bad it's too salty!!!\nI have not ordered anything else so I can't give any positive comment.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 1, "date": "2008-06-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "D8JZnUA6XwlvGZM9pGOFgw", "review_id": "ewqRQve6m-_DvZy_kpx7DA", "text": "the inside of this place is like an upscale pho place.. but the food was wayyyy too over priced for a bowl of pho.. which was like $7.25.. and a bowl of porridge was $9.... food came out in a decent time... rather have went to a cheaper place that was more authentic", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2008-06-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "A3mpjzazkSDkua4cPSayYA", "review_id": "tpBkC_lH_G8cAFsRShU3HQ", "text": "Starting to wonder if there's anything this place cant do. \n\nMy cousin told me about a crayfish place next to kim long he wanted to try out. Once we parked the car and looked at the sign we realized that it wasnt next to kim long...it's is kim long.\n\nwe both split 3 pounds of crayfish, they came out in two bowls so i'm guessing pound and a half each. Nicely spiced but HEAVY on the garlic which is a good thing i guess. Some of the seasonings were a bit on the heavy side but a swig from a corona fixes that real nice. \n\nOnly down side is when we were served the bowls weren't steaming hot they were just warm, but that could be considered a plus cause we didn't burn ourselves. \n\nJust a personal thing but i'd like more sausage and potato chunks to bite into every once in a while and there's not enough in one bowl to make me happy.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2008-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3U4DXI-8S4yHRpw2J0x5HA", "review_id": "ZuRso5RzcZt7mMld2W1jWQ", "text": "Best Pho in Vegas. Soup was flavorful yet light. The noodles  were perfect. We ask for extra basil X3. :) Used up all the jalapenos too. Open till 3am. I heard through th grape vine when the Top Chefs were in town they stopped here. By the way, drank all the soup . (heehee)  Such great comfort food. Service was very fast too.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2008-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IR_kFduvskBeZjmBTEgqKw", "review_id": "e4O2h213wR34c1MXAX7Qyg", "text": "Imagine driving into the parking lot and seeing mad heads waiting to get a seat in this joint. Mind you, it was 110 degrees outside and people were still waiting like they were giving something away for free. \n\nI should have gone for the pho but I've had my share in college when I live in Orange County. Instead, I opted for the bahn mein which was not the best I've ever had. It was quite mediocre as I've had better elsewhere.\n\nSince it was searing hot outside, I opted to get a mango smoothie with tapioca and was expecting fresh mangos for a $4.75 drink. Boy did they serve up a powered monstrosity which I took two sips of. I hate powdered drinks when fresh fruit should have been in order.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2008-07-13", "type": "review"}
{"votes": {"funny": 2, "useful": 6, "cool": 6}, "user_id": "2rlBbFPHyZjXSFSE8r551w", "review_id": "jcfNAoJsXko3WwotjQB5dQ", "text": "Serving \"Fine Chinese-Vietnamese Cuisine\" out on Spring Mountain in Chinatown.\n\nThis place is usually pretty busy and popular. It is also very clean with nice decor, starting with the beautiful and colorful, large fish tank at the door. Good Feng Shui! \n\nThey have a large menu of Vietnamese and Chinese dishes, so you can have a bowl of Pho all they way up to a Canh Chua Ca Bong Lau (sweet and sour catfish soup) or Tom Ham Rang Muon (baked live lobster with salt and pepper), and everything in between, like Hu Tieu, Mi, Com, Bun, Ga, Bo, and Chao.\n\nWe had Pho Tai and Pho Tai Nam. We ask for medium size, but they came out more typical of a small in Little Saigon or San Jose. But the broth was very good, with not a lot of junk floating in it, but a lot of flavor in a more clear broth than the muddy waters some places  try to give you. It had a great flavor with a hint of sweetness, like good Pho should. \n\nUnfortunately, for some reason my noodles didn't taste fresh and silky as they should with a little chew to it. Instead they seemed old and chalky somehow. The beef Tai was full rounds and the Nam was tender and tasty. \n\nThe prices were about $1 more than you would pay elsewhere, but they have the broth down very well, and with the nicer decor, it is a good choice. If wasn't for my noodles, it might have got  4 stars.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2008-07-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "jcns4g1Gp2TwqtDS4ef23g", "review_id": "uy5JROZ6oGdAiXqHYaMBng", "text": "\"You've got to be kidding me....\" says my gal pal. \n\"Nope, that's really the name of this joint,\"   says I.\n\nReluctantly, she took her hungover self there. She's still dreaming about the flavorful pho.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2008-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "mRXMTAI90Ts7fTyCVXC_Fw", "review_id": "vXB0FOxU1gMskWO_w_yBEw", "text": "will come here every time I am in vegas. Found this place through yelp and the name made me laugh. It had a pretty good rating. So I decided to give it a try. \nThe place was well put together, the pho is more expensive than what i'm used to paying to back in my area, but I was not disappointed! The service was SO fast and\nI really liked the broth.. I ordered pho GA as usssual and I enjoyed the strips of chicken and onion and cilantro.\nThe place was clean.. Even the bathrooms.\nThe place closes at 3am which is pretty good time considerin it's in vegas.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2008-07-25", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "Ns9TaL66ggWN8gisy0F-QQ", "review_id": "TCITSA6lly86AZYgmHajgw", "text": "2.5 stars.\n\nGreat service, semi-clean interior, minimal decorations, and decent food. Compared to LA pho, this place can't compete. It's about as good as it gets, in the desert though. \n\nThe pho broth seemed to lack a little luster, and the vegetables weren't so fresh. I didn't expect fresh sprouts, and limes in the desert though. Can you even grow fruit in Vegas?\n\nLike everyone else mentioned, the name alone makes it worth a visit.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2008-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r5QPTFb8FFHQkZPumA9FaA", "review_id": "GM11wyMgqjMGDPtpBj8Tdg", "text": "This place is alright. We got an order of  Pho Tai ($6.25) and Rice plate with chargrilled pork chop. Both dishes were decent. Almost right after we ordered, the pho came out. We went during a busy hour, but they still got the food out pretty fast. There's a mixture of mid20s-30s crowd and lots of families came to this place to eat. The place is simple in decoration and is a good place to eat.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2008-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 7, "cool": 5}, "user_id": "zTWH9b_ItSdLOK9ypeFOIw", "review_id": "KcpJd8XZeDkRtTJ-dhC1XA", "text": "\"CRAWFISH\" is a new addition to Pho Kim Long, and that's what brought me here in the first place.  They only started offering this shellfish in June, weekends only.\n\nMy luck that the Sunday I choose to come in, they weren't offering it. We still sat down for dinner and this is what we got: \n\n* Hu Tieu Hoac Mi Bo Kho (Beef Stew Egg Noodle) - $7.95: The Big F enjoyed his noodle soup.  I was too busy with my plate to eat much of his.\n\n* Dau Dua Xao XO Sauce (Stir fried String Beans with XO Sauce) - $9.95: Tasty string beans, a bit on the pricey side though.  A nice spice kick as well.\n\n* Com Ga Hai Nam (Hai Nam Style Chicken with Seasoned Rice) $8.50: I've always liked Hainamese chicken since my friend's mom made it for me, along with the seasoned rice.  It's good here, but definitely not as good as my friend's mom's version.\n\nPho Kim Long II is a huge restaurant with lots of big tables for large parties.  A great place for families to eat and friends to gather after a late night.  Their menu is pretty extensive so there's plenty of choices for everyone.  And portions seem pretty decent-sized too.  (I wish they would get a bigger fish tank though because there are way too many fish in that tiny thing up front!)\n\nFrom this experience, I give it a FOUR stars.\n\nI love Hot N Juicy Crawfish up the road, and I definitely believe in some healthy competition.  So, last Friday we decided to finally check out their crawfish and see if it's worthy.\n\nWe decided to start off with two pounds and see where we went for there.     We noticed a neighboring table with their order of crawfish and was definitely excited.  It came in a large bowl with red potatoes, corn on the cob and sausage.  They also brought extra bowls for the shells and a plate for us to eat on.  The Big F requested limes, salt and pepper to make a dipping concoction.\n\nI dove right in and noticed the big difference...the crawfish was not fresh.  It was old or way overcooked.  The tail meat didn't come off the shell easily and was broken up.  I thought it was just the first one and continued eating.  Unfortunately, this wasn't the case.  There was little to no head juice either, which was very disappointing to me.  The Big F was easily disgusted with the crawfish and we were glad that we only ordered two pounds to start.  (We usually go for two pounds each!)  The corn, potatoes, and sausage were good though, but it didn't make up for the bad crawfish.  Since it comes in a bowl, there's no sauce on the bottom for you to dip your crawfish in after you shell it.  No bibs were provided, which explains all the stains on my shirt.\n\nWhen I'm craving crawfish, I'll drive up the road and spring the extra cash over at Hot N Juicy.\n\nFor this experience, I give it a TWO stars.\n\nOverall, a four stars for their Vietnamese food, and a two stars for their bad crawfish.  I'm giving Pho Kim Long II a THREE star.\n\n(Pics are posted!)", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2008-08-11", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "-NKMogyXoqMW3emthoM2BQ", "review_id": "bB-QGBjZHJWg5Pdq0sMaFQ", "text": "I've been craving Pho, because I've had a killer cold for a week.  My friend suggested Vietnamese food, so I thought of Pho Kim Long.  I'm so glad we came here.\n\nMy first time here was w/ Susan R. and it was sort of an unsavory experience, not because of the company or the food, but because a certain a-hole that we both had the displeasure of knowing was the main topic of conversation, anyways, that's neither here nor there...\n\nThe Pho is great! My friend ordered the Orange Chicken and the Scallops with Black Bean Sauce.  I love the fresh ingredients in Vietnamese cooking, it really adds a distinct taste that sets it apart from Chinese food.  If you're gonna do Vietnamese, go to Pho Kim Long, I highly recommend it!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2008-08-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "uF5GQxyqFzgGgbzokQHr1Q", "review_id": "kRHBPvnOmT7R8lCpvVjr4Q", "text": "My last couple visits here, we could not get a table. It is about an hour wait on weekends! WTF! So since today was Wednesday, we got in and were the 3rd party in the place. Its big, nice and best of all, clean!\n\nIve eaten here maybe 2-3 times but it was never anything memorable... This time though.... it was freaking great! The soup was so flavorful and the noodles were cooked PERFECTLY! You know how usually the noodles break in your chopsticks or they clump up and are hard to seperate? Not here... That alone makes this place awesome! \n\nId have to say that based on this visit, Pho Kim Long would be one of my top 5 Pho choices! BUUUT, Like I said; I had been there before and was not impressed so hopefully it wasnt a fluke today! :)", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-06-04", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "aYLh5zzmppKnFnBuNHpFkw", "review_id": "px_JBTGaRSGQ_N3Pqxb5CA", "text": "Good pho here. I got the Pho Ga [chicken pho] and my broth was nice and clear, the dark meat was tender and delicious. The garlic fish sauce was good too. \n\nFriends got the egg noodles with cha gio [egg rolls] and that was phenomenal. I will get that next time.\n\nMy other friend ordered the chao ga [chicken porridge] and porridge was amazing. Flavorful, hot, and delicious for your hungover tummy.\n\nHowever, the service was short and very asian like....one thing did bother me. The porridge arrived soooo late and its the easiest thing to make and should be ready in minutes. We all finished our meal and he was still waiting on his! We asked the server twice and he kind of blew us off. I think he forgot both times and then finally placed the order the second time we asked. That lost a star.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "vLtUlhN0sFbVI-0_E9M0JA", "review_id": "mAdtRSKSWhR8BxA5U4Ob9g", "text": "I decided to get out of my normal routine of going to Pho Saigon 8 and decided to try a new place. Boy, was I PISSED! At first, i saw that it was packed with Asians (good sign, right?). Whatever they were eating must not have been pho, because the broth sucked. It was this cloudy brown water with very little meat. I felt like I was being ripped off. I actually left angry because I could have gone to Saigon 8 like I originally wanted to.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 1, "date": "2009-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "oMcxPntH4BmTm6qs09T2lQ", "review_id": "drHkk9u4zKtizU0tD4AAYQ", "text": "Despite the what is hopefully an unintentional innuendo in the restaurant name, the food is absolutely delicious. My husband and I were craving Asian food and decided to explore the areas off the strip. Intrigued by the name and prompted by good yelp reviews, we decided to try it out. We both ordered the standard Pho Tai (rice noodles in beef broth) and loved it. The noodles did not clump together like at other restaurants and appeared to be cooked to order. The soup broth was flavorful and very refreshing. I would definitely recommend it. And in Vegas style, the restaurant is open 24 hours!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iBa9Uz2z0muwGKmtgJChGg", "review_id": "T8_Yl9ijPTdHfnvd7uwEJw", "text": "The food is comparable to other good Vietnamese restaurant. I usually get the Pho Chin Nam (Brisket & Flank) and egg rolls. It's always busy. The service isn't always that great. For the most part, they get you your food and then leave you alone until you're ready to pay. They charged a 15% gratuity on a party of 7. I don't know many Vietnamese restaurants that charges gratuity. For the service that we received the last time we went there (in early July), the gratuity was undeserving. \nIf you have a hankering for Vietnamese food, this place will give you what you want. They have good selections. \nIf you're just hungry for anything, I'd say skip it.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2009-07-24", "type": "review"}
{"votes": {"funny": 4, "useful": 2, "cool": 1}, "user_id": "qNME-YIJkW0gAyDqi5EJmA", "review_id": "g6ijYtGtZhIU-Tf_UN1Tng", "text": "Best drunk food in Vegas especially since it's open 24 hours.  My favorites: bo kha and the bo luc lac.  If you're planning on attending a pool party the next morning, don't eat here.  Not only will the food take away ripples from your six pack but it will give you major shiiizzzzeettss.  But IMO, the food is worth it.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-07-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jYnZF8D38BvViuEWI7I3xA", "review_id": "5C3OY-hs4DgLMlOjT8x3gA", "text": "Good solid chinese food.  Fresh, crisp veggies all the time.  The meats are nicely tender and good sauces.  A bit above average aesthetics and good service.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TEAUmZ4MygQyoVdLDfXopA", "review_id": "xsokL5mbpni9WeKMAkbgwA", "text": "This is the king of Vietnamese places in Vegas. It's got a huge menu and is open 24 hours. It's not the best in town but solid with lots of variety and a great choice if you're out on the town late at night. You could do a lot worse.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-08-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Buqf-GA-bTv7eN0jqL2gdA", "review_id": "VAhr7AeA4TfJkoy-axIM_w", "text": "I don't know if pho shop owners gather weekly to come up with clever or hilarious names, but I like it. (maybe they do a weekly \"Pho\"ne Con\"pho\"rence.) The only thing more memorable than the restaurant name is the pho at this place. Pho Kim Long is delicious pho goodness in Las Vegas and it's open 24 hours. I never even considered eating pho in Vegas because I'm always trying to go to the buffets, but now I think I have to go here every time I visit thank to my drunk Japanese boss who suddenly craved pho. Because it's Vegas, it's one of the nicest looking pho restaurants I've ever been to. I just wish it was closer to the strip.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ocsu563HOiClZufjc3snDA", "review_id": "Ftjk8rgRTvS2cYyiOgonhg", "text": "I guess it's \"okay\" vacation food...\n\nStaff are nice and food came out pretty fast.\n\nI had the wonton soup, beef cube steak and roast chicken rice noodles.\n\nThe wonton was very mediocre, the beef cube steak was barely acceptable and the roast chicken was rather dry.\n\nOne redeeming quality: the price tag isn't so high...especially compared to other eats in Vegas.\n\nWill I be coming back to the restaurant on my next Vegas trip?  Probably not.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 2, "date": "2009-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JbGkVsuU3IFFDZ52OBke2A", "review_id": "irZHhFa6cSifzJyqecXRIw", "text": "I'm going to open a Pho Restaurant called Pho-5-6 and I would serve a bowl of Pho, with your choice of 5 different meats (choose one) all for 6 bucks. But that dream is still a long way away. In the meantime, I'm going to Pho Kim Long.\n\nThey serve a full menu, but you've got to get a bowl of Pho. All of them are tasty (sober or drunk - most reviews are from the drunk point of view).\n\nI tend to go at 1pm rather than 1am and the service is speedy, the bathrooms are clean, and the food is tasty.\n\nThey are open 24hrs a day - enjoy.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "v6ICTEet4U-bGC-xlsimnQ", "review_id": "etH2UkqeDgofh4KS9uZziQ", "text": "Good PHO!!  Nothing crazy in the soup and very consistent.  My favorite place in Vegas to eat pho!!  The restaurant is clean and is open late!  Great for late night eats or take out!  Gui Cuon are very yummy!!\n\nAll in all, I have never had a bad meal here.  Although there nuoc mum could use a little love.  Perhaps some lime juice etc...", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-06-03", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "3_lYWmECPWFSkN8-hBZkcA", "review_id": "c3KdKX33-NJZ_iVCtnBQ0w", "text": "the best after hours PHO place in VEGAS!!!!\n\nI had the Pho Thai and it was amazing!!!\nha ha the Kalbi was awesome too.\nI've never eaten at a place that cuts the Kalbi off of the bone.  That definitely made me want to go back!\nOf course don't forget the spring rolls! They were awesome..\n\nI really only eat a few things when I go to a Vietnamese restaurant. So from what I had I loved!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2010-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "09Q5Poz8pkfp-_srlEzJpw", "review_id": "uXbNqLVkMCczgJWiRJwxsw", "text": "So the first few times I went here the food blew me away. I loved it but the service was horrible so we never tip. When they get us seated they just point and leave. Its like they just slam the water and plates as if they was being rude on purpose. Sometimes we would get 3 waiters and they were all rude. We won't even be done eating and they throw us a check without a word as if they want us to leave already. My fiance and I became regulars coming to this restaurant and they probably remember us coz everytime I come here the food gets smaller and smaller. \n\nI guess theres a SIZE IN THERE SOUP bowls which is small, medium, or large. They never tell you that they just asume you want small. But when we ask for large they never told us there was a extra charge. \n\nthe first time I ate here the soup was so cheap and it could feed 2 people. Last night when I ate there it was smaller. \nI'm not coming here again. \n\nThe food already pays for itself but the service won't let you come back.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 1, "date": "2010-06-14", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 3}, "user_id": "v6W7o2d7RxOyYMUToLtbGQ", "review_id": "hpQt3zhWZpAovCQlc2t-OA", "text": "Overpriced and could taste a lot better. For what you're paying, your plate should be covered with food, especially for a vietnamese restaurant. The Pho broth was salty and not flavorful like pho broth should be, portion was small for the price, and their fried rice was extremely bland...very disappointing. Their service was kind of sucky too. Only good thing about this place is that it's open 24/7 and it will help with your pho cravings but if you have other choices and instincts, go with it.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 2, "date": "2010-06-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "HAWHM5VNld0Nu1BjXm8UuQ", "review_id": "lF-OmOWHYEZqRdl5N4vP_g", "text": "Fried rice? Delicious !!!!! Try the Shrimp noodle phong too!! The food was great plus it's open 24 hours.. great for a late night grub :)", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "myiFO5F3E8vo2sdcnCZPYw", "review_id": "t-_uLkT05JMZ9VKyC7Km1w", "text": "Besides the fact that the name of this place said 5 times fast always sends me in a fit of (totally immature) giggles, I have always enjoyed my meals here during almost every trip I've made to Vegas.  Their menu is huge, the service is fast, ingredients fresh, and the prices totally reasonable. \n\nAlso, if I'm not in the mood for pho, they have both vermicelli bowls and porridge (with century egg!!!!!) that I can partake in.  Also, their egg rolls are perfectly light, not too greasy deliciousness.  It's a no-fuss, no-muss pho place that has not disappointed.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-06-17", "type": "review"}
{"votes": {"funny": 4, "useful": 4, "cool": 4}, "user_id": "kGgAARL2UmvCcTRfiscjug", "review_id": "kKV1hDu6qsCm8bfxYNtqyQ", "text": "Friends from So Cal were visiting and wanted to come here.  One of them is a FOB Vietnamese (she calls herself that!) and has dined here before.  Her boyfriend also loves the place and so do I, so we had lunch yesterday.\n\nI had the Beef Fried Rice, she had I the Sweet & Sour Pork Chops, and I don't know what her boyfriend had, but it looked good.  All of the dishes were excellent.  We didn't leave hungry, that's for sure!\n\nThe only strike against this place is that the servers here seem so unfriendly.  They don't say hello, have a mean look on their face all the time, and when my friend asked for chopsticks, the server gave her a mean look and pointed to the chopsticks on the table....she obviously didn't see it, but it was the way he handled it that was shocking.  The funny part is that she's Vietnamese, so you would think they would treat Gringo's like that, but not their own....whatever.  They only get 3 Stars because of the service.\n\nWill I return?  Pho-gettah 'bout it, of course!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "_M3VW1IkJVmL0e8EC3j_NQ", "review_id": "FvB631zRBGIBMJYxLg19tw", "text": "Nom, nom... \n\nThis place is a favorite to me and many friends, I really haven't been here many times where I haven't run into someone I know!  \n\nThey have a large menu which makes it hard for me to choose, while others may find this attractive.  Food is good, my three favorite options are the spicy eggplant without meat & cilantro, the veggie fried rice w/out eggs, or the tofu spring rolls, and a must have is a fresh young coconut !\n\nI like this place also because the hours are convenient, its close to the strip, and there is ample seating.  \n\nNone of the Pho is Vegan or Veggie based so I haven't tried it but all of my friends say wonderful things,  Oh yeah and I live their chili sauce its really tasty.  \n\nThe service:  it has heart, but isn't always the best.  \n\nSide note: I once ordered the hot & sour soup, I would strongly advise against it, looked like gelatin and smelled like my dogs food, they were so kind when they saw my reaction they just took it back no questions asked.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-06-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s3kfelbyKl9tH5YHjs1QTg", "review_id": "SSNLguhzuEsjj_xVRaELlQ", "text": "You gotta love the name \"pho kim long\" time lol... The decor here is better than any Vietnamese restaurant I've ever been too and to match the food is top notch! Great place to cure your hangover in Vegas. It's also open 24hrs!!!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-06-24", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "PTIswLvdufBZUzk2OceTig", "review_id": "-zhOApmzdjQGNekBtcBaLg", "text": "Came here around 2am on Saturday after gambling at Bellagio. and starving. The pho here SUCKS. I can make better ones using the pho broth that comes in a can. I ordered the pho tai and the meat tasted like paper, actually maybe a piece of paper would of had more taste. The broth sucks, and so did the noodles. I also ordered the cha gio and instead of using the viet rice paper to wrap it, they used the chinese style egg roll wrapper. Never would I come back here again. Not even when I'm starving! Worse pho place ever on earth!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 1, "date": "2010-06-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "-K3ZjROK0ml2P-Rk7ttHzA", "review_id": "1KqoSaNNfaubi_14UfthlQ", "text": "The food was alright, but the service...not so much AT ALL.\n\nWe came in here with a group of 7 (they add on 17%  gratuity to the bill for groups of 5 or more). They sat us at a big round table and we had to wait about 20 minutes just to get our orders taken. We got the food pretty fast, but we were completely ignored after that. One of the girls in the group literally had to walk up to one of the workers just so she could order another order of eggrolls since no one was going back to our table. That second order of eggrolls probably took about 30 minutes to get to the table, which made no sense at all considering the first order only took like 5 minutes. After we were all done and waiting there for a longtime for someone to give us our check, we had to go up and ask the cashier for it, so they finally dropped it off at our table. Even after we put the money down on it, we still had to walk up to the cashier to give it to him.\n\nI have no idea wth was up with this place. We were the biggest group there and not one server was attending to us. This place wasn't exactly full either. \n\nAgain, the food was okay, but the service was pretty bad. \n\nWill not come again.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 2, "date": "2010-06-30", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "_9yx2LZC_4vMVP6DIaBotg", "review_id": "WRpupJ08qY-d_dvW9UROsw", "text": "this place is simply the best. the pho was not bad at all, it was delicious and served in a big portion. the service was fairly fast for a family of 9. they didnt give out enough cups of water though, so we had to ask them some more. the price is cheap for being in las vegas. location was off the strip but it was not a problem since we drove. we went back here again on the day we left vegas just because the food was sooo good!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rMqyJmo0a2zeQ05Ld0Yfzg", "review_id": "pbuom-8aO1X6AsIjXDBrpw", "text": "Since I had access to a car the past trip, my buddies and I wanted some good ol asian food to nurse our wounded livers on a saturday morning. What else to do that than some Pho or some rice plates!  Just a short drive down Spring Mtn Road, Pho Kim Long is in the heart of Chinatown.\n\nI opted for a rice plate since I wasn't in the mood for Pho while is 100 outside. The grilled pork, pork skin, and egg dish hit the spot. Nothing fancy, just down to earth good viet eats. It wasn't the best ive had since i'm spoiled with good viet food at home but it sure hit the spot.\n\nThe service was attentive and the place was clean. This is quite strange for a Pho restaurant, a clean one? Total dmg was around $50 for 5 people with tax/tip included, not too shabby at all", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3k7SY2V5MrVwYIsMexTSfA", "review_id": "V63rPHFNhXLG4Pmr01FFGg", "text": "Pho in LV? Yessiree bob! I had the Pho Ga w/ white chicken pieces. So So SO So SOOOO good. Yes, I have been to garden grove, and we went with Vietnamese people. This place was a really good pho place, and pho is the perfect hangover food. You know I will definiltey be visiting here again when I am in Vegas!!! Everyone else had the regular Pho Dac Biet, which was good. Portions were a nice size too. Oh AND they are opening a Lee's Sandwich right next door. Holla!\n\nYummilicious Factor = A", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-07-06", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "QgslnXS8quN-oFNVPVlNUQ", "review_id": "MD2BXDPoIwtZy-HmiXd37A", "text": "If the food does not make you sick, the customer service will!\n\nThis place is really a 1.5 stars for me, but I'm going to round up for these guys.  The hostess in the front desk was pretty cool, but not the rest of the staff.  Sadly that is about the only good thing I can say about this place.  Now on to the rest of the review.\n\nI visited this place because I was in the mood for some pho and happen noticed this place while driving by.  Dropped in and the first thing was the massive waiting line to be seated.  There were lots of people waiting outside too.  Waiting outside on a HOT summer day is not fun.  After 30 minutes of waiting, we were finally called and seated.  This is where everything started to go down hill from here.\n\nWe were seated and we knew what we wanted because we were looking over the menu while we were waiting, so we ordered a coconut drink, the regular pho bowl and spring rolls.  The server wrote that down on his notepad and just disappeared.  We waited for at least 30 minutes and not one single item we ordered arrive on our table.  We then started to notice people that were seated after us got their order and they were chomping away.  After about 40 minutes of wait time I was wondering how long it takes to make just a simple coconut drink.  Are they sending a monkey to climb up a coconut tree to retrieve the coconut or something?\n\nWe finally saw our waiter and asked him to check on our order and he returned back to us to let us know they were out of spring rolls, therefore they did not make the pho or the coconut drink.  The thing was, the server said it in a way where it was OUR fault that we ordered something they ran out of and that's why they couldn't complete our order.  I just don't understand how when they ran out of one item that is no way related to the other items on the order could prevent the entire order to be made.  It's not like it was a combo or something.  I understand if I ordered a #1 at Mc Donalds and they tell me they ran out of fries, then I would order something else, not make me wait 30 minutes and tell me they are out of fries therefore they can't make the burger.  I really wanted to tell the server to GTFO here cause there is no way you run out of spring rolls in a Vietnamese pho restaurant.  It's the second most popular dish right after pho.  Its like a chinese restaurant running out of rice.  This is a MEGA CATASTROPHIC EPIC FAIL.  \n\nThe food finally arrived after putting in our order the second time, but the coconut drink did not.  I was about to take off my shoes and go out back to get the coconut down from the tree myself.  The pho dish was OK to average at best!  After waiting 45 minutes of waiting I have the right to have high expectations.  The size of the bowl was really small.  I wonder if they gave us the kids size bowl by mistake.  I can't believe they charge $8 for this kid size bowl of pho.  I can get a bowl of pho that is twice the size for $5-$6 at home!  The coconut drink finally arrived about halfway into finishing our food.  The drink was meh.  \n\nIn the end, the food was average, but the customer service just left a really bitter taste in my mind.  People think it is a good thing that they are open 24 hours.  No guys, that is not a good thing, they are there to FAIL 24 hrs a day.  Would you like to go to a place that fails 8-10 hrs a day or 24 hrs?  I personally would rather go to a place that FAILS less.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 2, "date": "2010-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iT59iDL02imW4_Ixx4LHjg", "review_id": "LCIkHnH__9lOf5a0OZzPTw", "text": "I am giving it three stars because the pho is pretty good, and decent price but the service is bad, we gave them money and it took them more than 10 minutes to come back with our change..\nThe other reviewers were right, the servers were kind of rude, but we did get free water, next time I'm going somewhere else to get my pho!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AW8Ck4X8cJwW7th3OpPR6A", "review_id": "9ot3xeK_l-monWZaa0fYtQ", "text": "I really wish I went here late at night than for lunch.\nThe wait is pretty long.  Their broth wasn't too bad.\nI liked how they decorated the place.  It doesn't look like your typical vietnamese pho restaurant and the servers are dressed up as well.\n\nHere's a tip: when you sign in, I'd advise waiting around in the restaurant because if they call your name and you're not there, you're pretty much out of luck.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-07-13", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "8JC-Yb3UDUv2FUl5ym1nVg", "review_id": "miei49r2bN-MT1DMHXxf7A", "text": "The name provides for endless jokes. Kind of awesome. It's open 24 hours. More awesome. \n\nHaving lived in Los Angeles, I have enjoyed Pho at many establishments...so many that I couldn't keep up with yelping.\n\nIn any case, the food was good, not great, but certainly good. I ordered the pho combination. No tripe or tendons, sorry to my friends who eat anything and everything like me.  Plenty of meat. Usually pho joints tend to skimp on the meat. Got a nice portion in my bowl.\n\nThe broth isn't as flavorful as some other places I've tried in Los Angeles, but it was still decent. Best in Vegas.\n\nNow the part of the review where I look like an asshole, but it's meant to be constructive. My water glass was never re-filled. (cue waaaahh) It wasn't super busy, and pho makes me thirsty for ice cold water...oh well. \n\nI'm sure I will try other pho joints up and down spring mountain and elsewhere, but this was a good start.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-07-13", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "ifFTbGgwjXALO1PgMHzrTQ", "review_id": "6WR0S5P_tz2IAnTYG55mVw", "text": "Everyone loves Pho Kim Long. Or is it that everyone loves to say the name? In any case, this place gets a lot of traffic.\n\nAs for me, I haven't been here since December of 2008. Back then, I really wasn't into pho. Since then, I've been to quite a few places. While I'm still no expert, I obviously know what I like. I've been meaning to return so that I can properly evaluate this restaurant.\n\nSimply put, PKL is A-OK. Their pho satiates the appetite. Their broth is pretty good and the rest of the ingredients complement the soup nicely. Unfortunately, they do not serve tripe, which for me is a bummer. However, they do have that \"home made\" style chili sauce that I strangely prefer over plain old Sriracha. There's nothing wrong with Sriracha of course; I'm just weird like that.\n\nOne thing that PKL has going for it is the decor. Places like Pho So 1 make better pho but are completely devoid of any personality. You would never confuse PKL with a diner. That's really not that important to me though.\n\nIn the end, it's all about the pho. In that case, PKL is good enough, especially when no other place is open.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-07-18", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "VJph9rD9ESoBCeJvetZWAQ", "review_id": "0pjAmMfOQb140B2PU31sFg", "text": "Came here my 2nd time this past early Sunday morning at around 3AM after clubbing.\nTRY TO AVOID COMING HERE AT THAT TIME!!\nHorrible service!!\n\nWhen we got there, we had a group of about 10-15 people. We were seated quickly. However, right after, the place was PACKED & way under staffed. You would think they'd have more people working..\n\nWe waved our hands around to get the server's attention for a good 30 minutes. They'd avoid making eye contact when we tried to flag them down -_- when they finally took our order, it took about 20 minutes for our food to be brought out.\nSo if you're looking for a quick bite after partying, don't come here.\n\nThe other time I came here was for lunch and it wasn't as bad.\n\nOverall the pho is good. Price is decent, I think its about $6-7 for a pho tai.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y_0FbhgGi4SMNLaFTfiMTQ", "review_id": "d9_jnJZtISEEli6txpnrQA", "text": "You will definitely find Authentic Pho when visiting Pho Kim Long. I recommend eating here if you're not in the mood for buffets or if you had way too many drinks last night.\n\nThe rating for this place can fluctuate from 3 stars to 4 stars. It really depends on how fresh your bowl of pho comes out. I've had one great experience and one OK experience when visiting Las Vegas. The rule of thumb when eating Pho is to avoid going at night (the soup taste better in the morning / early afternoon).\n\nPho - 3.5 / 5 stars\n\nEgg Rolls are not that great. They're not fresh here.  The restaurant makes them in advance and re-fry them when they receive an order. \n2. 5 / 5 Stars", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "08tQjvwbh5hEoTq_mJjtDw", "review_id": "HLARUDjsxbbvqNopPP2ryQ", "text": "Pho Kim Long is the place to go after an exhausting weekend at Vegas.  Nothing satisfies that deep beast of a hunger that's been culminating after the extreme dehydration from 5+ hours of dancing and alcohol than this place.  And I never crave pho.  ONLY AFTER VEGAS.\n\nI keep it simple by ordering the pho w/ rare steak.  My friend always gets the spring rolls which comes with a delicious peanut sauce.  The thai iced tea is also bomb.  This place is our tradition before driving home.  Always!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-07-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "05pUk_YYkW4uThfGIeN1xA", "review_id": "TkD_mNqvcSAKq5F4JWl9WA", "text": "Good place to eat after a hard night of drinking.\nPho Tai is pretty good (from what I remember).\nCheap. Well all pho is cheap haha.\nService, if that's what you wanna call it, is pretty much nonexistent. They take your order & bring your food... and that's about it. A friend ordered duck and it had that bad smell and they took forever to make it & bring it out - we were pretty much done with our meals by the time it was out.\nI wish this place was closer to the strip so that we can walk here. Usually we have to take a taxi  =\\.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zozxU-LtCJYQ9hRFsx2JPg", "review_id": "zfFm_687DbzT9UZkCuTNTA", "text": "Been here a few times, and the Pho still tastes all right. \n\nBecause I'm not a Las Vegas resident, I would not know if this place was great compared to other Vegas Pho restaurants. If I were to compare the Pho to Southern California  Vietnamese restaurants, then it would NOT be ranked that high....and it was pretty expensive for a bowl of Pho ($6-8)\n\nTo LV locals: what's YOUR favorite Vietnamese restaurant in Las Vegas??", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "21jkMYhwZDQjeML_Zg66JA", "review_id": "114SDrwQNwivE8ETpTMa4Q", "text": "Pho Kim Long is the place to go after clubin, love the noodles & their spring rolls which comes with a delicious peanut sauce.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2010-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "21dlvF92mezjqXEsE3Jc_w", "review_id": "8TVePXbH5uQ3TftKEhBqHw", "text": "The best thing about this place is the fact that it opens 24 hours. We had the pho and the summer rolls with shrimp. Both were good, this is definitely the place to go for early morning breakfast.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FMbWfm97FHO_ISi0-6Z3yw", "review_id": "QhtS9RFpUDplJo_6IjjO6A", "text": "The food here wasn't spectacular. I feel like I've had better pho back in LA. I guess it's a good break from all the Vegas food that one typically eats when visiting. I had the vermicelli noodles with BBQ pork and egg rolls. It was good but again, nothing amazing. We ordered egg rolls for appetizers too but I feel that they were a little expensive. It was 4 egg rolls for $6 or $7. \n\nThe service wasn't too great. It's the service you'd expect from an Asian restaurant. Impersonal and sometimes difficult to get the waiters' attention. They automatically charge a 18% gratuity for parties of 5 or more. That's a lot of tip for a small party. And I feel that they don't even do a lot to deserve that much tip. They take your order and serve your food. They don't refill your water automatically and they tend to ignore you if they can!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 2, "date": "2010-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S0iGD_Nebad4WddNrp08Ow", "review_id": "gKS5p5IEulolYJkwSTwhBA", "text": "Good pho. I like the 11. Very clean. Friendly staff. The vegitables are always so fresh. I haven't really strayed far from the #11 to be honest. I love it. The prices are cheap and the quality is better than expected for how little it cost. Then again how much can broth and spouts be?\n\nI mean really how can you go wrong with a place pronounced fu kim long?", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wsvKAEYJJbW8C1hDlUFHSw", "review_id": "hm4rTm7tLgL0jpA4qI4BFw", "text": "I've been here a few times. After the club and work after midnight.  Pho is good. I like the fact its only as good as you prepare it (adding the vegetables and condiments). You get a decent size bowl. The service isn't that friendly but lightning fast. We ordered spring rolls and they were there. Wow I was impressed. Food wasn't impressive but good especially for late night.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Tj_mjYL-2Wn31EurtIYuZQ", "review_id": "F5QyWR3mZ6JkU0DvB_tE-Q", "text": "It is and will always be that late night restaurant that is super fast, semi lively, and satisfying. This place has totally surpassed its name by remotely being called \"F**cking Long\" by many. It utterly appears to me as having one of the quickest service.. almost as fast as McDonalds.\n\nSince I first came to this place, the quality of the restaurant itself had changed dramatically.. only for the good though! Since the management changed a couple of times, the cleanliness of the environment had skyrocketed. There used to be an open area seafood, like the tanks you would see at 99 Ranch or any other Asian market, which was cool and all, but they got rid of it and added an extra table. The drinking water (thank god) was also one of the many things that they had switched around! Oh yea, I think they charge on soda refills, so beware!\n\nOf course, for food, you would most likely end up ordering the Pho whether it would be the soup or rice noodles, for example, the common  Pho Dac Biet (combination noodles). Sadly, they're kind of mean with the meatballs :( I would only see one floating around. On the other hand, also try the charbroiled pork chop, that one is pretty bomb as well. \n\nGirls, if you're looking for some Viet men or some late night attention, they would gladly tend to your needs and ignore majority of the customers. Don't forget, if there are other groups of girls who come in who, lets say, came back from clubbing, you would immediately become one of the rejectees and may have some difficulty getting employee attention. Real shit, they kind of flirt way too much. I know it's common elsewhere but sometimes.. I just want to eat my food and be treated equally! :\\", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-08-21", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "Drs6N6UhvsERT2GvxsaHDw", "review_id": "i5BJkN4Ja5e8jWPqlkga8w", "text": "Change the M to an N, say it fast and you get Pho-kin long! lol\n\nUsually when I am in Vegas, I eat on the strip; but our gambling adventures in Vegas last weekend left us craving for some comfort food.  Comfort food = pho!  We stumbled upon Pho Kim Long after a little drive and our party of 6 was seated immediately!  I know Vegas is a city that doesn't sleep, but even at 12:30 am and 5 minutes away from the strip, this place was still pretty busy!  After eating here, I understand why!  The pho quality is so good!  The soup is delicious and the service is excellent!  Yes!  And actual pho establishment with great service!  Their portions are the perfect size and it comes out fast!  My taste buds were pleasantly surprised.  This place is so good, I plan on visiting again the next time I'm in Vegas.  In the meantime, if you are in Vegas and need some comfort food, come here and check it out!!  You won't be disappointed!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2010-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oJ21JsG3_e5LaEP1AFn0oQ", "review_id": "gUvoEo8vrp_iqpXYb9bGqg", "text": "not the greatest pho ive had but the best ive had in vegas.  used to be a pho so 1 regular but now a pho kim long fan.  the service at pho kim long is actually better.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "46FHa5E-xfwvBoQW_ns17w", "review_id": "yNjZPLp1wmbbNMaQ1EukQg", "text": "Great late night Chinese and Vietnamese place in Vegas.  Got into town at close to midnight and my friend suggested this place.  Its in the Chinatown area off the strip not to far from the Rio hotel.  Knew it would be good, being one of the few white people in the place and it did not disappoint.\n\nHad their BBQ pork appetizer which was great, good quality.  Then had a couple of beef dishes, Mongolian beef and the cubed beef.  Both great.  Place got the food out pretty fast too.  This place makes great Chinese food, definitely worth leaving the strip for.\n\nThe pho is supposed to be awesome and I plan on having that next time.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-08-25", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Zi6EtA-4N4NP-csZjB3-fw", "review_id": "2_4MhtVDDfxW0Hn_g9bFeA", "text": "For a Vegas Vietnamese/Chinese restaurant, this place isn't too shabby.  Coming from the O.C., I'm used to some of the best Asian food that is cheap.  Prices here are a bit steep but I guess I don't mind eating here so I can take a break from all the other foods here.\n\nPho Dac Biet: mmm I like their noodles.  It's very nice and soft.  Okay meats.  Soup base was...not bad.  I felt the MSG a little bit past midway eating.  Plenty of veggies given (bonus!) and water is always provided :)  Overall, I would get it again.  But with a coke.\n\nWalnut Shrimp: really good.  Not too oily.  Delicious caramelized and crunchy walnuts.  I love the fact that the shrimp was so plump!  YUM!\n\nClean and contemporary atmosphere.  Diligent service.  Will definitely come back. :D", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2011-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y3vwco-7dT6LBRCnwZpu6A", "review_id": "mx1Mg_MtSlRHt9ZYoD1TTw", "text": "24 hour vietnamese food. oh yea and its in las vegas. the only reason why it's lacking the final star is because its so far away!\nnestled in the heart of Vegas' Chinatown - Pho Kim Long (i don't know about them - but pun is intended for me!) this place is always busy. luckily its large enough and they cook fast enough that the wait (if you do have to wait) is never that long. they can churn out everything from Pho to Bun Bo Hue - to fried rice, deep fried quail, to vermicelli bowls to vietnamese crepes! \n\ni have yet to have anything on the menu that i didn't enjoy. and if you need a pick me up - get the vietnamese coffee. way better than a quad shot at starbucks :)", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2011-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "JF1FEhOHxPLgc9dJ_qOXdw", "review_id": "xOZ7lBdCVBCeqiFpRthVmA", "text": "A Chinatown in Vegas?? Only a measly 10 minute cab ride away? Vegas, you really do have something for everyone!\n\nAfter a night of enthusiastic fist pumping to Armin van Buurin at Marquee, our arms were sore, our feet were hurting, and our stomachs were empty. My friends had already gone the night before (in a limo, no less -- we do it big in Vegas), but pho just really seemed to be a really good idea. \n\nThe taxi line was monstrous but we managed to squeeze into a 5-person taxi and off we went to pho heaven! The small bowls were big, the broth was brothy, the noodles were noodly, and the meat was definitely meaty. The basil was so basily my friend couldn't help putting several branches in his mouth like a koala. Pho really is the best drunk/hangover food ever.\n\nIn the words of one of my dear EAP friends... \"MM, this really hits the SPOT! I'm not sure which spot it is, but it's hitting it!\"\n\nAlso, I love that they have a large man standing in the front who opens the door for you. Is he a bouncer? A door-opener? Who knows??", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2011-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tWYMnVKLWrsu-FSzw8Qz5g", "review_id": "_SD-dN9l0h_n3QX3lmJtng", "text": "It was good but nothing spectacular. I ordered Pho noodles with beef and meat balls. Also, shrimp spring roll. The food came out really quick!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2011-06-06", "type": "review"}
