{"votes": {"funny": 2, "useful": 5, "cool": 0}, "user_id": "Vx-d8rFVKqc8RZ5FCA4NIg", "review_id": "qKb2WJtjl9_nZYy5WlNQlw", "text": "Renovating their lobby might be paid from their new policy to charge an extra 100 dollars if you request a same day appointment as I was when my daughter needed to be seen to verify flu symptoms so she could receive Tamiflu.  At no time during the appointment was there disclosure of this new policy and I have been going there for ten years, often being seen the same day due to illness.  That is a lot of money in my household and I was very surprised by seeing it on the mailed statement.  Needless to say, I won't be making that mistake again.  I don't appreciate surprise charges that are basically taking advantage of someone being ill.  Also they didn't want to address all the issues we wanted to discuss, but wanted to reschedule additional appointments.  I think they are more concerned about billing lately than patient care.  Oh and they also prescribed an antibiotic that was over 100 dollars even after I had said I had really awful health insurance...that really blew my mind.  What were they thinking?  Be very specific and clear with them or you'll get a bad monetary surprise is my best advice.", "business_id": "2yBBmcVEbhrGrk-hAUAfJg", "stars": 2, "date": "2014-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9UHtKq9fUrxazpbjYl79HQ", "review_id": "LKIaSFoj6AUjCRwUhAsQlQ", "text": "Love the online tracking, never had any delivery issues until today.  Quality check was finished at 3:25pm and then called location at 8510 Park Rd at 3:45 pm to find out that it would be another 20-30 minutes for driver to return to their location.  If I wanted pizza that was sitting around for an hour I can just go to Little Caesars.", "business_id": "MMgjU4K0D9RLsb7BWEic4g", "stars": 1, "date": "2015-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iHFNLaYxMlG6_0fP4jDZ8A", "review_id": "GOAHFTV9WNi2eDWUqnemFw", "text": "There's nothing wrong with the Courtyard. There's also nothing exciting about it.\n\nIt's an airport hotel. They expect people there for one night, so facilities are limited. But the bed was comfy, the wifi was free. \n\nOne qualm I has was with the breakfast. You're eating in the lobby (yes, the actual lobby, not a restaurant off the side), and all food is served on paper plates with plastic cutlery. Considering how much the nightly rate is, I would have expected better.", "business_id": "1xZ7zuLKrcrG65kzlEO66A", "stars": 3, "date": "2015-02-24", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "ts7EG6Zv2zdMDg29nyqGfA", "review_id": "OeM2x3gY_fCBmYVYHUuuNg", "text": "I've stayed here some time ago so I'll keep this short because it and the staff may have changed.  As I remember the staff was very attentive much like a 5 star hotel but for me personally I wasn't digging the old traditional style decor.  In full disclosure, the stay wasn't planned by me, so I probably would have steered clear had I made the plans.  All that aside, it's a fine hotel to unwind for a romantic weekend and take in all that is uptown Charlotte and the history of the place is pretty cool as well.  I don't think there is another hotel downtown that has been there as long as the Dunhill.", "business_id": "zwwmnQXk8jhFs4wwU8I4Ow", "stars": 3, "date": "2012-01-25", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "Pl_5HY5Uk4YzmMaEXHfXpQ", "review_id": "HOhyPi0e4CTHneiwbj6sxw", "text": "Just wow. If you ever come to Charlotte, go to the 4th Ward... its one of the most interesting downtown residential neighborhoods I've ever been in. When you go there, make sure you stop in here for some fantastic people watching and great beers. \n\nSeriously, walking here transports you completely away from the hustle and bustle and rowdiness of Tryon.", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 5, "date": "2008-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SgfuZWzXWFWooO3tZ8NogQ", "review_id": "Z6TBSsaUpVKofVdarjerzQ", "text": "This place is a GEM!  A nice relaxing neighborhood restaurant.  \n\nThe London Broil sandwich is awesome!  The crab soup is Awesome!  \n\nI got a turkey sandwich that was on special once and it was just OK.  \n\nI believe the owner works there everyday.  Good staff.  I can't wait to go back.  \n\nOne of my favorites.", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 5, "date": "2012-02-17", "type": "review"}
{"votes": {"funny": 7, "useful": 10, "cool": 6}, "user_id": "gRKiX_9JUqi4Jy8KjtsehA", "review_id": "aJUrGw1TvuJ9YCy8C8Ap7w", "text": "Al Mike's is my shit.  Want to a good place for a first date? Check.  Want Triple C babymaker in pints? Check?  Want awesome food at a great price?  Chickity friggin check. l Mike's is located in a really awesome part of the fourth ward.  Tree lined streeets and amazing houses.  Al Mike's itself looks like an awesome house turned into a restaurant.  When you walk in, you kind of feel like its an irish pub from the 80's, but this character is what makes it cozy and awesome.  The kitchen is the size of a shoe box and I don't understand how they turn out such great food as quick as they do.  It must be some type of wizardry. They have a semi cajun menu and cajun fries are always a good side dish.  Their crab soup is out of control.  Things to get here are the pasta dishes, the chicken dish, and for a sandwich the London Broil ( medium rare of course!).  This is my ace in the hole whenever I have no idea what I want. I love you Al Mike's!", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 5, "date": "2015-02-10", "type": "review"}
{"votes": {"funny": 1, "useful": 7, "cool": 3}, "user_id": "Q9xJQu-9oCFZozVBjZDETw", "review_id": "R8ghux64S2HgPbWA4H3qfg", "text": "Must-go for any new resident to Charlotte, NC, or even the south in general. I've always enjoyed knowing a little bit about what was there before. It gives you some perspective of where the city is currently and how far they've come.\n\nThe New South exhibit was very informative and fun to see the racial history from even less than 20 years ago. The LGBTQ exhibit was quite non-controversial so didn't excite me as much, meh.\n\nPark in the 7th St. garage on Sundays for validated tickets for the day! Free admission then as well but donations accepted.", "business_id": "udbtIhRXiehLRQoMFKvNXg", "stars": 4, "date": "2015-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "nHsj0cHOiroAsmDfF50BtA", "review_id": "bx8OGQoe3MWORaVfFE9F2g", "text": "I was in Uptown for an all-day meeting and looking for someplace to go on my lunch break.  I decided to give Matt's Chicago Dog a try because I've always noticed the crowds, I love hot dogs, and I love Chicago (I'm a sucker for marketing).  \n\nThe menu was a lot more extensive than I was expecting and I felt a bit overwhelmed, like being the new kid coming into a school halfway through the year.  Everyone walking in knew what they wanted and how to order.  I, on the other hand, felt like I had to go back to Ordering Food 101.  The guy behind the counter was very friendly and accommodating, though, and walked me through the process.  I still felt stupid, but at least I got to order.  \n\nFinding a place to sit was the biggest challenge.  The place fills up during lunch.  Luckily, hot dogs (and other similar items) are usually quick to eat, so people don't stay seated for very long.  The atmosphere doesn't pretend to be a place for \"hanging out\" and talking anyway, so you want to eat and go.  \n\nThe people working there definitely have a good process, but you still have to wait a little while for your food, as everything's freshly made.  And with the menu and the list of toppings being so extensive, no two things coming out are probably alike.  \n\nI got my polish sausage and fries in good time, though, and enjoyed them immensely.  I just wish we had someplace like Matt's near MY workplace, as I'd like to try a lot more on the cheaply priced menu!", "business_id": "gpCtDCSXIoQx70cq9itfNA", "stars": 4, "date": "2008-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kNdcKaIFmF0WHtKJUD6bIA", "review_id": "hnBq7fr0UAIj1rM2Ap9Xcg", "text": "There is a sandwich here that is delicious.  It's called the Black Forest.  Get it.  Life changing.\n\nI really like this place mostly because the Black Forest and the drink specials.  I usually have a good time here.  The other food isn't amazing, but the atmosphere is hopping.", "business_id": "-6JY1T0w4XETux5kGOj84g", "stars": 4, "date": "2008-12-09", "type": "review"}
{"votes": {"funny": 5, "useful": 5, "cool": 3}, "user_id": "35JyhZ4RQrXsAqbMnlRQIg", "review_id": "8MT-jnwNj0kYnkBAD_y6TQ", "text": "Ri-Ra's is an Irish pup, not a stereotypical Chinese man saying \"We Lost\".\n\nOn weekend's they'll have a cover, but this is offset by the lack of a bathroom attendant, so the overhead expense for going out here is in line with the rest of downtown Charlotte.\n\nThe prices of drinks are probably a bit higher here, so you may wish to get a base going before you find yourself here.\n\nThe bartender was pretty nice to me.  I used an iPhone app with a drink database to order a random obscure cocktail and \"Irish Twist\".  She had no idea what it was but made it for me using the iPhone recipe, injecting some uniqueness into my Ri-Ra's experience.\n\nAnd it may have just been the Irish Twists handling my perceptions, but I'm pretty sure she liked me.", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 3, "date": "2008-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "0OqjbLZWoXv9e0jIMGxC9Q", "review_id": "NdwMEJZ9Wdh17AbonT2PDQ", "text": "I went to RiRa for dinner on a Saturday night and it was surprisingly good. My husband and I sat at the long bar, while a fire roared behind us and the NFL playoffs were shown on the one television.  \n\nI rarely order burgers but was enticed by the Guinness BBQ Burger, figuring that it would be impossible not to pair well with my frothy pint of Guinness. I don't usually order burgers since they rarely meet my high expectations of a well seasoned, juicy, not-too-big-but-not-too-small beef patty, but RiRa delivered on all counts. I scarfed the burger, leaving little room for the good, but not great fries. My husband was very happy with his burger, which was some sort of super-spicy special and apparently left his mouth satisfyingly aflame. \n\nWe'll be back!", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 4, "date": "2014-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QvXc4P6DZq8Rfl_Qg1X9bw", "review_id": "NJMW1_s3NSnN1mYNRBUrDA", "text": "Went here for lunch and we were the only ones in there. We got great service because of it, but I wondered why no one else was in there? I got the eggplant special, as I always order eggplant in a Chinese restaurant.   The food was pretty good although the portions were small compared to some. I will likely return sometime.", "business_id": "rT-iPtIXMKj3dTcl87lbOw", "stars": 3, "date": "2013-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "bc4mZ3ocf91ZV3CpKxIi4g", "review_id": "8LaeH0BPzsNgx63PFbl8pQ", "text": "When I give the Marriott 5 stars I am not saying this is the fanciest-shmanciest hotel on the planet where they only accept AmEx black cards and instead of a mint they leave a medium rare, black truffle-stuffed filet mignon on your pillow at night.  \n\nI'm giving this place 5 stars for 5 darn good reasons.  Quality of the facility, quality of service, quality of food, value, and location.\n\nWe used the Marriott City Center for our wedding celebration (11/12/11) and Danijela Djukic took care of every single minute detail perfectly and on time.  The chef is great, and if you want to get truly inventive they will work with you.  All of the support staff at the wedding were phenomenal, the servers, bussers, barstaff, front desk, everyone.  Granted, this service wasn't anywhere near free, but compared to any other uptown hotel you cannot beat it.  Throughout all of the planning they took as much off of our hands as they could.  I guess the best thing I can say is they provided pro-active service instead of re-active repair.\n\nThe suites are very nice, we had two for the weekend, one for us and the other we used as a hospitality suite.  Let's not forget the great views too.  Even though we may have been a LITTLE loud, they didn't seem to mind TOO much (I mean come on after the party it's the afterparty).\n\nThe standard rooms are a normal uptown hotel room size, but they are updated, clean and convenient.\n\nThe pool area is clean and is a great place to relax for a bit or stretch your legs on a treadmill. \n\nThe location is perfect.  You are right at the \"heart\" of uptown Charlotte, the intersection of Trade and Tryon.  There are tons of restaurants in every genre in the blocks surrounding the hotel (be certain to try Dandelion Market on 5th - directly behind the hotel).  There are dozens of nightlife venues.  You can walk to Bank of America Stadium (Panthers), Time Warner Cable Arena (Bobcats), the Lynx Light Rail system, the Epicentre, NASCAR hall of fame, and a half dozen museums and culture exhibits.\n\nI cannot say enough about how impressed I was both the weekend of the wedding and throughout the process.  I am a fan and will recommend this to anyone who needs a large venue.", "business_id": "fJ72j9pRjLcRzBA_EhB4-g", "stars": 5, "date": "2011-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "b6N6uq_QRf3_M6gab8EIkw", "review_id": "-aYk1TfMZ8aTkCUbf5lXPg", "text": "I've never had sushi before, so when my friends recommended we go out for sushi on New Year's Eve, I was a bit apprehensive. Sushiya Japan is located in the Arboretum near the second entrance off Providence (the Qdoba/Chili's corner). I've seen it multiple times, but it never really registered to me.  \n\nWhen I entered the building, I was surprised at how nice it was. Hardwood floors and dimmed lights made it appear very upscale and trendy for being in the Arboretum. It was mostly empty except for two couples at side tables. Our drink orders were immediately taken and it only took a few minutes to get the drinks. We then ordered our food. I, and most of my friends, ordered the California Roll sushi. It was super affordable at $4.25 for eight rolls. The presentation was gorgeous and the service was ridiculously fast. Our waiter was so kind and constantly checked on our drinks and food. I found the sushi to be okay. I've never had sushi before and I'm not a huge fan of anything that is in the California Roll, so that's probably to be expected. My friends, who have had sushi before, both liked and hated the California Roll. The salads were delicious and several other foods that were ordered by my counterparts were really great (meat dishes). My final bill (for sweet tea with tons of free refills and the California Roll sushi, with tip included) was around $8. \n\nOverall, the great service will have me going back to Sushiya (tonight, actually). I'll definitely try something different next time, but this place is pretty good for the price. Definitely a standout in comparison to the other eateries at the Arboretum.", "business_id": "4glD2-evDFddHjQaEVpCPQ", "stars": 4, "date": "2013-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_Y0KdVN0AVTQQ1kgMbQmMQ", "review_id": "Rn4ezNcehd2lJ1-TViZZ4g", "text": "Let me just say, the5 times that I have been here, I have LOVED it!\n\nWent here for the first time with my boyfriend. We went during the week, and they had some kind of trivia going on(it was pretty fun & entertaining) For an appetizer, my boyfriend ordered a caesar salad, which was really good! I ordered chicken quesadillas which were MIND BLOWING!! I mean OMG, they were soooooo good! I had never eaten sour cream or avocado before that night, and now I eat it all the time when I get the quesadillas.  Next, my boyfriend ordered a burger(with cheese, ketcup and mustard. PLAIN I know.) He ordered steak fries that came out more like potato wedges. He thought his burger was so-so. I tasted it, and it was dry and overcooked. The wedges were salty as well. \n\nI ordered a steak(medium well) and fries. Now that was 10 times better than my boyfriends plain burger. My steak was juicy, seasoned well, and cooked to perfection. I couldn't have asked for a better steak! So kudos to the cook! My fries were normal fries which were just as tasty(once again better than my boyfriends) lol.\n\nI have been back to Rock Bottom 4 times since then, and now that I live up the street from it, I plan on becoming a weekly regular! I always get the chicken quesadillas, and have even tried the chicken nachos. Let me tell you that the nachos coming in a heap PILED up on a plate, with cheese, olives, tomatoes, and other stuff. They were sooooo good! Me and my friends couldn't eat it all.\n\nAlso, my boyfriend ordered the ribs before, and he did not like them WHAT-SO-EVER. But then again, he was comparing them to the ribs at Firebirds so yea. He also ordered the cheese pizza, and I must say that I have gotten better pizza at chuckie-cheese. I don't know if my boyfriend just has a string of bad luck at ordering at Rock Bottom, but his food is NEVER as good as mines. I have ordered the burger before(cheese, ketchup, mustard, lettuce, bbq sauce, medium well) and it was DELISH!\n\nI recommend Rock Bottom to everyone to try out for themselves!", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 4, "date": "2012-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kciO7KU4MqlGwJw4soDO4w", "review_id": "Nu1vBxebCK0sqkNue8z0gA", "text": "Rockbottom? What can I say. Hmmm. Don't throw rotten vegetables at me please. Okay, I'll say it: it felt like an upscale Applebee's.  Everyone was helpful and friendly; we didn't even mind the 20 minute wait (at  5:30 PM?). Did not care for their IPA. I love beer and only drank maybe half - tasted more like a Lager to me. Wife's soup was barely warm but she said the flavor was good. My Santa Fe Ranch Chicken Salad was just okay. Some of the lettuce was a bit limp and slimy. I did like the deep fried Jalapeno rings on top. Our waiter was really good but smelled heavily of cigarettes.  Our glasses never went empty and he even packed up our leftovers and bagged them. I think trying to run a good brewery and restaurant at the same time is a tricky operation. Sometimes one may suffer to highlight the other, or both may be slightly diminished as the operational  focus is spread thin. A-OK but not great. Go at least once and decide for yourself.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 3, "date": "2015-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I1WILQ2Ok1U8igHUE9iIdQ", "review_id": "LNVZo0We018vgYH6lxxgKg", "text": "I had the smothered cube steak w/mac & cheese & fried okra.  My friend had the fried chicken w/cabbage & veggies.  The smothered cube steak had to be drowned in gravy.  The meat was so dry it was crumbling & took the entire jumbo fresh squeezed lemonade to eat.  The mac & cheese was okay.  The fried okra came from a bag & tasted like the fried breading but there was no distinguishable okra taste.  The fresh squeezed lemonade resembles Hot dog on a stick & is supersweet.  A jumbo size is like the biggest big gulp size you can get.  I enjoyed the lemonade.  Perfect for a summer day.  My friend enjoyed the fried chicken, loved the cabbage, & veggies were par for the course.  Being right across the st, I will go again & try a different dinner.", "business_id": "XzhsJecsCYj-Wc32zOWqmg", "stars": 3, "date": "2011-01-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "Hj-uPtsI4hMa6MoihekQ-A", "review_id": "fGcQR77UfP6uFPBH4La6Jg", "text": "Beautiful lounge downstairs that doubles as a lobby/workspace and hotel bar. Great place to work, wait for someone, or hang out for a drink (my work team definitely had to do all three). \n\nThe rooms were extremely nice as well with amenities (fridge and iron, essential for a work hotel room). This location is completely walkable to the rest of the downtown area. They also sometimes have flavored ice water in the lobby which was a nice touch. \n\nMy only complaint was how overpriced breakfast was (the hotel bar was a bit overpriced, but not exceedingly so). $10 for an English muffin and a coffee? However, our server was very friendly and attentive -  and they also give you your coffee in a to go cup after you finish your sit down breakfast. Nothing like 3 cups of coffee and a spare before you get to a conference.", "business_id": "4nFqPL-glgDm9v7bZptskQ", "stars": 4, "date": "2010-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rWMnZjuLSejXvHZzl_xPDg", "review_id": "saOJfLkNd-bwSW11xdi2TA", "text": "Wonderful location, minutes walk from the center of Uptown and other venues such as the BoA Stadium. Right next to the light rail so super convenient to get where ever you need to be. \n\nThe interior is of the hotel is quite good, though is getting a little dated. The bed is very comfortable and the linen was clean and crisp. The room's size was okay and the bathroom was on the small side. The bathroom light was quite dim, but shower pressure and soaps was also very good. WiFi was quite fast and reasonable for the price. I had a room facing Uptown, and the Westin had very large windows, allowing me to look out of the beautiful skyline. I will definitely be back.", "business_id": "4nFqPL-glgDm9v7bZptskQ", "stars": 4, "date": "2015-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_X0Xt2z5Q7GESxxRzvy4_g", "review_id": "M5waSo7292N_M83pwtDoVw", "text": "Called today on a whim (well, maybe not a whim, since we had a 3+ hour Internet outage this morning) to see about getting my bill lowered.  Surprisingly, the rep I spoke with gave me two promotions, which I was not interested in. No, I do not want Showtime or phone service.  About a minute later, she said she could get my bill down to $110.42 for the next year.  I'm OK with that, that's 31 extra dollars I can use towards something else.", "business_id": "vKtMsWeAaThimXGo9Ic_Og", "stars": 3, "date": "2012-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b8O_t56S7Co9hX19mHs3dg", "review_id": "o4ivWwf7aJqT-sq71iQ0yw", "text": "5 star review is for Gabby, who I have been going to for nearly two years. She does a great job with my bob every time and is super sweet to boot. Highly recommended.", "business_id": "I9S-4czHzMVfKejCiAuXag", "stars": 5, "date": "2015-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Al_lV54KFnRgAqDO-qVIuw", "review_id": "1pInEleDJ8U4aGTerVmSZw", "text": "Love Salsarita's! 2-taco combo every time I go ... 2 tacos, chips & salsa and a drink for $6.50. Their queso is delicious ... and they have shrimp as an option for your tacos. Shrimp & Queso?!? TAKE THAT CHIPOTLE!", "business_id": "Heon0PS3J4RGmMa-VflCuA", "stars": 5, "date": "2015-01-26", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 3}, "user_id": "iK3JvFCyALKEvUo4BCPMGw", "review_id": "LjpmuWuvD9iN3e5xE4M0aA", "text": "What a freak show! I walked into this place and I thought to my self WTF? All I saw were a bunch of little people and a swing. Lol. The music was great so we decided to go inside for a look. We were visiting from out of town and browsing the down town scene and what a scene this place was. There were a bunch of staff walking around with animal masks and someone in a monkey suit and a bunch of half-naked bar tenders and for the love of me I couldn't figure out why there were so many short people in the place. Not little people but just short people. Oh yeah and the swing in the corner.\n\nWell I had a blast. The music was great and the vibe was great. There were quite a few young people and about 3 men who I thought might have been in their 60's but that was ok because it was cool. It was judgment free. The headless bull in the corner was cool too. The girls dancing on the bar were cool too. If I go back to charlotte I will definitely visit this place again. I  don't know why this place is getting such a low rating.", "business_id": "jbUu0Mtu9QUjyyeOn6RIHw", "stars": 4, "date": "2013-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F8rOtCtfmhBeBQRK6gyD0w", "review_id": "Hq3k7LtMHVHPLiHPC378Ew", "text": "No doubt am I fan. Whether this LBD is craving mac and cheese or collard greens, I know where to go.\n\nI usually order online on \"uptown2go\", so I know to give it about 20 minutes before collecting my meal. Lately, I have been a huge fan of their bbq sandwich. It comes on top of a buttered roll. Now if that doesn't get it poppin, what does?\n\nBeing a northern boy, I never really had the opportunity to munch out on some soul food. Let me tell you, this place has gotten me addicted to collard greens. \n\nThey also have good beans and cornbread. And when I want some beans and cornbread, I will go to Mert's for some beans and cornbread. If it wasn't for their beans and cornbread, I'd go somewhere else for my beans and cornbread.\n\nLBD Scale- Easy 8. Now doubt in my mind that this place is a trademark southern soul food boutique. If there's any other places that you recommend, holla at me. But right this second, I'm all about Mert's. I WANT SOME MERT'S IN MY MOUTH!", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 4, "date": "2011-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6SGGyr-RTxR_iLK7BO25BA", "review_id": "pdTZTRBolwcnJR8QNojQHA", "text": "Really, its as good as it gets. The food is hot and fresh. The cornbread is awesome and the service is good...I love this place.", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 5, "date": "2013-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V8x6FXeaDubYvfQGFvl8VA", "review_id": "2CH5OUbvzidz8PDt_aIWOQ", "text": "Great place to experience home cooked style southern food. Yams are delicious along with salmon fish cakes and sweet potato cake for dessert", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 5, "date": "2014-01-09", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "yJi4gQUIK1NAs8nD65aS7Q", "review_id": "oS7yNegSHhdbo9A38b-jzw", "text": "I'm from NY. I only know what Southern cuisine entails from the Food Network Channel. Other than that, I have no concept of what things should taste like. Knowing I'd be in Charlotte for a short trip, I scouted out the food options in Downtown area and Mert's seemed to be the place where I could get my fix.\n\nKnowing I had important business the next day, I couldn't take any chances with my stomach. My safety order of Buttermilk Fried Chicken Fingers ended up way too salty after a while. The sides of roasted potatoes and mac & cheese were just okay, nothing too mind blowing.\n\nI wouldn't disregard this place completely after 1 visit since my party thought their orders were decent. Decent enough to put them into a food coma at 1:00 PM. Perhaps it was a bad day/I should've ordered something else.\n\nDat cornbread doe. Spot on.", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 3, "date": "2014-12-20", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "GZPmUmnnH7rx3xUzF5vqwQ", "review_id": "8CNdHi9oBy6CIsGnF5Uppw", "text": "I decided to do the bounce back to Jersey Mikes as I was swamped with work and needed something I could eat at my desk.  The bounce back allows you to bring back your receipt from Tuesday and get the sandwich, chips, and drink special for $5.99.  I went on a Friday afternoon around 11:30 am.  There were few people inside and only one person ahead of me in line.  I ordered the same thing I previously had on Tuesday, the original Italian.  The sandwich had the same high quality and everything from my previous review was reinforced.  Since it was pretty slow I was able to interact with the staff there. They were extremely friendly and courteous.  The woman garnishing sandwiches called me \"sweetie\" (don't tell my wife).  The manager was on the register and he asked me if I liked the bounce back deal.  I replied with a hearty, \"yes I do!\"  He stated that he was glad to hear that.  I'd like to think I can tell if someone is just going through the motions or really enjoys interacting with their customers.  At this location the staff were the later.  Because of the great sandwiches and awesome staff I have to bump my rating up to 5 stars.", "business_id": "6ICGve6UyGPuLaGrKQBVuw", "stars": 5, "date": "2010-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YEkBmDBm8M_Mkq21vHovsA", "review_id": "goS9PA28O6fe5TUU0qoLXQ", "text": "Passed through Charlotte on a holiday road trip, and found Mimosa Grill on Yelp. Took a look at the menu, and thought it sounded like interesting, delicious food. And it was. Food was fresh, tasty, perfectly seasoned.  Service was just the right amount attentive. If I lived closer, I would definitely go back!", "business_id": "NTfUFk8GyOLL1uPbEO-pVg", "stars": 5, "date": "2012-01-09", "type": "review"}
{"votes": {"funny": 5, "useful": 14, "cool": 8}, "user_id": "PM2jXrlVzik1jDwwahLJJQ", "review_id": "scixkVHyrKJMNYIT8rGLiw", "text": "Folks, hands down this has to be one of the best brunch spreads in Charlotte!!! \n\nI met some girlfriends here for brunch on Sunday afternoon. I scored a parking space on the street but they do offer valet and there are plenty of parking garages.\n \nThe inside of this place is gorgeous. There's plenty of beautiful tile work and it's all windows in the dining area so you'll have a great view. In the warmer months, there's even a lovely patio section! \n\nFor Sundays there is no regular menu! It's brunch or nothing! But that was totally fine with me! It's one price for all the brunch and tapas plates (mini omelets, french toast, eggs benedict) you can eat.  \n\nThat brunch bar is loaded! It's got everything:\n\nMac and cheese (cheesy goodness) \n\nA Grits Bar (Yep! There are tons of toppings like ham, cheese and bacon crumbles to add if naked grits aren't your thing)\n\nSmashed brown potatoes (like hash browns but 10x better) \n\nPeel and eat shrimp\n\nBiscuits and gravy (mouthwatering good) \n\nHerb Crusted Prime rib (tender and delish) \n\nSalmon\n\nBacon and Sausage \n\nEggs\n\nShrimp and Grits The grits were nice and creamy! Just the way they should be. And the shrimp were tossed in a gravy sauce mixed with andouille sausage and spinach. With just the right amount of spice and flavor...I could eat this every day!\n\nChili (forget everything you know because it's freaking fantastic) \n\nWhew!\n\n I'm sure I'm missing a ton of things but it's more than enough variety for you to make sure you leave full and happy. What the heck are you waiting for? \n\nOh and if you somehow manage to have room left after sampling all those goodies....they have chocolate covered strawberries! Yum!", "business_id": "NTfUFk8GyOLL1uPbEO-pVg", "stars": 4, "date": "2014-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Hg4GF6sHT_9tuHIvrfpkpw", "review_id": "25qSU3dWiBQ115y41YVajA", "text": "My husband and I came here for dinner on Friday night. We didnt have a ton of expectations but left very much impressed!\n\nWe started with a bottle of wine and the lobster mac-n-cheese appetizer. Oh my gosh, delicious! There were huge chunks of lobster claw in the mac n cheese and it was super creamy. Perfect for splitting!\n\nWe then decided to split the brussel sprouts and the Pecan Crusted Trout. The trout was a large portion and very good. The brussel sprouts were cooked well, a bit sweeter than I would have liked but very tasty. We ended the evening with the warm chocolate cake.\n\nThis was such a relaxing evening. Service was absolutely amazing. We will absolutely return!", "business_id": "NTfUFk8GyOLL1uPbEO-pVg", "stars": 5, "date": "2015-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Ul93T_U5jDh1FIIpiiTxuw", "review_id": "fji3sg8msagntGeKYXgyDQ", "text": "Italian cuisine that transcends the ordinary, with impeccable service and an ambiance that demands romance make for a great dining experience, especially with your someone special.\n\nThe Mrs. and I strolled in on a Friday night at the start of restaurant week.  Thankfully, \"rush\" is not a concept here and, even from our initial greeting and coat check with the hostess, we were pampered  throughout the evening.  \n\nThe dining room is low lit in the evening, but not dark.  Plaster walls, travertine floors and mostly small tables along the walls.  A small bar sits off to the side, but seemed filled with regulars before the evening's end.  I'll agree with others- this is a place for date night, not a corporate function. \n\nWine list is ample and will cover most palates.  A drink menu holds a small selection of cocktail options.  While you peruse the menu, there is fresh-made bread with a white Italian whole-bean dip that we eventually had to push away lest we spoiled our appetites for the entrees to come.   \n\nThe menu seems to change but you really should listen to the specials of the evening- there is usually a fish of the day and a risotto and pasta of the day that all sounded worthy on our evening.  Our waitress took her time and seemed very knowledgeable about the menu.  While there are a few Italian staples here, like lasagna, there is a noticeable effort to focus on more Tuscan-style offerings that play on fresh vegetables and proteins light on sauce but skillfully chosen to complement the other ingredients.\n\nOn our night, I had pistachio-crusted Salmon alongside a risotto flavored with citrus and cardamom.  It was wonderful.  Salmon was cooked to order and light, while the risotto was rich and savory.  The Mrs. had a veal and risotto dish that was accented with truffle and was equally amazing.\n\nWhile we ate, it seemed all the staff stopped by to ask if we were enjoying our meal and whether we needed anything else.  Glasses never got close to empty and I got the feeling that our disapproval of anything would have resulted in immediate rectification.  In other words, the team-based service approach was seriously spot-on here.  The Italian accents by most staff were a pleasant surprise as well.  Pacing was appropriate and we were comfortable the entire time.  \n\nDessert menu was small, but what we picked out worked very well.  Chocolate lava cake and a pear tarte were both single-sized portions, but just enough to savor and cap off what had already been an exceptional meal.  \n\nBill was promptly delivered but we were never rushed.  Parking validation at the table was nice.  Even upon leaving it seems the floor staff made a point to wish us a good evening.  When the hostess refused our tip for the coat check, it just sealed the deal that these guys take customer serious seriously.  Refreshing.  \n\nLuce not only has some excellence in their kitchen, but it flows out to the floor staff as well.  This was a great choice and is a worthy contender for a romantic night out with one's significant other.", "business_id": "z24h6ZYnZiWjlDTuLXG9jw", "stars": 4, "date": "2012-01-27", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 2}, "user_id": "RgRn7tjpAvLZy3y4S992eg", "review_id": "3ETFAb88Ja-d9d3daRfF0w", "text": "By far my favorite restaurant in Charlotte.  While the price point limits how often we can visit, the service is excellent and the food is amazing.", "business_id": "z24h6ZYnZiWjlDTuLXG9jw", "stars": 5, "date": "2015-01-21", "type": "review"}
{"votes": {"funny": 3, "useful": 11, "cool": 6}, "user_id": "D4udabSXvSaiQFYEW-yKMQ", "review_id": "oO18LL4UeL0AECcb4HLbGA", "text": "This bar is not too far from where I work.  I was told by a friend that it was a gay bar, but had pretty decent food.  I walked there one afternoon.  It has a brick exterior and the interior looks like any old Irish pub, nothing overtly gay about it at all (what a change from SF gay bars).\n\nThe bartender was friendly.  She quickly told us the specials and we had some bottled beer for I think only $1.50 each or something crazy like that.  This isn't' just a happy  hour special either, but I think it's all day.\n\nWe decided to try the other special that day, 35 cent chicken wings.  We ordered ten and the cook delivered them himself, plenty of napkins, side plates and blue cheese dressing.  Surprisingly, the wings looked great.  What's more they tasted pretty darn delicious.  They were a good size, meaty, slightly crispy here and there and the heat of the sauce was just right.  Can you believe it only cost $3.50 for 10 wings?  They have different daily specials, so check out their website.\n\nIt was quiet during our late lunch, we were the only ones there, but the place is pretty comfortable (booths, tables, bar, TVs, etc.).\n\nIt's a hidden find, that's worth checking out.", "business_id": "EwuvZCcVHkICgTbqCEjikA", "stars": 4, "date": "2009-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h82nc1vcGVDXVLGTGSuQqA", "review_id": "BRu1iWo5zT1DxtC4WX_1Jw", "text": "My daughter's soccer team was in Charlotte for the weekend.  We were looking for a restaurant for our team dinner on a Saturday night at 7:00pm, party of 45.  Brixx was more than accommodating.  Service was excellent, food was fantastic and the girls loved the Saturday night Trivia contest.  Highly recommend Brixx, can't wait for the new one to open back home in East Cobb.", "business_id": "kAid56AY_laxGYslMdsYJw", "stars": 5, "date": "2014-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "07rQTc1iCe_C8aZvTxCTdA", "review_id": "PNt4Nnm_X_R8d-mosX70Fw", "text": "The Goat Wagon Grocery has nothing going for it except its location. I shop here because it's the closest convenience store to my apartment.\n\nNegative experience #1:\n\nThe store reeked of marijuana. Smoking's fine, whatever floats your boat, but air the place out. You can also attempt to not look completely stoned on the job.\n\nNegative experience #2:\n\nMy girlfriend walked here to get change for laundry. The younger gentleman attending the store (the one who smokes) initially refused, saying the store didn't give change. First off, this isn't true; the older attendant gave me change before. Second, we shop here all the time, and everyone who works here recognizes us, including him. She offered to buy something to get change and he again refused, this time insisting he do her a favor by opening the cash register anyway. He was never this much of a wishy-washy jerk when we shop together.", "business_id": "CC9ttbNktyxl9tRHkUG30w", "stars": 1, "date": "2012-02-12", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 4}, "user_id": "hYpCpleBxL5h4jz3HeNqGw", "review_id": "gAWOiJL9oqfLSajdpIgArA", "text": "I have to be honest... when I first heard the name of this place, I thought it was going to be bar food or something pretty typical. My honey decided to surprise me for restaurant week and this was the place of choice. I was actually a bit disappointed when he told me since my first idea of their selection was initially incorrect. \n\nHe told me to dress up, and I was thinking he was crazy or something... dress up for bar food?? What? Ok... I have to admit, I'm pretty stubborn, so uttering the words, \"You were right\" as we walked in the door of this beautiful place wasn't easy. I felt as if I were an actress in the silver screen era with the beautiful artwork, and almost royal looking furnishings. The lights were set to a low romantic level and the place was buzzing with a sophisticated crowd. \n\nWhen we walked in and I got over the romantic candle lights flickering lazily in the dining area. The hosts and hostess were super attentive and We told them we had reservations. We were told there was still going to be a wait.,which I figured may be the case for restaurant week. They had some chairs to the side so we sat to the wayside, and watched a couple people get sat before us who came in after us. I went up and asked them for a menu and they realized we had been there for a bit. The hostess was great, and she put us at the top of the list to be sat. She apologized and we were fine. After we sat down we ordered, and the food came out in great time. \n\nHe ordered the 8 oz Kona Parmesan steak for his meal and I had the Salmon. The sides that came with these meals were spinach and mashed potatoes. Now, I've said that many places were good, and I've given many 5 star reviews, but MY GOD I think they should make an exception for even more stars for some places. \n\nWhen I took that first taste of my salmon... time stopped as my taste buds exploded. I thought it couldn't get any better, and then I tried the potatoes... If foodgasms were real. This is it folks. I'm serious... Capital Grill has the BEST food I have ever eaten in my entire life. I could have wept from the amazingness on my palate. The salmon was so juicy and perfect. The potatoes... oh those potatoes... I could write an entire review on those alone. Perfect. \n\nNow the most amazing part and quite possibly the best customer service I have ever experienced in my life. We got our bill and my honey had ordered an All American and then changed his mind and switched to a B&B, both drinks ended up being on the bill. We weren't upset by it at all, but a manager came over when he saw us looking around for our waitress. \n\nHe asked if everything was ok, and when we explained the mix up, he apologized profusely and told us he would take both drinks off of our bill!! We told him he didn't have to do that because we did have the one drink, but he insisted and said it would make his night to make this right for us. WOW!!! We were amazed!!\n\nThere is seriously nothing negative I can say about this place, and I think it'll be a great place for any special occasion. Hmmm... my birthday IS right around the corner... :)", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2013-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "NTRHnt3wWo-Lb_YGS2WAdQ", "review_id": "fPZtAGXrRSC3wakt8RA1jw", "text": "I took my family here for Charlotte's Restaurant Week the other night to celebrate my dad's birthday. There were 5 of us. Let me just say, it was incredible. I've done the Restaurant Week thing before on numerous occasions and, it's very easy to come across servers and restaurants that are focused on getting you in and out as quickly as possible. This was absolutely not the case here.\n\nBeing that it was Restaurant Week, there was a set menu for us to choose from. Unfortunately, there was not a vegetarian option (my fiancee is vegetarian), however the server spoke with the chef and they were able to come up with an incredible vegetarian pasta that she loved. The server was very conscious to avoid any soups that had a meat broth as well. In addition, at no point were any of our water glasses ever empty, every interaction with the server was met with a smile, and what's more important, we never felt rushed. The server found out that it was my dad's birthday, and brought him a cheesecake with a candle for dessert (complementary). \n\nAs for the food, I can say that this was without a doubt the best steak I've ever had. The filet was so tender and cooked perfectly! For some perspective, I've eaten at Ruth's Chris, Del Friscos, and several other high-end steakhouses in addition to working at a very high-end country club. Capital Grille blew all of them out of the water. \n\nI truly can't say enough about our experience. My dad said that it was the best birthday he'd had in a very long time, and attributed it to his experience at Capital Grille. If you are looking for a great place to eat, with great service, I can't recommend this place enough.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2015-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "svDfyraZSfiBT-CvrsycXg", "review_id": "RyD5GgvJ2mrywob1Ikq6-A", "text": "Stool pigeons is a straight up middle-of-the-road sports bar for me. I find nothing whatsoever offensive about it, and yet nothing totally standout either. \n\n(Well, except  the Hot Italian Beef sandwich is pretty standout if you're in the mood for that kind of meat and cheese monster )\n\nDon't quite get all the complaints about service?\n\n I've never had an issue with service here and have been during lunch when it can be quiet and  during high-profile football games when it is packed.\n\nTypically, I sit at the bar and find the bartenders competent but not overly cloying.\n\nIn short, it is what it is - a downtown sports bar, with sports bar food, drink specials and lots of TV screens.  \n\nAnd I don't have an issue with any of that.", "business_id": "t5l-H2KdY4MQgLDMENz9WQ", "stars": 3, "date": "2012-01-11", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "ZYpkpzO2GVPktnrJhJKIPA", "review_id": "ok9BhfWvhIS6ix-GreB6zQ", "text": "Don't bother with this place. What a joke. We had a seat at the bar, no staff in sight. Waited about 15 - 20 minutes. Although two employees were milling about just around the corner, neither checked on the bar even once. Finally a waitress came out, brought a check to a table, walked behind the bar, fiddled with the dishwasher just a few feet away from us but never made eye contact. She proceeded to joke around with some customers at the other end of the bar, continuing to ignore us entirely. Fed up, we got up and left. \n\nBut wait, it gets better...moments later a different waitress came running out after us, asking if we'd paid for our tab. WTF???\n\nAvoid at all costs.", "business_id": "7BVCmaxhvXgEpx7J-SQ4QA", "stars": 1, "date": "2012-02-26", "type": "review"}
{"votes": {"funny": 7, "useful": 5, "cool": 5}, "user_id": "5h8l-jqqDS2Cc8pFy3vMOQ", "review_id": "CQ5bHcUhk0p74nALNhfEgA", "text": "I used to come to Charlotte a lot when I was more of a \"Bang All Of America Stadium\" kind of guy, rather than a \"Bank Of America Stadium\" kind of guy.\n\nFirst-Hand Experience: Info on my personal visit to this stadium - I've seen the Panthers play here and I wasn't too impressed. The crowd was big and loud and intense, not the loudest I've seen but still impressive. However, the team wasn't much to write home about, and the design of the stadium was a little typcal and dated. It's just something of an uninspiring place although I'm sure lots of the home fans love it. I may come back here and see another game one of these days.\n\nNow that I've been to every NFL stadium (current and former) and seen all 32 teams play live in the flesh, time to review them on Yelp! I love stadia! I've been to every cool sports arena in the UK & North America, it's an obsession I have with travel & sport. I've roamed America as a musician for years. In that time, I've seen sports games at (or toured when empty, or both) almost every major stadium in US/Canada. Many pictures taken which I'll upload eventually. On future travels, I'll new pix, and add more stadiums! Watch this space!\n\n***back to regular review***\n\nI don't really like this stadium. It's just another big bowl (like a lot of the stadiums in this region are... Jax, Miami, Nashville, all a little bit samey)... yes it has some loud fans, but it still doesn't quite do it for me. I also think it looks better from the outside than the inside. On the inside it's just a bit unoriginal for my tastes.\n\nAnyway, I'm more of a Raleigh-Durham-Chapel Hill person than a Charlotte person anyway, but more power to the Panthers and good luck to them in all their future ventures.\n\nHearts go out to North Carolina, and if you've never tried one, get yourself up to a Cook Out and check out the cajun chicken sandwich with extra cajun, and a banana shake.", "business_id": "g-Q7G5Q2zHb1BqoF8pq-OA", "stars": 3, "date": "2014-12-31", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "W6LTsXcY1R76M9EdeN0G6A", "review_id": "nyds8PyU9-EM9ogsDgvhiw", "text": "When I'm out and people ask for advice about where they should go next, I send them here.\n\nI love this place. It could be packed or completely empty... doesn't matter. I always have a good time. Sober or drunk. Yes, I have in fact been here sober. Go ahead, bring the jokes.\n\nConnolly's is like a family. Many of the bartenders have worked here for years. They are all super friendly and damn good at slinging drinks. These are the same masterminds involved in Tyber Creek, Dandelion and Prohibition. They know what they're doing.\n\nThe patio is huge. Perfect for after work cocktails or Sunday funday. Cornhole, tables, TVs. Pick your poison. Speaking of poison, if you're in the mood for a car bomb... go here to get it. And be sure to buy me one. \n\nFridays and Saturdays you can typically expect a cover. It's usually just $5. You'll find that at several bars in uptown.\n\nI'm happy this uptown staple is not only still kicking it, but also remains one of the most popular watering holes in Center City. I know I don't have to say this, but don't ever change Connolly's.", "business_id": "jmzPbvE_02SzTAjwZCTgYA", "stars": 4, "date": "2014-01-07", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "sfJWzJRos2PvvM99p_PQAg", "review_id": "KEBTgMBitDGdLpkcAsAIAA", "text": "It's definately meat-markety as previously stated. It's a place you gotta wanna go. If you're lookin for a relaxing evening then don't go here- simple as that. If you feel like taking a stranger home - this is a prime destination. Everyone is beyond trashed, normally. And o-yea, the more clevage you show the quicker you'll get your drink. Hey, I'm not opposed to using womenly wiles. \n\nI wasn't terribly impressed by the music but then again I rarely listen to the radio anymore. Anyhow! Huge space, sticky floors, gross bathrooms, and lots of horny people ..... sometimes you just want that.", "business_id": "GK6RBUJUBScobbF1oE5iuw", "stars": 3, "date": "2009-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dH1ADqrLKyO9GDhbPRMt5w", "review_id": "yfL4NKwxd-9NIZP9rZcISA", "text": "This place has everything!  Popped in for lunch with a friend and a drink or few.  We sat at the bar in the center of the place and spoke with the very friendly bartender for suggestions.  She suggested a sushi lunch plate which we ended up sharing and the drink special.  Since the sushi chief worked right behind where we were stationed we got to watch the whole plate get created.  After a few rounds of the daily drink special we walked out tipsy and full for around $10 each, now that's a great lunch date in my book!", "business_id": "e5J3s-xxs1S6PPHJhldBEA", "stars": 3, "date": "2011-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zgn20s7siQlxoT08xH5SJw", "review_id": "NqUsLWmcVkMXOCQYmiJKSQ", "text": "Just got back from the Mummies Of The World Exhibition. WOW!!! To think these mummies were all found in the basement of a German museum that were thought to be destroyed during WWII. These mummies date back from several thousand to over six thousand years ago and come from all over the world, just not Egypt. This exhibit has some of the oldest mummies in the world, including mummies thousands of years older than King Tut!! The oldest mummy was that of a child that was 6,500 years old and had some amazing detail. There was a female mummy with long hair and tattoos.\nThe exhibit also contains animal mummies and all sorts of artifacts that were found with the mummies, like mummy powder of ground up mummies that was used as medicine, tools used during the mummification process or jars used to store the organs that had been removed.\nAlthough the exhibit has already been here for 3 months, it was still very crowded, but most people used their manners if they bumped into or stepped in front of you. If you enjoy this type of history, My wife and I highly reccomend this exhibition. Admission is $24 per person which includes the mummies, $12 per person without the mummies.\nAs far as the rest of Discovery Place, most of it geared toward kids, and there was alot of them, but the parents seemed to keep things under control. I did enjoy the aquarium and some of the other exhibits. I wanted to see the 3d sea film, but it was getting late and we had to pass. And yes, I did let my inner child loose on some of the play stations!!!", "business_id": "ZBQWSsUXwixFmm3lpegMiA", "stars": 4, "date": "2012-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "72DsxswFZrkXkAtDJyBnLA", "review_id": "dB-jwEJKWMdPkPLrt6W33Q", "text": "This is the place for wanna be steelers fans. The bathrooms are terrible, and the place smells like a dirty ashtray.  the waitresses were very rude and didnt care about your orders. I was hoping for a better experience but oh we'll.... That's why I have found a much better place to watch all the games.", "business_id": "XeFNQqz5vVsVIcTjNuXcTw", "stars": 1, "date": "2011-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "fNghBJT0Gi0X5h3E9NFxgQ", "review_id": "DWZvE8rtmjBkfd_WntT9_w", "text": "Let's be honest with each other on this review. Yes, it's downtown Charlotte, NC but who cares. For the prices that this hotel charges, they can do much better. I'd suggest that they call the Omni in Pittsburgh and find-out how its done.", "business_id": "QThlnQ7AvzZwXHKD5DjdCw", "stars": 2, "date": "2011-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "OiV9jwVwAE1E2KuQkikokA", "review_id": "M4F_xQTS3VW0dtjtLH42GQ", "text": "I have had the baked Chicken (Thursday special) and it is WONDERFUL!. A great change from all the chain and fast food restaurants downtown. It does get very crowded and little awkward when it is that way. \nThe food comes fast and is delicious. I have only been here for weekday lunches, usually Thursday. My coworkers love the other specials too. \nIf you are looking for a change from the everyday, this place is a great one to start!", "business_id": "376PDtBpGi74Os08TvCkhg", "stars": 4, "date": "2009-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TxXCK-y9lldFIpit-PP3_w", "review_id": "c_vrR0zKfMNZBoJifalpiw", "text": "I love this restaurant.  It's really good to have a restaurant that cooks with heart and soul.  I eat their several times each week.  The food tastes great and is priced GREAT.  No complaints.", "business_id": "v96eOvQGYHukDu_UWqNl4A", "stars": 5, "date": "2014-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "hChxnZWW0K0DdPPrgvErUw", "review_id": "-gjO7jDf2V_Ycao0lU8kmA", "text": "I just had the bbq pulled pork sandwich because I'm trying to stop eating fried chicken.  I ordered the bbq pulled pork sandwich and it was pretty good. Actually it's better than Mac's Speed shop which now I find highly overrated.  The pork was moist, I liked the hot and spicy bbq sauce that came with it.  Not impressed with the bread or bun but I guess it does it's job of holding it all together.", "business_id": "wpFOZbONc7qUYz6YmBfKuQ", "stars": 3, "date": "2010-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bUhUrYUIcNRz-EOfX9kIug", "review_id": "ZfUDGB30w1YHiu0oTKNHPw", "text": "Liers and cheats. I chalk it up to them trying to take advantage of me because im young (20).  My brakes had been squealing. I brought my car in and had them look at it. I thought it was the front pads. About 40 minutes later they called me and told me in needed rear pads, rotors, and my brake fluid flushed because my rotors were at 10% and my brakes were destroyed. I've done more work on my car myself than the average guy and frankly it sounded like malarkey.   They quoted me $419.37, which is already ridiculous.   \n\nMy father and I elected to have it worked on back home. Good ol' Mayberry (Mount Airy, NC).  He took it to one of the shops in MA and had them check it out, because they had quoted us $240 for the same job. Within minutes of having the tires off they noticed something strange. All of my pads and rotors were above 50%. Just to be sure we had one of my friends whose been working on cars for years and years look at it. He said the same thing. \n\nGriffen Brothers simply lied to me. I am very thankful I didn't have them do the work. They should be ashamed of the way they act. \n\nThe associates name I spoke to was \"Danny.\"\n\n----------------------------------------------------\nUPDATE: I changed my original rating from one star to two. The general manager reached out to me an hour after posting my original review. It's means a lot to me he took the time to apologize. He explained the pricing difference, which I believe to a healthy extent. He told me he was looking into and was planning out how he'd reprimand the techanican at fault.", "business_id": "mnOTw4P5NaLbzFp2bTsm9g", "stars": 2, "date": "2015-02-25", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 3}, "user_id": "9oIJF2dmVbWa8mItl-egiA", "review_id": "cEjV3O7QKo4vc1p-J_BrNg", "text": "A liked this park a lot.  It was like Great America meets water world., but actually, great america has a water park now too.  So its like great america.  \n\nSome rides however, we dont have!  They have rollercoasters that get you wet!!  not the ones that little kids can ride too, but the ones that you have to be at least 5ft tall, and its up 60ft up in the air kinda rides.  The scary ones!  \n\nIt was really exciting when other Asians saw us and we thought the same thing, \"there are others like us here!\" rarity. It was so hot, i think i spent all my money on drinks.", "business_id": "n9iK0s1dKxv5JLi3u1eTkQ", "stars": 5, "date": "2010-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DG2e-iBmshfTao7aWAAepg", "review_id": "Vp8bSVZz3ZpRcZQlpM9jVg", "text": "Usually I stay at The Double Tree or Hampton Inn. But when I'm on a budget I choose Motel 6.  I decided to try this place for distance of where I must be tomorrow morning. \nWhen I entered the room it smelled weird and the heater was maxed. Then to top it off the remote doesn't even work for the TV. And last but not least, the bed is made as if a 6 yr old is just learning how to make their car bed. Choose the Days Inn that is in the same parking lot. Happy travels.", "business_id": "qi3If1JcIP9JLusFpEmtog", "stars": 1, "date": "2012-01-12", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 2}, "user_id": "CvMVd31cnTfzMUsHDXm4zQ", "review_id": "PKa0LTVzbYH2NanjDb3TkA", "text": "I was a member of the Dowd Y for about 3 years and then bowed out to move south to the lands of suburban Charlotte. Where Target and soccer fields reign supreme. Well, no longer! I'm back to the Dowd, and boy, oh boy, does it feel good. \n\nI love this facility. Easy to access all of the equipment you need. Swimming, cardio equipment, weights, basketball courts...just the works. I've been a racquetball player most of my life and the courts here are fantastic. The crowd that shows up is challenging, lively, and exudes a great deal of sportsmanship. The Y really does formulate a great deal of community. \n\nBiggest gripe, as many would agree, is the parking situation. Ha! Good luck finding a space at 5pm on a weekday. You'll circle that old building for half an hour before landing a space! I recommend biking if possible. Much less of a headache. \n\nThe staff at the front desk and the pro shop are great people, too. Very nice, helpful, and no-frills. They just do what you need and that's all. \n\nI also love the baskets of bible verses near the entrances/exits. It's a nice touch. Glad to see this organization is focused on the needs of spirituality as well. \n\nLove the Dowd. Love being a member here. That is all.", "business_id": "b3u-GK6_xj2fJkinzLk_jQ", "stars": 4, "date": "2013-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UmCAhWcU_abaaESenKUiLw", "review_id": "4mFu8ZISYTwLXLJyUhY9jw", "text": "Overall, nothing special here. We went for RESTAURANT WEEK on a busy Saturday night. I had the NY Strip, which did not look like a high quality cut. My wife had the \"Jumbo\" scallops... 3 small scallops for $25. You don't get much for what you pay, and the quality of the food just meets your expecations.\n\nThe best thing we had was the Baklava. Fantastic. Free valet parking is another plus. The waiters seemed attentive.\n\nThe decor was okay. I was expecting more of a loungy, hip atmosphere. \n\nThe most suprising thing were how many diners were complimenting the food after their meals. Charlotte-- time to raise your standards??", "business_id": "eaqJQP6bp7rQJQt5KqfvxQ", "stars": 3, "date": "2010-02-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WycBF7A57CbcET2vUB6r4w", "review_id": "4POP85hnnq-zVm19Qhg--w", "text": "Had a great dinner at Blue last week.  A friend wanted to take me out, and picked the place.  The night began with complimentary valet- always a plus in uptown.  We had a reservation and were seated in a comfy booth on Friday night.  We began with the flat bread appetizer- nothing out of the ordinary,  but tasty nonetheless!  Then the bread arrived- the cranberry wheat is delicious.  My entree was the beef tenderloin.  Very good.  My friend went out of the box with the Wild Boar.  I tasted it- first time that I ever had it...it was interesting- but delicious!  I tried 2 of the martinis off the list- both were well mixed.  If you want a nice night out, check out Blue.  There was a soloist playing and it is a nice, intimate date spot.", "business_id": "eaqJQP6bp7rQJQt5KqfvxQ", "stars": 4, "date": "2012-12-18", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "z2XhWvTl7KiaDdhBBaDR_w", "review_id": "9pN-CiCEQoYnDfkoxuAMZA", "text": "Very nice restaurant. Came for the jazz and wasn't disappointed. Arrived late so we couldn't sit at the bar but nevertheless the music was very authentic. I recommend arriving on time for the show and you won't be disappointed. Also, order the sticky toffee!", "business_id": "eaqJQP6bp7rQJQt5KqfvxQ", "stars": 4, "date": "2015-12-07", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "eppXd18fTZSY5d7etGre4g", "review_id": "QiuTs5SaGFxaEHrA7_-Zfg", "text": "I gave one star because you can't give none!! The manager, Mary Figerarro was mean to me, she yelled at me and told me I was wrong because I wanted a sandwich that was cooked!! And continued to show her attitude problem about me having a different opinion about how done the roast should be cooked!!!!  I asked for a refund and she yelled at me again because I took my receipt!!!  She is a raging witch!!!", "business_id": "d4t1qlm-mjhBmDUdboq5Uw", "stars": 1, "date": "2013-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rjvF4Sz2QsvQRA6W6ZQ9ww", "review_id": "DeGHU2ec45v_wNI2HiP5bg", "text": "My husband is in law enforcement and has been wanting to try an area dry cleaners to have his uniforms washed and pressed. After doing some research on Yelp, I chose to take his uniforms to Kim's Cleaners. I am not saying that our experience was the typical experience, but would like people to know how this dry cleaners handles a range of situations. \nFirst of all, the customer service was great! We were impressed by the man behind the counter. However, my jaw almost hit the floor when we received  our bill. I had my husbands two long sleeve shirts, two short sleeve shirts, and two pairs of pants dry cleaned and pressed. Many area cleaners give discounts to law enforcement officers; I did not take away a star for Kim's not giving one, but it would be nice if they would consider this option, especially since many officers frequent the same dry cleaners (although likely not this one considering the prices). My husband also wanted the sleeves on the two short sleeved shirts taken in a 1/2 inch. Our total bill was almost $60. I think the actual dry cleaning was about $20-$25 and the alterations accounted for the rest. I did not feel that the dry cleaning was worth that much. I will definitely not be bringing anything else here. I would recommend others to check the price when you drop off your clothes.", "business_id": "TuUqEn9Q7LyuaT03LJ4ArQ", "stars": 2, "date": "2015-01-08", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "W6LTsXcY1R76M9EdeN0G6A", "review_id": "qrSZZ1LOwrZbH2wLREO1Kg", "text": "I finally popped my Melting Pot cherry this week. A good friend was out of town for all my birthday celebrations and brought me here as a make up date. (After this experience... I'm okay with Rich missing my birthday every year if it means he will take me here)\n\nFirst off.... the hostess gave me a birthday card when she took us to our table. It was signed by a bunch of the waitstaff. Plus, at the end of the night our server gave me a box of chocolate covered strawberries to take home. Happy birthday to me. Wow, that is some fantastic service all the way around.\n\nWhat do you need to know before a night at the Pot? It is a process. So allow yourself two-three hours for dinner. Come hungry. Really hungry. Maybe the hungriest you've ever been in your life. We went with the four course experience\n\nCheese: The special. Bourbon Bacon Cheddar. Holy.\n\nSalad: California. Gorgonzola cheese and raspberry vinaigrette make everything better.\n\nEntree: We went with Coq Au Vin... delicious. I want to try the Mojo next time. I did land and sea, but was mad that I didn't go with the classic. Luckily, Rich shared some of his with me. I love all the sauces they give you. I'm a sauce whore.\n\nDessert: I'm about to explode. I don't really think you can go wrong with any of the choices.. they all sound amazing. I picked flaming turtle... basically so we could also get a table-side fire show.\n\nDrinks: there were martini specials. The strawberry blonde was very refreshing. The salted caramel was absolutely delicious. I also got a boozy cappuccino to go with my dessert. It came complete with a rock sugar candy stick to use as a stirry thing.\n\nI could barely drive home because I was so full. I thought about sleeping in my car. It was all delicious. I think it would be great to go here and just skip out on the entree portion of the evening all together and just do cheese and dessert. That may be my plan next time.\n\nThank you Melting Pot for a tremendous dinner... birthday celebration round 5.", "business_id": "uDoTFFud2mXE3VT1Jt9L5A", "stars": 4, "date": "2014-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_V4_DUrA_H6Kg7_fwtMWCA", "review_id": "l9IrpCLhvuaummQLs7_fyQ", "text": "I am a big fan of Mama Ricotta's. The location does it ZERO justice (strip mall). But the interior is great and I actually love the outdoor seating - considering the Kings Dr. location.\n\nThey have really good pizza. Perfect for take out. I adore the angel hair pasta with added chicken. The rigatoni with meat sauce is also delicious. I normally choose one of those two. Though I have tried some others like the Pasta Fra Diavolo which was good.\n\nThe boyfriend loves the calzones. Which is totally random - but whatever, it lets me get to go to Mama's!\n\nI went once for Brunch and had the richest stuffed panini french toast ever. Ohhh was it good!! \n\nWorth a visit for sure!", "business_id": "MQnNtW1lHS-eid3QNUoUIw", "stars": 4, "date": "2010-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "3z_DQqnPm8uMyoYB57obHg", "review_id": "4GH-v9LJpLGqp0nFnqWhVQ", "text": "I don't say this lightly, and I'm surprised I'm saying this at all.\n\nThis is actually the best Italian food I had EVER (and that counts Italy as well). It was hearty, flavorful and the service was simply fantastic. It tasted like they made quite a few things on site too.\n\nThe menu was also manageable (unlike some Italian places). My favorite is how you can order items family style. Everything was delicious through and through from the appetizers (goat cheese is a plus) to the cannoli. \n\nThe drinks specials were also delicious (I came when Mama-citas were the special).", "business_id": "MQnNtW1lHS-eid3QNUoUIw", "stars": 5, "date": "2014-12-20", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "z9d-pTSx6qa8_FAIP8tgcQ", "review_id": "6tg_WlADTLLwvvwnv7vxgg", "text": "This place has pretty much everything.  They carry a lot more movies than Blockbuster and their prices seem to be better than blockbuster as well, which in my book renders Blockbuster obsolete, although truth be told I wrote them off long before I discovered this place.\n\nThe greatest asset that Visart has is its staff.  I don't know where these people find the time, but they have been able to answer every question that I have ever had regarding a movie.  They are very knowledgeable in addition to being very friendly and engaging.\n\nWhile I myself use Netflix, there are times when you have an urge to watch a movie and you are unwilling to wait for 2-3 days.  Visart definitely fills that role for me.", "business_id": "STcLx0y_X89TsC0m2gVgHw", "stars": 4, "date": "2009-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LdqbmcX9czDIcCznCCHL5A", "review_id": "rdg7ZQ7sQ4hfYY4NssF_Pg", "text": "I went in to store with no intention on purchasing anything. I already had my camera equipment and all I had was questions on how to use them. I just spent 1500 on new equipment and told the sales rep. He was very patient with me and walked me through the \"how to\" with everything. He spent almost an hour with me knowing I wasn't buying anything. He didn't even try to sell me something. I call this great service and even though they may be pricey, I will definitely be going back to purchase anything else I may need. Amazing service.", "business_id": "EQDq4hZ45hDEHaWn6yuZyg", "stars": 5, "date": "2015-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "EmpkDgejncKoP9N3HjGptw", "review_id": "nHQ2Lo4PQ063ArXE4nb3Zg", "text": "We have had our son here many time in the Orthopedic hospital for surgeries so my review is purely based on the experiences as a parents in with pediatrics.\n\nFirst the Orthopedic Hospital Surgical part. check ins are usually very quick. the patient holding area is fairly nice and each room does have a TV to keep you occupied while waiting. There is usually a steady entering of people coming to discuss your procedure and answer questions so write them down before you get here, because if you are like me it quickly escapes your memory when they ask if you have any questions. \n\nThe waiting room is very large and has regular size chairs as well as a few small benches. If you have other small children accompanying you then this bench is great for sleepy children. \n\nthe lounge area has 2 tables with chairs if you would want a table for eating or computer. also one table has a few electrical outlets for recharging your cell battery or computer laptop.  They have a free machine that can make different kinds of coffee, hot tea and even hot chocolate. There is also a TV in this area.\n\nThe bathrooms are very large but are single file type so gotta wait if in use.\n\nthe cafeteria downstairs is renovated and I am sorry that I cant tell you about the food there because it closes at 2pm! after lunch SO if your procedure is scheduled around lunch time then people who are allowed to eat should keep this in mind!\n\nALSO keep in mind parents that if you are being admitted to HEMBY you may want to move your car from the orthopedic hospital parking deck to the main hospital during the time your child is in surgery. I get lost trying to maze my way through the hospital so I have to walk around the outside. And if you are by yourself at the hospital then you will be walking with your child to their room.\n\nthe recovery room is typical, except that the pediatric \"cubbies\" are right next to the automatic door which is very loud when people come in and out.\n\nNOW onto the main hospital:\nWe have usually always been admitted to HEMBY, which has its own elevator near the parking garage entrance to the hospital, take note that the entrance to the cafeteria is also near here.\n\nHemby is a very nice place, there is a lot for your kids to do if able, playroom, birds to look at in there little glass houses. the rooms are typically adorned with a DVD player and movies are available to borrow. a fridge and microwave in some rooms too. which is great if you have a small one you cant leave.\n\nNow on this visit we were actually in the NEW Hemby overflow which is accessed by the B elevator located directly behind receptionist in main lobby. These rooms are large and have the sleeper sofa, but down fall is no fridge or microwave. but there is a TV of course with a vcr/dvd player. \n\nThe food service person will visit you on the next food serving time and get your order for the next meals. The menu they give you is the one you will be making choices from for you stay. There is a lot to choose from. and as a parent I enjoyed that I didn't have to leave my child to go hunt food.\n\nthe nurses have been awesome and respectful of listening to my instructions for how to care for my son. They are helpful to make sure his pain is under control and get whatever I need. \n\nFOOD Room served: not so bad! let me say that condiments help a great deal and this hospital uses mainly Kraft products (BBQ sauce, dressings, mayo) in the cafeteria you can get hot sauce, tartar sauce, creamers (flavored). of course salt and pepper.\nthe mac and cheese is surprisingly great! just a little salt and pepper! The salads are filling. the chicken fingers remind me of Arby's breading. The flank steak with baked potato was edible, a little dry on the meat but hey it was free. The baked herbed chicken breast was also a little dry but very good. Breakfast was the best I think, I had eggs, bacon, sausage and grits. \n\nCafeteria- salad bar is paid for by WEIGHT so keep that in mind. they now have sushi available, fruits, pastries and the hot section is per item unless you get the special. (like bacon is 49 cents a slice!). burgers are OK, i usually hit it with some of the seasoning salt used for the fries. which are great when first made. They have pizza, soups and sandwiches and this place opens late hours also. \n\nGift shop has a lot to offer, snacks, headache meds, stomach meds, chap-stick. perfume, flowers, nice gifts, books, magazines. and extremely helpful staff.\n\nATM is located on the first floor but the cafeteria and gift shop do take credit/debit cards so if your card is NOT signed be prepared to show ID, it is their policy! \n\nSo if you should be admitted to the children's sections of the hospital I hope you a speeding recovery and a pleasant experience like I have received many times.", "business_id": "Vmw4amlubvfDnIpkegvKKw", "stars": 4, "date": "2011-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S50_9SlqLePZN1_fT7wlUQ", "review_id": "U85Te7LxSlm6Daj-msq79w", "text": "This business knows nothing about customer service!  I ordered tiki masala and the owner wanted to charge me 15.95 however the price listed on the website was 2.00 cheaper.  When I brought it to his attention he did not handle it in a professional manner!  Copper is waaaaay better anyway!", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 1, "date": "2015-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "dH1ADqrLKyO9GDhbPRMt5w", "review_id": "4ijEgWcWyEMMll_6GCi1Jw", "text": "I have parked in Cuisine Malaya's lot multiple time when going to shows at the double door and always wondered how the food there was. Then an acquaintance suggested I try it.... so on Valentine's Day craving some sushi but not feeling like dealing with the masses of sweet heart dinners,  Cuisine Malaya fit the bill!\n\nWe called ahead for a table but realized that was an unnecessary step once we arrived.  Our waitress was friendly and attentive.  My partner in crime and I shared some edamame which came out within minutes or ordering and the vegetable lettuce wraps which were surprisingly sweet.  We each enjoyed some very hot miso soup that hit the spot and then a few rolls of sushi. My mate got a spicy tuna roll. Being vegan I got a vegetable roll and a cucumber and avocado roll, which were delicious, even my meat eating partner agreed that the vegetable roll was the best.\n\nAll in all it was a hit!  This will now be a go to for me when I am craving a sushi fix.  I even grabbed a menu on my way out and may even out take out for dinner tonight!", "business_id": "MMNBgMQCdwyVoNaHg0h_QA", "stars": 4, "date": "2012-02-15", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "87p0zEo9ndNvWWyViRoKew", "review_id": "Ydk0oL30zUcUpwJYRVx8hw", "text": "This place is ok. The people who work there are amazing though. They love what they do and they enjoy helping you. They have a great comic book selection however, I wish they carried more toys. \n\nSadly, this placed is owned by a guy who only cares about profit and not customer service. Kind of a jerk.", "business_id": "L1OqlH9UzjBK0js4sKs9cQ", "stars": 2, "date": "2008-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "iB6eqn6eb0ygpg4EIaJJIQ", "review_id": "PGKBnVgCKWM03mUuLqPJZg", "text": "My wife and I went to Red Sea based on excellent Yelp reviews.  It was the most interesting eating experience of our life.  You get no eating utensils.  You eat with your hands and Ethiopian bread.  We had the vegetarian dish and the lamb dish.  Both were incredibly tasty.  The owner came to our table several times to make sure we were doing okay.  He explained some Ethiopian stuff regarding the food.  He even brought out some spices for us to sample.  Try this restaurant if you are looking for a food adventure.", "business_id": "oYo5e7TUAYGRdx_0rjohww", "stars": 5, "date": "2012-01-23", "type": "review"}
