{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hFhHmfwRPkN81NJZkrnRjQ", "review_id": "rsim8cs4YGDQttRXn0F8JA", "text": "Sushi Kim is one of those Korean restaurants you'll find in most N. American cities that don't have a really big Korean population. They tend to diversify into sushi as well as Korean food, which is probably a good move considering the American palate and their general unawareness of Korean cuisine outside of the major Korean enclaves. It's pretty obvious by their name, they aren't trying to hide the fact they are Korean.\n\nI've been there for both Korean BBQ on the second floor and Korean food on the main floor.  I wouldn't trek all the way from CMU to have sushi there since sushi can be more easily had, but definitely for the Korean food. Some would disagree, but I have friends from Seoul who even think Sushi Kim has the best Korean food in Pittsburgh.(Granted we are speaking for Pittsburgh) It is pricier than Korea Garden, but the atmosphere is slightly more \"upscale.\"\n\nThey also have at least 3 brands of soju(Charm, Cheoeum cheo reom, and  Jinro Chamisul), which for Pittsburgh is quite exceptional even though I would only drink the Chamisul. They also have Korean noraebang, which you have to reserve in advance. However they only have Korean songs, so if you can't read Korean you're out of luck. They charge $30/hour. I'm not sure there is any other Korean noraebang in the city. I didn't try it, so I can't say what kind of selection they have for songs.\n\nThe BBQ is a great deal and though not the best I've ever had. It may be the only Korean BBQ grill place in the city. The staff is quite attentive and is pretty good about replacing the grills. I would prefer a different sahm-jang and more variety in the non-BBQ items in the buffet. The BBQ is great for groups and seats 4 people for each grill.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 4, "date": "2008-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gmnlHY-adKIHZsq051A3iA", "review_id": "N003I74Co7L_5Dw-PoFppA", "text": "I am sorry to say that this place still STINKS.  I work in the strip and often get temped by Sushi Kim.  I stopped in for lunch today and I was the only person in the whole place.  That should have tipped me off.  The last time i was there i had a bad meal, but i wanted to give them another shot.  \n\nI ordered the spicy chicken off of the lunch menu.  I believe is was L1......Numbered menu items.....Another tip.   My food was terrible.  The miso soup was horrid and old, the sides were awful and everything seemed to be microwaved.  AVOID THIS PLACE AT ALL COSTS!!!", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 1, "date": "2013-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3ovDwBtgSpcU3U-SzkJnWw", "review_id": "ZeNzx9cd_aIUt0XdHvdKpg", "text": "Ohhh, how I miss this place! Moved almost 4 years ago and go back to visit every year and make a special stop! The Dawgee Bolgoki and the Kalbee always call us home. When we first starting coming the owners would hand us pictures to see what we wanted. Then the \"English\" menu came out and we learned what it is was that we were ordering. I love Hadori's. The kids always called it the \"Kitty Kat place\" due to the tigers painted on the windows. If you like Korean or want to try you must stop here!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2011-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FUMdzARf71drXyDZ7lkpWw", "review_id": "xWbYVULNLF6Cb8b7141ylw", "text": "It always seems to be lacking in the protein department. Not enough meat. The service was super rushed this time despite my $30 bill for s single diner. The food ultimately is awesome. Service, and perhaps presentation of the protein would be beneficial.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2014-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S7v9YL4AvVV_E0xHBBk_3A", "review_id": "RmMZFbuBaU-nehoek8ORrg", "text": "Healthier twist to authentic Asian food, and very delicious (and extremely great value). I will definitely be going here more often. \n\nThey newly renovated, and it looks great. I'm excited to see what they do with the exterior to draw in more traffic. \n\nA must try!", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 5, "date": "2014-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-Z7JOAgE-Gz1MoHXMw9ITQ", "review_id": "JPmkmu0i934Uv3BmOFycKg", "text": "You got to go here for all you can eat shortribs,pork belly, tripe, marinated tri tip, rib eye.an your traditional korean sides an all the rice you can eat the speacials run from 11pm to 3am bout 14 dollers per person this place reminds me of a moms an pops joint, the staff is very friendly.\n The enjoyment for me is that its very exiting cooking your own meal so guys bring your grilling skills, remember its a electric grill so the heat is constant. This is one of the places i always go back to when i visit vegas...", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7x3-B0yaO_hqXm42VKStzw", "review_id": "qZydmQ-np6cFUEw4qbXElg", "text": "MMMM, I forgot how good and cheap it was here.\nNeeded a kbbq fix and this def fulfilled that need at 2am. \nThe fact that I only had 20 bucks in my pocket helped choose the kbbq place, as well.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "7_XwjOebd1temr3CaqGwpg", "review_id": "K-HlOm_DmmAIq5eySgcVwQ", "text": "Iove eating here, it's definitely worth $14 after 10pm! \n\nAMBIANCE: 4 - small, limited seating in grill area! restaurant area usually always open! it's always clean and they revamped their waiting area with wooden benches! usually always busy with people! \n\nSERVICE: 4 - usually fast towards the beginning and slow towards the end! lol but don't you just hate it when they turn up your heat so you leave faster?! hahaha\n\nFOOD: 4 - hot dam, meat is so good! Try the brisket salted with the oil mixture they give you (not even sure if I'm using anything right but it's delicious!!) their side dishes are so good! it's just worth every penny! it makes me wonder why fast food exists when you could just spend $14 eating here!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-12-29", "type": "review"}
{"votes": {"funny": 9, "useful": 15, "cool": 9}, "user_id": "Vlon2bJdT43_1oHSrQsHTQ", "review_id": "4Y_DAtN8Kt7o1LZKY4WlhA", "text": "Since my last review, I've been here a couple times. I'm going to knock them down a star. This is mainly due to the quality of the food.\n\nMany people like to come here because the all you can eat barbecue is the cheapest in town. It's 15.99 and it includes short rib and steamed egg. But recently, the food quality has gone down drastically.\n\nFirst, let's talk about the kalbi, or marinated short ribs. The beef was average quality. And, it was way too soft. It lacked any sort of chew, which means it was marinated too long. \n\nThe spicy pork bbq was really disappointing as well. It had been overly marinated as well and we had been cooking it for a while, but it seemed like it was never done.\n\nThe ribeye was acceptable, and so were the pork belly slices, but really, is it that hard to mess it up? All your doing is slicing. What seems to be the issue is the marinades here.\n\nThe banchan is very disappointing here. The only highlight is the stir fried fish cakes, but it was average. The pancake and japchae are so bland here. The kimchi does not taste good. The only highlight was the salad.. just what I wanted to eat at an AYCE bbq (sarcasm).\n\nThe bean paste soup is so bland and flavorless, and the once good steamed egg tasted like an overly salted, watery mess.\n\nThe food, I'll give it 2 stars, but the price, I'll give it 4. The service here is good and fast. I would go here if my friends wanted to go, but on my own accord, I probably wouldn't be taking any out of towners here, no matter what the price was.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2014-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cqPsIQ4k-KIjD4ZXAcqfZA", "review_id": "qDJui8sqQfByHN1sQR8Urw", "text": "I've been going here for over 10 years. Tofu Hut feels like home to me and my family! All you can eat is cheap and delicious. I reccomend getting the pork belly, brisket and dipping it in to the oil salt and pepper sauce they give you. At night it gets crowded but just write your name down and you should be seated in a few, it's seriously worth the wait though!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-12-08", "type": "review"}
