{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "LWbYpcangjBMm4KPxZGOKg", "review_id": "6w6gMZ3iBLGcUM4RBIuifQ", "text": "This place was DELICIOUS!!  My parents saw a recommendation to visit this place from Rick Sebak's \"25 Things I Like About Pittsburgh\" and he's usually pretty accurate.  His recommendations were to try the Reuben, Fish Sandwich and Open-Faced Steak Sandwich.  We went early afternoon for a late lunch today (a Saturday) and were seated right away.  The staff is extremely friendly.  My Mom & I each had the fish sandwich, while my Dad & Brother had a Reuben sandwich.  The fish was very good, but the Reuben was to die for!  Both dishes were massive, and could very easily be shared between two people.  On top of being extremely large portions, it was incredibly affordable.  The giant fish sandwich was $8 and the giant Reuben was $7.50.  Our drinks were always filled and we were checked on several times during the meal.  We will definitely be back!!!  Oh and a bit of advice ahead of time - they take CASH ONLY.  So come prepared, but I'm pretty sure I saw an ATM there as well.  And I do believe they are closed on Sundays & Mondays.", "business_id": "mVHrayjG3uZ_RLHkLj-AMg", "stars": 5, "date": "2012-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NBlxu925qd8II-SwilrI9g", "review_id": "gH9H5iPoFezxmR5B43kFJQ", "text": "Went for my 25th birthday and had a blast! Servers are great, the show was hilarious and had the whole crowd involved. Only bad thing is it can get very expensive!", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww", "stars": 5, "date": "2014-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FAtk38wdEbNgM6rSmP-zew", "review_id": "oHf5jPx25UTX9UK9v_pQKw", "text": "Awful awful. Spent 150.00SERVICE WAS TERRIBLE. Took 27 minutes to even be acknowledged. Really. The only saving grace was the kids had fun and the hostess took AMAZING care of us......", "business_id": "sbW8qHJgzEIH42B0S-3New", "stars": 1, "date": "2015-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vJxXGprSf3ZQkvOfmldPFw", "review_id": "yKVQrSWLdWQB6mEb9OA0og", "text": "I've eaten just once, mostly I go for drinks. Nice, lively place, nice outdoor seating for the summer and fall.\nDrinks are good, service is good.\nLocation is great as well, right across the movie theater.", "business_id": "EoAY1JSVeJriBzId8lUQwQ", "stars": 4, "date": "2012-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bEyGMTOF8gcAwjNz_qXv-w", "review_id": "MO7j4RZkRXvOQLlzDJ3ToQ", "text": "Wednesday is Wing night, i.e., eat your face off night. For ~ $9 you can eat unlimited wings (with your choice of various sauces) for several hours. If you can, top it off with a brownie - they're quite good.\n\nI've mostly had the wings at Blues & I like all of the sauces, but the burgers are good, as well. Whatever you do, make sure to get the sweet potato fries & tip your waitress! (Especially if her name is Meg).", "business_id": "Ts4xsKPU7FNPPZRj-nRjIg", "stars": 3, "date": "2010-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ybmr49qtfGZtco2RE6LJiQ", "review_id": "Jhr7L-cYYUFecc1GLyX3ZQ", "text": "Enjoyed the winter solstice concert Saturday night. Fun scene, cover benefited charity, drinks were decent (nothing spectacular), but the grilled cheeses moved this review from a three to four star rating. Fun night, cool spot. Will go back!", "business_id": "ZDKi3qsO8lSSogrIdbLJKg", "stars": 4, "date": "2012-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "xSyjJmHMYyoutsNznUWTqw", "review_id": "fyPW7VWwVf3-MNzD7gWibQ", "text": "Passed this restaurant for years on my way to Buffalo Blues or more recently Mad Mex but have never actually eaten here.  Having finally come for lunch, I overall enjoyed it but it had some ups and some downs.  \n\nI ordered the Piccola Gusto Menu which for me included the Cream of Cauliflower soup, the Orecchiette Pasta and the Roasted Turkey Sandwich.  It sounds like a lot of food but the pasta serving is mini and it's a half sandwich.  For me, the size was just right.  The soup was awesome, and I could have eaten an entire lunch of just it.  The pasta was a little too creamy for me and just didn't have enough seasoning or spice.  I did love the addition of the cranberries in it though.  The perfect amount of sweet to offset the cream.  The roast turkey sandwich was just that.  Not out of this world, but not bad.  My biggest complaint was the service.  It took a really long time to get our meals which is always a bad thing during a weekday lunch.  \n\nI'd like to go back here for a happy hour when it's warm so I can enjoy the covered patio though and a nice glass of wine!", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 3, "date": "2011-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5otX11v4iOPPpHw1Rj4q0A", "review_id": "XZ2DLyalUqJoc1uFmEj26A", "text": "- Great food. I had the Gerber's Amish Farm Chicken Breast and it was cooked perfectly and delicious =]\n- Nice wine selection. Though I'm a beer guy.\n- Friendly staff.\n- Okay atmosphere.\n\nThis place is definitely worth trying. Will be back for seconds!", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 4, "date": "2013-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NZKATMk1tIv3HflQ5dNucw", "review_id": "02qAsG18oa3dQHOUicbPsQ", "text": "My girlfriend and I went to Casbah for the first time recently and we both enjoyed our experience.\n\nThe atmosphere is dressy, but the restaurant isn't so formal that it feels stuffy or uncomfortable, which is a welcome change compared to most classy restaurants.  The environment was relaxed, and it was easy to have a quiet conversation throughout the meal.  As for the meal itself, we had a reservation and were promptly seated when we showed up.\n\nOur waiter was courteous and provided good, fast service without being overbearing or constantly hovering, which was quite nice.  For an appetizer, we ordered the cheese tray which was tasty as well as fun and unique.\n\nFollowing the cheese tray, I dined on the cioppino while my girlfriend had the casereccia.  Both dishes were tasty and our seafood was skillfully cooked, particularly the sea bass in my dish which was delicious.\n\nI'd recommend this restaurant for anyone looking to celebrate an occasion or have some good, out of the ordinary food.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 4, "date": "2014-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "IB4Oxk8IlNG2K0oH0I9Dkg", "review_id": "DPpJJTj4aior10Zu7QOAFA", "text": "It's hard to judge and review based on takeout alone, especially at a place with such an atmosphere like Casbah, but here it's goes...\n\nMy boss decided to treat us all for lunch so I looked for something that appealed to me. I must admit that the menu scared me at first. It's definitely more of an upscale kind of place, but not quite a \"suit & tie\" affair. I settled on the bacon and turkey club. Seemed safe. \n\nI didn't think it was anything amazing. Yes, I said it. I've been looking forward to eating here, too! The sandwich was just sort of... plain. The sauces were bland and did nothing for me. It all just seemed very dry. Aside from the tasty bread and bacon, I wasn't too impressed. For a cheaper price, I could have ordered a club sandwich from a mom and pop's greasy spoon and been more satisfied. \n\nI also ordered a salad which consisted of lettuce and beets. Dressing was okay, but a little tangy. \n\nAll in all, I'd like to return and actually enjoy a meal in the restaurant. Atmosphere does a lot for a place so a trip back is definitely in order. Also, I'd like to actually study the menu and ask some questions to make sure I can order something good. At work I was a little rushed to make a decision.\n\nSide note - the takeout packaging is awesome. High quality microwaveable/reusable plasticware!", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 3, "date": "2015-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jfvv8uvdSJYa5NWEAloxpQ", "review_id": "gU32hGldUp6Tt8JnV9OaFQ", "text": "German food and German beer served in a mason jar. Best in Pittsburgh. The history of the tavern and the friendly makes this wish me that I lived closer to Max's.", "business_id": "IxQ1ATP_Wg_QujO9nywzcQ", "stars": 5, "date": "2012-12-14", "type": "review"}
{"votes": {"funny": 3, "useful": 0, "cool": 1}, "user_id": "D1G8W0SgCbsKTv7cAqKcNg", "review_id": "Ax-Wr6ltnJvKccNV1NF0hg", "text": "Hmmm...what to say about Key West.  I wouldn't exactly call it \"warm\" - get it - hahaha.  \n\nA friend and I checked this place out on a Friday night.  You know that point in the night when you think to yourself, \"I could go home right now and call it a night or I could do this right and see where the night leads me\".  Well we decided on the latter and it led us to Key West.\n\nIt is a total dive of a bar.  It's fairly small inside and no one seemed to pay us any attention.  Key West seems like the type of bar where you get regulars and so if you've never been there before, you're probably going to stick out.  \n\nBut no one really bothered us and we just hung out for a bit.  There seemed to be a potential fight breaking out behind us and like I said it's not that big so it caused a bit of a scene in the bar.  It quickly died down and started back up and then tapered back down - fyi this seems like a normal occurrence as my friend and I were the only ones that were alarmed.    \n\nAnother thing to keep in mind beside the potential fights is that its cash only.", "business_id": "L6yf7W3uvCHdLrmLmPLJ8Q", "stars": 3, "date": "2012-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HXhYt_M1nDOfFse0_QlLww", "review_id": "Z0adIVcTBF8XxoXVEWJ_Hg", "text": "Large bar food menu and great selection of draft beers. Patio open in the summer and decent size restaurant. Large portions on food. Great Sicilian and speciality pizzas.", "business_id": "qemCNgjeYGcFsRwxW9x4xw", "stars": 5, "date": "2014-01-01", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "MzyUCQD3CtIQ0ifkYKl8iQ", "review_id": "cgZfGiEHScTCqz63zYZxhA", "text": "I'm not from PA, I'm from VA.  In VA I worked at a wine and beer bar, where we served and I tasted some of the best beers in the world.  And in VA we don't have absurd old beer and wine control laws, meaning our access to reasonably priced, intelligently stocked beer is much higher than pittsburgh.  That said, the best selection of beer I've found in this city has been at D's.  You will find a number of american craft brews, trappist ales, etc.  The only problem is the price...  which is solvable.  D's has a great system, if you buy a bottle of beer to take out of the restaurant they take 1 dollar off the bottle.  This dollar off doesn't matter when you consider how small a normal bottle is, but when you look at the larger bottles it does.  The prices for their larger bottles with the dollar off are not much higher than you would pay in a specialty beer shop in a less regulated state.  The only problem is that you have to commit to drinking three or four beers instead of one - I'm not really seeing the issue with that, but I'm sure someone will.  \n\nAlso, I've never eaten here, because hot dogs are generally not good.  Furthermore, I'm not sure why anyone would go to a hot-dog joint and expect good service.  So ignore anyone talking about hot-dogs and come here for the beer. Finally, parking sucks there's a lot of very busy restaurants and businesses on the same street, so expect to walk a little.", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 5, "date": "2011-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aunYpnhE0nAHnFcHOsH56Q", "review_id": "mGr6Su24UUrlPei35Z23Pw", "text": "Awful service; took us 2 and a half hours to get our food and the waiter forgot several items (then added a few beers we didn't order on to our tab; I'm assuming because he thought we were too drunk to notice.) Then we find out that after we had nicely split the tab for them (even adding in an extra $10 on top of the grat because we were too lazy to re-do the math) that they wouldn't split the check? In the time we argued about it, you could have run the 3 credit cards we had and been done with it.\n\nHad to argue with the manager (who was completely unhelpful, with one of the waiters standing behind her and being rude to me for backup) for 10 minutes and they didn't give us an inch. I would have stiffed the waiter for the awful service if I could have; but we got gratted so I didn't even have that option.\n\nIf you want to come here with more than 3 people, avoid D's. Their beer is severely overpriced ($10 for a beer I can get at Sharp Edge for $6? no thanks!) and the food is the same fried garbage covered in cheese you can get at any other bar in Pittsburgh.\n\nIn other words, don't come here. I used to like this place, but tonight was such a bad experience I'll just go to one of the other places in Pittsburgh that serves hot dogs, french fries and beer. There are plenty of them, I won't miss D's at all.", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 1, "date": "2012-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "0P58MD0FRVI6pTVKUpd7YA", "review_id": "ONT7zaC4nPy7O3EmV8WCeA", "text": "The beer cave is amazing, and you get $1 off each bottle if you take out... Which means that some of them end up being cheaper than if you bought a case! WOW. \n\nThe food is really good. I have been here several times, and each time, I told the server to bring me something vegetarian. I have never been disappointed!! From hotdogs, to seitan, to nachos everything here tastes great and there are tons of options. \n\nThe last time I was there we were having fun upstairs playing darts and racking up a tab. The bartender was nice enough to actually stop us and point out that it had started to snow, and we should probably leave before the roads got bad... I thought that was super sweet and nice of him!!", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 5, "date": "2014-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Or7fUkuJtQCwt4MRWF7pQg", "review_id": "dRaV02599fUTun6PLeKkXA", "text": "For what it is, this place does the job. Cheap, powerful drinks without any distractions such as...dinner. There is a list of available wines posted outside the front door, but why on earth would you come here for wine? It's a beers-and-booze place all the way. \n\nAt 8pm on a Friday night, the front room was perhaps a quarter full. The bartender was friendly and the service was snappy, but I can't picture this being a regular destination. The air is thick with cigarette smoke, and the decor grim and dingy, with more light coming from the TV than from the overheads. I guess what I'm saying is, it's exactly what I picture an OTB from the early 80s to have been like.\n\nVerdict: if you want a quick drink (and I mean \"drink,\" not \"cocktail\"), it's a bargain. Recommended for time travelers, day boozers, and folks who hate HVAC.", "business_id": "7lDNKKxMV84KIS1OVZOepw", "stars": 3, "date": "2013-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tPQlzUv4x9nRWGhDU1-jdQ", "review_id": "Ji9OryJen_48Sl-AIdZIKQ", "text": "I really like Olive Garden but the reason why I am giving this place (green tree next to Starbucks) is that the service is not consistent over time. One time the waitress was so rude that she was throwing the food on us and hubby got his coke with no ice. I understand that it can bee too busy at times but I have been to other Olive Gardens which they are equally busy if not busier! The food here is good but I would really recommend Olive Garden in Robinson instead.", "business_id": "zpNGtjBlIkDq_PLGSCPlAg", "stars": 3, "date": "2015-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1h5T9mNgReCiykYCxvI55A", "review_id": "9erIqwPud9MA5guUX6RiQA", "text": "I'm reviewing Olive Or Twist strictly as a weekday lunch person.  I haven't had drinks there, or been there during an evening or weekend rush.\n\nI absolutely love this place.  Its seating area is small - maybe seven or eight tables?  The lunch menu is delicious.  I get the grilled cheese and tomato soup every time, and it's perfect.  The friend I go with gets the French Dip and sings its praises all day long.\n\nThe prices are a bit on the high side - over $10 for lunch - but frankly, the food is so good I'm glad to pay the extra couple of dollars.  \n\nThe bartender is always the same guy when I go, and if he's the only one up front who has to seat me I get a distinctly unhappy vibe off him.  Killing him with kindness does not work.  Other than him, the staff seems great, and I'm happy to give them my business.", "business_id": "OxIeMVcop5oxBUWANi-1Rw", "stars": 4, "date": "2013-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mS6HCG87Jv0moeHhswhalg", "review_id": "jiWVwMkgCRz4GXVxPWZMJQ", "text": "I selected Olive or Twist for my sister's birthday dinner, mainly because the name drew me in. I made a reservation and was told there were only two timeslots available. Fortunately, one of them was fairly close to the time I was hoping for, so I went ahead and booked it. The only reason I mention this is that when we arrived, there were only two other tables in use and no one else came in the entire time we were there, which seemed a bit odd.\n\nHowever, that small bit aside, the meal and experience were excellent. We both ordered the penne with vodka cream sauce, and it was absolutely delicious, as were the appetizer and drinks. I will say that they certainly do not skimp on their martinis! I generally feel that martinis tend to be on the weak side, but I actually found this one to be too strong for my taste -- fortunately, the waitress kindly offered to have the bartender lighten it up for me. On that note, they have many creative and traditional drink choices, so you can feel confident that there will be something everyone will enjoy. \n\nThe service was exceptional -- our waitress did a wonderful job and we particularly enjoyed the quiet atmosphere. We did go on a Monday night when I'm sure it was much slower than usual, but still, it seemed much quieter than your typical bar scene. It can get pricey, but it's worth it for a special occasion. All in all, a great place to go for dinner and/or drinks in an intimate setting.", "business_id": "OxIeMVcop5oxBUWANi-1Rw", "stars": 4, "date": "2015-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tIm0aNnmnQad7GrjbotHXg", "review_id": "BGlSbxWL9PKgAsccZo3Nog", "text": "Yes, the fish was good. However, the restaurant was dirty, the bathroom smelled so awful that I could not go in it. The waitress was RUDE, CRUDE, and downright  OBNOXIOUS!!!!  Was the fish good enough for me to ever go back - NEVER!!!!!!!!", "business_id": "FD6OocZdFUfE2J5H0WN4fA", "stars": 1, "date": "2014-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vCbB1R32o2VvLLzTyvbF_Q", "review_id": "06WzlyYbFs4Bq3uAa6yk9Q", "text": "Wow! If I could give negative stars I certainly would for this place. I wanted it to be decent because they have an ok draught selection and seating outside in the summer. That is where the positive qualities end. Food tasted like it came from a microwave - but that is actually generous, probably actually came from Fido's dog bowl. This is an excellent candidate for kitchen nightmares, the place looks straight out of the 80's and not in a cool hipster way either.", "business_id": "-Nanlb7SYXObqQ6dZ49UOg", "stars": 1, "date": "2011-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e1W6pOaJbovM-jEosgwOCw", "review_id": "0U4Ly-49Ln_MRymrmH4riQ", "text": "I feel like Lot 17 doesn't advertise their tasty selection of food enough! You walk thinking you're going to find typical bar food but that is not that case at all. \n\nEverything is very fresh tasting and you can tell a lot of it is homemade! The reason they are only getting 3 stars is each time I've been there the service was so-so. Somewhat understaffed for lunchtime. :( \n\nAlso a word to the wise, their crab cake sandwich is outstanding, but deep fried! :)", "business_id": "7XXmky6YYjsvKFwho_eavg", "stars": 3, "date": "2012-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HXhYt_M1nDOfFse0_QlLww", "review_id": "LK6jcTqpWJvwFOGfBskx3g", "text": "Good beer selection and great additional space when the deck is open. Typical dive and bar food. Crowded on Friday/Saturday nights.", "business_id": "jJfTh2O3M2Q716akd9Dr9w", "stars": 3, "date": "2014-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uPOda7vdHgjMWiH4tNBiGA", "review_id": "4i34R5LUEURyeMSjZ-UFvw", "text": "Two words: Bacon. Night. \n\nYes! Do not adjust your screen, you read right. They have a bacon night here. \nContain yourself! It happens on Tuesdays!\n\nI started coming here when I lived in the area a few years back, and it still has it's charm. I try to make it out for Bacon Night whenever I am in town. The other food is good too, so don't overlook it. \n\nAs for drinks, well, I became knowns as a mojito abuser overnight because of this place, and I don't care who knows it.", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 5, "date": "2012-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "MSuyK2p8G9hEqyWf5IgnYQ", "review_id": "SJVD-UaQgp4lc5KCQFChoA", "text": "Harris grill is the best. Tonight was probably the 5th time that I have been here but this is my first yelp review! \n\nIt's an adorable set up. There's an outdoor patio when the weather is nice and the building is two floors. It's dark and cozy with art on the walls. \n\nService is always spectacular. The servers are helpful, friendly and take great care of their customers.\n\nTheir hummus is AMAZING!!! It's super tasty and it's my favorite hummus from any restaurant. Their platter comes with tons of veggies and pita bread. The Britney Spears chicken tenders are awesome- their sauces are unique and packed with flavor. Why did I call them Britney Spears chicken tenders you ask? Because their menu is awesome and witty and hilarious- their items have really goofy names with long descriptions that make you laugh. \n\nToday I ordered their grilled weasel which is a veggie sandwich. I've had it in the past and it's perfect every time. Ciabatta bread, portabella mushroom cap, grilled zucchini,  red peppers, melty cheese... So good! Their eggplant parm is awesome too! Sooo yummy! \n\nHarris grill is consistently good. Is it the most amazing meal you have ever had? Well no, I mean maybe .. .. But overall it's always good. They always have living socials and groupons too!", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 5, "date": "2014-12-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "R4mbfT5hC3ZQZDWSZzNKgA", "review_id": "YPmehPAQB2z9MR0N4WFZ3g", "text": "Those stars are for the wings! If your not ordering wings don't come. I haven't tried everything on the menu buttttttt the nachos are skimpy and salty and those Mac and cheese bites are nothing but Kraft boxed Mac and cheese, no thank you. Oh and extra ranch is 75 cent and comes in a little cup smh... But wings are delicious and great price...", "business_id": "vSZDiKiF8vf9zt_BcDL7GQ", "stars": 4, "date": "2014-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zr1Q5sgULX5bjHTUSC2MXg", "review_id": "FeKbfk_k716XHFi70Icg4w", "text": "the pizza may be lame, but it's cheap. at least on mondays and tuesdays, when it's half price. this is one of those places that fits a very specific need. it's not a cool restaurant. it's not a cool bar. i probably wouldn't go there if i didn't live 2 blocks away, but it's got medium pizzas for $4.00 and some nights i go ghetto and get the miller light on special, (hope my friends in SF don't read this) so my bf and i are outta there -- full and tipsy for $14 - total. docs deserves credit for that.", "business_id": "Oq5MyNxNi-xuXdPOWR9O_g", "stars": 3, "date": "2007-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EoMXzKxsZjGTvFvp63x5DQ", "review_id": "5Ql0lqMuGv1S4sPfPV51oA", "text": "As a non-smoker, it takes me a while to get used to the stink. As a karaoke lover, oh yea, it's the best place in the city! I would just come for great karaoke (my husband DJs every Thursday!) and a nice atmosphere.", "business_id": "9VtaTbTKVK9sQVy4j2RO-w", "stars": 4, "date": "2013-12-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rkNZl74XHEW9U1AK7brYVw", "review_id": "OZ6_abPaZN5tzgWDixkk6w", "text": "Al Mike's gets 5 stars because the atmosphere and ambiance are so uncommonly wonderful. From the beautiful wooden ceiling to the lovingly salvaged bar, to the incredibly awesome beer fridge, everything inside says \"Welcome. Stay awhile.\"\n\nsecond Ace: a lovingly selected beer list. Small, but thoughtful, this one had a few surprises even for me! There's big names like Duvel and Sierra Nevada, local beers from Asheville, Mooresville, and Charlotte, and even a few Germans you might not expect - Neumarkt and Moos are usually not beer producing cities you see in the US. Well, not Chicago anyway.\n\nthird ace: the food. Since the restaurant industry is label-obsessed, I'll make one up: upgraded comfort pub grub. Could a few of the ingredients benefit from the upgrade? Sure. But this is not a \"blow your mind with something new\" kind of place. It is a \"let you know that everything is right with the world by doing the simple things well\" kind of place. For example: The meatloaf is tender and meaty. The Reuben -- a sandwich invented at the Blackstone Hotel in Omaha, NE, yeah, that's right NYC, take your 'We invented everything' God complex and stuff it! -- is solid with rye bread that leaves seeds in your teeth, an unabashed amount of salty sauerkraut, and just enough 1000 Island to moisten the affair.\n\nFourth ace: Did I mention the beer fridge? It's just awesome.\n\nNow, I may not be a big city poker ace, but I do believe four aces is a mighty tough hand to beat.\n\nCheckmate!", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 5, "date": "2010-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "VvTUjtIpJSmKTkYEtcr2Vg", "review_id": "4sloyD4FotksDJkQICJLXg", "text": "One of my favorite places in Charlotte. Super cozy inside, food is something like mom would make. Great selection of local beers. \n\nFried pickles from here are a must! \n\nService is alway friendly, go there a few times and they will know you by name. \n\nIf you haven't tried it yet, this Charlotte landmark is a must!", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 5, "date": "2013-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KUt_cB1sfF6bX3cfVVJwcg", "review_id": "ayr1dL1FT5vor9M05wt6fA", "text": "Being a native of Charlotte... this is one of my all time favorite place to have lunch or dinner. great place and better staff. This is a true gem for Charlotte!", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 5, "date": "2015-12-16", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "wiCVP2O_qnmQ8aNtS9vPRQ", "review_id": "g5mm8zpt8zAGJiOf1Qk8OA", "text": "Yes, you have to pay a five dollar cover.  Yes, that's super lame. \n\nThe band was awesome and the bartenders were amiable and generous.  It was crowded, but I didn't have any problem getting service from the bar.\n\nThe smokiness definitely didn't bother me because I'm used to Mississippi bars which are much worse.  It seems like this is where the younger crowd hangs out.  I certainly enjoyed myself.  Ri Ra Rocks.  \n\nApparently it's cool to wear a Christmas sweater too.  Do it.", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 4, "date": "2008-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vIcNz_5uhKUOYVGOh0346w", "review_id": "sGn23Q3bBgNFJpi-k2MudA", "text": "I went with friends to a show at Belk Theatre and we wanted to eat somewhere close. We just happened in to Ri Ra not really knowing anything about it. I can't remember having a better meal! The service was excellent and the ambiance is more than you could ask for in a pub. We felt like we were dining alone in our booth as we couldn't even see other patrons. I would definitely eat here again and again!", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 5, "date": "2013-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uRME8ABZns2NpUFy0LU5Jg", "review_id": "eBrbEHjhJhiANoel3lEOFw", "text": "I'd have to say it was no where near an awesome experience. We tried to order a pitcher of the IPA and the waitress stops us and is like do you like IPAS? do you know what your ordering? i was like yes i like IPAS im capable of ordering a beer like a grown up. maybe next time be like hey our ipa is exceptionally hoppy compared to other ipas, is that alright for you? After finally ordering a pitcher of beer (there were six of us, so four of us had one beer) the waitress tells us that it is such a high gravity, she says 9% that if any of us have more than three she'll have to start figuring out who the DD is and maybe cut people off. Not only was it an uncomfortable comment, but we looked back at the menu and the beer was only 5.7%. Needless to say none of us wanted to order another round of drinks. Then when the waitress brought out our chili, she told us that the green onions looked nasty and she didn't feel comfortable serving them. I was kind of grossed out by that point. Couldn't you have just lied to me and told me you were out? I don't wanna hear about nasty things in the kitchen, it made me really not want to eat. Luckily the food was good, however the service was reason enough not to return.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 2, "date": "2010-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ofyzGmH2ZRI9pw9A4-igQA", "review_id": "v9mXc32lgzC-_M80RvWNwQ", "text": "We were ivisiting from out of town and went here on a Friday night.  We had good service and great food.  We both had the chicken/sausage gumbo and it had just a little kick to warm us up on a chilly night.  Also went for the beer battered fish and chips which was also great.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 5, "date": "2013-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wZg4fDjMdEReUYcnn9y7JQ", "review_id": "8ddw278NEwRVauZhM23gkA", "text": "This rock bottom doesn't disappoint. They really need to consider a nicer hostess but the service is usually great from the different servers I've had over the years.\n\nI love the chicken mac n cheese and beer choice with it. I even tried replicating it at home. Good place for food uptown.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 4, "date": "2015-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Lx8HsuKahjELb-UZHGagZA", "review_id": "hP5uxG7mzie0pVRQ9i0cSw", "text": "Phil's is a small sports bar just off the beaten path. Had the bacon cheese burger w hand cut chips. Burger was juicy and well seasoned, but didn't taste the applewood bacon nor cheese. Chips were good, but half of them were not fully cooked. Beer and service excellent. Come for drinks. Don't come hungry ;-)", "business_id": "6SxAOEXHzNjWQMQ9Nnos3A", "stars": 3, "date": "2012-01-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "ID-rdph6XTnUkMziOCluEQ", "review_id": "olTK5Vgl2DUkR1ac0Tz5Zg", "text": "I had lunch at Capital Grill and was pleasantly surprised by the menu options that included fish and other non-meat items. The service was impeccable from the moment we stepped into the restaraunt. I was surprised that it wasn't more crowded but there was an ice storm brewing outside, which could have forced people to stay in. Even though I begrudgingly went to Cap Grill because my boyfriend wanted a steak, I enjoyed myself just as much as he did. I had the salmon salad, which our waiter recommended, and was delicious, and my boyfriend had the filet, which he has never been disappointed by at any Cap Gill. The service stands out at Cap Grill and, as long as you're in the mood for deliciously prepared but simple dishes, you won't be disappointed.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 4, "date": "2013-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "14t5tt41XgIbWllIptq8ug", "review_id": "SC4pNdUq7XTAf46C1d3Iew", "text": "Great place to celebrate with your special/loved one!\n\nJan3,2014", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2015-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "AfjBA2MAXUshy_qzk2FmGg", "review_id": "bmv2AMNnRmGjLNEsF_971g", "text": "Where do I start. It was a friend's 30th birthday so we wanted to go somewhere and light up a cigar to celebrate. Given Cutters is one of the few (if not only) indoor cigar smoking bars/options, your hands are kind of tied if you like cigars. I called (at 11pm) before going and was told last call was at 12:30 and the bar closes at 1am. At midnight, the waitress comes around for last call. When I ask what happened to 12:30 for last call, she says that the food and beverage director wants to shut down early - no other reason for the early closing. \n\n20 minutes later, a waitress comes over while we are finishing our cigar and drinks and says, \"Alright guys, you have to leave now\" and opens the door. If this is customer service, I'd hate to see what customer disservice looks like. I guess paying $15 worth of cutting fees for the cigars we brought with us and purchasing several drinks was not enough to buy good customer service. \n\nWe were clearly unhappy about the way we were being treated but left anyway. On the way out, the waitress holding the door makes unnecessary comments about our slowness in leaving the bar at 12:20 (which should be open until 1am). The waitress and the food and beverage director proceed to follow us out of the hotel, ask if we were staying there and threatened to have us kicked off the property. The sad part is we had not spoken with the food and beverage director up until this point so instead of inquiring about our displeasure and what happened, he immediately jumps to conclusions. Needless to say, Marriott Charlotte City Center and Marriott's Corporate Customer Service center will be receiving letters regarding this incident and the customer service of its staff. \n\nI personally hope Cutters gets what it deserves and closes up. It gives Charlotte entertainment options a bad name and the customer service was the worst I've experienced in a long time. \nCutters does not have to worry about my patronage going forward and Marriott should be ashamed to have such poor customer service associated with its brand.", "business_id": "7BVCmaxhvXgEpx7J-SQ4QA", "stars": 1, "date": "2010-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "taYAFnYaPddh2zBTZISdxw", "review_id": "A_tsUzkUu4-JyFD73trhFg", "text": "Had a blast at Connolly's on Fifth.  Was in uptown for work and walked over to the bar with some co-workers.  We visited on a Tuesday and it had a nice size crowd for  a Tuesday night.  We went for a few drinks and ended up staying until the lights came on! Walked in and instantly felt at home.  Its a dark bar with typical Irish bar decor.  Bartenders were very friendly and easy to get their attention.  Great beer selection and everybody was super friendly. \nWill definetely be back.", "business_id": "jmzPbvE_02SzTAjwZCTgYA", "stars": 5, "date": "2014-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "sXULK2ESJKrtoSExmslPkg", "review_id": "-vP8-MCbxXjDCnL_I0mRDg", "text": "Went here for my sister-in-law's birthday party and had a great time.  The staff was super friendly and had everything set up in fairly short order.  No complaints really.", "business_id": "e5J3s-xxs1S6PPHJhldBEA", "stars": 4, "date": "2015-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OqKhWpP8nOwynXyjR1uDIg", "review_id": "Hd6Vob2pWamMIgkmT7IURQ", "text": "Thumbs up, great wine selection and atmosphere.  Must try the Scallops. \nWent during Charlotte Restaurant Week.  They accommodated a group of ten.", "business_id": "eaqJQP6bp7rQJQt5KqfvxQ", "stars": 4, "date": "2011-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2uDd7jQtAXqpiRCfA0UXYA", "review_id": "LzaCFG9ckXY5m7LS6j5EYw", "text": "Great food, however, the reason I give it 3 stars is service. The bar, with 3 people working and no crowd, just seemed swamped. 15 min for our first drink/acknowledgement from bar. Not a friendly welcome with the hostess stand at all, too busy chatting it up about their social affairs from the night before. Again, amazing food, service.... Meh... Not so much.", "business_id": "eaqJQP6bp7rQJQt5KqfvxQ", "stars": 3, "date": "2014-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3IOQbdQ2z7TKWOnBjAnkew", "review_id": "4BbOi4Tw9iNIDn8ZzCknUw", "text": "First-time at the Visulite last night to see a local band my husband knew.  Though we've been in CLT for a good six months, we'd never been over to the Visulite, simply because they hadn't had any shows that were of great interest to us.\n\nI was impressed with the space, though.  I'm not a die-hard show goer and am a little soft with respect to the standing and waiting and listening and head bopping... I vastly prefer venues with ample casual seating and enough atmosphere to entertain me when I get distracted from listening to a less-than-average opener.  Visulite has enough tables, counters, benches, and stools to provide lots of seating opportunities.\n\nIt's a snazzy-looking venue, for sure, and we were able to watch a couple bands without having to stand on our tip-toes and press against the crowd.  All in all, a good time.", "business_id": "eNIDbboNe7W_rAnNHoveEA", "stars": 4, "date": "2011-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tlVo4jGqjdYIL33emSSEEQ", "review_id": "Rb1-N_lmVcGKBnc_kVNGew", "text": "I went last Friday to celebrate my 5 year wedding anniversary. Our 2 year old daughter was with us as well. The place was alot busier than I was expecting. It was such an exciting atmosphere. We loved it! My daughter said to us \"wow, were at a party\". The music band plays upstairs and that is where we were seated. We had a short wait around 10 minutes and the manager seated us right in front of the band as if he read my mind. That is exactly where we wanted to sit. I'm not a fan of spicy food and the waiter recommended instead of blackened, I can order the fish or chicken to be grilled and it was amazing. The popcorn crawfish was excellent. Beers were $3, $4 The whole experience was great, fun and we spent only $80 including the tip. I had spent more than double that at Villa Antonio a few months back for my wife's 30th bday and did not have as nice of a time. I would definitely go back and recommend to anyone wanting to have more than just your average dinner at applebees :)", "business_id": "jTGQUWGIVvL-aY03C5BEmw", "stars": 4, "date": "2011-02-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WycBF7A57CbcET2vUB6r4w", "review_id": "T8xJl8i7uO0zysUCrM7Ztg", "text": "In no way do I feel like I'm a New Orleans style food expert, but I have been to a few restaurants in the past with similar style food, and I have to say, Cajun Queen is pretty much amazing!\n\nI bought a Groupon for this place on a whim- and it was about to expire so I rounded up a friend and headed over there to treat him for a night out.  \n\nI have a favorite meal from a restaurant at home that they call Louisiana Shrimp and Scallops- and it is JUST like the \"Diane.\"  The sauce that it is in is DELICIOUS!  A little bit of kick, I asked for it extra spicy.  I had it with all three proteins- chicken, shrimp and crawfish.  It was excellent!!!  I can't wait to go back and get it again.\n\nMy friend got blackened Cat fish.  It was good.....pretty similar to most blackened food....not exactly signature like I would compare my dish to!  His meal came with a salad or soup, mine did not.\n\nThey started our meal with rolls and butter.....I wish I got to try the bread and oil dip that I saw a few other people wrote about!\n\nTHe price point was close to $20 per person.  I do believe it's priced parallel to the meal, but I would save it for a slighty more special occasion.  I did not get to see a lot of the building- we were seated downstairs to the right in a section that was a bit less intimate and was kind of patio-like.  The other dining area downstairs did look a bit fancier and we never went upstairs, which sounded like it was the bar area.\n\nAll in all, it was a great meal and great spot!", "business_id": "jTGQUWGIVvL-aY03C5BEmw", "stars": 5, "date": "2013-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S4ExEknqtPH2gn141oz4JA", "review_id": "01gx8yXZ5e02GM_l2rF2Kw", "text": "wonderful food and wonderful music every night", "business_id": "jTGQUWGIVvL-aY03C5BEmw", "stars": 5, "date": "2014-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JMsDXE5LixY2dqwnqgYkjQ", "review_id": "xJed344iFm6_9W8j1W5a8w", "text": "Good cajun restaurant in Charlotte.  The fried oysters are out of this world!", "business_id": "jTGQUWGIVvL-aY03C5BEmw", "stars": 4, "date": "2015-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "K5dxGhJ99TmS6La6krwkcg", "review_id": "rVqi_BbCU08sJBAtGnEEng", "text": "This is a great place to see live music in Charlotte.  Part of the reason this place is great is that it has been around for ages, it's sort of the CBGB of Charlotte if you will.  The original graffitti on the walls dates back to the 70s (look for stuff written by bands like the dead kennedy's) and is the only thing used to decorate.  This place is a really small concrete hole, but the people are great and the shows are typically intense.  The music is typical LOUD metal, punk, hardcore, rock, etc.", "business_id": "J7XRfg3ScS5K7UyM5Te-ng", "stars": 4, "date": "2006-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b4CftWQSELbAXZBI_dxnBw", "review_id": "EBxX4zJxhxR3xdsR9OQHRw", "text": "Great selection of beers. Not the best food but it's a beer bar after all. Was a better place when they had pool tables but not a bad place to watch a ballgame now.  \n\nMonday has really good specials for draft beers. And seasonal rotations offer great new selections.", "business_id": "F-e-sWfVd3eCYll3BP1QFA", "stars": 5, "date": "2013-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "s9I4KMcrHKki44g_eTrYqQ", "review_id": "YW0huGcoWafUxLustsVDcQ", "text": "I have never eaten a full meal at Hickory Tavern, but I have been in here several times with friends to grab a couple of appetizers and beverages.  \n\nThe menu is typical bar food - not great but not bad either. I am always a fan of oysters and they offer them on the half shell.... yay!  They do have a nice patio that I like to enjoy when weather permits. \n\nService on my visits has been hit or miss. I have been several times when it is really crowded and it can be a challenge to get served.  However, on visits when it was not so busy, the service was very good. \n\nIn addition to all of the TVs for the sports fans, they also have live music on occasion.  The overall atmosphere is comfy and laid back but I think a little nicer than many sports bars.", "business_id": "r-pBY6vR_Iu5XhPRvPnquw", "stars": 3, "date": "2011-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0M8yDErLTXrzj44J0SLq9g", "review_id": "zqKsTyK1nhNkRMrOIllkJg", "text": "I've been going here for years (college and after) ! i love the atmosphere and the location.  Most of the staff I've encounter are overall friendly expect for the manager-a RACIST! I think here name is Lisa (unless they have more than 1 manager), she about 5'5, short dark hair, around 200 lbs. Not a very never friendly person, and also trying to start trouble with minorities.  So, if you are a minority and looking for comfortable place to hang out please call ahead and make sure she's not on duty! I'm not coming back until she's either quit or FIRED!  Sorry Tim Wallace (the owner), you are loosing quite a few customers with nonchalant manager around ya!", "business_id": "1wIKHSHPOkywuOkyrXt6dw", "stars": 1, "date": "2011-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "US1xYmsm4L3kh_5Sck2Byw", "review_id": "_WCMdQAu7IMA1pVcw7YyhQ", "text": "After a miserable experience at McHale's in September 2012, we thought we've never go back.  Well, we did go back.  We had an old Groupon that was going to expire and decided to give McHale's another try.  What a difference!  Ironically, we sat that the EXACT same table, and also ironically we ended up going on another Friday night.  But this time there was a total turnaround on all fronts.  The waitress was attentive and timely throughout our whole meal, and the food was MUCH MUCH better.   We ordered different items on the menu from last time, and they didn't disappoint at all.    It was like a totally different restaurant, and one that we WOULD go to again.\n\nI've bumped up the rating from 1 star to 3 stars - I'm leery to give it a higher rating since I don't know whether the first experience or the second experience was the \"out of the norm\" version of the place.  If we end up going again, I'll update again as well!", "business_id": "5odPoosll36dti3xbSwuJA", "stars": 3, "date": "2013-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "k42CUkU9dxyCRDlcOfsVTw", "review_id": "6wYj80QHbOGbttDC0S3NkQ", "text": "Later in the night, not very crowded yet they insisted we sit crowded next to another pair of people.  Service was slow, just getting a drink was an effort.  Food was poorly prepared and over cooked, or as in my partners case cold.  No way coming back other than drinks in the summer.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 2, "date": "2013-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7OP-I_VSr6L7FlzsqWjdIw", "review_id": "MNw3ebFt-0DuIP3GZ707DA", "text": "Its Friday night...cold and snowing.   What  is there to do? Head to the Village Green.   Enjoy the Friday fish fry and yes, an ice cold beer.   So lets start with the service.   It was very good.   I walked in at 5:06pm, was immediatly greeted and placed my order within a few minutes.        By 5:10pm I had 3 pieces of hot cod, french fries, 2 hush puppies and coleslaw.   The meal was better then expected and exceeded expectations.   The Village Green is a traditional Wisconsin Tavern that has great service.   I am looking forward to next Friday already!   I forgot to mention that they have a decent selection of on tap beer.   I tried the Winter Skull, pretty smooth!", "business_id": "G1qUGBNYNS220jKlPAlFsA", "stars": 5, "date": "2014-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "sOZK11vtg6BowI6ulQu1Ag", "review_id": "Ks2ibOGyK-IRfD_dmfUgRw", "text": "Visited for the first time for Friday Night Happy Hour.  Admittedly I wasn't sure what I walked in to...the interiors are divey and I didn't have food, but I was compelled to write a review because I had one of the BEST bloody mary's I've had in the area!  Shrimp, sausage, cheese, pickle...ordered extra spicy with a perfect about of kick....I will be going back just to have another!  Nice work Club Tavern!", "business_id": "Nj0vQjUYjaa7qbvZlEr2jQ", "stars": 4, "date": "2015-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Kf7xjoztHhjWl_YHLcFPrw", "review_id": "Yv4mcgaYrCn2gmUqKic3CQ", "text": "Saturday night, very busy. About 20 minute wait, not surprising. Bruschetta sirloin with potatoes was very nice. Staff was obviously stressed but food arrived timely and hot.  Kids thoroughly enjoyed the desserts. Nice array of flat screen televisions, several games available to watch from just about any seat in the house.", "business_id": "JdCFcgw4yk4M1ZRhAhBIag", "stars": 3, "date": "2015-02-28", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 5}, "user_id": "T1Ju5Uin6Ja3iki17ME6fA", "review_id": "_eqmVRK3NJzWMU6_1GfLbw", "text": "My husband, my mom, and I braved Dexter's on a Friday night for fish. Oh man, I am so glad we did!\n\nWe went into it expecting a wait, and we did end up waiting about an hour and a half. At first, we had to stand in the bar area, but we got drinks relatively quickly and were able to snag a table after about a half hour of standing. Their beer selection is amazing. I tried 3 different new-to-me beers and there were still a bunch more I wanted to taste. Hooray for options!\n\nWe ordered soon after sitting down and didn't have to wait long for our appetizer (spinach dip with veggies & pita). The dip was good and their pita (fried) was as awesome as you would assume fried pita would be.\n\nOur meals were great too! Between the three of us we had cod, perch (or bluegill? woops, can't remember), and a shrimp po-boy. I would order any of our three choices again.\n\nIn summary: the fish fry is worth the wait & the Friday night crowd.", "business_id": "HTplzElel_F_U_qhWuDKdg", "stars": 4, "date": "2014-02-28", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 4}, "user_id": "JryL6DmP4FPadFQD6Yj0CA", "review_id": "r0OCDwuBDCRhwC4xIQU3XA", "text": "Another strictly pinball review. \nAround thanksgiving The Ideal had Simpsons Pinball Party. SPP is a lot of fun but never lasts long at any one stop in Madison because it always has mechanical issues going on (first played it at the Plaza this past summer, they get rotated by the big pinball company in town) . \nI stopped in the other night to find Walking Dead (which you can also find at the Up North currently). I haven't seen a lick of the TV series, Walking Dead, so I admit I'm missing something but this game was just plain boring in my book. 4 stars for having a functioning (and new!) pinball machine - I bet Walking Dead fans will feel differently than I do about this one.", "business_id": "MQtzOBwYXrTjqkWLLKInew", "stars": 4, "date": "2015-01-05", "type": "review"}
{"votes": {"funny": 3, "useful": 6, "cool": 4}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "VpQnhTj5O9I3engfTLsvzA", "text": "Dropped-by for a quick drink on 1/30/14 at around 8:30pm.\n\n+ Super cool dive bar that isn't really a dive bar\n+ Very cozy inside, but in a really good way - feels \"homey\" and comfy\n+ Awesome decor - the fixtures, the wood walls, the tin ceiling, the tables/chairs\n+ Attention to detail like none other; little things make the whole (and they make it great)\n+ Even the bathrooms are excellent\n\n+ It's like the tap list was made just for me\n+ Two nitro brews on tap, IPAs, Karben4, Upland - a really great mix\n+ Super reasonable prices - $4 for excellent pints? Here's a $20; pry me off the floor when I'm done\n\n+ Waitstaff was very responsive, very prompt, and super friendly\n\n- So noisy; sound really carries in the place\n+ It's a bar - it's supposed to be noisy, so deal with it, old man Steve\n\n\nGrabbed a small table near the back/side wall. Ben, the owner, introduced himself and was so welcoming, gracious, and sincere. He's done an amazing job with this place and I'm confident it's going to be a smashing success. I love that it's just a few blocks from my house, because I know I'm going to be here often. Can't wait to try the food - the menu sounds and looks like a perfect match to the neighborhood, while honoring the spirit of the joint.\n\nWould I go here with a date or someone that I wanted to have a good, solid conversation with? Probably not - it's just a little too noisy for that. But for any and every other occasion? Absofreakinglutely. Very, very cool place.", "business_id": "JJFoeKZXgi2_LeECDMkkoQ", "stars": 5, "date": "2014-01-31", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "u_kFEQtddzIbw2855xL-vQ", "review_id": "q1_P58gVSvTQOX2Uam2rkQ", "text": "I stayed away from this chain for years, but after a business trip forced me into their doors multiple nights, I gave my home location another chance.\n\nThe food is predictable but getting more adventurous over the years, and the korean tacos are pretty exotic. I try not to eat here without looking at the nutritional information in advance; the one time I didn't, I ate half an appetizer (loaded baked potatoes) and a salad and found out that was 2100 calories. There were also pretty substantial delays in service. My other half dozen visits have had excellent service and well prepared food. Maybe the staff wasn't at its best because they were here on New Year's Eve?\n\nThough I seldom use it, they have a very nice drink list, especially if you're a fan of tequila. It's also one of the few restaurants I know that offers reward points for eating there. All in all, I choose to go here for a standard night out with people who can't agree on what they want to eat.", "business_id": "ykxf0XiJt-d76dBwfO_yew", "stars": 3, "date": "2013-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DVrXeMouQYXndLmU7J_kzw", "review_id": "1BiDdvY5jtMkI5yjUsti3Q", "text": "Ok crowd. Good place to see concerts. But stupid expensive drinks and the bartenders do not give very good service. I've downgraded this place to only a concert stop. And only then if there is nothing else going on.", "business_id": "yrBo3c3OTKVO4H1ttBxadw", "stars": 2, "date": "2010-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "try1NSovbCPo4zvAIxSfXQ", "review_id": "tyzOXtQRFO5SA_2mdaibGQ", "text": "Worst bar I've been to, period. It looks awful, smells awful, and the nastiest, warmest beer on tap that I've ever drank came from KAMS. On top of that, the clientele are awful, too, unless you're looking to meet the most obnoxious people in the whole city when they're in full bar crawl mode.", "business_id": "RwhUzMEG2tVnZQY9dEuXzw", "stars": 1, "date": "2013-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7jwHHdBTkWn3B8fshnmDPQ", "review_id": "O-tiy_JiabZRdJQF0HFknQ", "text": "Ohhhh the murphyburger, how I loved thee.  Best damn burger in town.  The mushroom cheeseburger was my favorite, and the fries - oh. so. good.  Extra pickles, please.\n\nI went back to campus a few years ago and found they had expanded - it's a little disconcerting, but at least the food is still the same.  Go Murphy's!", "business_id": "MVH3JOKpQvMTP4jxwBUhkA", "stars": 4, "date": "2007-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IIRBF6_xbWYPbP_mjGI8RA", "review_id": "0djbadBAB6Ecm-CBfRmwwQ", "text": "Solid burger and fries for cheap. Good beer selection for campus town and reasonably priced. Overall, I like murphys. The loudspeaker announcements though are just really annoying.", "business_id": "MVH3JOKpQvMTP4jxwBUhkA", "stars": 3, "date": "2015-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jFB4m2Na8fTIhc3TAYoeYw", "review_id": "nhc5IYkjtSu2hURfwzUbRg", "text": "I am a Legends fan.  It's a bar with really solid food (lots of options, even vegetarian ones) and it's consistently good.  The staff is generally friendly, and they run Trivia on Sunday nights for fame/glory/lots of cool prizes such as free meals, 25% off any tab up to $400, etc.  The drinks are inexpensive, it's clean, and the music is usually at a good level.  Thursday thru Saturday they have a DJ so you can make requests and such.  I just wish their kitchen was open later.", "business_id": "05FJCAvUFOAk8B_nIOqt7A", "stars": 4, "date": "2009-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "1RqGGze27ndXIx82HWB31A", "review_id": "XA9gFe1jBaOp0we9w7BnPQ", "text": "Folks, this is your quintessential small town concert venue.  Great prices, great service, great music.  I came from way out of town for an act that I couldn't pass up: the Corb Lund Band.  Canadian Honky-Tonk at its finest!  \n\nWhat I like most was the vibes - this place has character.  You can tell the building is old, but from what it looks like, it is in great condition.  The mood lighting is red and dim and the decor has a 60s retro-modern twist.  I like it.  If it's open, try to grab a seat on the upstairs balcony, especially if seats are limited down below.  The view and sound is fantastic.\n\nTicket prices are right on the mark - most shows that I saw are under $20, most well below that.  Corb was $15, and from the performance we got, I'd say it was well worth it.  What also blew me away was the drink prices, I got an above rail whiskey mixer for under $5.  Maybe I'm not used to small town prices, but this was an unexpected surprise.\n\nAll towns would be so lucky to have a music venue like The Highdive.  I have to agree with Jess S. on her review; there are not many places like this in the Midwest, and surely not in Indy.  Keep booking the gigs, Highdive, I'll keep ordering Wild Turkey and Ginger Ales.", "business_id": "1j7xdgHkm-zU036o9EOUDw", "stars": 5, "date": "2013-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TpGTyk-NuepCXxsda8iXUA", "review_id": "wYzgYZ4AkYjx7Ul7XowZdA", "text": "These burgers are ridiculous. One of my boys hit me up and was like we need to go to Farren's. One of the best burgers I've ever had in my life and easily the best burger in the Champaign area. No one else comes close.", "business_id": "IUhO58Il7gUEjl1RMEncHA", "stars": 5, "date": "2012-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tWtug6Y0Rpx-7UCQsF8t7w", "review_id": "wAhJxZwGRP55PhnH9g0kXA", "text": "Amazing burgers, had once would go again except the wait was pretty long.", "business_id": "IUhO58Il7gUEjl1RMEncHA", "stars": 5, "date": "2014-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tnODxijeYNBtCn9S_joP5g", "review_id": "P5nGr1_SI8zgJQVH5eeHvA", "text": "My favorite college bar and I didn't even go to college there. Red Lion is where dreams come true.", "business_id": "TxWfLkj8LLlVLBgA0woYEg", "stars": 5, "date": "2014-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oXF1ugDJPy6FUwWCLfywDQ", "review_id": "usyzHfFgTd_UA1_Y5e6d9w", "text": "Esquire rocks. The place is dirt cheap and the food is simple and good. 1.50 pints of old style and 3 dollar grilled cheese sandwiches make this place my cheap go to in Champaign. They also have free peanuts which are good when you are too cheap to buy the cheap food, like I am sometimes. It's a bit of an old man bar but the cheapness makes up for it in my mind. Also, they have a number of large pool tables. The place can be pretty packed on a Fri or Sat night as well so it makes for a good time.", "business_id": "pPWre8lbVAssER6CN0uWMw", "stars": 5, "date": "2009-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6VYJaa-APMGqSDQkXz5hZQ", "review_id": "FLGGPeODc3XYHzwEkPrvgw", "text": "One of the best bar/restaurants I've been to in champaign! I live in a tourist filled florida city so bars are a dime a dozen but when I stopped in here, all I could do is wish we had one down south! The pizza is cooked perfect, priced right, and served piping hott! Subs and sandwiches taste just as well, bar is fully stocked with local and national brews and a brilliantly educated staff can make any drink fast and easy, not to mention the games. 6+ professional pool tables and pinball arcade style games as well! All I can tell ya is whenever I'm in town I will stop to catch a ball game or eat some awesome food and drinks!!! 5 stars!", "business_id": "6U94ybDpNd0fTL7TIzb5Kg", "stars": 5, "date": "2012-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "U5SbzmnG08Jphb53RwyazQ", "review_id": "VAlP5wdfb-nPz1De6Krk6Q", "text": "I am a huge fan of high end restaurants and since discovering my addiction I've been trying all of them within reasonable driving distance of my home. Bacaro is one of the most upper-endish restaurants around, so I had to give it a try.\n\nI liked the atmosphere, very modern and mood-setting, and the staff was nice. The food however was just a bit too out of the ordinary for me. I prefer classic dishes done to a high standard over the creative and stronger-flavored inventions they had here. I found the food more interesting than delicious, which in the end left me a little disappointed.\n\nIf your palette is bored, adventurous, and experienced you might like Bacaro, I'm not quite there yet.", "business_id": "h9xdY1NO4GnNijNChTy-8A", "stars": 2, "date": "2011-01-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "amxtfaoqV0JEwbJUFeCyLg", "review_id": "AdiMr026jPpg2-S7-CAqVA", "text": "Came here with a friend's parents (who were paying!) and we loved it. The service was great and the food was amazing. I just personally could generally not afford to come here as a student.", "business_id": "h9xdY1NO4GnNijNChTy-8A", "stars": 4, "date": "2015-12-03", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "ceKoQX0_IJZ6Lr9-9LGcbA", "review_id": "IbhhDt9XZQi_-XSzyk3UIw", "text": "\"Thunder Dan\" lives on in Downtown Phoenix!  \n\nThis is a very good choice if you're looking for a cool sports bar atmosphere before/during/or after a Suns/Dbacks game while in downtown.  The ambiance is great being dimmly lit, having exposed bricks, newer newer flat screens tv's and surround sound that really makes you feel apart of the game.  \n\nI'm only commenting this place as a bar and not on its food.  I don't think this would be in my top twenty of choices to eat at with so many other great dining choices nearby.  Only come here for the scene and the drinks, you really can't go wrong with that at Majerle's!", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 4, "date": "2010-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "llu0xnAghOiQ1y22J-tK1g", "review_id": "FgY_O3aNqfZ5V6oAziuRuA", "text": "It is pretty loud in here, but other than that I like the food. The chicken sandwich and the fries are great.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 4, "date": "2013-01-24", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 4}, "user_id": "6kmu0mYbdpMIOZ6Y0eVsxg", "review_id": "R1pbjiFRTE1wY8YeQKbVeQ", "text": "I have taken my mom here twice and was really pleased with the service each time.\nGet the shrimp wrapped in pancetta.  Yummy!\nI also crave...no...I mean...CRAVE their lobster bisque a few times a year!  It's rich, creamy, with a bit of a kick.  I always order a tub to take home with me.\nMy only gripe?  When the heck is it opened consistently?  Argh!", "business_id": "j8nyAaN_w5t6wYv-ni23sg", "stars": 4, "date": "2008-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hnzx7Q7IWq5EDVe0yjKK8w", "review_id": "4MV7fazeDiLeIy0a7DwVNQ", "text": "\"Quick eats\"\n\nYep, that sums it up. You go to hooters and you kinda know what to expect. I find that hooters centered around campuses have less service then others.. and this locay is no exception. This place is also kinda interesting. They have tables but really low seats and some tables with high stools. The restaurant feels hodge podge in the back.. so opt for a table in the front.\n\nGo for the wings and to watch some games. Worry less about the service and you'll be fine.", "business_id": "qsWxbgQwuomXvMseg23DGg", "stars": 2, "date": "2013-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UCQNrwN4_hHHTWYa8cqe_Q", "review_id": "8Rrg7Y5GnuOu6MwPseQ5oA", "text": "Family and I brought my mother here before we had to drop her off at the airport! Had a very nice waitress, who was very courteous to us. Wife and I shared a granny apple burger, It was nothing special! Could get a better burger elsewhere! Mother had their twisted mac and cheese. She claimed it was the best she ever had? Wife and daughter agreed it was very good. I don't like mac and cheese so I never tried it. Over all food was OK! Service was very good!", "business_id": "gkv2XvXpFgiq4Bb2XK7YmQ", "stars": 3, "date": "2010-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BFIsRXzgNVz2gwAH80DECA", "review_id": "z4NMY_3xr4PDKwz24nVPyQ", "text": "Our waitress Noelle was awesome!! Ask for her ! Food so so drinks and atmosphere excellent", "business_id": "gkv2XvXpFgiq4Bb2XK7YmQ", "stars": 4, "date": "2015-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9CIwY0Uvy9L0Ss-Z4YGwBQ", "review_id": "lYIHxKUqhnHDryyVFo2LVg", "text": "With knowledge of Cheuvronts past, I expected much more.  I ordered the vegetarian Ravioli, which was not available anymore, and was presented with a Risotto cake, accompanied by sauteed mushrooms and asparagus with a phenomenal pea sauce.  The pea sauce was phenomenal, the rest, I could have fed to my dog.  I would have sent the dish back, however the bartender (who was my server) never asked how the meal was until the end.  When he did ask, after I finished my meal, I responded \"it was quick\".  Value, not a good one, taste, not so good.  Will I go here again?  Yes, I do believe every restaurant deserves a second chance.", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 2, "date": "2010-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "gcyEUr4DXcbjnGRAWFtfAQ", "review_id": "_kuVjnJbUMCEwZOPULVD7g", "text": "So my wife and I are  HUGE fans of Cheuvront and the tastings they hold there several times a month. We've done Spanish Cheese tastings, Italian Wine tastings and everything in between and always have a great time! This past weekend was the port tasting and what a great event. I learned a TON about port that I didn't know and got to try several ports that I'd never had. The tastings are typically $15 and include a small plate (or in this case, delicious of pizza). Do yourself a favor and go check out Todd, Jeff and the gang and get on the email list for their tastings. it's always a great time!", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 5, "date": "2012-12-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "Q-5tp8EOnIKosqZ0MNBVcQ", "review_id": "dAUhwRTexts2wIcPVw-92w", "text": "I just had to order \"The Big Unit\".  This caused a lot of yelling behind the bar amongst the servers adorned in black tears and diamondback jerseys.  \n\nWhen the two foot dog was served, I immediately text a pic of my bf  posing with the ridiculously inappropriate wiener in pre-bite stance.  This caused a lot of replies about how gay he really is (which is pretty much true).\n\nThe funny part was that the dog was actually pretty good and that's coming from a Chicagoan.  I don't recommend the chili though.\n\nMy bf had the \"Ricky Ricardo's Cuban\" and was very pleased with it as well.  I was surprised to note more than a few vegetarian items on the menu and quite a few other items I'd like to try.\n\nI don't get the hard rock cafe meets sportsbar concept, but it didn't interfere with my enjoyment so to each their own.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 4, "date": "2009-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "VL3-X2kM2u2Z7dFo-FXVIA", "review_id": "j_Lis510w9u6uQTG-CagEg", "text": "Came here to split the \"Adam Richman's\" Loaded Big Unit, fat 22inch sausage on a french baguette smothered in chili, jalapeno, cheese, onions, tomatoes, bacon (although mine wasn't smothered in bacon :(). with a side of THE BEST seasoned fries I've ever had. So the unit had a lot of flavors but it wasn't too hot, but it was still great and I can finally say I tried it.\n\nAlso got a side of fried zucchini which was amazing as well, the marinara sauce it came with was really wet though, but the ranch the provided was good enough for me. I probably don't need to come in again for the loaded unit, but what I saw other people ordering made my mouth water, everything looks delicious! Service was great, nothing bad about this place at all. Came when there wasn't a sports game so it wasn't crowded :). Would come back just for the seasoned fries.. mmmmmmm.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 5, "date": "2012-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "6JNkOmfplaZh2pXaxJzM9Q", "review_id": "CX-Z86ulZKiocgKTDmeIlA", "text": "This your basic \"theme\" bar with average bar food. It wasn't bad; it wasn't great. If you're on ANY kind of low-Carb or high-Protein eating plan, forget this place. You'll struggle to find anything on the menu that doesn't add 5 pounds of body weight, and that's before you even walk out the door when you're finished. \n\nI wouldn't make this a \"must visit\" place but if you're in the area, its nice, fun and Ok.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 3, "date": "2013-02-14", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "uTatytEeN_dyB8WtNGluvg", "review_id": "8DbbrZ8Kqma7ifk8z7edXQ", "text": "I have been here before and never have I experienced bad service. \nCame in on a Friday after the NFL experience and had family from out of town with me. They were looking forward to eating here since it was on \"Man vs Food\".\n\nNo wait time, seated us fast. Waiter took our drink order a few minutes after seated.\nWaiter screwed up on my drink order but did correct it the 2nd time. On the 2nd return trip we had to remind waiter that he never brought a beer that was ordered. \n\nFood came and AGAIN had to remind waiter about the beer (3rd time). Food was cold and he forgot my daughters order, he never put the order in. Waited another 15 minutes for her simple cheese crisp to come out. Sent the pulled pork back was cold when brought out. Food was blah! \nAGAIN asked about the beer (4th time). By this time I was not having it and told him to forget the beer as my party was done eating. Waiters response \"you still have some salad on that plate so sure you don't want the beer\"? \nReally dude??? So rude!!\n\nAsked for manager and she didn't care to much about our bad experience, her response \"it's been a crazy night\". From the moment we walked in and sat to order food did not seem like a crazy night? What did I miss to receive the crap service. \n\nWill I be back...no! I can take my business elsewhere downtown.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 2, "date": "2015-02-03", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 5}, "user_id": "lPaYMDmJbAnv_3pmZH_inw", "review_id": "xi_tbn1C88_SKgMJfUsNiw", "text": "I couldn't possibly think about standing around outside waiting for a table at Pizzeria Bianco. So why not make the best of it and come next door to Bar Bianco. \n\nA great wine list and an awesome selection of craft beers all reasonably priced! But the big allure for me is the old house that Bar Bianco is housed. Its just an amazing old house that has been lovingly cared for. All the details are still there and you can tell this place had a lot of love in it. The second you walk through the door the place has a just walked into grandma's house, make yourself at home kind of feel. \n\nYou cant go wrong here..", "business_id": "JR95uaM82xBUIZ-kQ785iA", "stars": 5, "date": "2008-12-31", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "65j7bRPXJUkrUCQ7XGteDQ", "review_id": "7Tu7Dhrpf668B5ndL8oxYA", "text": "I totally heart the Welcome Diner because:\n\nThere are 7 seats. Maybe 8. (inside)\n\nThe cook (Andy?) is super friendly and apologizes if it takes more than mere moments to get your food.\n\nThe Garfield fried egg sandwich will knock your little socks off.\n\nIf the Garfield knocks your socks off, then the french fries with onions and peppers will knock everything off you, leaving you happily, nakedly enjoying you food.\n\nAnd because there are only really like 5 menu items. Eggs somehow, hamburgers somehow, hot dogs somehow, french toast in a cup (what? yes) , and some other thing maybe. \n\nNormally I hate cash only, but this gets a pass. It seems right to pay cash.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2008-12-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "okmAri_cR7xNknQAJCgGHQ", "review_id": "6Bl0lOINl4QmNA0NV5Zazw", "text": "Out with my two boys,who, like me, enjoy exploring for great eats. Based on Yelp suggestions, I decided to give this place a shot. It was close to the art museum we were at, reasonable prices, and great food!  It is hard to find food that has great flavor, and makes you feel like you are eating a meal made by momma.  Staff was courteous and ambiance was hip. Thanks for the experience, we are definitely excited to come back!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2014-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2KgMrBmHxfVSsnI6_-zXpg", "review_id": "sqOMKzTFgizczs-7N31EVQ", "text": "Finally got to try this place and it did not disappoint. Amazing burgers... \n\nThe PB&B (peanut butter) was insane. The special was the champion burger with caramelized onions and it was great too, but I would definitely go with the peanut butter one again..and again. \n\nAlso had a a homemade biscuit with honey and it was crazy good. Prob try a fried chicken biscuit sandwich next time. \n\nPlace has a lot of character. Old RV converted into a restaurant. Minimal indoor seating but not a bid deal. Wish I lived closer... Great place.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2014-02-01", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "4S60OIoF2D7I6ibowjNO2Q", "review_id": "bVKi2wBQHHoiWHaOjP8pUQ", "text": "I received an invite from a co-worker to meet here for dinner and had no idea what to expect. Having \"Diner\" in the name is misleading. It is an old diner and has lots of character. But the name is more appropriate if it references the patrons.\n\nThe food is amazing and creative. I am not the kind of person who seeks out locally sourced anything, but it really sets this place apart! They make their own ginger beer for crying out loud...\n\nIf you're near downtown and not afraid to go a little off the beaten path, you will not be disappointed!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "d3pY-uyyPfQ9H-4irGy8eQ", "review_id": "RH24-lldx49VCVI3l7_EQQ", "text": "Found this AMAZING little Gem while looking for some street art in the Phoenix Art District. A MUST try and MUST visit for good home cooking, we had the Big Jim. Went on Saturday the vibe was super chill , they had a DJ playing a dope mix and all the people super nice. Would come back here for sure my next visit back to PHX", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-02-17", "type": "review"}
{"votes": {"funny": 6, "useful": 3, "cool": 2}, "user_id": "lUWE7yEkkpj-Sq6dKUQhew", "review_id": "LHqlrMwtVB3Ci5VwKDGANg", "text": "By far the worst gay nightclub in phoenix and trust me I know gay nightclubs!!! \nLol no seriously this place is crap I have been suckered to come here a few times for a birthday party and some other events and it's no fun the drag show is lame or the acts I have seen are the Dj is good plays some different tunes the a/c is non existent I think they use a swamp cooler. The bathroom is the size of a toilet stall and always packed that u have to piss in the alley where there is plenty of hookers at your disposal. The drinks are expensive, watered down and even the soda tasted funny the bar tender was very nice and friendly. Never tried the food outside but I hear it's great, the parking is another disaster there is limited space and the night we went there was a few break ins in the back parking lot near liquor store. Just being honest but the bad outweighs the good at this club, give it a shot at your own risk but remember I warned you.", "business_id": "0VpsHbGLHDVKIKAi0ZliyQ", "stars": 1, "date": "2015-01-07", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "cEIeuU0-4fX0Y4qCUW3PwQ", "review_id": "fUus84hJxyvaFHhEYRaEZg", "text": "Dropping some stars due to the Luminaria policy. Myself and four friends bought tickets to the luminarias a bit ago. It rained today, so the luminarias were canceled, which I understand. However, as the event is sold out every other night, we were told we could not get tickets for another night and could get a refund or donate our ticket money. I do appreciate the refund, and I know they cannot control the weather, but I do think it stinks that we will miss the luminarias through no fault of our own.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 3, "date": "2008-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kjivTd9V5wrTWBoFMHHKWA", "review_id": "OIv3FIaRhyhePD4lEv3xXA", "text": "Weddings: The wedding I went to while visiting AZ was @ the Binns Wildflower Pavilion. For a Desert Botanical Garden...well...thanks for all the cactus. And thank you for dressing up natural beauty with artificial cactus and and plastic plants. Wow. \n\nAs far as the desert part of it is concerned...it's quite nice. The flexibility of the staff. Really not that nice. For a place like that, you should be allowed to spruce up the venue a little bit, but to no avail. Staff is hard-core strict. Why? Who knows... Maybe the economy states that they have to be more strict than give deals. \n\nOh so the bartender...was so-so...thanks for the attitude while getting a sprite. No outside liquids were allowed AT ALL. The regular wait-staff was funny and cool.\n\nOther than that, free parking! woot...i'll give you 3 stars for that since I had i carpooled with friends to a night out.\n\nPass on this for weddings...unless it's really cheap. BTW, the wedding was fun, but that's because of the people.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 3, "date": "2010-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "sKBjKeVGjFbAItLXM9_Kkg", "review_id": "rnttn-fc2PjZnu21S-_tDA", "text": "Love it here! It was my 2nd time there but the first for the rest of the family. Very peaceful and serene. Great photography opportunities. Very educational. As a family of four midwesterners, we loved walking around looking at the beautifully designed and cared for desert landscape. \n\nWe paid about $40 to get in, for a 16 year old, 6 year old, and two adults. Both times I've gone it has taken me about 3 hours to very leisurely walk the entire gadens with a stop for something to drink and relax. \n\nWe saw plants that looked like they were from another planet! We saw lizards too!\n\nI highly recommend a visit! Stay for sunset, it's beaituful!", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2011-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "thlVIc8s6ZCP37UGMf3yDA", "review_id": "S6G5zEGaCghIsmV9tXLLmg", "text": "Awesome place. Went here when I lived here with no expectations, but thought it was really well done and really cool stuff here. Be sure to go once during the day and once at night. People of all ages will like this.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2013-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "nP_vZUqkoajeBC4qTV0Mlg", "review_id": "OV9bfC-sr89qo3tExdYRbQ", "text": "20% discount with AAA card :)", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2014-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "tH4brXlghqKn_9GbahrMTQ", "review_id": "CJv1UYbSH8Fd6x77k_pzDw", "text": "I've never seen so many different types of cactuses in my life. Everything is labeled well. Unfortunately we came during the winter, so there were not many flowers. The wildlife is still very abundant. If you're very lucky you can catch a road runner, otherwise there are mostly quail.\n\nThe saguaro cacti are a sight to see. It's amazing at how tall some of them were, towering just like trees. The herb garden is also interesting to check out. It seems to have become the caretaker's personal garden. I saw chili, eggplants, basil, Chinese cabbage, kumquats, oranges, pomegranates, beets, and more in the herb garden. \n\nIf you want to see the butterfly garden they are open March to Mother's Day. Monarch specific butterflies begin in the Fall.\n\nThe prices are $22 for adult, and only $12 for student. It's a little overpriced, especially with such a huge difference between adult and student. To be honest, I got bored after a while, but if you're a tourist like we were, this is definitely a decent thing to kill time.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 4, "date": "2014-12-30", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 0}, "user_id": "z5g5Lclwt13_BO0BStohMA", "review_id": "FGfMmgve0_5nID9u-FyPSQ", "text": "I've only been to Jugheads for Sadisco, the goth/industrial night, and I wasn't impressed. Jugheads isn't as much a bar as a series of fences, ramshackle walls and bits of trash. I don't know what the drink prices are like, because I've never felt comfortable enough to have a drink there.\n\nThe parking lot is a mess, and I'm surprised there isn't a crash every night. There isn't much room to move, and it's poorly lit. If you do go, try parking in a lot west of the bar, near the Delhi Palace. There's lots of parking there.\n\nDuring the last Sadisco Fight Club, an amateur brawler was knocked unconscious and couldn't be revived. That resulted in a visit from the cops and paramedics. The bar was shut down, and my $15 cover went to waste. \n\nI likely won't be back.", "business_id": "R10n8BjvPvQtgJh4DcZUIg", "stars": 1, "date": "2008-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QFz9x0X_z7bF3igoylbobw", "review_id": "Kjl0pMOnDyZB48F78kR_Ow", "text": "Took my Mother, Daughter and Sister to the Michael W Smith concert  Saturday 1/11/14, We had a great experience, The staff was very friendly, not a bad seat in the house, the sound was great, this is a very special place.", "business_id": "BcBxTyj09Wu-w0KA1QvKTA", "stars": 5, "date": "2014-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xIF-4OkTenh741cVlpDfzQ", "review_id": "3EWQ1_cPhQz3R_oY0D5MzA", "text": "Dive, divy, diviest bar in Phoenix I think, and so awesome for it.  Staff is friendly and no-nonsense, so keeps the trouble down, Cheap drinks, and a fun time if you're into that sorta thing.  I highly recommend a visit if youre looking for a divy spot to have an ICY cold beer.  By far, the coldest beer ive ever had, but not frozen or slushy.  The glass alone will make you beg for the Arizona Summer.  Even the owner is friendly,  which seems common sense but we all know isn't always the case.  If anything changes, I'll update the review, because I am definitely coming back here again.", "business_id": "JWvdQoRe00tbdNwfZYeK6g", "stars": 5, "date": "2014-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WavzQE_0yoy05hF-637EoA", "review_id": "hiS_RNbDdzk0oSpn6wue8g", "text": "What can you say... It's Applebees. If you don't set your expectations too high you probably won't be disappointed. The service during my visit was prompt and pleasant. The cheeseburger sliders were good; they were no White Castle but then, nothing is. All in all, nothing to complain about.", "business_id": "hzUOqxpcnYYBgLlrgvjQYQ", "stars": 4, "date": "2011-02-20", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 3}, "user_id": "-F32Vl8Rk4dwsmk0f2wRIw", "review_id": "YM1wRkiLqkwBqsrcZ9dQng", "text": "I love the \"no apologies\" approach of George and Dragon.  I've been going to this bar for almost 8 years (which is a lifetime in PHX), and not even the scent has changed (despite being smoke-free, for what, like 2 years)\n\nIts like the Binion's Horseshoe of Phoenix pubs.  \n\nClassic.  Comfortable. Cocksure. \n\nVile.  Smarmy.  Ruddy.\n\nEverything a British Pub should be -- complete with Smithwick's and Fish/Chips.\n\nTheir music is tip-top, and though it doesn't exist anymore, I was highly, HIGHLY impressed by their Northern Soul night on Wednesdays.  I mean, holy smokes, what a freaking stunt!  Too bad it couldn't maintain.\n\nEither way, you've got the EPL on Saturdays and Sundays, so this appeases the loss of midweek, underground Motown.\n\nAnd as an aside, this place is mos def in my Top 5 of places that need to have the smoking ban recanted.  Yes, i have a list.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 4, "date": "2008-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AdVBY7Ow_ICQLfVEbf_nTw", "review_id": "rUGUd8uY9HqIHvgteN2FFQ", "text": "please tear this place down.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 1, "date": "2009-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "X5GbNXY_nNoa_vTZDD0aCA", "review_id": "KR1FJKorF3hDUwhB8IF51Q", "text": "Ive never had the food here, just drinks.\n\nThis is probably one of the most authentic British Pubs in the valley, proof by the Brit owner cracking jokes on the mic behind the bar.\n\nThey have a great tap and bottle selection, and their mixed drinks are pretty good as well. Very friendly staff, kind of slow sometimes, but very accommodating. The decor is nice, just kitchy enough. The pool tables are cheap, and I believe they have darts as well.\n\nA great place to start or finish your night in Central Phoenix.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 4, "date": "2013-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_LsbT_uW0UE6rhsWiAIrsg", "review_id": "ev2XFlwvnuWDnNZdU_2QjQ", "text": "too much smokers outside, could never go in, and restaurant does nothing about it at all, cannot go in the front, smoking everywhere", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 1, "date": "2015-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BsgXTs_hz4AwgbK0wSIIxw", "review_id": "fZlavFHHPVB3tmwpdSzjcg", "text": "Applebee's is pretty much the same at each location.  I could suggest it is the McDonald's of \"bar and grill\" chains.   Advantage - they have liquor.  The food is decent and the portions are decent as well.  The staff is always friendly in a \"pieces of flare\" way and that can get a little annoying.  The drinks are good.  I had a terrific autumnal drink with Apple Jim Beam, lemon and honey.  I fact I had two!  The new \"pub\" items are pretty good portions.  I had the cedar chicken on quinoa and apple chutney.  Not too much food so you don't leaving bloated up.  It is always a reliable place to go because you know what to expect, what you will get and how long it will take.  Consistent which is not bad but it is nothing amazing.  It is your neighborhood bar and grill just like your local McDonald's.", "business_id": "cjUmPLRT43wN9Z87A9BOpg", "stars": 3, "date": "2015-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FgpukW0i4Dp239pCzE0qyA", "review_id": "oX2HaVy8X184lQdjHjvGgA", "text": "I stopped in here yesterday for a drink.  Enticed by a brewhouse in AZ I had to go in, I was also enticed by the fact that they were offering a Happy Hour from 3-6 even on a Sunday (it seemed that most places here in AZ don't offer Happy Hour Specials on Sunday).  I was slightly disappointed when I found out that it wasn't a real happy hour, but a kind of happy hour (real happy hour is 2 for 1 drinks or fifty percent off, being honest here) while the happy hour offered here was a dollar off drinks.  In fairness they offered half off appetizers, but only the one's without meat. Now I have read Michael Pollan as well and I am down with everyone consuming less meat (especially here in the Southwest) but it seemed a little rough to have rules like that at a beer drinkin' place....Anyway, I started off with the Barleywine. My mom had the root beer. The waitress returned several times to see if \"us guys\" were okay. When I was ready to order a second glass, the Trooper IPA caught my eye. My love affair with hoppy beers is so great, but she was kind enough to bring me a few small samples before I ordered it. In the end I went with the Amber Ale.  Four stars because: The atmosphere was pretty nice, attentive staff (a little too much, especially on trying to get me ordering food), they brew their own beer, my total check wasn't too bad.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2009-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "x7QYSYyc_x63-61Z9SB8jA", "review_id": "3DENbIGLfcgfr6KEzvbV7Q", "text": "I came here for a first date with some one and just missed happy hour.But i did like this place and enjoyed their beer!!I wish i could have tasted  the vanilla porter but the were out.Will return soon!!", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2012-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tRBC8zo48KbWIJn_hEG4mA", "review_id": "Y6GMrNsTqi8YG04pv7lhBQ", "text": "First, let me reiterate that this is one of those times that I wish there were half stars in the rating system.  It is definitely better than a 3 but I am not quite ready to give it a 4.  I do have to say that it really all comes down to the purpose of your visit here.  Its a brewery.  As a brewery it was so fun and we really enjoyed our server, Amanda.  She was helpful and knowledgeable, as was most of the staff that visited our table.  Ambiance, meh.  I wanted to sit outside but it reeked of cigars and cigarettes so we settled for a booth in a side room.  The front room was definitely where it was happening.  Mostly locals/regulars, from what we gathered.  An eclectic bunch of people.  We only had appetizers so again, hard to know what the regular menu was about.  Our  green chili quesadilla was burnt on the outside but the inside was good.  The melted cheese was the right consistency.  Our calamari tasted like most bars.  Good, crunchy.  The big hit for us was the hot artichoke and green chili dip.  I could have eaten the whole thing myself (I think I did).  So, I will definitely go back.  Found the beer that I liked the best...the Lightrail Creme Ale was my favorite.  And I would probably try something of the dinner menu.  I'll keep you posted.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 3, "date": "2015-01-17", "type": "review"}
{"votes": {"funny": 6, "useful": 5, "cool": 3}, "user_id": "BuwjlU6D4kcs1aGo7wSM4Q", "review_id": "tKkluk48NqFz5rakyzY5eA", "text": "I got to thinking about Osso Bucco the other day.\n\nMy new Dutch Ovens brought this on, I'm kind of obsessed with braised meat right  now. What to braise, how to braise, which pot to use... must be because of the freezing cold temperatures. \n\nAnyway. \n\nA few years back my dad and the evil stepmonster (she's gone now, as in they got divorced, in their 70's, can I hear an AMEN sister?) could not stop talking about Christos. \n\nThey would talk about it all the time. \n\nIn Oregon.\n\nLike, in the middle of a nice dinner at Jake's. \n\nWeird.\n\nAlso, rude. \n\nI just chalked it up to stepmonster's name dropping mental health condition. \n\nNo seriously, she drops names all the time. ANNOYING. anyway, ahem.\n\nIt was Osso Bucco this, Osso Bucco that, Christos this, Christos that. \n\nSo, when I was down there on a visit, post stepmonster,  I made my Dad take me.\n\nIt's good stuff. \n\nI don't even eat veal. \n\nBut the Osso Bucco rocks. \n\nEverything else did, too. I liked the service, the feel of the place, and I liked the calamari, and the wine. All good. \n\nif you're in Phoenix and you want a good meal, I'd say this is one of the places to go.", "business_id": "3CSaqRNvYg7ZdN2zwxwzVw", "stars": 4, "date": "2013-01-11", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "A_O8wZOsMTPwyeYA4-Rsow", "review_id": "vN-Cm_Pc-Yr7AqfjkBO8Kw", "text": "Best Blues and \"American Roots\" venue in Phoenix ... small and extreamly low stage ... place can pack up depending upon the act ...", "business_id": "JZJqJadk9pSoCGT7VTwBvg", "stars": 4, "date": "2006-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3ONPPazUH-Q3XblYJIaA1A", "review_id": "5ztt5ds6kQJVjfYCKIeoKA", "text": "This place is not fancy, it's not new, but it's a great place to see a band.  The bar is in the back and there are seats all around to chill out while listening to the bands.  it's very loud so definitely not the place to go  for a quiet night out by any stretch of the imagination.  I give it the the most points for atmosphere since it revels in it's dive-y-ness.  The sound isn't the best at the couple shows I have been too they always have sound issues of some kind or another.  I think that adds to the charm of the place.  It's a great place to see a $10 band at any rate.  I do not hesitate to go if a band I like is playing there.   The bartenders are very nice and I haven't had any issues with the bouncers although I had tickets all the times I went.", "business_id": "JZJqJadk9pSoCGT7VTwBvg", "stars": 4, "date": "2012-02-09", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "mDS8rlDOcgRT3PMHGz3tug", "review_id": "Hgw1E4dY2F-PtlaBcKGD8g", "text": "I've been here before and received the same dismal and uninterested service both times. Sad. Our group was here for Sunday NFL breakfast and though the Bloody Mary bar looked tempting, no one imbibed. We went for the beer specials, which were good. The breakfast burrito was also tasty, but I seriously cannot get past your horrible horrible service.", "business_id": "7srDFwPPnzBaQoPW55Dc8Q", "stars": 2, "date": "2013-12-23", "type": "review"}
{"votes": {"funny": 3, "useful": 7, "cool": 5}, "user_id": "JffajLV-Dnn-eGYgdXDxFg", "review_id": "Bit-ktIrDA1dTAIEcJI-6g", "text": "I finally got around to coming here last night, and I really like it!  I knew what I was getting into because A) I've been to the original wineburger at 19th ave and Bethany Home already, B) I've read the reviews and C) I knew that these two places were originally started by a pair of brothers many years ago.\n\nWalking in, its a real divey type place.  Wood paneling on the walls, simple no frill tables and chairs, with limited decorations and dimly lit.  It's set up exactly like its sister location the original wineburger, with half of it being a bar with chairs and tables, and the other half being a pool and congregating area for those that want to do more then sit and hang on the bar.  I also saw a pinball machine, which was pretty cool as well.\n\nThey have a few TV's hanging from the walls behind the bar with a variety of sporting events on for you to watch. Granted, I'm not a huge sports fan, but it's better then staring off into space or what not.  I sat at the bar, since I felt more comfortable there, and there wasn't to many people in here, so there was more then enough seating for me. I felt really comfortable here, and didn't feel like being around a million people anyways.\n\nThey have great beer and alcohol specials during happy hour, and they have a decent menu of items to choose from. Prices are great, and the bartender here was really super cool.  Him and I chatted throughout my meal and I really enjoyed the conversation.  I went with the Jumbo Hot dog, and it was tasty...charbroiled and all, I really liked it here.\n\nIf you want a low key night out, go check this place out. Divey, dark and not half bad. Will be back in the future. I think I like it here better then I did at the original one.", "business_id": "ntJAKLAq0cXzzdFgPoo0Iw", "stars": 4, "date": "2012-12-15", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 4}, "user_id": "Ps1Db9zOatoF_76FZNO5CQ", "review_id": "3nARWmwRhxLhCjIjEPSUXQ", "text": "I actually went here over a month ago but felt it worthy of saving for my 200th review.  If it wasn't for Yelp I this is one of the places I have eaten I never would have known about.  And it is sort of fun to tell your date your are going to eat in a mostly vacated strip mall just off the highway. :-)  I had been here previously for a Yelp event.\n\nWe arrived around 6 on a Saturday just as it was getting dark.  We got seated right away.  Even at that early hour the place was far from empty.  It seldom happens we are amongst the youngest folks in any venue so we happily take note.  As the evening went on the crowd got younger and the place was almost packed.\n\nWe got our waters and menus right away and then we sort of got forgotten for about 5 minutes or so before our waiter introduced himself and took our drink orders.  That would prove to be the only glitch in food or service the entire meal.  I had the PCG pasta and she had a black and blue burger.  I also had a salad with Blue cheese dressing.  Lately we seem to have been on a run of less than stellar blue cheese, both my dressing and the crumbles on her burger were good.  We both enjoyed our meal.  Usually we try some of each others food but I declined to take a bite of a well done burger, however she thought it was great.  I did sample the fries and they were pretty good.  The beer selection had a couple of selections I liked to choose from.\n\nExcellent place for a nice dinner out.  Even if you get in to steaks the place is not over the top expensive.  It was quiet enough we no trouble talking.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 4, "date": "2010-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cIDSKriAFAa-bQzoFniwOw", "review_id": "Ju3PrYPvC_aj9xJbNJs1bA", "text": "The atmosphere and the food were exactly what I was seeking. Very comfortable and well priced. They were more that happy to make any changes I desired when I wanted to substitute sides. I can't wait to go back.  I had one of their well-designed burgers - it didn't need a drop of ketchup. The posole soup was also very much on spot. I subbed in the arugula and beet salad and it was a perfect side to that big burger. \n\nThe hardest part may be not trying some of the other interesting restaurants in this part of Phoenix.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 5, "date": "2012-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eaX53FCXTykf5n2e1XsW1w", "review_id": "XcYQ7qU0xWK8GZQiDpkLbQ", "text": "After a rough start of not having a reservation acknowledged which was made a week in advance, and being seated in the entrance to the kitchen, dinner was great.  I just can't understand why there always has to be drama to deal with here.  \n\nAfter being moved to a nice table in the dining room, getting a great waitress and a perfect meal, it was a very nice Valentine's dinner spot.  I hope to see this special on their menu again as my husband and I both really loved it.   It was Grilled Sea Bass with a champagne sauce, strawberry salsa and jasmine rice cakes.  The chef even shared his grilled sea bass secret with me.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 4, "date": "2014-02-18", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 4}, "user_id": "4dnDsoHuxUtzhaumxbpR5w", "review_id": "haeHEvBtd9zujVRXxZ1jqw", "text": "I love love love this place. If I could afford it, I would eat here more often. The sandwiches are fabulous. Best ingredients out there and amazing breads. You can also pretty much add/exclude anything you want to any sandwich. The soups are always delicious, as well as their side salads and pastas. \n\nI love the feeling and atmosphere of the place. Very homey and welcoming. They also have several different patios around the restaurant, which is nice. Not to mention a glorious cheese selection, wine/beer bar, and espresso. \n\nIt's a bit pricey, and if you go during the lunch hour any day of the week (including weekends), especially during the nice season, expect to wait more than just a few minutes for your food. Otherwise, though, this place is a hidden (it's tucked away in the plaza) wonder.", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 4, "date": "2008-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "0F-JS0c2D2PDWGOX7MRzLA", "review_id": "1hceEwRj4xaAjE2_bgH-yQ", "text": "Ok based on people's review I was expecting fabulous - husband and I went in one night for some soup and sammies - both of our meals were mediocre at best - won't be back until we have exhausted all other options - \n\nFood quality was ok - the bread was nothing to write home about (and is that not what makes a sammie?) - veggies were fresh and deli meat was meh.  Sorry - I wanted to love it -", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 2, "date": "2013-01-10", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "3VgHutPPmF3TbWwIzlSNCA", "review_id": "V3F_YorRsVhl8A-Fll5Reg", "text": "To me, the Swizzle always feels like a Southern California beach bar.  Maybe it is the nautical theme, the bumper sticker collection or the year-round Christmas lights.  Either way, it makes me nostalgic for my visits to one of my best friends when he lived a little North of San Diego.  Drinks are cheap and strong, and they offer a nightly special.  Beer selection is pretty limited, but at least they have Fat Tire on draft.  Bartenders and customers alike are always friendly.  Trivia night has recently changed, I think it's on Wednesday but wouldn't swear to it.  They seem to do it potluck style, and if you are in the mood for a cheap meal and aren't afraid of crockpots, I suspect you could poach.  I do love the sliding door to nowhere/terrarium/glass dungeon mentioned in the other reviews.  Every bar should have a \"what the hell\" feature.", "business_id": "mgllPJA6NQXlJurFWAkqQg", "stars": 4, "date": "2009-01-20", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 0}, "user_id": "9LiL4vAyWp_WSHoI5J5IQQ", "review_id": "2ua4-3a86BC0-a8fYiN27w", "text": "Fool me once, shame on you; fool me twice, shame on me. That is exactly where I am at with the beloved Swizzle Inn. But only with a certain semi-tall blonde (brunette w/highlights) bartender who apparently refuses to acknowledge me hanging over the bar with empty drink in hand as she prepares drinks for everybody else that walks up after me. Not on one occasion...three. Now, since I'm one to give the benefit of the doubt I can afford to give her some leeway. Here it is: 1) She is inept at her job who folds at the first sign of decent business and is unable to differentiate who was waiting first. 2) She would rather I be a six foot blonde chic who has the hots for her. 3) She is a racist that would prefer to snub me albeit I have a history of tipping well. 4) Number one and three. 5) Number two and three. 6) All of the above. 7) She can't handle the pressure of working at a small neighbor bar solo. \n\nWhatever the answer is, it's ashame because I'm all for the neighborhood bar. \n\nMy last attempt was to purchase a $50 gift certificate for a friend who loves the place. I'm actually glad this chic saved me $50 by acting like a flustered nincompoop. \n\nAlright, I'm done. This place is too cool to totally abandon but I'm not giving this particular \"woman\"any more of my money.\n\nThanks for reading.", "business_id": "mgllPJA6NQXlJurFWAkqQg", "stars": 2, "date": "2014-12-23", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "JlCjjf4H8rs2_lkj7xWRZA", "review_id": "BW46E2-IDB29AbT5bbdBCw", "text": "The Dillo is easily one of the best bars in the Camelback Corridor, with a friendly staff, great drink specials and yummy snacks! \n\nI started going here when I moved into the area, and now I don't mind going anytime of the day! The day bartenders are always super friendly, as are the night bartenders. The food is delicious regardless of when you order it- my favorites are the fried pickles (frickles) and the buffalo mac n' cheese. \n\nIf you work in the 16th street area, don't forget to write the name of your establishment on your check so that you can be king of camelback!\n\nGo Aunt Chialda's! ;-)\n\nLove you Dillo!", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 4, "date": "2011-02-09", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "zQE0aulnd-gcfVw17HeULg", "review_id": "1vEpDhjnuQ548M2Agy4WVg", "text": "Good good ol' Armadillo Grill. It's been years since I used to frequent this place during my car biz days, back then I used to come here for their \"Armadillo Gold\" wings and CHEAP happy hour drink specials. This review will focus on my most recent experience here. \n\nI came here because I was looking for a reasonably priced healthy meal at 1 am, a virtually impossible combination to find at this time. And I got exactly that, a hearty blackened chicken salad with fresh greens topped with a generous amount of moist and savory chicken. It was very good, and for about $10 it's the only place I can think of that I can get a quality salad this late at night let alone for that price.\n\nIn addition to the food which is surprisingly good for a bar, they have very attentive and friendly service. I always leave 'dillo feeling well fed and like I got my money's worth. This establishment has made it's self synonymous with quality food and value in my book and earns a 4.5 from me.", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 4, "date": "2014-02-02", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "BHph9QBeSbNJh6eTj2ukhg", "review_id": "qCqr1RsWJClj858yIKhnfA", "text": "Wow...if you are looking for a great date bar to take a lady for a fine drink and want to set the mood....this place is definitly at the top of the list for me and you would be wise to place it on yours as well.  Super dark, swanky, candles, couches,great dj and some nites they have live acoustic.  If your date is not into you by the end of the evening at this place she never will be my man.  I am pretty sure if Tiger had a mistress in Phoenix and didnt want to be seen he would take her to Merc Bar.", "business_id": "peA3F-PnIfijYr8HuG-A-Q", "stars": 5, "date": "2009-12-24", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 0}, "user_id": "Ovpa3S8xD96dLE5eDxcxJg", "review_id": "q_zhwvbmz5EbapsZEQD9eA", "text": "Do you valet more often than not? Do people ever call you \"narcissistic\" or \"pretentious\"? Do you go at lengths to be sure people know that you are the wealthier than they are? If you answered yes to any of those questions, Capital Grill is where you should eat lunch tomorrow. \n\nThe wait staff is friendly and they all have exotic accents, but you can tell their jobs aren't easy. \"I said pink in the middle! Not charred, not red. Pink, you imbecile! I knew we should've brunched at the country club, dear.\" \n\nFood is good for those who can flip the bill but not nearly good enough to charge what they do.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 2, "date": "2007-02-07", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "qmnYXGG0OAFRofQgfFirqg", "review_id": "MS1KdvpvM5gm7RvJ2WrKLA", "text": "We arrived at 5:30 without a reservation the dining room was completely empty but, hostess insisted on seating us in the bar, even though we told her we were in a hurry with theater tickets waiting. We were seated at a dark table in the corner right next to another table where we could enjoy each others conversations whether we wanted to or not. Jarrid the waiter was in the weeds and continually ignored us the entire meal. Asking if we were ready to order and when we said yes, asked us to wait while he took our carafes back to the bar. He then proceeded to wait on the other 3 tables that arrived after us. Then came back and ask us if we were ready to order again. The food deliverer brought the dinner but, there wasn't a steak knife. After 10 minutes I was able to flag down a bus boy and he got a knife. When Jarrid did return we were through with our meal and we asked for the check. He said what no dessert and we said no, we are in a hurry headed to the theater. 15 minutes later we flagged the busboy down to get us a check. Jarrid did pickup the check with my credit card and we explained again we were in a hurry, but again we had to wait. Another 15 minutes roll by still no Jarrid, finally with no choice but to get up and find him so we could leave. On departure we noticed only half the marquee sign was lit. The food was delicious but the dining experience a large disappointment at every turn. I was with a date who had never been to Capital Grill and we will not return.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 1, "date": "2012-02-19", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "RiOXLgH3uRGoOD6MNC2k3A", "review_id": "GYy6nBuOODyrqLUSMOA40A", "text": "Great food, ate here earlier, kind of pricey for my wallet, but tasty as can be :)", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 4, "date": "2014-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7j6VVJ9vbKW1spFNvYyb2Q", "review_id": "1-8tBd1jS8JgynN603rxCQ", "text": "Best steaks ever!! The best service ever!! The beat cheesecake I really liked this place the only little thing that bothered me was how rude two of the bartenders were but the rest of the staff great", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2015-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bp-ww5tH22JDEuj0o3WisA", "review_id": "ECDiVK1w9njUuVue6814-w", "text": "We visited here a couple of weeks ago, and I have to say that the food was really good. What absolutely killed it for us, to this point that we will not be back, is the service. HORRIBLE!! The waitress that we had, had zero personality, and was down right rude. She was not attentive at all to our needs, and was more concerned about the other tables around us. When I brought this to her attention, she was literally argumentative. \"Sir, I have refilled your drink, what more do you want?\" That is a direct quote. I said, \"wow, you are very rude, and combative as well, great service!\" Off to the manager we went, who at first seemed apologetic, but then changed her tune, saying that she was a great waitress, and that we should come back in a give her another try....WHAT???? Are you kidding me!!! Not only will we not try her again, we will not try them again. Your food may be on point, and delicious, but if your service/attitude is horrible, then its truly pointless!\nAVOID THIS PLACE!!", "business_id": "rVUEZpHQfWI_3kt0lBwaxQ", "stars": 1, "date": "2015-02-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wUEp87FqOB9ew27Iz6zk_w", "review_id": "dqLJqNCi7oroiERX3oZd9g", "text": "The food here is good, not phenomenal.  The service is great.  But that still doesn't make me want to come back considering the prices.\n\nI came for a special lunch, so we had the back room to ourselves and a special pre-set menu.  For my entree I ordered the pasta sampler.  I had never tried gnocchi, but I loved it.  The other pastas that came on my plate were just so-so.\n\nThe best part of our meal was the service.  The waiter was very friendly and attentive and willing to accomodate people's requests.\n\nSadly, I can't imagine coming back here because our bill came out close to $85/person (although admittedly we did have two drinks each).", "business_id": "vvA3fbps4F9nGlAEYKk_sA", "stars": 3, "date": "2013-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5Td84D4oDkkgxsMeqcrTRw", "review_id": "CQKTi7Ufiu1qAR6DzAHw1w", "text": "Went with another couple and you would of thought we had a disease or something.  Just wasn't couple friendly at all.  Drinks were not worth what you paid for them $20 for a beer and mixed drink in a SMALL glass.  I guess you get what you pay for. We paid $10 a person for the privilege of being snubbed.  Dancers if you want to earn money act like you want to be there and see everyone not just those you think you will make more money. I've been to better strip clubs and will make sure to take my business there.", "business_id": "aToxIssFRGDGsTV4yJ9qbg", "stars": 2, "date": "2012-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "lhvFynuv5pyc4XdFNebqGg", "review_id": "-k-RUuE0DbNkZygQxlbJow", "text": "I love this place!  It's a fun place to sit and relax and sip a glass of vino.  Be sure to order the bruschetta...I especially love the figs and prosciutto.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2006-12-11", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "4sIK_74UwkKU9YQXIfgCdg", "review_id": "UW3BRZX7D00q735OGYCUqg", "text": "This is my kind of place.  I used to really enjoy going to Sakowitz years ago and having lavosh and cheese in the midst of my shopping.  I can do this at Postino.  There is a sense of the quiet and the casual where a man (or woman) can sit back, have most pleasant snacks, and let the world go by.  I have found places like this on the coast and am happy to find one like it in Phoenix.  I wouldn't go here for a \"full blown\" meal but it wouldn't be the place it is if I were going to.\n\nIn the hustle and bustle of today's world, Postino can provide you a welcome retreat.  It is needed.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2009-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wsf6MhOr2x7dlJx5lAavOg", "review_id": "IG9M7InyNmHI-Vh__JiOIQ", "text": "Wow, $20 for a bottle of wine and bruschetta is an awesome deal.  (Mon and Tues nights)  The wait was long and it was loud inside, but the night was still very enjoyable.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2010-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8oY8gmr4NYwHgiYjTjh7Rw", "review_id": "d3PgsaUFZWUXLKTVjZVP-Q", "text": "Postino - $5 pitcher's of Odell IPA.   What more needs be said?\n\nA great reuse of a 1950's post office with a perfect menu while enjoying a glass of wine or the aforementioned pitcher of beer.  My wife and I lingered her over two lunches on a recent vacation and even stopped by for a quick drink on the way to the airport; couldn't get enough of this place's charm.\n\nThe bonus is its location - across from La Grande Orange Bakery which is also super cool and Radio Milano across the street.  Anyone living in this neighborhood better realize how lucky they are.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2010-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "U39epgGUi4PD27rshctSWg", "review_id": "kzBnmbkECdVa-tVd5j0MYw", "text": "Great ambiance! Perfect for a girls get together or a romantic date....The Monday and Tuesday night special is a MUST!  The $20 special includes a bottle of wine (your choice) and 2 bruschetta boards! It's amazingly delicious!!! What a great deal, great food, and great surroundings!!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2011-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4rIgZlwv3WQifoXwcFGcfg", "review_id": "wFRmUnUPsDuRQ5986G_-nQ", "text": "My favorite place by far and well worth the drive from Gilbert. Love the atmosphere, bruschetta, and of course the wine. Great place to catch up with friends. I can't wait for the location in Gilbert to open up.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2011-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ad4bqFpq5C_DCwPkvlS2NA", "review_id": "OsaufG0JVtufUcc5i8_yUQ", "text": "I have not located a better place to drink wine and enjoy bruschetta anywhere else in the world.  The food and wine selection are fantastic and the staff keep if flowing!!!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2012-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aRlggQmKdaC8K9yAMuFGJA", "review_id": "9olQudAlNwdczc3UgLHyMQ", "text": "I cannot even begin to say enough great things about Postinos! Great food (try the artichoke bruchetta...yummy) , great service, great prices, and a wonderful atmosphere! If you haven't been there, you are missing out!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2013-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1_5zcj-nV18IU700y2kMEQ", "review_id": "q8-tmR-wokOvORITlJ2oag", "text": "Great wine specials! Sunday's $5 glasses of wine and their Monday & Tuesday special of bruschetta and a bottle of wine for $20 is amazing! It does get busy so don't go if you're in a hurry but it is worth a try.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2013-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TEGWADXt1VA1832jbVtSqA", "review_id": "3wZLPwEnq_6PsgcaB1V8Gw", "text": "I love the atmosphere and the food. Not a fan of beer or wine as my only options. And I hate forced valet parking. If it weren't for the forced valet parking I would visit more often.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2014-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "xBqJD_QkZbxu6DDXWWGKBw", "review_id": "GakxyPlH8QQrv3FWnVrSgA", "text": "The bruschetta was good as always, but the artichoke and bean dips were blah and the bread was hard enough to tear up my mouth. We asked for softer French bread they say sure and brought us 3 slices! When asked for more they brought us a bowl of the hard stuff, it was quite frustrating since the service overall was bad for us. We had a server who left right after taking our initial drink order and no new server took us on. We had to flag someone new every time we needed or wanted something since no one came to check on us and that was including our food order.  I plan to stick to the one in central from now on. I've always had excellent service there.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 2, "date": "2014-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sdifiZFO5wPX3I9dkaMuFA", "review_id": "baaZSZNRLcplJJLW_UDIiQ", "text": "Love, love, love the  Bruschetta !!!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2015-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "474gZer4_3IxqOpirild1w", "review_id": "NQtIgcsqTGrEnm6XF0iIXQ", "text": "JT's effin rocks.  All the food is very good, great tasting bar food at it's best but the thing you have to get is the wings.  These are the best wings in town, bar none!  They are flavorful and addictive!", "business_id": "qz4ZOcv-840UjfCEYI4qZg", "stars": 4, "date": "2012-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HHzkQKGS8Jm8_7CObRty5A", "review_id": "FllbfQFFMTXlXMnRtNi_0w", "text": "Cool bar, fun crowd, horrible service.  I paid $25 for 4 drinks which is awesome, but cheap drinks comes at the price at bartenders who were slow to customers and smartass about that.  Every bar has a different appeal, but bad service ruins it for me.", "business_id": "4vZZjr6IZAk4riT0DB8MbQ", "stars": 2, "date": "2014-12-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "N1koTSTyiLCD8zH0rHSh4w", "review_id": "FKrQyP-BE8MT5P8wFL6j8g", "text": "Yeah for Dive Bars! A good Dive Bar to me is one where you can come in and feel completely at ease no matter who you are or what you are wearing. The bartender is super relaxed but helpful and can make a mean cocktail. The lighting is dark and moody and the jukebox has good tunes.\n\nDizzy's is pretty much a solid bet on all these items except for all the damn country music that some patrons think is listenable.", "business_id": "tC_T3DykMOlLV4p7iiRDWw", "stars": 4, "date": "2010-01-14", "type": "review"}
{"votes": {"funny": 5, "useful": 1, "cool": 0}, "user_id": "X6GycoLMzQaocXBANVnB4Q", "review_id": "DURrskdKrHUjbvOlYxOnXA", "text": "This is a really, really generic neighborhood sports bar. They have generic bar food, generic drinks, and generic drink specials. They have poker nights several nights a week that bring out... well, just the kind of crowd you expect at a neighborhood sports bar poker night.\n\nThe only reason I'm taking the effort to write this review is to mention their hot wings. They used to have an \"atomic\" wing challenge, where you would sign a liability waiver then have to eat a dozen extremely hot wings. If you could eat all of them you would receive a shirt and your picture on the wall. Last time I was in Sports Peppers all of the pictures were off the wall and the atomic wing challenge was gone, but I believe their hottest wings are still just as spicy.\n\nSince the wings still exist and I did their old atomic wing challenge, let me explain to you how hot the wings were for anyone crazy like me who wants to test their manhood. Let me say beforehand that I can eat a ton of spicy foods. Suicide wings at most every place around town are not a problem to eat. They are enjoyable and do not resemble a challenge or anything too spicy. I figured this \"challenge\" would be easy. It was not.\n\nWhen the plate arrived, the fumes launched a barbaric attack on my nose. I cringed knowing what I might be in for. But hey, any loser cook can make wings smell hot. Actually making them hot is something different. I took the first bite. No sweat. I made a sarcastic remark to my friends, thinking about how awesome I am, probably something along the lines of, \"This shit is a joke. Too easy.\" Well, like most really hot foods, these wings take awhile before they really hit you. When they do hit, have some fucking milk nearby. \n\nSooner or later I finished all of the wings. I was victorious. Except for a couple of things. First of all, my mouth was numb. I drooled on myself a couple of times. My eyes were watering. When I got home, I lived in the bathroom for awhile and produced some utterly vile waste. To be honest, I don't think I ate wings for ~6 months after this challenge. This little sports bar taught me that I'm not the spicy food god I thought I was. You win, Sports Peppers.\n\nOh, to the guy who looks like Jesus and had the 1st place record for eating some absurd amount of these (100 maybe?): bravo, sir.", "business_id": "cTyBfWfmgL3vgRetyfmtyA", "stars": 3, "date": "2009-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JrDbIXQ7X_NTd7-V75KEFA", "review_id": "2wGZOs9RULMpIaFoOiTmAQ", "text": "The location is in a strip mall, but this place is a diamond in the rough.  The food was some of the best italian food I have had anywhere.  I live in Kansas City, which has a pretty large and long standing italian populaiton.  The food is a good as any of the old italian places in KC.  Everyone in my group was amazed at the quality of the food for the price.  I will keep this one on my list of places to come back to when I am in AZ again.", "business_id": "jq_YnMQjcArdBWuwRospFg", "stars": 5, "date": "2009-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "csdw8jhu_pGX8R0ts0kINA", "review_id": "nF_H94Lx8VFbDY-L0pl32g", "text": "Came in on a Sunday. No cover until 9pm so I said why not. Their drink special was pretty awesome, best deal I've heard so far. $3 for bottles, $4 for any draft. This place is pretty neat, nicely lit, dancers were C+. However, this place was far too small for me and the layout could have been better. You're pretty packed together and the TVs/bar is on the opposite side of the main stage. Other than that it's a great spot for a small group (2-4 people), any larger and you'd pretty much fill up 1/3 of the place. Also, dances were $10, VIP was $20.", "business_id": "e6i8v7VkD8yJk02PH4d9VA", "stars": 3, "date": "2013-12-29", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "N1Fuak5n6mjqFoNa_LgrxQ", "review_id": "Eufk6iavkmvE1WhvK7gPvQ", "text": "Every neighborhood should have a tiki/beach themed dive located in the non-descript strip mall on the corner.\n\nA locals place for sure, but as an out of towner I felt totally comfortable here knocking back a few brews and shooting a few games of pool.\n\n2 beers were only $5.50 (I think).", "business_id": "gVgJIBQDXHtgIS7p7uDa6Q", "stars": 4, "date": "2013-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dx8caQLlg6Zo3decSnS4NQ", "review_id": "TwSAYkVSbPFgfa0ZVn2k4Q", "text": "This is a great place for amazing food and an awesome staff. Even the owners take time to say hi and check on their guests. I had the shrimp and grits and I will definitely order it again.", "business_id": "vFJmFFfPVhHkC3bWOeZnNA", "stars": 5, "date": "2015-01-17", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "H50yHk8E8MSB54VarKQFtA", "review_id": "Qt0lxMUHcLOTGDVmrxeXvg", "text": "I really don't know what people see in this place. One thing, it does have that old crusty bar feel. We went as a group for drinks and food. The initial drink service was pretty quick and the experience diminished from there. I ordered one of the starred items off the menu, the Reuben. Three words best describe the sandwich ... greasy and tough! Another person at the table ordered chicken fingers, they were so dry she only ate half of one. The last person at our table had a cheese quesadilla, it was cold and looked like it had been microwaved.  The astonishing thing, the waitress actually pocketed my change from my food order.  They do like their regulars though and seem to treat them well. I can't say I would recommend going unless you are dying to find a karaoke bar.  I know I won't be going back any time soon. Actually, the sandwich I ate didn't sit very well with me either.", "business_id": "-xLwGUmmyKgsTtFOOXzjeg", "stars": 1, "date": "2012-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "qAAANTz5PrJ77oWK85bipQ", "review_id": "2RitvU6jVBeN-WDowme0kg", "text": "Jennifer and Hannah made our night!\n\nI love small neighborhood bars.  Jennifer and Hannah were so accomdating and friendly.  I felt right at home.\n\nA fun time was had by all.  I'll definately be back!", "business_id": "1rOQVIlUlLBcf1EDj_n4Vw", "stars": 5, "date": "2011-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "lBMCBwbAhfgb5oKqilA7CA", "review_id": "k2rzCl5pvTWx-Ox2uPUpAg", "text": "Went to Bobby C's this weekend as a stop on a Light Rail Pub Crawl. The bar was very cozy on the inside and had live jazz playing. It was my first visit and I would definitely like to go back and spend more time listening to the music and having a couple of drinks.  The only reason this bar lost a couple of stars in my rating because the beers were kind of pricey, $4 for a bottle of Miller Light seems high in my opinion and the bar tender seemed to be miffed by our arrival. Maybe we just got him on an off day.", "business_id": "RKOS92ptLgEU3BUNMtDHrw", "stars": 3, "date": "2010-01-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "J5nb9AT1LDiGN4_hY0Au8Q", "review_id": "HD4qbc-7eGyXAUYnXdb0Sg", "text": "The Good: We absolutely love their wings and its becoming a regular for us to go every other Tuesday for their wing deal. We always get the honey hot wings and share a side of either regular fries or the loaded fries.\n\nThe Bad: I do feel the wings are a bit too pricey, even on the deal days. Also, what is up with their high school hostesses!? They are incredibly rude and give dirty looks every single time we have gone, which is now around 7 times. Someone really needs to put these girls in check. Goodness. This is the reason for 3 stars instead of 4. I would actually give it 3.5 stars if I could.\n\nWe like the atmosphere and it always seems clean and the servers have been very nice so far.", "business_id": "SgGINtDKQgoXoAnQgrDKDg", "stars": 3, "date": "2012-12-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "f4KaaYA_eEtn19QVqd9sgA", "review_id": "pkFht8NdrDqc4iJZ9LXfcg", "text": "It's kind of hidden in a small strip mall, but isn't everything in Phoenix?  It's a very comfortable place to go with friends and family for a glass (or three) of wine and some simple food.  Really nice selection of wine to drink and to buy and the wine menu changes often.  My husband and I usually just have the pizza, but lately we've been adventuring on to other items like the bruschetta.  They have wine tastings every week I believe and often have wine and food specials.  For most of last summer they offered every glass of wine for only $5.  This was a fantastic deal and we came back often for it.  The back patio is so nice with views of the golf course.  Inside there are tables and couch areas, so you have options for what's comfortable for you.  \n\nWe use to live in Tempe, but we'd still make the trek over to My Wine Cellar/Lucy's Place.  When we decided to move to Ahwatukee, we were so excited to find a home so close to My Wine Cellar.", "business_id": "Our6bzte5W1wlIeOu9luug", "stars": 4, "date": "2010-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "NjRbV1XCodXHEzdYtHBRAQ", "review_id": "_ZOPDr5RexGlECI8gH5XMA", "text": "This place is perfect for a date night! Happy hour includes some yummy apps (my fave is the bruschetta) and discounted glasses of wine. There's space to sit at the bar, high top tables, as well as booths. I suggest going on the nights where there is live music to fully enjoy the experience. The servers are friendly and knowledgeable and there is absolutely nothing pretentious about this wine bar. Go try it out!", "business_id": "Our6bzte5W1wlIeOu9luug", "stars": 4, "date": "2013-12-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "vWCksqJJfYjGGdD-yb9qGA", "review_id": "dILi7aIE3PZXpRWQ1OjALQ", "text": "Unexciting, bland and expensive! \nService was good, if somewhat snobbish. \nFood was nothing special run of the mill bland Italian fair.\n\nAll in all its probably not worth it. Especially for someone like myself who is really not Italian fan. \n\n\"I no like\"\n\nEugene", "business_id": "S3FhtwXuiGMlGdBNtmiiSQ", "stars": 3, "date": "2008-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QsgNEYXnlvXQnFJOEAWMWg", "review_id": "VWSiiGyZcyxJVAIOhpRx7g", "text": "Sad they closed down the one at Paradise Valley Mall area but I get it, this one is just a couple miles north. \nLOVE ISLANDS! BEST BURGER - Hawaiian, best fries anywhere and best ranch. Lol they cut their fries fresh everyday, make their own salsa and marinate their own chicken. They also make their own ranch. Delicious ! Yum yum yum. Can't get a better burger anywhere else. Juicy flavorful and the bun (whole wheat) is divine.", "business_id": "e0vubCKi8KD8zC2C6FdbuQ", "stars": 5, "date": "2015-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sV92jHf2jFT025UluLCKNA", "review_id": "m4LIyfl2FqlWGGkbz7au0g", "text": "I visited the Elephant Bar Restaurant with some friends. It was my first visit, but will not be my last. The food menu was extensive and prices were very fair. I even had to take a portion of my meal home as it was very large portions. I give the food 5 stars.\nThe drinks werer very good and the service was very good as well.\n\nI highly recommend this restaurant; it is on my all time favorite list.\n\nFIVE STARS+++", "business_id": "QzXFdjIbFRGhzL83goPPLA", "stars": 5, "date": "2011-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LA0VFYinaFtynZMjEWqq7A", "review_id": "4ZisllkP089pO9Ya9-MSsw", "text": "I love Legand's bar! It is my favorite place to eat.  We always get great food and service. Even though it is a bar, the TV's aren't over barring, so you can still have a conversation with out yelling while enjoying a meal.  We take our little ones, and they love the cheese balls!", "business_id": "d-rZazFFYvnjRZUhLTEUZg", "stars": 5, "date": "2012-01-03", "type": "review"}
