{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dnblJf2bPOkkCNv-GLpeEg", "review_id": "ImCCbzFZf6-iSr0GiXAooQ", "text": "I ate a delicious hot smoked Scottish salmon pasta dish here. I really enjoyed it as a lovely way to taste some Scottish cuisine! \n\nThe dish included asparagus and artichokes, drizzled with a rich tasting balsamic vinegar. It was sprinkled with cheese too which was nice but would have been handy to know in advance as I'm not supposed to be eating dairy. \n\nOverall a delicious, huge portion that id recommend! \n\nThe staff were friendly but the service was a little slow and we had to seek their assistance twice to hurry up our order and pay for our food as we were under a bit of time pressure.\n\nA nice pub with a good bistro located closed to Waverly train station, so very handy!", "business_id": "aFVO6hoFlOCN8pKsmJbWjw", "stars": 4, "date": "2015-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "YlpzPPySUxJsUJHRyRde8A", "review_id": "rmICPEOInGPNN9qfAf-2xg", "text": "it's a birthday, and he wants to party like it's his birthday. So where do you take 11 people in the depth of Christmas party-season when this should have been booked back in May?\n\nWell, hurrah for Yelp, hurrah for online bookings (taking the painfullest of painful 'room for 11 people? No? Ok. Next! discussions out of the pain) and helped me narrow down the available restaurants according to the Silent Reviewer's specifications down to um, The Doric. So, our options were relatively limited, but it was such a good thing, in this case. It was a cold, miserable December night, the pub downstairs was heaving, the restaurant upstairs the same. But, all the meals were great, service was pretty damn prompt, with nary a person left without a drink too long, and our meals were all served together. With a big group, it's often that this fails, especially in the catering style poor quality party food that makes an appearance. Not here, and in fact, there was a non-festive menu still available to choose from that just made my heart sing - all too often the Silent Reviewer is left with turkey as his birthday meal option year after year. The fact he chose it anyway made it his choice rather than mandatory. \n\nSo good we're going back with another big birthday group - see you soon The Doric, see you soon.", "business_id": "aFVO6hoFlOCN8pKsmJbWjw", "stars": 4, "date": "2015-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "-nvivF0jSExZDSwEUcqo3A", "review_id": "WJH6GznHmNjrx1WNwT1h5Q", "text": "Just had a surprisingly delightful dinner here tonight and I didn't even know this is actually the oldest gastropub in Edinburgh! So it's also a place of historical significance!\n\nFOOD/DRINKS- haggis Bon bons: crispy and steaming hot when cut open, served nicely with mashed turnips, straw potatoes, cream fraiche and a light salad. It was delicious. Prawns & chorizo: served with fresh bread, prawns taste shrimpy and fresh while chorizo bits are spicy with a kick. The chorizo was a bit salty, but was perfect with the bread. Mulled wine was delicious and warmed my soul.\n\nAMBIANCE/DECOR- small restaurant with some bar counter seating, dimly lit, but not loud. Good for romantic date, casual dinner, and even an interview over dinner (like the two men to the table next of me tonight). The room was decorated with paintings and tables with candles. \n\nSERVICE/STAFF- hit or miss. One staff was super friendly/helpful while the other one was only average and seemed a bit anxious/stressed out. When I entered the place downstairs into the bar section, the bartender saw me but ignored me. Good thing I figured it out soon enough...when I saw the door to the 'bistro' that I just walk upstairs! \n\nOverall, I had a very pleasant experience and the food/mulled wine that I had was very enjoyable. I like the atmosphere and want to go back to try their other drinks and food items. Would recommend!", "business_id": "aFVO6hoFlOCN8pKsmJbWjw", "stars": 4, "date": "2015-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RyZbKX6MLz5i7XE5f0_nww", "review_id": "hbFNb3qiZsxcjcYKrPNPbw", "text": "Great pub near the train station. They had yummy food and an awesome extensive beer list. I had the fish and chips then used the beer list to start exploring Scottish craft beer. Will come again when using the Edinburgh train station.", "business_id": "aFVO6hoFlOCN8pKsmJbWjw", "stars": 4, "date": "2015-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gSIuZh1tOSu4oH3YQ3UtQQ", "review_id": "-iLpE4ZcC2icaZHfdOSf0Q", "text": "This was my favorite place to eat/drink on our 2 week long honeymoon. The food was absolutely incredible, and I wanted to come here every day after.", "business_id": "aFVO6hoFlOCN8pKsmJbWjw", "stars": 5, "date": "2015-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B9p4cnBr3YPedWA8Gh104Q", "review_id": "QqBPbKgXJCBHyn3Pws0jhQ", "text": "Recently had a refurb and looks good for it. Cheap drinks and food although not great was decent for whatt we paid. Bar is quite easily filled and you will have too wait on a table at times but given it's location this is acceptable.", "business_id": "2LZtHTbbN5xA3PcPzFsXlQ", "stars": 4, "date": "2010-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "BFLcP58Al9gvBxjQ0SFxUw", "review_id": "Z5g7O9cur49D45iGluQVoA", "text": "Cozy place to pop in for a drink and a simple bite, not far from the main downtown attractions of the city. Nothing amazing on the menu, but lots of choices so should please everyone. Filled with a nice mix of people the night I was there, and staff were friendly and helpful. Not somewhere I'd seek out again, but I might stop by if I were in the neighborhood and thirsty.", "business_id": "2LZtHTbbN5xA3PcPzFsXlQ", "stars": 3, "date": "2011-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "g2Ac1IZUqQuxa0_uG8-Cbw", "review_id": "a9sl_A_yUn1aYP_IQjFjFg", "text": "Great food - had to try the Haggis as I was visiting Scotland for the first time.  It was outstanding!  Mom had a chicken dish that was also fantastic.  \n\nVery cute pub with a lovely atmosphere.\n\n4 stars because the wait was longer than expected with no place to stand or get out of the way.", "business_id": "2LZtHTbbN5xA3PcPzFsXlQ", "stars": 4, "date": "2011-01-19", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "z3XT1sdx9-IZxMsNuivRUQ", "review_id": "A_Q9lDp2FNXJEqzANWw-fg", "text": "A great place to stumble into if you're trying to escape the morning rain (and in our case, to recover from a long coach trip). The atmosphere is quite cozy for a pub, and the Arthur Conan Doyle/Sherlock Holmes decor is an added bonus. It felt very authentic all around. I indulged in the traditional Scottish breakfast with apple juice, which ended up being a bit much -- hello, food coma -- but it was all great.", "business_id": "2LZtHTbbN5xA3PcPzFsXlQ", "stars": 4, "date": "2011-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0-SZCLONHQvilp7Ezht9Ew", "review_id": "XMvWJkLdsM962TC-6FkVFQ", "text": "Located near enough to the bus station for one last pint before leaving town.  The staff was friendly and the clientele were fun.  Great interior!  I'd definitely return.", "business_id": "2LZtHTbbN5xA3PcPzFsXlQ", "stars": 4, "date": "2012-02-29", "type": "review"}
{"votes": {"funny": 5, "useful": 1, "cool": 0}, "user_id": "xd2g1JwHOQa4E7CSAlwCsw", "review_id": "oB6LWeOm_s7julU9rg6mRw", "text": "Such a disappointment.  Last Friday at 11.45pm they sold me a beer, and 10 minutes later waitress with fake smile is telling me \"sorry we are closing\"... but... but... earlier I've cheeked on Yelp... and on Friday should be open till 1.00am... and in this moment I've noticed little pain in my stomach, wasn't strong but squeezing my belly... like during the watching a sad movie, you see incredible unfairness, poor child is dying or... or... two lovers... and she's dying and was so pretty and innocent... and guy is screaming terribly \"Nooooo! Why?!\"... and you don't know why?... and you can do nothing, feeling powerless and extremely sad... your chin is starting to shake, tears are fulfilling eyes.... such a injustice... \nThis is how I was feeling last Friday... never again!!!", "business_id": "2LZtHTbbN5xA3PcPzFsXlQ", "stars": 2, "date": "2013-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FzwQDx7Ia3GxKJjUpRbAbw", "review_id": "xXGRlEDAx1BRvJqCp32npQ", "text": "The bartender here made our experience! She was so friendly and was able to give my mother and I several restaurant recommendations. They have Aspall Cider on tap, which I absolutely fell in love with and have since had shipped to my house in the US!", "business_id": "2LZtHTbbN5xA3PcPzFsXlQ", "stars": 5, "date": "2015-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B9p4cnBr3YPedWA8Gh104Q", "review_id": "xjRTwLT9-Kvv3BmKWPzB3Q", "text": "Live music bar next to Royal Mile in Edinburgh. Drinks are very cheap at certain times of the day and has a good mixture of people not just youngsters. Hard to find a seat but then again who wants to sit when a bands playing anyways. As mentioned before it is open late 7 days a week , we normally go there before we head into town.", "business_id": "XeX67II3LlNJ49-sg4gDig", "stars": 4, "date": "2010-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "PpyAxHW6S2R1eiAuKdxqUA", "review_id": "9bcar__3in3Nqa4lKS7YkQ", "text": "We went here at the recommendation of some locals. It was the only place they could think of when we asked some random people on the street where we could find some drinks and live music.\n\nIt was an interesting band. Sort of classic rock style. Decent sized crowd. We were able to sit ourselves down in one of the nooks with a couch. Unfortunately this meant we couldn't see the band, but it was quite loud so we had no trouble hearing it.\n\nHonestly, as a college group from America, every single place we went had very nice and helpful locals who were super chill and cool. We made some awesome friends with other people that wanted to party. Not here. Just being foreigners almost got us into a fight. There were quite a few older blokes. Guys pushing 40 or 50 who were trying to impress the ladies. They were not at all happy with us moving in on their turf. A couple of older drunken gents wanted to \"step outside\" when we danced with some college aged girls they apparently thought they owned the rights to.\n\nThings at the bar were like this too. When we went up to the bar and asked what beers and whiskeys they had that were Scottish (I mean we didn't go overseas to drink Bud Light) some guys in line behind us got super mad and grumbled under their breath about \"stupid Americans holding up the queue\".\n\nNo cover charge, and drink prices were reasonable by American club standards. The service was pretty quick and the bartenders were friendly. We took off and went elsewhere. Couldn't find live bands anywhere else, but we didn't feel welcome here.", "business_id": "XeX67II3LlNJ49-sg4gDig", "stars": 3, "date": "2014-01-16", "type": "review"}
{"votes": {"funny": 5, "useful": 5, "cool": 6}, "user_id": "k5zGEHC3C7AC6gxIGOdSmw", "review_id": "IuVhfE81bVyPhAbwvZNYJA", "text": "We were led to Whistle Binkies by our illustrious tour guide from the Black Bull.  Whistle Binkies boasts some live music and cheap drink specials.  There was a packed crowd while we were there and I barely found a place to stand while my friends ordered drinks.  When you're walking around Edinburgh layered up in your warmest threads, walking into a stuffy, warm bar can really mess with you.  You start taking off your layers with nowhere to stash your coats, scarves, gloves, and hats.  People started piling them on top of the ATM!  \n\nI found a small table by the entrance and perched there.  There were some interesting folk milling about, locals and tourists alike.  I met some nice Brazilians while just hanging out.  I had a drink and we left shortly after as it was getting late.  It's fun if you start the night out here, not so if you end it there.  They are open til 3 am.  We left and caught a cab back to our hotel.", "business_id": "XeX67II3LlNJ49-sg4gDig", "stars": 3, "date": "2015-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ns9GTbUxCOYo3NIDmLIaqw", "review_id": "ViL0fFaM6f7y5Mf_0DkK7A", "text": "Made a reservation here for New Years Eve before heading out to Hogmanay.  While the bar seems like a cool place to grab  a pint or a glass of wine, I wasn't blow away with the restaurant.  The menu was fairly standard for Scotland (pork belly, steak pie, fish and chips, a few soups, etc.), and it was OK.  However, I was expecting a bit more selection from the wine list, and the waiter didn't have much knowledge of the wines at all.  The service was polite and pleasant, but not great.  For the price, this is a reasonable place, however I would keep to lunch and the bar, and skip it for dinner.", "business_id": "QXUzUvUp8_sCDzp7f4_ToQ", "stars": 3, "date": "2013-01-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "ifkTViV_buOHEigExzEVRQ", "review_id": "HcqXn9VQQymO6MWHwIH_2Q", "text": "I'd always really thought of Whighams of a place for after work drinks rather than a restaurant but having recently dinned here I was pleasantly surprised at how well both elements of the place work together. \n\nThe sunken alcoves, that I'm assuming previously held wine barrels when it actually was a wine cellar, have a lovely cosy feel to them which is great if you have one to yourself. Sharing one with complete strangers however can feel a little awkward depending on your company as the music and chatter of the bar is really subdued in the little alcoves, so they can hear everything you're talking about. (Thankfully I've usually been sitting with a loud, exuberant group who's rowdiness tended to scare off anyone foolish enough to try and sit with us.) As you would expect the place has a good wine list and also provides a very nice list of cocktails. If the weather is nice there is also a teeny tiny beer garden that you can sit it, though it is usually full of smokers.\n\n The restaurant area is separated off a little from the main bar so it's not quite in the thick of things, though I wouldn't really want to eat here in the evenings on a weekend given how busy the bar gets. On the Wednesday I came in here for food the place was quite quiet and my friend and I got tucked away in a nice wee corner away from the hubbub of the bar. Seafood seems to be a speciality here with lots of fresh and enticing options on the menu. I opted for mussels while my friend had some oysters followed up with langoustines and pasta for mains. The food is lovely and it was nice to find a decent seafood restaurant outside of Leith. I'll probably stick to drinking here as opposed to eating but it's a lovely place to spend some time if you're in the West End.", "business_id": "QXUzUvUp8_sCDzp7f4_ToQ", "stars": 4, "date": "2013-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M4MVVzNPZHiJdnNvWjL8VQ", "review_id": "WWKe8Ulamsl162BQAHZiZA", "text": "Like many bars on Easter Road this place probably gets the bulk of its custom on match days but you'll still find a number of regulars in on weekend nights. No real ales but a largely untouched interior so its character makes up for that and there's McEwan's as a stop gap.", "business_id": "NXsVHhf1WBhjNPCVlT4dEw", "stars": 3, "date": "2015-12-15", "type": "review"}
{"votes": {"funny": 5, "useful": 3, "cool": 4}, "user_id": "3w1Zjz2DYWfFTv54yeWd0w", "review_id": "0Ek3shp4AcAnzrhPgFqPSA", "text": "This is the residence of Queen when she is visiting Scotland. I walked here from near Edinburgh Castle. It was a nice walk. The grounds are beautiful, and their are tons of cool statues to look at. I wanted to walk up the hill and have a hike but I was too tired and wearing suede boots that I didn't want to muddy. I definitely recommend seeing this as part of your Edinburgh experience.\n\nMinus one star for not being allowed to go into the castle and take a nap on the Queen's bed and use her bathroom.", "business_id": "F1-S8DkAsFIyrkfTl9MmlA", "stars": 4, "date": "2009-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Se2xketFzRCKj_oe89pWog", "review_id": "QfGj4aPaUhi9D4MMFtGatQ", "text": "If I wasn't being watched, I would have skipped with glee. This place was awesome! No Photos rule on the inside, but the Gardens are a okay. \n\nOh the gardens. Best view of Arthur's Seat! \n\nYou have to go! Even if its just for the gardens. And the price of admission is a yearly pass, just make sure you get it stamped and signed.", "business_id": "F1-S8DkAsFIyrkfTl9MmlA", "stars": 4, "date": "2012-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "OSlyqHBxGVI4HHDlOsCWGg", "review_id": "RAYrnaMRTCKeNhEYVuD2ag", "text": "Es mi palacio favorito!! \nEs en donde la reina de UK pasa los veranos cuando va de visita a Escocia. Queda en la otra punta de la Royal mile, que sale desde el Edinburgh Castle.\n\nEl palacio es tranqui en cuando a decoración. No permiten sacar fotos en el interior, pero lo más genial que tiene es que está lleno de cositas que pertenecieron a la monarquía y se pueden ver en vitrinas desparramadas por todas las salas.\n\nTambién podés visitar las habitaciones de Mary queen of scotts y ver el lugar en donde su marido le mató al secretario una noche que cayó medio sacado. \n\nEl recorrido es unidireccional así que salís por una abadía que está en ruinas y después se pueden ver los jardines de la reina que sólo están abiertos durante el verano.\n\nEn vez de terminar la visita en el gift shop, la visita concluye en una sala con una mini muestra de fotos de la familia real, muy muy linda.", "business_id": "F1-S8DkAsFIyrkfTl9MmlA", "stars": 5, "date": "2014-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fP2odq2PCBTsCNnidbkTmQ", "review_id": "vMaetcW8Dv6RqXwDnTDHMg", "text": "Great historic walk with free audio tour!\n\nThis walk costs about £12 and it comes with a FREE audio tour which really makes it informative! \n\nThe walk includes a tour of the Palace, and the gardens (during summer months) \n\nThere is a as always a gift shop selling highly inflated gifts. \n\nAlso a nice cafe that I really enjoyed.", "business_id": "F1-S8DkAsFIyrkfTl9MmlA", "stars": 5, "date": "2015-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FzwQDx7Ia3GxKJjUpRbAbw", "review_id": "hZBsvWDrLp6p0hZWFgu5zA", "text": "If you love history, you will love touring the Palace! You will be able to see everything from Mary Queen of Scots chambers to the Holyrood Abby Church. Best of all, your ticket is good for entrance for the rest of the year!", "business_id": "F1-S8DkAsFIyrkfTl9MmlA", "stars": 5, "date": "2015-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-uySe6UQyAnl-T_BBxuJWA", "review_id": "JpvBl_6NRkwHm3FdwDiZaA", "text": "I ended up here randomly after walking aimlessly for a bit.  To be fair, I knew I was ending up near the parliament buildings and the palace, I just hadn't planned on going in to either.\n\nGlad I went in.  Took the audio tour and there was lots of good information, both about the building and historical figures.  I had forgotten about Mary Queen of Scots' link to the building.\n\nWell-preserved, a bit expensive when I convert it back to dollars, but what are you going to do?\n\nThe abbey (which is ruins) was interesting to look at, too.\n\nGardens are closed this time of year, so take that into account.  Also, there are some very cool graveyards right nearby, so visit them on your way back up to town.\n\nGift shop was so similar to the one at Buckingham Palace that I snorted. (I have seen more than my fair share of giftshops at historical British sites in the last few months).", "business_id": "F1-S8DkAsFIyrkfTl9MmlA", "stars": 4, "date": "2015-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IyPFdnOIxDIZM44d3gUDGg", "review_id": "5cdRTW2YiXbyyDq6GupbbQ", "text": "Großes Pro dieses Hotels: die Lage. \nGrassmarket, Royal Mile, Edinburgh Castle sind innerhalb von 5, die Princes Street innerhalb von ca. 10-15 Minuten zu Fuß zu erreichen. Ein Sainsbury Local (ein kleiner Express-Supermarkt) ist nur ca 100-150m entfernt.\n\nIn der stylischen Lobby gibt es kostenfreies WLAN, das Hotel-eigene Restaurant bzw. die Bar lohnen sich eher nicht - gegenüber gibt es zwei Pubs, die beide besseres Essen in authentischerer Atmosphäre für weniger Geld bieten.\n\nDas Personal war sehr freundilich und ist bei Bedarf mehrsprachig. Unser Zimmer war in Ordnung, einzig im Bad befand sich etwas Schimmel (mehr dazu unten bei Contra 2). Der versprochene castle view war allerdings nur erahnbar, wenn man sich ausreichend verrenkt hat.\n\n\nGroßes Contra 1: Die Lautstärke.\nWeniger von draussen als viel mehr vom Flur und den Zimmernachbarn. Die Wände bestehen scheinbar aus Papier und man hört wirklich alles (ja, leider alles!) was im Nachbarzimmer so vor sich geht. Hinzu kommt, dass die Türen konstruktionsbedingt von selbst zufallen - und das ziemlich laut. Besonders schön mit den dünnen Wänden So wird man zwischen 22 und 3 Uhr immer mal wieder von vermeintlichen mittelschweren Erdbeben aus dem Schlaf gerissen. \nWir haben uns dann Ohrenstöpsel besorgt - das erste Mal, dass ich die Teile benötigte um schlafen zu können.\n\nGroßes Contra 2: Die Luft.\nDas Hotel besteht aus einem alten Bau und einem modernen Anbau mit Glasfront. Hierzu muss ich sagen, dass dieses Problem scheinbar in den Zimmern im alten Teil des Hotels nicht besteht.\nIm neuen Teil allerdings lassen sich die Fenster aufgrund der stylischen Glasfront nicht öffnen - Was dazu führt, dass die einzige Frischluft durch die schwachbrüstige und nicht regelbare Klimaanlage kommt. Besonders interressant wird das dann, wenn Morgens nacheinander 2 Personen duschen - Abends ist es dann im Zimmer immer noch warm-feucht und muffig. Dadurch, dass die Feuchtigkeit nicht anständig abziehen konnte hat sich im Bad auch entsprechend Schimmel gebildet.\n\n\nAbgesehen davon ist das Hotel eigentlich empfehlenswert. Meine Prioritäten lagen hier eindeutig auf der Lage, daher war ich mit dem The Point zum bezahlten Preis eigentlich recht zufrieden.", "business_id": "yQMRUN3WlbZH-Fq__ubvXw", "stars": 3, "date": "2013-02-12", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 1}, "user_id": "_lmmIZeJTv8roWn8qU3oIQ", "review_id": "q0vkfL9QQX84ODGM_ZwJ7Q", "text": "\"Sis! Happy birthday!\"\n\"Bro, my birthday was in June.\"\n\"I know. I'm taking you to Petit Paris. Woah, look at this city, it's PERFORMING! What's THAT building? And that one?\"\n\nThis was the exchange that occurred when my excellent brother stepped off the train at the beginning of his visit last month.\n\nNow then. There are two reasons that Petit Paris was the first place that sprang to my brother's mind when he wanted to take me out for a meal in a city he'd only actually visited once before. The first is that he didn't really know anywhere else. The second is that he was genuinely impressed with it when he came to Edinburgh last and he doesn't like to give shoddy presents; he's good that way.\n\nWell, I see why he was impressed. The waiter who took our coats and saw us to our seats (table complete with cute gingham tablecloth) was cheery and warm, and plenty patient as we ummed and ahhed over the delicious-looking menu. We began with snails to share - yes, folks, I do the snail thing, and if you have not done the snail thing, Petit Paris is probably the place to do the snail thing. Rich in a garlic and parsley sauce, and blissfully un-chewy, they nestled in indentations in the special snail-dish like happy little blobs of buttery snaily joy. That dish, by the way, makes the process great fun and also, when you're sharing as we were, easy to ensure equitable division of the very good goods.\n\n(I like to imagine that I am a hedgehog when I do the snail thing. That's just an irrelevant little side note for your entertainment.)\n\nMy main was the goat's cheese and vegetable pie - utter bliss. The number of times things get passed off as pies when they're really just tarts is so disappointing. The difference, of course, is that a pie should have pastry on the top. This, to my delight, did, and the pastry was superb. Likewise the filling; the goat's cheese was liberal although it could have perhaps been more evenly distributed as it took me a couple of forkfuls to find it, hiding as it was under its pastry blanket. Bro was less ecstatic about his rabbit, proclaiming it a little stringy, but generally adequate.\n\nHaving ordered, in a moment's forgetfulness, a bottle of wine instead of a glass, Bro must have been happy enough with its quality; it was all gone by the time we left and as anyone who reads my reviews regularly will know, Sis was by no means his glamorous assistant in this vanishing act.\n\nIt's not the cheapest place to eat in Edinburgh, but at around £20 for a starter and main it's very reasonable indeed, especially given the undeniable quality.", "business_id": "L5cQjBQu6qnV_grmvk-drg", "stars": 4, "date": "2013-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IDCUAtylqrvYv9HZ3ys8SQ", "review_id": "UXj-U-j13CJm6tQW1xoUPA", "text": "Klein restaurantje midden in oude centrum. Eten simpel, maar erg goed. Veel Fransen in de zaak. Bedienend personeel ook Frans. Prima.", "business_id": "L5cQjBQu6qnV_grmvk-drg", "stars": 4, "date": "2015-12-19", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "5WbQVsNME0Xr_SQX8JnBxA", "review_id": "25RSSBSGEsIG0rHkLdab3g", "text": "Went to Smoke Stack to have a Sunday brunch with my husband. We had an itison voucher which offered waffles, coffee/tea, and a Bloody Mary or other cocktail. \nBooked table for 12 as the small print mentioned the licence law, which meant that our Bloody Marys could only be consumed after 12.30..\n\nOn arrival the place was almost empty. The orders were taken, but I was slightly surprised that there was no choice of coffees or teas - I would have maybe gone for a cappuccino but never mind. The drinks arrived with some milk on the side. \n\nThen a while later, the waffles arrived. i had waffles with smoked salmon and scrambled eggs, and my husband chose bacon and maple syrup waffles. \nThey were ok, nothing special though. \n\nBloody Marys were brought to the table, and again - nothing special. \nAt this point I really realised what annoyed me about this place is we had to constantly ask for something:\n\n- there was no sugar on the table\n- asked for more maple syrup and they brought a small jug of what seemed like golden syrup\n- asked for white pepper for the bloody mary: the waiter then asked if we want black or white??\nand only then did he mention that they had celery salt which we took and it complimented the drink\n\nAll in all, ok place but I wouldn't perhaps rush back.", "business_id": "QopG-46G0EIeePT8q-4JtQ", "stars": 2, "date": "2012-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "tZs84cKAUSOtP_nAiSdreQ", "review_id": "i_AqASPmZNs4IxxfI3Z3ug", "text": "Too bad - it could've been so nice. \nSunday morning brunch is sometimes a special hangover time and you want to be taken care off. Well in my view anyway. The promise of a fresh waffle with bacon and maple syrup with a Bloody Mary was music to my ears. Good thing that I didn't actually had an hangover otherwise I would have been really annoyed during this visit. \n\nThe owner / manager showed us to our table. Which was nice, close to the heater. He took our voucher for the brunch and asked if we wanted coffee or tea. - huh? I sometimes like simple, non fuss choices this wasn't one of those moments though. I did find out from the drinks menu there were slightly more choices, but I got the idea that on the voucher it was either coffee OR tea.\n\nWhen our coffee & tea arrived I noticed no sugar on the table - or any table - so it was something that should have been served with the order - so I got up to ask the waiter/owner/manager for some and promptly he did bring some. - It should really be served with the Coffee & Tea (since that wasn't really that complicated of an order to start with)\n\nWe ordered our waffles; mine with bacon and maple (?) syrup and the wife scrambled egg and salmon. The waffles were of the very thin, round Tefal waffle-maker variety. Shame, as I was expecting a nice thick square Belgium waffle. But yeah a waffle we did get. The bacon was OK and crisps, the syrup tasted golden NOT maple and very little was served.\n\n*sigh* here we go again..\n\nI had to ask waiter (non owner / non manager) for extra maple syrup and some butter to moisten the waffle. - which was not offered nor were we asked if anything was to our satisfaction. \n\nThe Bloody Mary was big, nice. No celery stick, not nice. - and here I went again.. this time asking for Worcester sauce and white pepper. - no white pepper on the premises - but celery salt was offered - thanks.\n\n Too many times I had to ask for additional things that you'd expect to be on the table or served with an order. - that staff was not easily approachable. I did try from my seat, but to get things I really had to get of my seat and go to the bar/serving/kitchen area. \n\nIt was in all a bit of an disappointing visit.\nit is difficult to complain about having to ask for something and if it was only one thing fine.. but so many things that needed to be asked for was very annoying.", "business_id": "QopG-46G0EIeePT8q-4JtQ", "stars": 2, "date": "2012-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "Mjfc9jAPCFbIyW4Cmr11JA", "review_id": "iqUoHnhkTu48z5UX9_cYAg", "text": "Myself and a friend went here for brunch on Sunday as she had one of those groupon type vouchers so basically I got free food :). We had a choice of tea or coffee, then one of four options on the waffles and a smoothie to boot. I have to say I really enjoyed the food (possibly as I wasn't paying, and I hadn't eaten that morning). I got the Canadian Waffles which were good and had plenty of syrup on it. I was thinking/hoping the bacon would be streaky bacon but it was just regular bacon, which was ok too. It felt nice an relaxed in there and the staff were pleasant too. I'm not sure I was totally in awe of the place that I would go back again but it was nice.", "business_id": "QopG-46G0EIeePT8q-4JtQ", "stars": 3, "date": "2013-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uahOUM2kFpkHu5L_rZe1KA", "review_id": "aSKAcM7LXyR5g4r7u0FVIA", "text": "A solid place for a casual bite with a twinge of hipness. Several cuts of steak, bunch of different toppings for burgers, fries, baked potatoes and a few beers and wines. No complaints here! But its nothing to go on about.", "business_id": "QopG-46G0EIeePT8q-4JtQ", "stars": 3, "date": "2014-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eq1uG_B-l9epn0Y4FSKiOA", "review_id": "gcd1v-Dq4w_cpoPyiNHK_Q", "text": "Our waitress was quite rude. I asked for some butter and syrup for my waffle and she said \"that's weird\" which made me kind of upset. The food was ok....I ordered waffles and they came out cold. The Bloody Mary wasn't good, order something else. The sausage, egg and cheese bap was good though.", "business_id": "QopG-46G0EIeePT8q-4JtQ", "stars": 3, "date": "2015-02-07", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "PH-TR5VxMTOmOscSeufDMw", "review_id": "ilfWJaYbSn1D_l27Zbncig", "text": "Coffee.  I. Need.  Coffee.  That's why I stopped in.  Sure I could've walked a little further to the Starbucks at the top of the road, but this place caught my eye.  Inside is really nice and the staff were really friendly, but not in the \"it is too early in the morning to every be that peppy\" sort of friendly.  They let you add your own milk to your coffee and I ended up getting a massive brownie to take away, you know, for a little snack later.  The brownie was delicious ;)", "business_id": "8RXIwWR34JunHKd00UU4wA", "stars": 4, "date": "2012-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_lmmIZeJTv8roWn8qU3oIQ", "review_id": "sRstA9XTT0SAfBhol0K69g", "text": "Southern Cross is the first place I think of for a quickish lunch with a friend before they have to catch the train. Just a little less than halfway down Cockburn Street, which winds colourfully toward the Market Street entrance to the station, it's ideally located and, inside, bigger than it looks.\n\nI've been here a couple of times; on this most recent visit, I opted for the smoked salmon toast with cream cheese. It was really good, but - and I can't believe this is actually a criticism! - too much salmon. I are well over three quarters of it but by the time the toast and cheese were all gone, it began to be a little sickly just downing the salmon.\n\nThey have lots of cakes and things which (amazingly) I've not tried yet, but they look good. Be aware that they also will not split a bill for you. That seems totally weird to me; I understand it during the high visitor volumes of August since it can slow proceedings but on a regular day I don't see why they'd simply refuse...\n\nService is also variable. The first time I came, I had a delightfully charming young man who admired my brooch. This most recent time, the young lady was civil, but slightly curt. Nonetheless, the three of us got fed amply and had a drink each, and the bill came to £26, which really isn't bad in the Mile area.", "business_id": "8RXIwWR34JunHKd00UU4wA", "stars": 3, "date": "2014-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Q3ZPd_MRf1nPTRhaYTRSXg", "review_id": "4rbRoA-zPwmYBqfIUqlrWw", "text": "Lovely little cafe that was a welcome respite from the drizzle and cold. Although they were busy, they seated 5 of us within about 5 minutes, and took our order quickly. My coffee was good, and I had a lovely scone with cream and jam. Also pinched one of Lauren's haggis balls, which was lovely, with a good amount of pepper. Staff were great, and the cafe had a nice atmosphere.", "business_id": "8RXIwWR34JunHKd00UU4wA", "stars": 4, "date": "2015-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dnblJf2bPOkkCNv-GLpeEg", "review_id": "5L_5orrLtSY-eBpZf6y1Nw", "text": "We popped in here for a quite bite to eat, hot drink and rest whilst it was raining.\n\nIt was quite busy which made for a nice atmosphere and they managed to squeeze our group of five in after a short wait.\n\nWhilst everyone else had coffees and tasty looking scones and jam (but with squirty cream rather than clotted!), I indulged in haggis bon bons!\n\nThey were deep fried little balls of haggis accompanied by a mustard mayo. They were not only really yummy but also a great way to sample haggis whilst in Bonny Scotland!\n\nPs. The signs downstairs and in the toilets are fantastic! Pop down and make your favourite your motto for the week!", "business_id": "8RXIwWR34JunHKd00UU4wA", "stars": 4, "date": "2015-01-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "In6L6fy4jFlN0E-LEZXGiw", "review_id": "g6SIL9YT4EZR0Q_fJr1A_w", "text": "I used to shiver at the thought of going to Citrus, but now I've come to accept it, for what it is... A grungy, dirty black pit with good tunes!  Second to GoGo at Studio 24, it's probably the only club you can go to for good indie or retro soul music.  \n\nUpon entering you faced with the bar selling a range of drinks, but they are pretty dear.  Further into the club you can find a cloak room and lime green toilets opposite. At the end of the warren is the black pit.  A dance floor on two levels and the DJ in the far corner.  There is no fine design or luxury here, it's concrete floors and black walls.  Basic and no nonsense.  I guess that's why people come here, for the music and to dance.  It's not full of stilettos, fake tan, male peacocks and George Street naff, it's good honest friendly people having a drink, dancing like no ones watching and having a good time! \n\nJust don't wear your good shoes here though, the dance floor is usually covered in spilt drink from too much shape cutting!", "business_id": "m9D6h0NRuVSQkFpyLZQcpQ", "stars": 4, "date": "2013-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "RvyBcMVefE8BADMo0Dl48Q", "review_id": "AviT_mFsimS6hKP9cNq5kA", "text": "I paid a flying visit to Sandwich Culture for a breakfast roll, the other day. The roll was very tasty, featuring particularly good sausages. \n\nOverall, we said: \"I was really pleased with Sandwich Culture. Their deli counter looked like it offered a nice range of sandwich options for lunchtime, too. I rarely find myself in this part of the world when I'm requiring lunchtime takeout, so it's more likely I'll continue to use it as an on-the-go breakfast place, but I'd be happy to recommend that you pay it a visit, when you're next in the west of the city.\"", "business_id": "tHLEoHBZtjH1G_ONnKwRNg", "stars": 4, "date": "2013-01-24", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "wx12_24dFiL1Pc0H_PygLw", "review_id": "DRYowuOeRnsAbatMbgP_fQ", "text": "What's that slightly odd cabbage-y smell? And after sitting in here for 2 hours, is it going to stick to my hair and clothes?\n\nThese are not the first thoughts you want to have upon entering a cinema. Cinemas are cinemas, they show you films. Some show blockbusters, some show arthousey types. But as long as the seats are comfy, the screen big, and the popcorn plentiful, what can go wrong?\n\nI'll happily go to Odean or Omni for blockbusters, but when I wanted to see the French film L'Illusionsite (a beautiful film set in Edinburgh) I thought the Cameo would be a better choice. Smaller, off the beaten track so a calmer audience.\n\nLike I said, it smelt funny. And the toilets were really badly kept. No toilet paper, broken lights, broken doors, soap dispensers broken, and COLD. \n\nSo, they showed me my move. Fair enough. But they really could do something about the smell. The seats are comfy though.", "business_id": "vW_krCghxf4GYPRfkgZ06A", "stars": 3, "date": "2011-01-16", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "AKi8Zk0xvi7GB7Vf_a-Gkw", "review_id": "gfTJVoBOq4YMJTMvbSXfRg", "text": "It's no big secret that I'm somewhat of a cinema buff and probably spend more time a week staring open mouthed at the silver screen than you do eating hot dinners (what is it about hot dinners that makes them a relevant point of comparison to everything?!).\n\nThe Cameo then... well... it's alright isn't it? As far as independent/arthouse cinemas go, the Cameo has a couple of nice tricks up its sleeve. First is the membership which will set you back £30 a year but gives you discounted rates on tickets as well as concessions and also includes three free tickets to any movie or your choice (which goes some way to discounting the membership price.\n\nThe second thing the Cameo has up its sleeve are the double bill Sundays where they'll show two semi related movies back to back; the first usually being a recent movie which is nearing the end of its run and the second something vaguely related to the first (for example today they showed Machete followed by Planet Terror). The good news with these double bills is that they're the price of a regular ticket OR free if you're a member (again knocking a few quid off of that ticket price). There's no obligation to stay through both and it can be a good way of killing a lazy Sunday afternoon.\n\nThe final thing that the Cameo has up its sleeve is a bit of personality. They'll happily show films from a while ago, just because and the staff are all friendly enough. There's a nice cafe/bar attached to the side and in general it's a pretty good place to see a little something hich isn't showing at the multiplexes.\n\nThe bad? Only three screens, of which two are minuscule. They've always been pretty empty when I've been stuck in them though so it's never been a huge issue, but I can imagine them being pretty uncomfortable when full. The big screen is pretty cool though and regularly packs out.\n\nThere's been some renovation work done recently and the gents toilets have seen no end of improvements; from Jen's comments though it would appear as though the ladies' haven't been done yet or have been neglected completely so pee with caution!\n\nI'm not all too sure why but I always choose to visit the Cameo over the Picturehouse, despite them being equidistant from where I live. It's not THE BEST small cinema ever, but it's certainly a good one.", "business_id": "vW_krCghxf4GYPRfkgZ06A", "stars": 4, "date": "2011-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "w2wHU-O5ZM9tobWDzT3nig", "review_id": "6yVEI2xw4EOfP1uZliMMhA", "text": "I'm not sure how only one other reviewer mentioned the smell of this place. but it overpowers any good qualities this theatre has. \n\nOnce passing through the front doors, you are greeted immediately by a very strong dirty bathroom odor which follows you until the doors to the theatre (not a very big entrance). Once entering the theatre, the bad bathroom smell is mixed with a moldy mildew odor that, when combined with the bathroom smell, is almost unbearable. It completely detracts from whatever film you are watching, and my boyfriend's breathing became heavy for two days because of the amount of mold we were breathing in while sitting there. With numerous other cinemas around (even with a block or two) of Cameo, I'm not sure how it continues to stay in business. \n\nThe theatre itself is gorgeous, with lovely crown moldings and interior architecture, and it's a shame that the place smells so bad. It made me feel dirty just being there. I would recommend going to a different theatre nearby, it won't be difficult finding a suitable alternative.", "business_id": "vW_krCghxf4GYPRfkgZ06A", "stars": 1, "date": "2011-01-21", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 3}, "user_id": "OskgfrWPNYEQVLMOrNjF6A", "review_id": "BPVmYerDF2gG9h9qAkJ9NQ", "text": "Went last night and had a blast. They were showing Singin' in the Rain. Oh my.. I love that movie. \n\nI had a really easy experience, and enjoyed the independent venue vibe. Also, really comfy seats and intimate showing (compared to many!). \n\nNever went to the bar, but easy to go for a pint across the road when you're done! Perfect date night :) \n\nplus student discount! I believe 11.60 for 2 student tickets :)", "business_id": "vW_krCghxf4GYPRfkgZ06A", "stars": 5, "date": "2012-02-03", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "JWwZyFHft__bHjbmpZhimg", "review_id": "CMT8ap9FVYmxLsHWxkgQ3g", "text": "This place is great for anyone who loves good old fashioned cinemas!\nI went for the first time the other night to see The Muppets... it was like being in the actual Muppet theatre, so good! \nThe seats are comfortable, there is loads of leg room and I was happy to see that even as early as 8.30pm during half term, there were no children in the screen. (I'm glad that a new generation are being introduced to the Muppets, just not on my watch!)\n\nOverall, I had a great evening at Cameo and will definitely be keeping an eye out from the bus to see what is on the board in future!", "business_id": "vW_krCghxf4GYPRfkgZ06A", "stars": 4, "date": "2012-02-15", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "w6ZQwutFCvmM2cYXbZjB9Q", "review_id": "a2qO-hOL3HhA8-GmcQIZ1g", "text": "Surely you've been to or at least heard of the Cameo. It's definitely an Edinburgh institution.\n\nCameo snubs its nose at the expensive frills embraced by the cinema-goliaths. Everything seems to be done as a \"fuck you\" to the Vues and Cineworlds, done with this seedy-glamorous charm that makes you feel like you're part of the club just by being there. \n\nAside from all that, though, they play some f'ing AWESOME movies. The sunday double-bills hit the mark regularly and some of the movie feature nights are an absolute gas. Tip for young players: go see 'The Room' if you ever get the chance.\nIn fact, go see any movie here played in cinema 1, that gorgeous room makes anything amazing. I would even go see a double-bill featuring 'Transformers 2' followed by 'Spiderman 3' if it was in cinema 1. Maybe.", "business_id": "vW_krCghxf4GYPRfkgZ06A", "stars": 5, "date": "2012-02-25", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "sfJP6W0E_JThj5eXLBd6pA", "review_id": "s5av2UpjUOq4VKpVhhYsJw", "text": "Yay! I'm a fan indeed. I am a loyal Cameo customer and have been going to Edinburgh's arguably quirkiest (and definitely smelliest) cinema for many years. \n\nWith respect to the nasal offensiveness, it's definitely on its way out. The cinema refurbed its ladies' loos last year and that's made a big difference, and their drains and pipes have been less stinky of late. I wonder if they've finally cleared up the problem? \n\nMy issue with Cameo is the little things. The last three or four times I've been here small (but vitally important) things have hacked me off. The lack of staff on the counter, the lack of information on screening formats, the misinformation regarding cafe offerings, etc etc. These are small quibbles that have slowly built up to rub me up the wrong way. And I decided not to renew my membership when the cinema binned its (legendary) Sunday double bills. What the?! \n\nBut despite these issues, I do want to support the Cameo. It's a stalwart of the city and I really hope it starts to pick itself up again and become the shining beacon of brilliance it once was for cinema-goers. \n\nThere are some fabulous special events to treasure, like All Night Horror Madness, and you can come here for live theatre and ballet performances. There's also the Cameo's atmosphere - it just feels like a beat-up, loved and slightly whiffy member of Edinburgh's family. I really love the Cameo and hope it gets better with age, not worse.", "business_id": "vW_krCghxf4GYPRfkgZ06A", "stars": 4, "date": "2013-02-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "h4tfHGODErFCFrg6KEZ3xw", "review_id": "lqm2Y_xfkS3_86eObx_QoQ", "text": "The Cameo is lovely. The decor, the bar, everything. You can buy a pint of sausage rolls (complete with pint glass!) which made me giggle. I think I'd travel to the Cameo to see a film every now and then because of the nice ambience. The walls are decorated with film posters from yesteryears and it has a really nice homely feel. It's comparable to Glasgow's GFT but I'd say the Cameo is a lot more spacious and modern as opposed to the GFT's classic, lived in feel. I'll be back, Cameo!", "business_id": "vW_krCghxf4GYPRfkgZ06A", "stars": 5, "date": "2013-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8E6IVA0JqLuse39f4UPHpw", "review_id": "JZHfzNWLxzI2z-QKRmuYKQ", "text": "A cinema with a lot of charm. Retro candy, deli popcorn, delightful staff and the most comfortable seats I've ever experienced.", "business_id": "vW_krCghxf4GYPRfkgZ06A", "stars": 5, "date": "2015-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "6cEjxKwdxNeet2vt55XDfQ", "review_id": "0yDoxO_Q3Nnac7ByaI0pIw", "text": "There is nothing more uncomfortable than sitting in a comedy club and listening to a 'comedian' laying in to a member of the crowd trying to raise some sort of smile from the rest of the audience. I always wince a little when I hear a comedian ask if there is anyone from the States in the audience for this very reason- no doubt what's coming is a uninspired rant about American politics and George Bush as though it's the poor tourists fault for the war in Iraq! Last time I visited the Stand this exact scene was played before my eyes. Egged on by a Stag party I watched a comedian blame two poor American girls for every problem from obesity and McDonalds to war and the oil crisis. During the break in the show at least 15 of us walked out. Too awkward for words! \n\nThis experience is quite typical of the Stand. Often you watch a really hysterical piece one week and then the next it's bitterly disappointing. My advice would be to do your research before you visit and check out the website to see whose performing. Some acts are just not worth the torture!", "business_id": "NkyjMfpdpYBKIarzVqY6yw", "stars": 3, "date": "2009-01-21", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "L1Gtm7ovUSb98XG1P19oNw", "review_id": "ikwCAvd5fwh0R6PkzoMy5w", "text": "The Stand seemed to become an institution the day it opened its doors. They've matched small scale year round comedy with some of the biggest names on the circuit, then gradually expanded their festival operation so that it now takes in the Assembly Rooms on George Street. The original Stand space, with its seating/standing jockeying for position and an atmosphere that encourages the performers to relax into their show is an experience in itself. Go early, go often, go for food and go home (or elsewhere) happy and smiling. Coming soon: go there by tram!", "business_id": "NkyjMfpdpYBKIarzVqY6yw", "stars": 4, "date": "2014-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "D5WA_kIBF4xDtVJMayANWg", "review_id": "GvLDtfYwsp1DbK99YW_16Q", "text": "Super crowded, took a refund and left. Management needs to add capacity. The alternative to standing is to get there super early and wait for the show to start. Not coming again.", "business_id": "NkyjMfpdpYBKIarzVqY6yw", "stars": 1, "date": "2015-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "6cEjxKwdxNeet2vt55XDfQ", "review_id": "4OBzAUzp2wHhbanJ03oNGw", "text": "Gandhi's is a great little Indian restaurant just off Lothian Road. I was reluctant to try it at first because I always associated Gandhi as a figure of fasting. I felt it was a bit of an oxymoron to chomp away at an elaborate feast in this place. However, one day I was drawn in by the crowds inside and I haven't looked back. \n\nCurries in Gandhi's are fresh and delicious. I particularly enjoyed the Bhuna and Biryani. On my last visit ten of us shared a long table and decided to choose almost one of everything. We were very impressed at the high standard throughout and found ourselves ordering more and more okra even though we were stuffed full. \n\nThe staff here are lovely. One trip with a few friends ended up very drunken and we accidently over paid. The waiter was so honest and kind that he ran up to us as we left telling us that he couldn't accept such a huge tip and to take our money back. Service like that makes a restaurant well worth a return visit!", "business_id": "FfCUl9Bqt3QrL0xtkPDQXg", "stars": 4, "date": "2009-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FQBsSK8bOMfcu1pnwDKFtg", "review_id": "aOVswqkb93yzDtxc62g3HA", "text": "Wow - Does the food here taste amazing! So fresh and the flavours are amazing! I'd go again and again!", "business_id": "FfCUl9Bqt3QrL0xtkPDQXg", "stars": 5, "date": "2010-02-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "L3yW72jdSshXLJkTSIoWKA", "review_id": "Z4soO_lINVLTFJ8Tuz5gSA", "text": "Gandhi's served me up one of the best Indian meals of my life. The Vegetable Biryani is so incredibly scrumptious that I would easily make it my last meal if I was on death row. Luckily, I am not on death row and they deliver so absolutely nothing can stop me from ordering Gandhi's every weekend.", "business_id": "FfCUl9Bqt3QrL0xtkPDQXg", "stars": 4, "date": "2011-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "1u9og6Q7kVu53_A2bGlMmg", "review_id": "4yGOCNydDM6PFj42cekREQ", "text": "I live in London, another mecca of Indian food. But Edinburgh? You might have us beat. There's a lot to choose from.\n\nWe had Ceylon chicken, naan, pilau rice, lamb jazfrezi and those crispy pancake things with chickpeas in the middle. I forget the name. But that was awesome. Ran us about £35. I didn't find anything too spicy. \n\nWhatever curry you choose, DEFINITELY get the naan, it is quite light and fluffy yet crisp and flavourful.", "business_id": "FfCUl9Bqt3QrL0xtkPDQXg", "stars": 5, "date": "2012-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vQP3n9_DmUpGl1QkV3cuXA", "review_id": "TLL1loNeMGHAPdiz2TobEQ", "text": "The name of the restaurant has changed to something like \"I love India\" - sorry, didn't get the full name.  Still the same great food.  Lamb so tender it melts in your mouth.  Fantastic Garlic Naan.", "business_id": "FfCUl9Bqt3QrL0xtkPDQXg", "stars": 5, "date": "2014-02-15", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 4}, "user_id": "wx12_24dFiL1Pc0H_PygLw", "review_id": "tg7_Ekx4pyqv25idm6xxoQ", "text": "I'm sorry I doubted you Hamilton's. How could I have judged you on one visit on a crammed Friday night? Poor show.\n\nI came back for a mid-week drink and dinner with a good friend. I'm going to cut to the chase. VENISON STEAK with red wine sauce, parsnip mash, and haggis fritters. Oh dear lord. \n\nIf you don't know what that means to me by now, what sort of Yelp fan do you call yourself? I jest, and I digress. Basically, it's a gastropub but one with a really nice, slightly different menu. Prices aren't cheap but definitely not OTT for the Stockbridge area and for the quality of food. \n\nIt's chic, sleek yet cosy and comfy all at once. Low lighting, a mixture of comfy couches, high top tables and an actual dining area. Friendly staff, good food, and did I mention the food?\n\nIt's not local to me at all, it was a good wee bus journey away. But I would definitely go out of my way to come back. It's owned by the same people who own Treacle, I believe (I garner this from the website) and anyone who knows me, knows Treacle is one of my top 5 go-to Edinburgh munch spots (best sweet potato wedges, and best margaritas. Done.) I didn't know this till after I'd been, so wasn't biased in judgement, but then it all fell into place.\n\nTogether, these two are definitely the epitome of a great gastropub. The best in fact.\n\nHamilton's is more for date-nights, or a quieter night. And maybe doesn't shine its best on a crammed Friday or Saturday night. But give it another chance like I did. Too good.", "business_id": "KqgeyLdYbfsd9veyR6UGtw", "stars": 5, "date": "2012-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "qXLte7ikUM-__NHU5RaUgg", "review_id": "odLhutLKcKLVxUOk1NSfMw", "text": "Yelp brunch action yesterday was a perfect hangover cure afternoon a weekend on the sauce.\n\nEggs Bennedict with smoked salmon aka eggs royale for me was a very tasty lunch, there was a slight over flavouring of vinegar but I was a slid effort.\n\nGood coffee and a Bloody Mary made for a good brunch experience.", "business_id": "KqgeyLdYbfsd9veyR6UGtw", "stars": 4, "date": "2012-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "L1Gtm7ovUSb98XG1P19oNw", "review_id": "oo4QWMfonAPJwMwMS3qUyg", "text": "I wanted to give this a 3.5 star review, but alas I've opted to round down rather than up. The setting is very nice indeed and I can see that it would be equally well suited to a busy evening crowd as it was to our Sunday brunch gathering. The food looked good and they use tasty fresh ingredients - I had a full Scottish, though would have loved it to be a bit fuller with perhaps a second rasher or a little more toast.\n\nThere were a few touches that could have been overcome. I understand that they very rarely take reservations, so it was a surprise to hear that they couldn't add an extra table to our setting when the place was all but empty at the time. Nevertheless the staff were friendly and bright on a sunny morning, prompt with our orders and the bill, and quick with answers to our various questions. (Yes, you can opt for a fruit juice instead of the tea/coffee with the big breakfast.)\n\nHamilton's looks very Christmassy and is a lovely place to rest a while before a stroll round Stockbridge Market or the Water of Leith.", "business_id": "KqgeyLdYbfsd9veyR6UGtw", "stars": 3, "date": "2012-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "YslVzCJPQoeOwqnYduJlyQ", "review_id": "m-ZJzbs6rX52udrK9cVIoA", "text": "On a sunny, crispy December morning, it was time for the Yelpy Brunch at Hamilton's. Well it was fun, staff were friendly and attentive, they coped well with our ever increasing table (well, we squeezed in as we're a friendly bunch) and offering a separate brunch menu is a nice touch.\n\nAs Jenny L explained, its not an extensive menu but it is full of 'brunch' type offerings so does ok and offers big breakfasts, breakfast rolls, veggie and gluten free options. The gluten free option (one listed) is ok if you don't have a problem with eggs. Yep, I'm weird. I like omelet's, tortilla and frittata but try and feed me an egg scrambled, poached, fried or boiled and I freak out. It can't even be on the same plate. \n\nLuckily Hamilton's cobbled together a gluten free option (bacon, beans, tomato, spinach, salmon and mushrooms) for me. It was ok, but 3 starts only as the spinach was really grainy. Like chewing on a mussel which wasn't cleaned properly and getting silt and sand. I ended up leaving some on my plate as it was really off putting. Everything else was ok, but as David J mentioned, another rasher or two of bacon would have been great, so a very big plate, but the portions appear smaller. \n\nI would go back here - not sure for brunch but poor Hamilton's is probably being reviewed on the back of me weaning myself off Dottie's in San Francisco where I became addicted to brunch (10 days since Dottie's - not a happy celebration). \n\nI think it would be a nice option for lunch with a group of friends and it seems to be dog friendly too so I think I'll be back here in the next few weeks. I'm not sure how GF it would be for lunch having not viewed the menu, but having some awareness of GF and allergies and this is noted on the menu, is a start and I'm sure there would be a few choice items worth sampling.", "business_id": "KqgeyLdYbfsd9veyR6UGtw", "stars": 3, "date": "2012-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "VfW0f0d4OMG74f41yxwn8w", "review_id": "f9i2-If23iRu6mDdkQKMww", "text": "I thoroughly enjoyed my first ever Eggs Benedict (with salmon) experience at Yelp's Brunchy Munchy in Hamilton's. It was beautifully presented, adequately proportioned and tasted delicious! I was a little surprised that there was no cereal/porridge, pancake and fruit options on the breakfast menu (but I suppose I expected that because I 'm used to seeing it available elsewhere) - although I knew I always wanted the egg's benedict. The table space required for our group of 15 was misjudged which followed with a little shuffling and squeezing as there were no extra tables to add on (when you just want to sit down and get on with the munching on a lazy Sunday). However, I thought the staff gave great service, especially when add-ons to the order were regularly requested at different ends of the table which resulted in the them continuously going back and forward to our table. Often on a Sunday I have been exposed to hungover wait staff who make no attempt to hide that they would rather be anywhere but at work (wouldn't we all) but not here. \n\nI have drank at this bar several times and ate once here for dinner during the summer.  Whilst I can only remember that I had pan fried chorizo with cider, lemon, chilli and tomatoes for my starter which was presented in a cute mini frying pan with a generous serving of bread to soak up the juices and was oh so delicious; I do recall being impressed with their menu. It was a bit more upmarket than typical pub grub of fish and chips, stake and ale pie etc, and reasonably priced. I can't wait to eat here again. \n\nHamilton's seems to have a trendy style in it's decor and wait staff, yet I have seen all kinds of people stop by: from couples on a date, new and old friends just out for a good time,  families and even a dog or two depending on what day it is mind you.  I have also seen the look of disappointment on numerous peoples faces when they have to be turned away when it is full which I guess just goes to show how good this place can be.", "business_id": "KqgeyLdYbfsd9veyR6UGtw", "stars": 4, "date": "2012-12-07", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "qz4m67bbdrBFmGEzjmvHjw", "review_id": "lQzvcVrNontSZZ2mBWQp8A", "text": "The Sunday after New Year's Day a friend and I made an impromptu visit to Hamiltons for lunch after we found that both the nearby Hector's and Peter's Yard had no space for us.\nWe had to clear the messy table ourselves and wait for a while to be served but, considering how busy the place was, this was understandable.\nThe menu was fairly varied and offered a few choices for vegetarians like me (although two of the starters were marked with a 'V' when one contained bacon and the other salmon!). We both opted for the vegetarian breakfast which arrived very quickly and couldn't be faulted.\nHamiltons has a fairly cosy atmosphere. The bar area to the left of the main door contains comfortable sofas overlooking the windows onto Hamilton Place. The raised eating area to the right is brightened by a feature wall depicting a Lichtenstein illustration, although this may be a little 'in your face' for some. I have to say I prefer the softer colours favoured by Hector's.\n\nA recommended visit should you be down in Stockbridge for a weekend walk  (it's very close to the entrance to the stretch of the Water of Leith walk that takes you down to Dean Village, and the galleries beyond). And a popular place for a weekday drink after work.", "business_id": "KqgeyLdYbfsd9veyR6UGtw", "stars": 3, "date": "2013-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "WU45Uu7mh4e52awqYSN-vA", "review_id": "t1wrx454CcU57ZvdWQmTog", "text": "Looking for a post-market lunch on Sunday, with dog in tow, we opted for 'Hamilton's'\n\nIt turned out to be a great choice. The place is very cosy, the staff are all friendly, polite and easygoing. Being so 'dog friendly' also adds to the relaxed, homely environment already created by the leather sofas, exposed wood, chilled atmosphere and fun vibe.\n\nThe cocktail menu immediately stood out. It was extremely comprehensive with a huge variety of delicious sounding concoctions. The bar had a good choice of beers on tap and bottled.\n\nThe food menu was equally extensive, with small dishes, sharing dishes and larger mains. As well as offering all day breakfast (including veggie option) and other breakfast-y treats. I ordered the soup, parsnip and apple. A slightly unusual combination that could have been overly sweet but was perfectly seasoned and with the addition of some fresh sage made it a very tasty, well balanced dish.\n\nDecked out with Christmas decorations, mulled cider and wine filling the air, it was a great place to spend an afternoon. I'm looking forward to going back.", "business_id": "KqgeyLdYbfsd9veyR6UGtw", "stars": 4, "date": "2013-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ftzmtHY4sjRcQ8s--xCizg", "review_id": "rU0uGjLLBVYJPP3E06aVCA", "text": "I had some drinks and dinner here last weekend and had a very positive experience. The pub itself is on the nicer side with plush couches and dark wood furniture. It is also very toasty, which was a welcome respite from the outside cold. \n\nThe vibe was very much a gastropub that was primarily locals (we got the recommendation from the owner of our B&B) who wanted to catch up over dinner or drinks. It is a friendly atmosphere.\n\nThe menu looked amazing - I had a difficult time choosing as so many items looked great. The menu is seasonal and sources from local farms and butchers. I opted for a venison stew with a pumpkin mash and my friend got a burger and chips. We split a fish cake as an appetizer and ordered a bottle of their own Hamilton's red wine. \n\nThe cocktail menu also looked incredible though I stuck to wine. I had a glass of mulled wine while waiting for our table, which was great. \n\nThe food was excellent. Very generous portions (maybe too big, but I'm not complaining) and you could really tell that they put a lot of care into the food preparation. \n\nWhile the pub was crowded, the dining area is separate and there was enough room to settle in for a relaxing dinner. \n\nMinus one star for slow, inattentive service that still managed to be friendly. If I lived in the area, I would be sure to go back here again.", "business_id": "KqgeyLdYbfsd9veyR6UGtw", "stars": 4, "date": "2013-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "ScullHVHSQsJfVGAyCC0UA", "review_id": "ObEcUCu6kzecKF5FlH2AHA", "text": "Hamilton's of Stockbridge is one of those places I've walked past umpteen times, but had never actually been in until Hogmanay when I was meeting a friend who was getting his hair cut at a local barber's.  It being Hogmanay, the place was packed and we were lucky to get a walk-in table (possibly the last one!), and it being day time it was more specifically packed with babies! Lots and lots of new parents meeting up with their friends for an end of year get together, and bringing the weans along with them.\n\nThe fact that it was so busy meant that my steak ciabatta sandwich took a little longer to arrive than it probably ought to have, but this was understandable and forgivable. Otherwise the service was largely fine, I mean it took us a while to flag someone down when we wanted to pay but again, it was hoaching in there.\n\nMy sandwich itself was tasty, with good chunky chips and a little pot of gravy (for pouring? dipping? I dipped but I guess it's up to you), and nicely cooked.  My criticism would be that they'd been a bit mean with the steak.  It wasn't one piece, it was several chunks, and only a few at that - areas of the ciabatta were steakless.  Which, for nearly a tenner in price, isn't good.\n\nMeanness of steak aside, Hamilton's seems perfectly nice.  Any service issues can be explained by it being packed. And they had a really interesting list of seasonal coffees, certainly more than enough to give Starbucks etc a run for their money!  It's a very solid choice if you're in the Stockbridge area.", "business_id": "KqgeyLdYbfsd9veyR6UGtw", "stars": 3, "date": "2014-01-09", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 3}, "user_id": "x7ZP6lB2fZl2UN6lun87lA", "review_id": "9Qv9oNvS89uvEtOLBMGv0g", "text": "The night that I visited, they were in the midst of a cask ale festival, which was a total score for me.  I tried...several.  I don't really remember names; some were great and some were so-so, but most weren't brands of which I had heard.  They also had live music, which is why I came in the first place.  This was the last night of my trip, and I hadn't heard as much traditional music as I had hoped.  \n\nIt was just a young guy playing guitar.  His jokes were terrible, but his energy and musicianship were very good.  There were many sing-along, foot-stomping kind of moments.  He pointed me out as the only person doing the claps in \"The Wild Rover\" and had me demonstrate to the rest of the bar.  \n\nFun times.  I also met a group of four female American tourists, who let me sit at their table.", "business_id": "Nq_BMV7kyx9_C3w0Jip6CA", "stars": 4, "date": "2009-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "VSgbmmHro5z2aQMocOwz5Q", "review_id": "4YmpAgKDRb7eJ9j1j8Cl2A", "text": "Yes, it's a bit of a touristy stop to make, but we had a nice time....once we were able to snag some real estate on some comfy couches.  We ordered a round of Scotch, and an appetizer.  So, if you're in the area, you should atleast stop here as well as take a photo next to the Greyfriars Bobby statue which is just outside.", "business_id": "Nq_BMV7kyx9_C3w0Jip6CA", "stars": 3, "date": "2009-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "raf7Qqr3EgRuylIU1nH96g", "review_id": "hE5PvkcMdihsNTAqyj7ldQ", "text": "Awesome food and services. Recommend sausage and mash!", "business_id": "Nq_BMV7kyx9_C3w0Jip6CA", "stars": 4, "date": "2013-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5CpiSlcO588zSWh3ImXaOg", "review_id": "sijXmhpaSHvx2jVm_2u5RA", "text": "Yami~~~ had dinner with my dad and mum~", "business_id": "Nq_BMV7kyx9_C3w0Jip6CA", "stars": 4, "date": "2014-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r9vy96lZXDOXezwZxiWbww", "review_id": "TyuYpAHPqIvrWpaqQVKiYA", "text": "The chicken & mushroom pot pie with veg and fries were delicious and the price was great too; under 9 pounds.", "business_id": "Nq_BMV7kyx9_C3w0Jip6CA", "stars": 4, "date": "2014-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "C_cTkEBLiWI4wrpwxSdrlg", "review_id": "rRemde8bU0FI6DM0OSkkVQ", "text": "A lovely, welcoming Scottish pub. I had Cullen Skink to start, haggis, neaps and tatties for my main course. Both courses were impeccable. A lovely place to dine. The only thing that let it down, was the obnoxious American waitress who served us, but judging by her manner, I can't see her lasting long there.", "business_id": "Nq_BMV7kyx9_C3w0Jip6CA", "stars": 3, "date": "2014-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JCkzKmJYVfA6MEhsShpfsg", "review_id": "_HSOQspYT3bhrbww1151Lw", "text": "Always walked by this pub/restaurant/place but never popped in. Wandering about Edinburgh last night, I happened upon the Greyfriars Bobby statue. I took the obligatory selfie with it (the world does not need to see it) and decided to pop in and finally have a look.\n\nY'know what? It's alright! Looked to me like the top part was for eatin' and the rest was for drinkin' - and that was fine. A damn fine selection of beers on tap - I had Hobgoblin, a great beer in the winter - and staff that helped folk who weren't quite sure what they were drinking.\n\nThe food I could smell seemed to be good quality, and the staff were all friendly, despite the freezing cold temperatures outside and several \"well lubricated\"  punters further down the bar.\n\nNot somewhere I'd call a \"must visit\" but definitely would have no problems about returning.\n\nPlus, it's named after the wee dug! How can you not like that? :D", "business_id": "Nq_BMV7kyx9_C3w0Jip6CA", "stars": 3, "date": "2015-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B9p4cnBr3YPedWA8Gh104Q", "review_id": "oWy1qgle5RhS2VloDuspMA", "text": "Bar set right on Royal Mile in Edinburgh.\nBar was quiet when we went in for a drink but were served straight away , good choice of beers etc and food was also good value although not oustanding quality. Cheap deals for students and has live sport on all day but gets very busy when big games on.", "business_id": "zBG2vQ0A6F5HQkv_aeWfAQ", "stars": 3, "date": "2010-02-05", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "QTS9YcD3Cu3W6gWspF-vAA", "review_id": "b6HpK1ZlkCl3e5ruAmRLeA", "text": "My stay at the Bank Hotel was flawed in only one real way...it was too short!  Next time I'm in Edinburgh...I'm there for a week not just a couple of days!!!\n\nThe rooms are quirky and comfortable and the staff is helpful to the Nth degree!  The hotel is centrally located...literally...you are right in the middle of the Royal Mile!  The train station is but a few blocks away (albeit a few blocks UPHILL on the way to the hotel...be ready!) so you don't need a taxi or anything.  \n\nWhen I was there, someone had stolen the modem so there was no WiFi, but there is a very nice Starbucks just a few steps away.  Nothing major and actually it was nice to unplug for a few days.\n\nNow...one thing to know about Edinburgh...it seems that people like to drink there!  My last night I was um...serenaded by a herd of singing Germans for several hours.  I was just about ready to open the window and shout \"OI!  Shut it!!\" but they moved on just in time (which was good because I did NOT want to get out of bed!).  I'd have been ok with a bit of it, but until 4 am was pushing it in my book!\n\nBut, I expected some noise...the rooms are above the bar and it is Scotland, so while it was annoying it wasn't horrible.  The rest of the hotel experience made up for it!\n\nI also had a burger in the bar...and the breakfast as well...very nice food and seemed like a nice pub to hang out in.  When I move to Edinburgh someday...I'll probably be a semi-regular there!", "business_id": "zBG2vQ0A6F5HQkv_aeWfAQ", "stars": 4, "date": "2011-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Hc0sufBPV0ubfP-A7glUIw", "review_id": "k1k8Q3dGLcNrJQyk1ZSr0A", "text": "Crowded bar on the Royal Mile has a decent atmosphere and often has live music.  The back nook behind the bar is a cozy spot where you are able to have a conversation with friends.", "business_id": "zBG2vQ0A6F5HQkv_aeWfAQ", "stars": 3, "date": "2012-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "LfnB4N7SVSAIPOM3If_kDA", "review_id": "XnRf3InP2D0HUekYu0WAlw", "text": "Princess street and its sourrounding pubs arent really my cuppa, but the Guildford is a bit different. From when you walk through the revolving doors to take in the amazing cornice work to the big horse shoe style bar taking pride of place I always feel like this bar is from another time. The more gentle soles amongst you will be pleased that the food area and bathrooms are more modernised and fully ... turned out with contemporary fixtures. ;D\n\nThe folks in the bar are normally a mix of regulars and those that have just popped in, but always friendly. The staff are knowledgable and chatty as a whole. There is a large tv above the door, but this doesnt really detarct from proceedings. Last time I was in they were showing a vhs of adverts from the 80's which made a talking point for a few minutes. \n\nThe main reason I like this place is that its a real ale bar that I can get my Cider and lager in. All our group are catered for here from the whiskey/vodka drinkers to the real ale folks. Never eaten here before but what I have seen getting turned out looks very nice for pub grub. \n\nAll in thumbs up from me! :D", "business_id": "zpsDyx9wh7LYjtBLTpu_-w", "stars": 4, "date": "2013-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6hsCkXulFXAkh-ELEhdGoA", "review_id": "qd1yBQ_yTXlSt0Sim-WTFw", "text": "Sono stata in questo pub un paio di settimane fa,bellissimo l'interno,da quel che ho visto un ampia selezione di birre(purtroppo io nn bevo birra), e il cibo tradizionale...beh...davvero ottimo,servizio cortese e attento,unica pecca x essere un pub è un pochino caro..ma può anche starci una volta ogni tanto. :)", "business_id": "zpsDyx9wh7LYjtBLTpu_-w", "stars": 4, "date": "2015-01-28", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "UTzpK0D8maxbXbnC8b3-dQ", "review_id": "BpqxY-RyG0ECvzJ6sEYVWA", "text": "Hmmm, I have a sneaky suspicion that someone's been reading their reviews online!\n\nWhen I last wrote about Bar Kohl I got into a major hissy fit because the bartender poured red win into a cylinder to measure out the glass, and then without washing said metal cylinder, poured white into it. This was not at all A-Ok to me or my girl-date (stole that one from Jen L. ha!).\n\nHaving been back twice in the past week (end of the semester, don't judge), I have been pleasantly surprised. Not only did they wash every single glass and utensil that was used in the bar, they were extraordinarily meticulous about measurements, tasting cocktails and making sure flavours where spot on. Needless to say, I really really enjoyed the cocktails, and judging by the state of them, so did the girls.\n\nOne tiny mishap, one bartender tasted the cocktail (it was the same one with the cylinder a few weeks ago) decided he didn't like the taste, then used the same straw that he'd just stuck into his mouth to taste the cocktail again. Bad move.\n\nBar Kohl, work at it, you're getting there, but for the love of the holy spaghetti monster, PLEASE tell your bartenders to keep their saliva out of my drinks. \n\nTa,\nLou", "business_id": "QPsNlmETw14k-_RqX-RULw", "stars": 4, "date": "2011-12-21", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "9c7QFk1usbU55mwrZJIosQ", "review_id": "e3-ZYG95yxd1o7GVgH1NXA", "text": "This place is brilliant.  For a night out definitely come here first.\n\nI tend to buy a couple of pitchers, highly recommend the fruit salad one and the Fab Ice Lolly one. Its just something totally different and a pitcher to 2 people is enough to get you a little tipsy. \n\nPrices are a little expensive as pitchers start at £18 but definitely worth it.\n\nShots are around £3 but who could say no to a bubblegum or birthday cake flavored shot!!! \n\nExpensive but enjoyable. I'm pretty sure their food isn't so great however. I vaguely remember inquiring and they told me it was frozen, microwave food. I have not tried it though so no comment as of yet.", "business_id": "QPsNlmETw14k-_RqX-RULw", "stars": 5, "date": "2014-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "qvrnItoE_UDGO0WqEuPyzw", "review_id": "1wRR_EyOx6PfrjolB25fqA", "text": "I've been here more times than I can count (it's a good location and does snapfax- student essentials) but I'm frequently underwhelmed by it. \nI mean, there's nothing wrong with it as such, and it's not bad, it's just (for me) not special either.", "business_id": "QPsNlmETw14k-_RqX-RULw", "stars": 3, "date": "2014-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ng7EzEw8E3rmBygGiq6dsg", "review_id": "8GpN_anrxeifirAPeLx2gg", "text": "Nous avons passé notre dernière soirée dans ce bar en plein centre d'Edimbourg. Nous voulions aller au devil advocate mais qui était complet. \n\nIls ont une large carte des cocktails que nous n'avons en revanche pas gouté. \n\nCependant nous y avons mangé ! Nous avons fait l'erreur de prendre le beef and chili nachos (12e) pour commencer à deux. Je n'avais jamais vu un nachos aussi gros ! C'était très bon mais énorme, il faut être au moins 4 pour le manger ! \n\nMon ami a pris l'ultimate burger (15e) , pareil énorme, mais très bon. Et je n'ai quasiment pas touché à mon plat, la falafel salade. La galette de falafel n'avait aucun intérêt, aucun goût et une consistance très aérée sans aucun croquant. Je pense vraiment qu'il faut y manger les spécialités, à savoir les burgers. \n\nLes serveurs et la clientèle sont très sympa, c'est une bonne adresse pour une soirée à deux ou entre amis.", "business_id": "QPsNlmETw14k-_RqX-RULw", "stars": 3, "date": "2015-01-02", "type": "review"}
{"votes": {"funny": 3, "useful": 7, "cool": 5}, "user_id": "4ulkvNf-T_UVM-e4dd0lbw", "review_id": "I23rjlooH9-U9uDhtyjpEA", "text": "It's difficult for a Grassmarket pub to fail given the sheer amount of volume (boozers, stag and hen party-goers, and tourists like myself) passing through its streets. Enviably, Bar Alba, located at the end of the 'market, is able to offer stunning views of Edinburgh Castle while still being in the midst of booze-filled revelry. It aims for class and respectability, given the decor and high prices, but ultimately ends up resting on it's Grassmarket, high-traffic laurels. Overall, it's not the worst pub out there, nor is it the best.  \n\nIn your own drunken revelry, don't let it's name fool you as it did me: this place has nothing to do with Jessica Alba; rather, as has been pointed out to me, Alba is Gaelic for Scotland.  However, Bar \"absent Jessica\" Alba did have a rare feature, of which I'm sure Ms. Alba herself would approve: easy wheel chair access (including the loo).  So, I recommend this place if you have friends with special access needs or if you just like a little extra leg room when you are recycling the evening's beverages.", "business_id": "pM4RA9OXTsJn7cR9ilsmQA", "stars": 3, "date": "2009-12-05", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "6cEjxKwdxNeet2vt55XDfQ", "review_id": "sh9g-oxB3qRSixzfi17O9w", "text": "The Villager belongs to the same people as Dragonfly so expect a few of the same traits- hot music, hot cocktails and hot staff. The design is a trendy blend of old meets new, retro wallpaper lit up by giant chandeliers. There's plenty of seating in this place, even a private room at the back but be warned, on a Friday and Saturday night it fills up very quickly.\n\nThe food in the Villager is pretty tasty, very light and fresh with a lean towards Asian fusion. I've never disappointed by the food here but I would say that the quality of the kitchen is not as high as the quality of the bar. Cocktails here are phenomenal. I have it on good authority that all the syrups and fruit blends are made in house- especially appealing! I would recommend the Villager to anyone looking for a classy spot of drinking. Well, maybe it will begin classy- who knows where it will end!", "business_id": "rkk2gLhqB3P5lwaGeBiDqQ", "stars": 4, "date": "2009-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "wx12_24dFiL1Pc0H_PygLw", "review_id": "naiip34knLNsRvTu_egkuQ", "text": "Going against the trend of what Villager is popular for (Sarah-Jane and her post-Villager hangover!) I actually came here to cure one, not create it.\n\nOn a very blustery, wet and horrible Edinburgh Saturday afternoon, all the cafes were full right up and so coffee with a friend was taken to the pub. \n\nVillager is a big bar, central on George IV bridge, and a really nice bar. It's warm and woody inside, plenty of room, with boots and tables, and friendly bar staff. Whilst I wasn't eating, there's lunch and dinner (usual gastro pub fare) and the plates I saw and smelt go past looked delicious.\n\nBut, one too many vodkas the night before, and it was 11am, so I opted for one of their smoothies. A pub that does home-made smoothies - how novel! The Villager Garden (I think): cucumber, mint and apple juice. It was really quite delicious! Green, thick with bits of mooshed up cucumber and mint, and so refreshing. I'd highly recommend!\n\nNow I've experienced it, I'll certainly be back for an evening burger and drink methinks. I could see it fast becoming a favourite mid-week watering hole for me...", "business_id": "rkk2gLhqB3P5lwaGeBiDqQ", "stars": 4, "date": "2011-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "wx12_24dFiL1Pc0H_PygLw", "review_id": "cwj_6t4U-dmF3N_tdRi6OQ", "text": "This pub just has it all. Great location on George IV Bridge. Amazing decor, really big booths for larger crowds. Good cocktails, really great choice. Really, really tasty food. Free wi-fi. Amazing non-alcoholic smoothies for day-time.\n\nIt's the sort of place I would go to for an early morning coffee with my laptop, lunch with friends, a pub-dinner with the boy, or cocktails with the girls.\n\nWhen I last went I had a tequila cocktail which was num. The boy had the Scotch Broth which was just how my grandma used to make it (delicious) and some sort of spiced chicken breast and sweet potato mash. The food is really, really well done. Not \"pub grub\", more gastro pub. I need to try the burgers, but the other food just all looks so good too.\n\nNot much more I can say but I heart Villager!", "business_id": "rkk2gLhqB3P5lwaGeBiDqQ", "stars": 5, "date": "2011-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 4}, "user_id": "wx12_24dFiL1Pc0H_PygLw", "review_id": "-FKHU6Sl3QdkWydryEABhA", "text": "Villager isn't just another trendy, central bar - oh no. As I've said in my previous review, this pub has it all: the decor, the location, the choice of alcohol, the free wifi, the lunch and dinner options, the super tasty non-alcoholic smoothies. \n\nHaving enjoyed one of said smoothies, a vanilla latte, and a cocktail on previous visits I have been eager to try their food for ages. The menu is just that little bit different. Pub food, like burgers, are present (of course) but there's a lot of asian influence, and exciting sounding things like coconut-battered fish, vodka mussels and the like.\n\nMy friend and I opted for a few small starters to share, and oh boy. We had the prawns, the chicken skewers,the beef quesadillas, and the flash-fried vegetables. It was all really, really delicious and beautifully cooked. This is indeed no standard pub fare, the quality of food is great, and the prices are really reasonable considering this. Beautiful flavours, no grease or 'pub-type' heaviness. The food was healthy, fresh and just mmm.\n\nThe cocktails, on yes the cocktails. I tried the Lychee and Rose Martini. Hendrick's gin with just raspberries, apple and lemon. I was curious as to how it would taste, but it really did like rose. Very fresh. My friend's Berry Flirtini was equally delicious. The cocktail menu is expansive, they have very different offerings, and I will certainly be back to try more. I didn't have another as at an average of £6 a pop they're not cheap - but no more expensive than any other cocktail bar in the Burgh.\n\nI've waxed lyrical plenty about this place. But from the outside it could just be another standard pub. It really does offer something a little different, and with its slap-bang central location on George IV it doesn't need to try as hard probably, but it still does. Nicely done guys.", "business_id": "rkk2gLhqB3P5lwaGeBiDqQ", "stars": 5, "date": "2011-02-22", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "MQ1QQ8WVVAI3EZpMyP_6yg", "review_id": "5xIeAJ0rWkIhsdaiCY0mQA", "text": "Birthday cocktails at villager? Heck-to-the-yeah! \nMulled cider after a rather stressful day Christmas shopping? Try and ruddy stop me!!\n\nSo, first trip here was with some other oh so lovely yelpers, as a little get together on my birthday. Did I have a totally awesome day? Yes!! Did going here help?? Fo' sho! We had a lovely little booth by the window. There was banter, there was chat, there was delicious cocktails. I had the berry flirtini, of course!? It was fruity and spot on!! I then had the Mistral Royale which just as tasty, but sadly about half the size! There was also munch, I plucked for some spicy potato wedges and Mussels which came in a vodka-y/vermouth-y broth. Both hit the spot, although I thought the broth from the mussels lacked flavour or a certain punch, which I had been expecting. Overall this visit was good!! Only down point being I did feel like they were maybe rushing us a little, I get it, we are sitting in at a food only table, but I certainly was not in any scramble to leave.\n\nSecond visit was specifically for the mulled cider I had seen advertised on the previous visit. My friend and I had spent the afternoon trampling down Princes Street 'trying' to get some Christmas shopping done. It was not a very productive afternoon, and the Saturday rush was beginning to get to my head, the only sensible solution - Mulled Cider. He utterly agreed, of course, who wouldn't!? So we headed to Villager. He was rather impressed by my choice....... and the cocktail menu. So we had some cider, it was perfect-o, warming, not too sweet with a lovely hint of orange. Then of course he wanted to try one of the cocktails, so I just had to have one too. He went for a cucumber-based concoction, which was not to my tastes, but he enjoyed it. I had some lethal tequila lovely yummy tasty thing. It was as good as my last experience of Villager cocktails. Only problem this time, lack of comfortable seating if you are just having a drink. I don't like sitting AT the bar, but other than that, very good.\n\nI can very well see myself returning, the cocktails are just de-vine!!!", "business_id": "rkk2gLhqB3P5lwaGeBiDqQ", "stars": 4, "date": "2011-12-19", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "RH2K7RqzkGUa0pD0nSMDcg", "review_id": "GE78N31qsDPwUVcsybt7RQ", "text": "Ahhh Villager.\n\nI used to come all the time for your Espresso Martinis but after some of my vaunted \"staff\" issues (slow, haughty to the point of rude) I stopped.\n\nHowever I've been back twice recently once for some \"lads\" drinks and once with just one friend and it was friendly, quiet, and VERY enjoyable.\n\nGood drinks and faster service than I remember and the staff were really nice. \n\nThey even have an excellent beer on now called Sierra Nevada which is highly recommended.\n\nI need to go back and try the cocktails more and also the food (especially sharing stuff) looked really good. \n\nThe staff are still hipster as f*** though....", "business_id": "rkk2gLhqB3P5lwaGeBiDqQ", "stars": 4, "date": "2012-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "I0tf3FNaIdtj5__aBPhTrw", "review_id": "80KDw7k78T2FBkeJBlPLCA", "text": "Lugar bien cool, justo frente al The Outsider, para hacerte con un par de cócteles después de cenar. O antes, que tampoco es plan de ponerse muy tiquismiquis... Las bebidas tienen buen precio y están muy bien preparadas, además hay que decir que casi no se demoran en la preparación pese a la cantidad de gente con la que suele poblar el local.\n\nMi recomendación es intentar hacerte fuerte en uno de los sillones Chester y de ahí dejarse llevar a lo que diga la noche. Tienen un cóctel con Kraken Rum muy similar al Kraken Stormy que está increríble de rico.\n\nEl personal, eso sí, es un poco más seco que de costumbre, pero se les perdona.", "business_id": "rkk2gLhqB3P5lwaGeBiDqQ", "stars": 4, "date": "2013-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sfJP6W0E_JThj5eXLBd6pA", "review_id": "f_rF_lTOySku6t3FDvsZZA", "text": "To me, the Villager feels like a regular bar that thinks it's really cool, except it isn't. The staff have a bit of a wannabe hipster vibe. The food is standard gastro-pub fare and does the job without too much problem. The last time I had food I had a burger, which was a bit dry and just alright.\n\nThe staff were pretty snobby on my most recent visit; they came over as proper draconian on the whole \"you will definitely have to move from this seat because someone might want food at some point in the near future even though this table isn't booked\". Five women drinking cocktails over the course of two hours is apparently not a priority for the bar, despite the likely higher bill for £8 per drink. We got hassled quite a few times about where we were sitting and it was irritating to feel that as paying customers we weren't as important as people eating.\n\nOn the plus side, the location is excellent and it's often chosen as an inoffensive place to meet up with friends for catch ups. Don't expect anything exciting - its hipster vibe feels a bit tired and obvious.", "business_id": "rkk2gLhqB3P5lwaGeBiDqQ", "stars": 3, "date": "2015-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wqoNDGpedRvfMV90xxCqZA", "review_id": "7dyDYowRv_Oy0p7DoRDd0A", "text": "This, somewhat accidentally, seems to have become our go-to place in Edinburgh when meeting friends. This is partly down the location, with George IV Bridge being central to most of our city adventures - but also because it's simply a good place to be.\n\nIt's predominantly a cocktail bar; or at least has always been marketed that way for as long as I have been going - sporadically over several years now. It's a big cocktail menu; each one made with care by an experienced and energetic staff - and I've not had a bad one yet. Real highlights include the Burntisland Iced Tea and the Lychee Rose Martini. I've had some other nice drinks from here; there's usually an interesting beer or two (at least in bottle form) and in the winter months I've been treated to warm, spiced cider.\n\nThey do now have a big focus on food; with the back area now sectioned off exclusively for those hoping to dine with their wine (or cocktails). I've only eaten a couple of times; but both times were fantastic. The first, I enjoyed a winter warmer of chorizo and chickpea stew, in a really delightfully rich sauce. The second was good old sausage and mash, but jazzed up a bit. No complaints there, everything is very tasty and leaves you wanting more. Even the tap water, brought in a jug full of mint and cucumber, is instantly refreshing and better than your standard bar fare. Great stuff!\n\nThe only downside is that it's a little small, especially now since the majority of space is reserved for eating. If you want to meet friends for drinks only, there aren't many tables and the long bar reduces standing room - and then of course the \"background\" music is often blasted out at a volume that means you can't hear your friends anymore. But that aside: if you come when it's a little quieter: the staff, food, and drinks will make you want to return. Brilliant!", "business_id": "rkk2gLhqB3P5lwaGeBiDqQ", "stars": 4, "date": "2015-12-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "7DxQDfrnoQI9nGALyi-LyQ", "review_id": "IuD5dq28l8gLob-mzzRRrw", "text": "Oh Uncle T's ...how do I love thee?\n\nI don't get to Uncle T's too much anymore because I don't live as close as I used to - but whenever I took breaks from the library up the street while I was working on my dissertation, Uncle T's provided sustenance.  I would get the chicken and spicy avocado sandwich, toasted.  Always get it toasted.  Don't get it on the baguette either because it will be too hard to eat and all of the fillings will fall out - trust me, I know.  \n\nWhen you eat in, they give you loads of napkins and usually a fork as well so you can gobble up all of the goodness which will inevitably fall out of your overfilled sandwich of toasty tastiness.  \n\nIt's even gotten to the point where the owner, his son, and the random guy who is always hanging out with the owner when he's not busy, all know who I am.  Whenever I go in these days they say they thought I'd moved back to America and they're so glad I'm still around.\n\nThe only down side of Uncle T's:\nIt's really hard to actually eat IN here but there aren't many places to actually take your sandwich as, let's face it, it's Scotland and there aren't many days in the year when it's nice enough to sit outside.  But, the tables here are tiny and extremely low, which makes eating in a bit tricky.\nThe other down side is the owner's buddy who always wants to chat about politics - and once he found out I'm American, had a field day with me.  Actually, since Obama he's been much better but before the election  it was getting pretty old.... \n\nBut to sum up - Uncle T's - top notch sandwiches all the way", "business_id": "AYobEbZ5JZ3WuEQaQnRXvQ", "stars": 5, "date": "2009-01-15", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "6cEjxKwdxNeet2vt55XDfQ", "review_id": "Q15U3kc2RyqEFMUM0A8TXg", "text": "If the house in Hansel and Gretal really existed and it was made out of Italian meat and cheese rather than sweets and chocolate- Valvona and Crolla would be it. I bet you even the wallpaper in this place tastes good. Valvona and Crolla deserves its reputation as a landmark in Edinburgh with produce this good. The cafe area upstairs is great if you're looking for some crostini or a nice salad but I'd recommend you just spend your money on tasty treats to take home. More than just a deli, this place is really special. Just read 'Dear Olivia' if you're looking to be sucked in even more. I love it here.", "business_id": "NLjG1EDhI2Aa71ZoLFqbQQ", "stars": 5, "date": "2009-01-08", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "UTzpK0D8maxbXbnC8b3-dQ", "review_id": "0hoMBSWIyz0U63LwyxRRyw", "text": "I went here with a couple of Italians (they're like accessories, you should always bring them to a deli), and had an absolutely amazing time. The cafe, all the way in the back of the deli serves delicious sweets and cafe. No, not coffee, vero cafe, espresso, cappuccino and all the way they should be.\n\nThe deli-meats were delicious. I miss my mortadela something awful when I'm not in Italy (unfortunately that's most of the year) so coming here and seeing this beautiful meat displayed, well, I simply couldn't resist.\nI batted my eyes at the meat-counter man a couple of times and hey presto, mortadela slices to taste for me and my friends. (Italians, I love them).\n\nThis is the type of deli that I've come to know and love back in the Northern part of Italy. I've missed it, as we don't really have that many of them in the Netherlands, but finding one here was like finding the One Ring. (Only, maybe a little less .. orcy).\n\nI highly recommend you go here, I also highly recommend you leave your credit card at home. Otherwise your rent-money may just end up as mortadele-meat.", "business_id": "NLjG1EDhI2Aa71ZoLFqbQQ", "stars": 5, "date": "2012-02-21", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "-QSNRIxny2I26yJT82OWtA", "review_id": "WlvSGS8L2kiFmRTvUY4OhA", "text": "This place is such an asset to Edinburgh.  Italian food is so interwoven to our household that I make special visits into town just to get a few essential supplies, here are my top 5 favourites.\n\n1. Olive Oil (choice of about 50) really top end quality.\n2. Sour dough bread & Panettone\n3. Their home made pizza (ready to cook at home)\n4. Macaroons (not always available, but a must when they are)\n5. half bottle of Muscato sweet sparkling wine.\n\nThey also have mean olives and artichoke hearts in their delli and a good choice of fresh coffee beans.  \n\nI can easily loose an hour in here looking at all the unusual things from floor to ceiling, the café is pretty decent and although usually busy, you don't wait too long to get a table.\n\nA voucher for Valvona & Crolla is one of the fail safe presents to me from my husband.", "business_id": "NLjG1EDhI2Aa71ZoLFqbQQ", "stars": 4, "date": "2013-01-12", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "-QSNRIxny2I26yJT82OWtA", "review_id": "mDv8qUw7n4q54ZaJoThOUw", "text": "Was delighted to get gift vouchers for here for my birthday and had so much fun spending them :0) \nI bought their own brand prosecco which is delicious and highly recommended. Also stocked up on pasta, olive oil and chocolate.  \nThe shop is so nice to just have a wander around.", "business_id": "NLjG1EDhI2Aa71ZoLFqbQQ", "stars": 4, "date": "2013-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mZWEPIfrJoUgiLJkhnb19Q", "review_id": "SgEEVCqu0icgvIGBenVanA", "text": "I had a pasta dish in the caffe bar for lunch when I met an old friend with whom I used to work in San Francisco before she moved back to Edinburgh. Valvona & Crolla was someplace I had on my Edinburgh food list to try not only for its caffe bar, and wonderous selection of deli meats, cheeses, and wines but because it was mentioned in one of Andrew McCall Smith's Isabel Dahousie novels. The fact that it was 2 blocks from the B&B I was staying in was also a factor.\n\nGood meal, good company, and I'll have to return one day to pick up some picnic supplies.", "business_id": "NLjG1EDhI2Aa71ZoLFqbQQ", "stars": 4, "date": "2013-02-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 4}, "user_id": "wx12_24dFiL1Pc0H_PygLw", "review_id": "K-0RbuJbEDnrrvPlOnIDvg", "text": "Oh Valvona & Crolla, how my heart is torn in twain over you. If I could eat from here every day, I would. But then I would be living in a cardboard box on the street outside, a very well-fed but poor person.\n\nValvona & Crolla has been established as a genuine Italian deli (meaning, run by an Italian family, with real Italian products) since the 1920s in Edinburgh. They are like the Godfather, but with less horse heads (oh, is that contentious given the current food situation? Hmm.)\n\nFor that reason, their food is at once exquisite and expensive. We went here on a Sunday afternoon to buy ingredients for a simple Sunday supper. Gluten-free pasta, pasta sauce, and some vegetables. That's it. So why, pray tell, did it come to £18? The two types of vegetables we got cost more than the wine we bought later. I kid you not. £6 for a pot of maybe 5 slices of chargrilled aubergine, and £6 for a wee pot of sundried tomato. More fool me for not checking the price before we paid, so it is my own fault, but wow that was a big sting.\n\nOther products may be cheaper, but it seems their grilled vegetables come at a high price. But if you are looking to spend an extra few pennies you can get olive oil that tastes like it's been squeezed straight from the hills of Sicilly; balsamic vinegar that is the only dressing needed to some rocket salad. They also have baked breads, croissants and the like. Equally pricey (around £1.50 for a croissant) but a nice treat.\n\nI previusly came here for breakfast, and I remember two breakfasts and two coffees and OJs costing £20 to sit in. Ouch.\n\nMaybe not the best place to shop daily, but if you're looking for quality, taste-of-true-Italy ingredients for some home cooking, then Valvona & Crolla can't be beat.", "business_id": "NLjG1EDhI2Aa71ZoLFqbQQ", "stars": 5, "date": "2013-02-21", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 5}, "user_id": "7bc7UFRA5VtF6G_MCoB_7A", "review_id": "jK5SpsH9JwJYWSN89G3EEw", "text": "Had a lovely lunch today at Elm Row.  Really impressed with the aftercare. \n\nHad two waiters who had style and grace. They both had well groomed breads.  I was hungry after my mains and had a roast potatoes side at the end of the meals! Completely back to front! They didn't skip a beat. They were delicious as was the polenta, rocket and pine nuts mains I had before. The sauce on my dish was gorgeous. Can't place it, love the mystery. It didn't matter as I nearly wanted to lick the plate!  My friend had a aubergine dish. She loved hers. \n\nThankyou. Happy New Year!", "business_id": "NLjG1EDhI2Aa71ZoLFqbQQ", "stars": 4, "date": "2014-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0Yn4NrXrBZGBpNPICk_F8w", "review_id": "geuwozMbyrnu5cL_92073Q", "text": "Amazing customer service! My wife and I are big fans of Alexander McCall Smith's 44 Scotland Street series of comic novels in which V&C is featured as part of the setting in Edinburgh. The characters pop in to Valvona & Crolla for their sun-dried tomatoes, olive oils, wines and other delicacies. Angus' dog Cyril once surreptitiously ate a small salami that was knocked of a shelf. Having never been to Scotland, I didn't know if V&C was a creation of the author's imagination or a real shop. I Googled and discovered that it is indeed, real. Next, I found a perfect gift for my wife, a Valvona and Crolla shopping bag. After setting up an online account, I began to input my PayPal and shipping info, only to discover that there is no provision for shipping outside the UK. Alastair and the Despatch Team to the rescue! He answered my questions, got me a shipping quote, and gave instructions on filling out the forms. My order is now on the way to Texas via Royal Mail. Hooray and it occurs to me that Mr McCall Smith is also a fan of this fine establishment, since he features it in the novels. Thanks again and Happy Christmas!", "business_id": "NLjG1EDhI2Aa71ZoLFqbQQ", "stars": 5, "date": "2015-12-14", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "pAZYqb6OuPjlHF7AeGy6uQ", "review_id": "IsGFdTTDIXu3VSVVitBDGA", "text": "Haters gonna hate. Personally, I thoroughly enjoyed Dynamic E!\n\nVisited a few days ago (in January), so had the place pretty much to ourselves. In our visit there we travelled back in time, stood in a volcano, strolled through the Ice Age (it was a walk in the park), stuck our tongue out at a big ole (plastic) lizard in the rainforest, watched a 4D movie and moved one step closer to the stars.\n\nIt's cheesy but good, suitable for kids of all ages, well paced, entertaining enough for wee yins but with enough info posted around to keep from patronising the oldies. I've got to say though, the experience was heightened by the awesome, friendly bunch of staff. Their information tripped off the tongue, they were approachable and engaging. They weren't too full on as you sometimes get in these places. I got the impression their opinion really mattered, so rather than seem like they're complying to a glossy gimmick their personalities shone through when delivering shows. Their chat was definitely spontaneous, so we learned more as a result. And I do love to learn!\n\nAside from the staff, my highlight was David Tennant's narration of the cataclysmic tale of the universe. The movie was touching and inspiring, not to mention easy to understand. \n\nI didn't make it past the gift shop alive - they've got GEMSTONES. I ended up buying myself a bloody cuddly parrot as well. How old am I? Never too old for Dynamic Earth! Gies a job!!", "business_id": "Rza-FztnKi8YfcSkn1KxgQ", "stars": 5, "date": "2011-01-22", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 2}, "user_id": "0CEXbozEEvYojdGxdX1ejg", "review_id": "bKzkCAVgPyFnhkP5pf2rZA", "text": "As a sucker to all things in connection to the Beautiful Sciences of Earth and Space, I must admit Dynamic Earth is a dream land for me.\n\nI cannot fault this place at all. It is filled with knowledge for both kids and adults alike. You are taken on a journey from the Big Bang to the shaping of the Earth and at no point during this journey are you at all bored, unless this stuff doesn't interest you at all, in which case why did you go?\n\nI feel this place just gets everything right. Instead of having you wander around aimlessly to begin with your left to watch a series of documentary like movies based on some of the main events which have shaped our world. These movies, narrated by John Hannah(the mummy) are the perfect introduction into the Dynamic Earth scene and do fantastically well to keep the guest interested. Then to end the day with a Bang we finish off with the beautifully done 'We Are Astronomers', an inspiring short film telling the story of the incredible progression of Astronomy today and how we are all joining together to delve deep into unraveling the answers to some of life's biggest questions about the Universe and the beginning of, well everything really.\n\nWell thats the exhibits done, now lets focus on the other little things that make a big difference. The staff were amazing. I didn't feel they felt forced to give 5 star service, I felt they just genuinely wanted to. The gift shop had all you could expect, magnets, mugs, postcards, books, cuddly toys, selection of sweets, stationary, and all those little silly science type toys kids would love to waste there money on. I spent £30, I was happy with that.\n\nIn the cafe they had a great choice of food and I enjoyed my chosen meal. The staff were not overworked and everything flowed very well.\n\nWould I go back again??\nI ALREADY DID!!!!!!", "business_id": "Rza-FztnKi8YfcSkn1KxgQ", "stars": 5, "date": "2011-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "OH7IB5YVhs41H7x4dHpuNg", "review_id": "V0bbLp8KzHHIq1h7GM0LLQ", "text": "The best sausages in town, oh, and their other stuff not bad either!", "business_id": "kRMmce-qdD06nm4ESno_3g", "stars": 5, "date": "2011-02-21", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "KMplxDK7d5FTD_5YbCUkIQ", "review_id": "s6gLqJ2pzOFD8RBA819AXQ", "text": "When I crave meat, I make the journey here. It does not smell like a meat shop, which is huge for me. The place is spacious, the butchers friendly, though sometimes I can't understand them and they have to speak slowly for me. I feel like a bit of a tard, but they hear my american accent and just smile indulgently at me. \nThey have lots of extras- meat pies, sundries, sauces, take and bake pies and things. Mostly, I get bacon. They have this gorgeous back bacon which does not fill my pan with fat grease like store bacon. It tastes sort of like Canadian bacon, which I ate a lot back home- way less fatty.", "business_id": "kRMmce-qdD06nm4ESno_3g", "stars": 5, "date": "2014-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z5F91_JiTdWwIFoD9ZqcSA", "review_id": "7QD_gBiBfh_8re5DPng3mA", "text": "Crombie's is one of those places where proper carnivores flock to, despite the somewhat modest website sausages.co.uk. As most would know one of the real pillars of the carnivorian diet is sausages and bacon(see that ties in nicely with the web address), and Crombie's has those in spades, varieties and quality. None of your low grade supermarket/fast food meat here thanks!\n\nApart from basically being a one-stop shop for wannabe protein addicts they also do meal deals during the week. Coincidently during my first week here this was largely what my meals consisted of due to my manager's desire to show me around. So I can vouch more than anything for their lunchtime meals, which although a bit costlier than your £3 meal deals at the shops will give you a much more solid meal, ranging from some sort of potato concoction called 'stovies' to probably the most generous hog roast in a bun i've ever seen(seriously there's so much hog that paper bag your bun comes with is required to keep it all contained)\n\nTheir lunchtime meal deals seem to be incredibly popular with the locals so it's worth shooting there as soon as your lunch allows, because the food does run out quickly especially with Thursday's hog roast.", "business_id": "kRMmce-qdD06nm4ESno_3g", "stars": 4, "date": "2014-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w_NcBy_E23Yg9wRKOb6oOA", "review_id": "fN2kvQNLB4LmTpFYzs_5wQ", "text": "We picked this pub based on Yelp's reviews and weren't disappointed. The pub has a very old-school drama-Yama feel to it and I felt at home immediately just looking at the numerous musical posters on the wall. \n\nWe had our dinner here and opted for a mushroom soup to start with a Mushroom risotto as main. The soup was light yet creamy enough to finish the whole bowl of it. The accompanying bread was kinda salty- very different expectations from me. Hubby loved it more than me. I personally loved the mushroom risotto very much. A good stomach warmer for the cold outside.", "business_id": "8uMP4kv2Je6rM9ZNz0apGw", "stars": 3, "date": "2012-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "h4tfHGODErFCFrg6KEZ3xw", "review_id": "kqlnSP7kcaBh8-x2JomILQ", "text": "When a pub reminds me of an old favourite spot, then it's safe to say we're going to be friends. The Antiquary sure felt like home from the onset.\n\nAs newbie musicians to the Stockbridge area, we were here for a folk jam, with a slight problem: we don't play folk. We had thought it was an open mic. Turns out, it's just friendly folks playing music in the corner and anyone can join in/take their turn. Or you can have a drink and just savour the sounds. If you're somebody who wants to dip their toe into the live music scene, this would be ideal because whilst there's an appreciation for the music, it's very relaxed with light chatter going on in the background. The musicians who lead the night are really very talented; a pleasure to the ears. What was really lovely was that we came in with our guitar, sat at the bar and thought that it might be best to sit the night out and listen, but the kind lady behind the bar told us that we shouldn't be shy and that it was an open forum. She even sang a song later in the evening, which was sweet. \n\nThe friendliness continued when we took up seats closer to the jam. Before we knew it we played some original songs and our tunes were brought to life in ways we'd only dreamed of. - There's only two of us, and we long for a bigger sound! The musicians couldn't have been friendlier and really set the tone of the pub. Bar staff, musicians and drinkers alike were appreciative that we'd come along to join in and we're already looking forward to next time. \n\nI'd really been missing my previous local and their live music, roaring fire and undeniable friendliness. - The Antiquary seems to have filled that void.", "business_id": "71Jz93r-PIkXpAP9Od_YwA", "stars": 5, "date": "2015-12-11", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 3}, "user_id": "PkJtD1KS8iJOwTuuoyfX6Q", "review_id": "QhNHMuQkE7S6g_exTcuG2Q", "text": "You know exactly what you're gonna get with the Tron which is a good and a bad thing.\n\nOn the plus side you've got cheap pints, location dead centre of town and bunch of other skint young folk to hang out with.\n\nNegatives include the \"cave like\" feel to the whole place and variable food.\n\nEvery self respecting student probably has a soft spot for this place... so I say go to the Tron, start you're night with some cheap drinks and good chat, then role on any whatever slightly more sophisticated drinking establishment takes you're fancy.", "business_id": "VxbK-VANsEOzqxTh_GzvzQ", "stars": 3, "date": "2011-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "In6L6fy4jFlN0E-LEZXGiw", "review_id": "eFFrITkk0dJ765NBrO2r0Q", "text": "Tron.  Serves it's purpose - cheap drinks and food.  If it's the end of the month, just before pay day and you need a cheap light refreshment and standard \"ok\" pub grub then come along!  Primarily a student venue (I felt pretty old hangin out here), current cheesy pop tunes on the boombox and cosy seating in the wee rooms off the main bar area downstairs.  If you are lucky enough to have a student card you can apply for a discount card, offering money off drinks, offers vary depending on the day of the week.  Location is central and everyone knows where it is, I find myself using The Tron as a navigational way of describing where things are.  \n\nTip: Girls, mind yourself going down the stairs to the toilets in big heels!  It's steep and mind yer head!... Or maybe that's just me after a few to many drinkies?!", "business_id": "VxbK-VANsEOzqxTh_GzvzQ", "stars": 3, "date": "2013-01-29", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "HkM4_Ma6VMso6hTpg2V-1A", "review_id": "7XDK2PfkMBZf8pz7EDNbWA", "text": "A great pub with a decent selection of beers and drinks at reasonable prices.\n\nI remember specifically one of the things I came here that there was karaoke? And that the guy was \"singing\" Black Sabbath? I think I'm going to chalk it up to a one time deal but it certainly made an impression on me.", "business_id": "VxbK-VANsEOzqxTh_GzvzQ", "stars": 4, "date": "2014-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M4MVVzNPZHiJdnNvWjL8VQ", "review_id": "LtRRFi7-JLW3WYw8KqYKlA", "text": "Headed here for a mid-week dinner last December and ate & drank very well. The beef cheeks were a particular highlight and the service was some of the most attentive I've ever experienced. Thoroughly deserves its reputation.", "business_id": "r3QvCj1tsgASA90GBU3eVg", "stars": 4, "date": "2013-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zC4IEveR2noEVaCB63n1Ag", "review_id": "i4ex2TPvW0Ai_4UgVG3raQ", "text": "delicious and such a find while my time in edinburgh.  it was exactly the right distance from the university for the moments when i had serious food craves. this place gradually became a home. the food is affordable (expect to spend 4-6#), come in large portions, and there is an array of veggie/vegan-minded fare for every heart's desire. expect soups, salad options, stews, and stir-fries all cooked with integrity and charm. the climate is down-to-earth and relaxed, with a lot of wooden furniture and art only appropriate for all that good food you are having. for those who like to drink, you can byob. a solid 4-4.5 stars.", "business_id": "nqZXFkRTH_vsGvOzRVWI8g", "stars": 5, "date": "2010-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B9p4cnBr3YPedWA8Gh104Q", "review_id": "TlT3Gi-pIFtDytYgMZkwJQ", "text": "Great location and fab food and service , kids are well catered for and well worth trying a cocktail. Staff are always very friendly and some great memorabilia around the venue.", "business_id": "u-JyVztsrx2f9sZKm5FvWQ", "stars": 4, "date": "2009-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aB381EcDRD0WT4IU66Z8KA", "review_id": "--w8Q_rscJhjzvW7xGFLWw", "text": "If you really need to visit an American chain restaurant while you're in Edinburgh, please do yourself a favour and walk a little bit further down George Street and go to the Hard Rock instead. This is possibly the most disappointed I've ever been going to a restaurant in Edinburgh. I've had better service and food from an airport TGI Fridays. We made a reservation despite probably not needing to. The waitress seemed disinterested, the cocktails were expensive and weak, the burger was overcooked, the wings were overpriced, and the onion rings were cold. There are very few places that I've ever sworn off going to again, but this is one of them.", "business_id": "u-JyVztsrx2f9sZKm5FvWQ", "stars": 1, "date": "2015-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "45hg3tzEPD-PnvSeiNi83w", "review_id": "s8bck_QGMfaRN8SBGQNqAg", "text": "Really good pie & chips!", "business_id": "2Yd7GEhU7uqzraztlLpWKQ", "stars": 3, "date": "2013-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "J_O5uZiEEB9aXNoT0Kya6A", "review_id": "Gd1D3YwGwkGWEVsYvyoBQA", "text": "Very nice place, very reasonably priced too! 4* luxury (mostly) with an interesting breakfast arrangement with Cafe Rouge! I'd certainly go back here to stay again.", "business_id": "BMrC7D5ApOsxPGY_oqn7-w", "stars": 3, "date": "2013-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KCyokAqFeI2-7CZX6uZ5bw", "review_id": "TFuNHayLTtOuQe54WBwFCA", "text": "We happened to get a great deal at this Hotel, and its super central to all the bars, and restaurants in Edinburgh. We had a triple room, and it was HUGE, there was so much space in the room, kinda wasted if you ask me. \n\nThe hotel is comfortable, and has everything you need. They have a deal with a restaurant nearby if you want breakfast. And they have free WiFi throughout the entire hotel, which is rare.\n\nThe only downside is there is no parking, though there is a long stay car park about 15 mins walk away. \n\nWould definitely stay here again.", "business_id": "BMrC7D5ApOsxPGY_oqn7-w", "stars": 4, "date": "2015-01-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "CwrdKoexxndK49mgm61bUg", "review_id": "x_fte7wApHMbynaegzuiFQ", "text": "The best quality they have!!!!! This is my favourit shop for fresh fish !!! They are very clean and polyte!!!! The price is not cheap like in the supermarket but when you get home and cooking this fish , then you understand why!!!! this is a kind of fish for joint a good health!!!! Thank so much guys!!! Giuseppe!", "business_id": "XbTQWKfOaFmg9Q8p9q3iSQ", "stars": 5, "date": "2013-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tDQhyPfdh5ce5dFetWLp5w", "review_id": "5kR27r4S1Uk-jHugouacwg", "text": "Good beer good whisky. A pity the staff have no sense of fun and let down edinburgh in it's cultural approach by treating fun loving visitors with no respect.", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 1, "date": "2010-02-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "Hc0sufBPV0ubfP-A7glUIw", "review_id": "c1Hhh5vZdKb-_aiV7SQh8A", "text": "I know a lot of the younger crowd have classified this as an old man's pub, but I think it is charming.  The non-nonsense staff are knowledgeable about the over 150 different bottles of whiskey that they stock.  No frills, no music, just good whiskey and ale in the Grassmarket area of Edinburgh.  Isn't that all you need sometimes?", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 4, "date": "2012-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rDk13HawRUdVyWLYsOTL1w", "review_id": "p_Jnvtjeo4JR9L02vNi7Zw", "text": "The Bow Bar is not perfect - what is? - so why 5 stars? Because as a fan of decent real ale pubs I cannot honestly suggest ANYTHING they should be doing differently. \n\nPop in for a steak pie on a weekday afternoon, bring a paper and enjoy quiet bliss. Or enjoy a livelier atmosphere on the weekend evenings. Although the changing daily cask ales are the real draw, there's also a fantastic selection of world beers (listed on the right-hand side of the bar). Another great pursuit in here is whisky. Especially for visitors to Edinburgh, the friendly bar staff will advise and talk you through several malts if you're up for trying a few. (As long as they're not too busy!)\n\nMy one problem with this place is going to meet someone on a busy evening and arriving first - it can be tricky to find a place to rest your glass, bag, coat, whatever, and one feels kind-of awkward. But, honestly, SO WHAT?! It's great! A no stags and hens rule adds to the appeal as well. \n\nDon't expect to have your mind blown by the Bow Bar - that's not what it does - expect a thoroughly decent and relaxed pub experience.", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 5, "date": "2013-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "FRDbugHwLHTzsPMAfwJduA", "review_id": "3ga-yHDE-ey0bYrtnTZJOg", "text": "Great bar for so many reasons, Beer range is always great, and they run mini Beer festivals which are very exciting! Awesome selection of Malts, and some not too shabby Rums and Gins also. The staff really know their stuff, which is what I would expect from an Edinburgh institution like this!\n\nDownsides, uncomfortable seating, bar counter should be longer to allow perching, no football....", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 4, "date": "2013-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "IBddBWgSfr4GpyqJx9MN3g", "review_id": "RwxGKf0cGznQT4BraE5K3A", "text": "This place is a tiny and gets very crowded but their immense selection makes it worth it. It also has a good atmosphere to it.", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 5, "date": "2014-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hxyxJ-Ul2Z3nVQ_ZdTE5Eg", "review_id": "ITu7YZtneFfUtc-pjAOPMQ", "text": "I agree with all the positive comments but I would like to add that even as tourists they made us feel welcome. Not all small, local pubs have made us feel this way. Fantastic whisky selection. Cheers!", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 5, "date": "2014-01-23", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "hkcQYLsj7QBTh6mmXbIE9A", "review_id": "0Jdmk9BzpRIMhXCtsOUG7A", "text": "Used to be a regular here many years ago, but stopped in with a couple of American colleagues who were in town. As always there was a good range of beers and excellent range of whiskys.\n\nThis place has a feel of a little old mans pub, except it isn't, it is small and can get very busy at peak times, but the customers are from every walk of life, age, type. It is friendly, you always end up talking to other people. And you can talk, no music, no tvs, makes life so much nicer, or is that just coz I'm getting old.\n\nAlso the staff are great, friendly with extensive knowledge of there products and very willing to recommend or discuss the whole gambit of the booze world.\n\nTop, only bad thing is I live in Glasgow and it is in Edinburgh.", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 4, "date": "2014-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "vu3zS6buvxid2Gy4CMqY2Q", "review_id": "IIKYzPUWLw1PFChJMeWjOA", "text": "This was the second stop on my solo whisky crawl through Edinburgh.  Located in the Old Town part of Edinburgh, the clientele is primarily 55+ men.  It's not a big place, and it's got a very friendly jovial environment. There is something quite refreshing about this type of bar!  The visit was absolutely worth it for the whisky collection alone.  I got a spot at the bar and went to work.\n\nThe staff (one from NZ) - much younger than the patrons - were very helpful in walking me through their impressive collection of whiskies.  My main goal was to try different whiskies that are hard to get in America, and the two barmen who were serving me did a great job of picking a few out to my tastes.  \n\nIf I've learned anything from my tastings, it's that anything put out by Cadenhead's (review forthcoming) is always a tremendous value.  Do yourself a favor and order a glass of whatever limited release they are offering when you're visiting!  Overall very knowledgable, helpful and friendly staff and absolutely worth a stop if you are looking for whisky.  In fact, this may be the best bar to taste whisky in all of Edinburgh.", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 5, "date": "2015-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aHpPR5MnwF3BOnV2nvyA4Q", "review_id": "YyEhKcIncOSh1JALEPtNcA", "text": "Whilst exploring the wonderful sights of Edinburgh, a spot of lunch and a pit stop was required. \n\nUnfortunately the cafe that had been recommended to me, was shut over the festive period so I decided to pop into this cafe / bistro instead which was close by. \n\nThe cafe was nice and quiet with only three other customers, so getting a table and ordering some lunch wasn't a problem.\n\nI was warmly greeted by the waitress who immediately showed me to a table. I knew what I wanted to order straight away, as the menus are stuck on the windows to entice customers in. I ordered an avocado salad and a glass of water (was feeling health conscious after the Christmas indulgence!). I didn't have to wait long for my salad to arrive which was also served with brown seeded bread.\n\nThe salad was lovely although I felt there could have been more variety of vegetables - i.e adding cucumber and spring onions would have been nice additions. Unfortunately too much vinaigrette was added to the salad which meant the salad leaves were dripping in oil. What a shame. Hence why a star is lost for his review. \n\nWould I return again? Yes I would as the service was great and there are plenty of food and drink options.", "business_id": "tw9LsOgI02DYT4L9Sr_quA", "stars": 4, "date": "2015-01-04", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "o64IkZLYluCHlDtWzQE71Q", "review_id": "vsuLyh9a_CyBmkmqrh2fkw", "text": "clean and convenient... \nAround the city we go...\nAlways on time...Ha...", "business_id": "9mW3X0VkQ61QWlJWWSGs7g", "stars": 3, "date": "2013-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 1}, "user_id": "wx12_24dFiL1Pc0H_PygLw", "review_id": "v8K8KUgzyefe0dAqoLnfpw", "text": "I know there is a lot of contentious talk on Yelp about Lothian Buses. One Yelper *coughJoeAcough* really, really doesn't like them. Something about a pizza incidence once?\n\nFor me, having lived in Glasgow, I can say Lothian Buses is miles ahead of the Glasgow network. First off, a set fare for any route in the city. Glasgow charges by the distance travelled. Yes, the price has succesively gone up from £1.10 to £1.20 to £1.30 and most recently £1.40 in the past two years. But that's still cheaper than what I payed in Glasgow 5 years ago.\n\nEdinburgh is a city of many villages. Stockbridge, Leith, Canonmills, Newington, Bruntsfield. And they're all connected by Lothian Buses. The routes are really great, they suit pretty much any route from A to B. The buses are frequent. The app, and the on-street electronic signs, are always accurate. The app is really pretty good.\n\nI think at the moment, given the Tram Works interrupting the whole city, the bus routes are disrupted. This can be annoying. But it's not the buses fault.\n\nThey also in the last year recently brought in a whole fleet of energy efficient buses. These new buses talk to you and do all sorts. Impressive.\n\nYou can't help who uses the bus, and yes the bus may often have questionable characters on it. But I think the Lothian Bus network keeps all of Edinburgh very well, and frequently connected. Their prices are fair, the bus routes are very convenient, and when you need to get from A to B they do the job.", "business_id": "9mW3X0VkQ61QWlJWWSGs7g", "stars": 4, "date": "2013-02-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "x7ZP6lB2fZl2UN6lun87lA", "review_id": "VhoUPnhqGQ209y1XKymIOg", "text": "Everything was fine, but the Hilton name let me down a bit in the realm of service.  There were no specific problems, but it just wasn't as crisp or accommodating as other Hiltons at which I've stayed, particularly Boston and Amsterdam.  I suppose that it's difficult to maintain a standard of service across hundreds of hotels worldwide.  For instance, instead of agreeing to have a cab waiting for me at a certain time of the morning, the desk clerk insisted that they could get me a taxi at very short notice and that I should just wait until I came down in the morning.  So of course it ended up taking about ten minutes.  \n\nWhen I checked in, they sent me to a second building across the street a few doors down.  The room was actually the smallest of my entire trip (a variety of lodging types) but was quite comfortable, except that I needed to pack for home and there wasn't quite enough surface area.  The shower/tub had a weird half-door which caused me to get water all over the place in the morning.\n\nThis Hilton is only two blocks from the Dollar Rent-A-Car on Haymarket Terrace, and maybe 3-4 blocks from the Haymarket train station.  Don't confuse it with the Hilton on Princes Street near the castle.", "business_id": "e8wCD4XNCcxSeTSrAU6xLA", "stars": 3, "date": "2009-01-21", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "_bN3gzZWy7BHrMbGWzx38w", "review_id": "e5TKeilM-7jLBtmyLJSgwA", "text": "I may be a tad bias when it comes to reviewing this hotel, but what the heck! The source of my positionality stems from my new found love for the city of Edinburgh. \nThe city is so beautiful complaining about a hotel seems incredibly obtuse. I shall however not digress and give you an insight into what the stay was like.\n\nNow what does a hotel have to do to gain browny points with me? Answer is simple, They can't be taking the buiscuits! Nothing spoils my ritual of having a brew before settling into my alien hotel bed watching an early 90's flick on sky movies than bad biscuits. You can imagine the horror when upon checking in I discovered that the biscuits were absent! \n\nThe staff at the hotel were extremely friendly, and catered for all my room service needs in good time. Parking is an issue, if like me, you didn't want to pay for it. Hotel does NOT have a guest carpark! Yes I know it's silly to expect to NOT pay for parking in a city centre. My theory is if I can get around it in Manchester I can get around it anywhere!  As it turns out you can get away with it but only 2 hours at a time, at the various Tesco stores located around the city centre!  Return to your hotel at 6 (after parking charge hours) and you can park outside the hotel for free, RESULT! However plan an early activity as you'll have to move the car in the morning! \n\nA second factor in my browny points book for hotels is its restaurant. On any given occasion when you don't want to venture out to have a meal, I feel the hotel should be able to cater for your taste buds! I am here to report that the restaurant indeed IS more than competent in this department. The menu is a little limited but the food I had was deliciously cooked and served in good time, although that might have had soemthign to do with the fact we were the sole diners that eveing at the restaurant. (It was midweek on a chilly January evening)\n\nAll in all a happy and satisfactory affair and whilst it may not be the best hotel in town, it is in close proximity to most of the atttractions Edinburgh has to offer.", "business_id": "e8wCD4XNCcxSeTSrAU6xLA", "stars": 4, "date": "2012-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LOStBS0zwzgq2plQftAjYg", "review_id": "EKrZ62iVwzUF05NYBDgmfA", "text": "Good location .... 10 min walk to town. Breakfast very nice.    On the negative side the bed was very uncomfortable ...& the shower non existent ... A trickle at best describes it well.   On complaining to the front desk the receptionist did not have a real explaination apart from offering to move rooms which probably wouldn't have resolved the overall problem of lack of water pressure.   Overall I do not think this worthy of its 4* status.  3* at best.", "business_id": "e8wCD4XNCcxSeTSrAU6xLA", "stars": 3, "date": "2013-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "xfdmWULSUa1NC8fVRhEAVA", "review_id": "x5hE_ENOEqibXmm1Uqg3lg", "text": "Very disappointing. Hilton Diamond member who stays in Hiltons around the world. This one is on the low side. Old, but not in a stately way. Trays of garbage stayed in the hallway for more than eight hours during the day and evening. Really nice staff, but it desperately needs an update.", "business_id": "e8wCD4XNCcxSeTSrAU6xLA", "stars": 2, "date": "2014-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aD5prHH46blfV0I1i4PcDg", "review_id": "Caf-XV8tO-P_rhJOvIAN0Q", "text": "I needed a hotel room for the night and their last minute accommodates were perfect! I arrived a few hours after check-in and the front desk was kind of enough to upgrade my room and gave excellent suggestions within walking distance to local restaurant, bars, and shopping. \n\nThey location is great, a little off the beaten path and is in a relatvely quiet nook for a peacful sleep.", "business_id": "e8wCD4XNCcxSeTSrAU6xLA", "stars": 5, "date": "2015-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "US6ABvJgQmxsKhSPBDgJcA", "review_id": "HMGUypKj21z9387KMwC2fw", "text": "Just my favourite place to eat in Edinburgh and the one I bring all my visitors to. It is small and intimate and the food is delicious and reasonably priced. The Haggis Fritters with Whiskey sauce are to die for. You do need to book as it gets very busy (especially around Festival time in August) but the staf are so friendly, it really is worth the wait if you have one. This place never lets me down. Excellent.", "business_id": "UmOeVhicD3cTepEDC6p4jw", "stars": 5, "date": "2010-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "x2K_xRzSSGfZtaJF-WMJ9w", "review_id": "OQLxOqK6_YF5kZSTdEg8fg", "text": "A splendid meal at a fantastic price. If you're in the mood for delightful French cuisine, don't miss this place.", "business_id": "WN2QUFWxIiTtUgW-oczrQg", "stars": 5, "date": "2013-02-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M4MVVzNPZHiJdnNvWjL8VQ", "review_id": "QPgUzuUvjs3UZV6fkswK5g", "text": "At £13.50 for 3 courses the January sale here was definitely good value for money and at 13:30 on a Friday the place was virtually full so had clearly caught a number of eyes. I'd been interested in paying it a visit for a while so my birthday offered a good opportunity.\n\n\n Service-wise I got the impression that an extra member of staff would have made quite a difference - my starter arrived near instantaneously after it was ordered (tasty oxtail terrine so I suppose it was just a question of slicing it and delivering it to the table) yet the main courses took far longer than you'd normally expect. Our waitress was though very able. They were good when they got there though - my no nonsense duck and beans went down a treat. My parents both enjoyed the apple tarts they had for dessert, but felt that the main course fish could have down with more veg or the option of a side-order of such. Within the terms of the deal the cheese board was fine and certainly had enough biscuits but £5 for brie and something un-named, even with the blob of quince jelly would I think have seemed too much to pay on its own.\n\n\n We had a pleasant Merlot to wash it all down but having no wine cheaper than £15.50 is I think something else that this establishment needs to look at, particularly in these financially straitened times.", "business_id": "IImme8H_HNUNNbPeTQwT_Q", "stars": 3, "date": "2009-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mprTLmLYm2Vy3iQ3Qa-wug", "review_id": "58p_WmKYYGZDUOHwydLL9w", "text": "Quite surprised that there s only one review here;jean michel is an excellent chef, and the food tastes''real''\nThey do a 2 course meal for £ 12.50, which is great; portion size is what you would expect, we had a great french classic, stuffed cabbage stuffed with duck xxx", "business_id": "IImme8H_HNUNNbPeTQwT_Q", "stars": 4, "date": "2011-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "zttuKYePVU7PKGI32-VmIQ", "review_id": "au269m8E-g_QTL2i5cSMUA", "text": "2010's Good Food restaurant of the year in Scotland and contender on Gordon Ramsey's best restaurant quest in the French category.\n\nCame here for lunch, there was a simple but varied set menu at a very reasonable price. The food is delicious and the staff are very tentative and know what they are talking about.", "business_id": "IImme8H_HNUNNbPeTQwT_Q", "stars": 4, "date": "2011-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "QYS29txRosYV2mGu68Cnhg", "review_id": "G6R8zHS6awWQlYmL_dfOEg", "text": "Definitely Meh I've experienced better- especially in a culinary city like Edinburgh! With as much hype as this place has been getting recently I was hoping for a yummy lunch and a new favourite place to adopt. Plus their appealing lunch deals meant that a visit was in order and very soon, so when my mum came up for a visit I thought it would be an ideal treat.\n\nI'll skip to the important stuff:\n- potatoes with my main (pork) were hard in the middle- not cooked at all.\n-slow cooked pork: over cooked and hard (far away from melt-in-your mouth goodness I was hoping for).\n-My mum's fish main was OK, OK being that it was good but nothing really to write home about.\n-the desserts, walnut tart and coffee ice cream and chocolate parfait with marshmallows and raspberries were a bit disappointing. There was nothing exactly wrong with them, the chocolate was too heavy (never thought I would say that about chocolate) and the walnut tart was mediocre. \n-plus be careful if you are going for the appealing lunch menu deals cause the various add ons tend to add enough on the bill).\n\nAll in all if it wasn't for it's hype it would be an alright restaurant, sort of at the medium level of all the other restaurants this city has. It wasn't packed, the view is from the front windows and the staff were alright. Didn't really get the feel of a rustic french food place and I have a feeling the publicity was a bit damaging to their quality. Perhaps they were having a bad day or something. I would like to try their other restaurant in New Town but I would not rush back to this one any time soon.", "business_id": "IImme8H_HNUNNbPeTQwT_Q", "stars": 2, "date": "2011-02-27", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "GkRBnPOBYD9ozp4ptPiW9w", "review_id": "YKCgug4hjwgqW6QZuJT0wg", "text": "I've been to this restaurant on several occasions, and have always enjoyed the food there. Yesterday, I took a group of 14 for dinner, and both the food and service were excellent. As a starter, I had baked goats cheese with almonds and beetroot dressing. This was a fantastic blend of tastes. My main course was slow cooked check of beef in red wine sauce with spinach, tomatoes, olives and pasta gratin. It was as awesome as it sounds! The entire group loved the range of food. This is now firmly in my top three list of Edinburgh restaurants. I want to go back! Now!!!", "business_id": "IImme8H_HNUNNbPeTQwT_Q", "stars": 5, "date": "2012-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FPh0IWj4HGHMPEPXbBcroQ", "review_id": "7Mhwds7ZWxWSEMQtwaHZ_w", "text": "Very disappointing Christmas Eve dinner. Lovely venue...but food was \"meh\" and service was worse. I", "business_id": "IImme8H_HNUNNbPeTQwT_Q", "stars": 2, "date": "2014-12-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "5WbQVsNME0Xr_SQX8JnBxA", "review_id": "DefHAi7APAWoNwSX9FOmMw", "text": "Great lunch at La Garrigue. I went there with a groupon voucher for 3 courses with a aperitic cocktail, hoping for good things and I can say it was all absolutely delicious.\n\nWe started off with an interesting aperitif of chestnut liqueur and white wine - don't think I have had that before but it was a nice start for the lunch. \n\nI had the endive, pear, roquefort and walnut salad for my starter. It was very tasty, just the right amount of 'everything' and nicely dressed salad. The only thing is that it was served in a bowl which wasn't entirely practical eating, but when it tastes this good it's not a big deal...\n\nFor main course I ordered the toulouse sausage with apple, grapes and potato. Again, so tasty! \n\nFinally, dessert. I had the baked cheese cake with a poached pear. It was a small portion, I ate it all... The flavours were good, though the cheese cake for my taste was maybe a tad 'wet' but I polished it off nevertheless.\n\nGreat food and great service - very friendly staff who truly make you feel welcome.", "business_id": "IImme8H_HNUNNbPeTQwT_Q", "stars": 4, "date": "2015-02-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vmyURrsBhEhnWjp697_qEw", "review_id": "64pYAQNjKvAB7Pnobbr-bw", "text": "I've been here two years in a row for work Christmas lunch and this place is great. I don't know why I haven't visited at other times of the year?\n\nReservations are easily made and the staff are well organised with pre-booked and pre-ordered food so we always know what we're getting and when. Food comes out at a decent pace and all of got our courses at the same time so there was no awkward waiting around ages for someone to get there's before you start. The drinks also flowed at a good pace, which helps.\n\nThe quality of the food is bloody brilliant. I haven't looked at the regular menu but the 3 course Christmas lunch is only £17.50 and for that I had a seafood flan started, a perfectly cooked duck leg main, and a satisfying vacherin dessert.\n\nRight, that's it - I'm off to book a table for January for a proper dinner!", "business_id": "IImme8H_HNUNNbPeTQwT_Q", "stars": 4, "date": "2015-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Ry_hy9B1LDhpTCLq3WEhNA", "review_id": "jM-wwM50bFWqvHlAmj2p8Q", "text": "For a while i was a regular here rehearsing with a group, and had plenty of time to sampe the food and the bar, and it's always left me feeling a bit deflated. \n\nThe food is ok but over priced for the portions you get. \n\nThe prices aren't too bad considering you're on the royal mile but there's nothing behind that bar that ever makes me go ooooh. \n\nIf i were a fairer man i'd probably 3 star this place but something about it i can't quite put my finger on always disappoints me.", "business_id": "01lSqf42wyNaiEmNgIrutg", "stars": 2, "date": "2014-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1s83qEXYPhmLRDvIqIf7Pg", "review_id": "sMsfWDX3D2itSTw7ArvDcg", "text": "Very nice craft beers (Holly Cow is my favorite). Service is very quick and nice. Really enjoyed dinner at this place. Not to crowded, mostly locals.", "business_id": "01lSqf42wyNaiEmNgIrutg", "stars": 5, "date": "2015-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nhf7UF6f6q7k19fkrmQSDA", "review_id": "Dz96DnU4txooC3T-9ozTQQ", "text": "Wow, what can I say about Canons' Gait?  I work near this pub and every time we go for lunch, we have never thought about coming in here once for food.  I have been here quite a few times for lunch now, but it is only now that I have decided to review this place so that more people can come here and try the food.\n\nThis pub has the best pub food I have ever eaten so far in Edinburgh.  It is reasonably priced for Royal Mile and you have a very friendly service.  My colleagues and I usually go to our usual restaurants for lunch but since the end of last year, we found this gem and we have been here nearly every week for lunch.  Lunch time is usually quieter so we have more space and the food comes out quick.  \n\nI have tried nearly all of the mains, but the best ones are the fish & chips, pork belly, sea bass with gnocchi and the risotto.  I urge you to give this place a try.  For what you pay, it is extremely value for money and you will keep thinking about the food every day for lunch.  I have uploaded pictures of the food.  Looking at them just make me want to go back tomorrow.  Nom nom nom nom....", "business_id": "01lSqf42wyNaiEmNgIrutg", "stars": 5, "date": "2015-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mgZ16PSsceu4Ey_K5NOZRQ", "review_id": "1GVUxyzIBoCplxY-Tc5aUw", "text": "Summary based on late afternoon stop for some drinks and snacks:\n--very friendly, helpful service\n--average prices for this area\n--nice selection of drinks on tap with helpful guidance and samples\n--decent snack food, at least, which is all we tried\n--locally popular\n\nRecommended in this area", "business_id": "01lSqf42wyNaiEmNgIrutg", "stars": 4, "date": "2015-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rIqc7TjCiFIqvj09GNqwdA", "review_id": "El1Rsi-Wj3YyAonTh85HCA", "text": "Yummy food and good service! I highly recommend starting with the Haggis Scotch Egg! Best Scotch Egg I've ever had. The Hop Smoked Duck Salad was also very tasty and it had plenty of duck. Only wish they would've strained the dressing, as I kept biting into blackberry seeds. Great selection of craft beers on tap as well!", "business_id": "01lSqf42wyNaiEmNgIrutg", "stars": 4, "date": "2015-12-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "MQ1QQ8WVVAI3EZpMyP_6yg", "review_id": "k9CudCaqpEw3fUzzopJMyA", "text": "Took a trip here at the weekend, I had already been a couple of years ago when I was around 10 maybe, I can't quite remember. All I know is I had waaaay more fun this time round!! There was alot more to see than I could remember and it gives me the chance to act very childish then yeah I am going to enjoy myself!!\n\nThe camera obscura itself is nothing massively impressive, but it is the rest of it I loved, the mirrored maze, twisty twirly tunnel and all the optical illusions. \n\nThis place may not be everyones cup of tea. I walked out of here £7 down in the pocket, but with thee most massive grin on my face!!", "business_id": "-UwZsTF1q2xaSm4bI_Azqw", "stars": 4, "date": "2012-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_tCtsOdhCuj-jZMtkKDS-g", "review_id": "3KoSiiZoJ1x1jskaU3N0yQ", "text": "I share most of the comments of previous reviewers and would give 5 star if they just reduce the price by 20-25%. There is lot to see, experience or get amused (esp. children!). The view from the roof was great (for daddies with big cameras) and I really enjoyed the paintings with double images (if you look from 5 metres away you see a painting, if you look close (50cm) you see a different image - very clever artists!)\n\nWell, I recommend this place as part of your site-visiting in Edinburgh.", "business_id": "-UwZsTF1q2xaSm4bI_Azqw", "stars": 4, "date": "2012-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "MKLpUBr07RtnOwG-altvew", "review_id": "kjW5_4-vOa0lhWM62sIZIw", "text": "Thought it was cheesy to come here before but it ended up being pretty cool.  Another of the tourist must stops in Edinburgh if you are a tourist, stuff that ranged from the cheesy to \"they were doing stuff like this back than?\".  This place has free wifi so if you are backpacking through Europe you can still check-in on yelp or facebook with your friends.\n\nThis place is a place to act like a kid again with a group of people to get the best effect, otherwise the pictures you get won't be as cool.  This place is a bit pricey and could do better with some newer stuff but remember to act like you were a kid again and do so on sugary drinks to maximize the effect of running around making faces.", "business_id": "-UwZsTF1q2xaSm4bI_Azqw", "stars": 4, "date": "2013-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "vmyURrsBhEhnWjp697_qEw", "review_id": "e68w30lArdIHK3FFaqbDmg", "text": "We visited Camera Obscura on our honeymoon (nearly 10 years ago) and really enjoyed it, but I could remember very little about it to be honest. So, now we live in Edinburgh, we needed to get around to going again, and a visiting friend was the perfect excuse.\n\nThe experience gets off to a great start with the desk staff who were friendly and chatty to us, and talked us through our options, while stamping our hands (free re-entry throughout the day/as long as you don't wash for). The told us when the next showing of the actual camera obscura was, and recommended we make our way up to the 6th floor in plenty of time.\n\nBoy howdy that's a lot of climbing! But as with all these things, the view is immediately worth the climb. 5th floor has an observation balcony which will keep you plenty occupied while you wait to enter the dark room!\n\nYup - \"Dark Room\" is the literal translation of \"camera obscura\" (I know facts me!). The member of staff giving the talk has obviously been doing it all day (and for many years) and yet everything was presented to us as fresh and exciting - for kids and adults alike. I won't spoil any of the patter, but it makes the entry price worth it alone.\n\nAfter the camera we made our way down, exploring 5 floors of optical and light illusions. Warning to arachnophobes - there is a 3D holographic tarantula. It is warned and signposted so make sure to read and you can avoid it.\n\nOther than that highlights for me included the maze of mirrors (which we would have solved much quicker if my husband hadn't deliberately misled us), and the projection of Edinburgh Castle on the floor which you can make fireworks go off on just by waving your arm in the way. I made it down the vortex tunnel but it's not an experience I would like to repeat any time soon!\n\nSo much fun whether you have kids or just want to behave like a big kid yourself, there's plenty to gawp in awe at!", "business_id": "-UwZsTF1q2xaSm4bI_Azqw", "stars": 5, "date": "2015-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "OH7IB5YVhs41H7x4dHpuNg", "review_id": "8hvIckUlNUWr9W9TGFTR1w", "text": "I must admit I have only ever been in for a pint, but no real fault can I find. If I were to be over critical, the renovations to the bar area have made it uber cool inside which doesn't hold with the building...but this is being critical for critical's sake and it will not stop me going back for a thirst quencher. Their beer garden out the front is a winner...even in the snow!", "business_id": "EDEZNi_8fgQnQK7U98pCeA", "stars": 4, "date": "2011-02-22", "type": "review"}
{"votes": {"funny": 5, "useful": 5, "cool": 6}, "user_id": "k5zGEHC3C7AC6gxIGOdSmw", "review_id": "yEQKS7geQnQbjuFXa4iiSQ", "text": "This review is for the Bothy, the restaurant, located inside the Murrayfield Hotel.  Our Contiki group had our Scottish evening dinner here.  This was an extra add-on to our trip but it was well worth it.  We had a wonderful 3-course meal where we were able to choose our starters, entrees, and desserts.  We also received a free glass of wine, beer or Irn-Bru of our choice.  Irn-Bru is like the Coca-Cola of Scotland.  I can't say what it tastes like since I went with a glass of wine. \n\n I also had the Scottish haggis, haddock in cream sauce, and sticky toffee pudding.  The dinner was fantastic and went beyond my expectations.  I think everyone in our group participated so we had a packed house.  The restaurant itself is cozy and the hotel is a small bed & breakfast.  It's a gorgeous venue located down the street from our hotel.  The service was great.  Our table happened to be the first to be served so that was nice and we were closest to the bar.  Anything we wanted to get from the bar was paid for separately so that was easy.   If you ever wanted to try haggis, this is where you want to have it.  It was served with taters and nips pureed on top with a whiskey cream sauce.  The haddock was flaky and delicious.  The sticky toffee pudding is delicious.  The food was phenomenal.  \n\nWe were also treated to the musical stylings of Andy the Piper.  He happened to be the Queen mother's favorite piper and has played for the Queen on numerous occasions, including a performance right before ours.  He told jokes and played some traditional Scottish songs with his bagpipes.  He posed for photos and was quite awesome.  It was a lively dinner and it was a great time had by all.", "business_id": "EDEZNi_8fgQnQK7U98pCeA", "stars": 5, "date": "2015-01-14", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "NIys9mctPMVmXxMDGw-Gxg", "review_id": "KvcBCGeduLw7qGHFinOkLA", "text": "One of the tastiest places for lunch in Edinburgh - I go for a spicy chicken wrap with falafel and aubergine... (although the wraps have shrunk significantly over the last two years...!) \n\nDinner - no no. Been there several times and although its byob and therefore frequented by intrepid students, the food is poor and overpriced\n\nBasically, 5 stars for lunch, 3 stars for dinner!", "business_id": "jgUtE_lFxqhMcG4ubWCQLg", "stars": 4, "date": "2010-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "SG56r_eAdyK9aad9H8dT4g", "review_id": "dAYUQy0xpT31pZonG3eLWQ", "text": "One of the many things I miss about Edinburgh. Great food. Friendly staff.\n\nTheir wraps are especially delicious. I can't speak for dinner entrees because I'd mostly go there for lunch, but those wraps were just YUM! Terrific place, and right across the street from the George Square buildings.", "business_id": "jgUtE_lFxqhMcG4ubWCQLg", "stars": 5, "date": "2011-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "EA-u29YMwnMIitLsM6NodQ", "review_id": "5uCoN4K1bQpDoF_HkrrEVw", "text": "Reading the lunchtime reviews of Nile Valley are making my mouth water. I've only been in for dinner, and I found it to be a very pleasurable experience. I'm a big fan of this type of cuisine: if there's hummus, aubergines, and lamb then count me in. And if it's BYOB even better. Nile Valley ticks all of these boxes, and is therefore firmly on my roster of places to get a good dinner with friendly service in Edinburgh. \n\nThe staff are very accommodating and will even find you a table during the festival. The last time I visited there was a minor issue with our starter not arriving on time; the manager personally came out to apologise to us, and we were given it for free. Very different treatment to certain fine dining institutions.", "business_id": "jgUtE_lFxqhMcG4ubWCQLg", "stars": 4, "date": "2011-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W9XwRjRsgn_mz-x86IiImw", "review_id": "Kdfx_ZE_3OgRqfIu22gMpg", "text": "Their cuisine is very tasty. No regrets headed into this restaurant. I will come again if I'm in the area.", "business_id": "jgUtE_lFxqhMcG4ubWCQLg", "stars": 5, "date": "2015-01-14", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "AZZZNNQbMy1fYWJfsA9rKg", "review_id": "PItZ_eygnyLekNIrKLzbww", "text": "The Nile Valley Cafe may appear humble from the outside (and on the inside too!), but if you are looking for authentic North African food in Edinburgh then look no further: this is the real deal.\n\nDecoration has not been high on the priority list of this establishment, but don't be put off! Everything is unpretentious in here: the furniture, the menus, the crockery and cutlery. The emphasis is entirely on the food, as it should be.\n\nThe menus cover a decent range of North-African cuisine, catering well for both vegetarians and meat-eaters alike. They don't serve alcohol but it's BYOB with no corkage, so bring your own wine if that's your bag. There is a great selection of freshly squeezed fruit juices and Sudanese teas (including spiced black tea and the ubiquitous mint tea). My wife had the mango juice, which was delicious, and I had the mint tea, which was served in the classic tiny glass cup with a giant bowl of sugar, of course.\n\nNow let's get serious here. I'm a self-confessed houmous snob and have tried houmous from Marrakesh to Baghdad. I can honestly say that the houmous in The Nile Valley Cafe was some of the best I've ever had. The falafel was also absolutely first rate.\n\nI had the ful for my mains, and you might not think that a plate full of beans could be that appetising, but it was absolutely delicious. It was unpretentious and simple but authentically made and tasted just great. Everything was also served with a smile by the very friendly waiter, who was happy to give recommendations when we weren't sure what to order.\n\nIf you are feeling bold, give the Sudanese coffee a try. It's EXTREMELY strong a spicy, but I've never tasted anything like it before.\n\nIt seems like a serious injustice that this place was almost empty on a Friday night. I strongly recommend checking it out.", "business_id": "jgUtE_lFxqhMcG4ubWCQLg", "stars": 5, "date": "2015-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t8mTGXXe8u5WF7mvN09zRg", "review_id": "25aA2W1IgJMzBVt7uQCvQg", "text": "Food was good but mine was really  salty, it was a fish and rice dish. It ended up being more expensive then I expected which was a bummer since it wasn't a very nice seating , more of a cafe feeling then a nice Resturant . Feels informal but paying the same price for nicer setting", "business_id": "jgUtE_lFxqhMcG4ubWCQLg", "stars": 4, "date": "2015-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "6cEjxKwdxNeet2vt55XDfQ", "review_id": "Q9LOL-7Tjilrb8C0Fc4aog", "text": "Made in France is far more than your average deli. The owners have sourced everything in the shop themselves from independent French suppliers to give the customers a far more authentic French experience. Real Toulouse sausages and Raclette cheese hang from the shelves between bottles of wine and vinegar. For me though one of the nicest things I discovered were the tiny pots of apple puree that you get in every French supermarket but are impossible to find over here. Basically it's baby food, mushed up apples in a squeezy pot, but wow it just tastes so good! \n\nIt was only on my second or third visit here that I also discovered that Made in France hire out Fondue and Raclette sets too. Having never had the urge to hold a fondue party (I lie, I always have the urge but I fear it would be a habit I couldn't quit) I'm yet to try one of these sets out myself but I bet it would be a lot of fun. The shop prepares the cheese for you so all you have to do is melt it and dip stuff in. Cheesy deliciousness!", "business_id": "7jqK8QfIj5PN2HFKgDKBfw", "stars": 4, "date": "2009-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0sUQjwff6McFhpC4anosJQ", "review_id": "Kb8yanleOUC3GcyOrFNglA", "text": "This is a gorgeous little deli, tucked away on Lochrin Place, serving the most delicious and incredibly strong coffee with a selection of tarts, cakes and pastries to go. It's filled with pretty unmatched polka dot and floral tablecloths, which adds to its quirky charm.\n\nI visited today and treated myself to a cafe au lait and a brioche to take away, which came to a very reasonable £2.25. Incredibly strong and incredibly delicious coffee, to the very last drop. What I loved most about this place is the customer service, displayed as the staff chatted away to a lovely lady, who was dressed up with full hair and makeup, for a wee afternoon to herself filled with coffee and cake, while the staff conversed with her like an old friend. A charming and delicious deli.", "business_id": "7jqK8QfIj5PN2HFKgDKBfw", "stars": 5, "date": "2010-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ysf0ladNzVA0Fv2X24l7PA", "review_id": "QbfedT-kkZU-1bxjntiHzw", "text": "I really enjoy relaxing after a busy day trooping in and out the shops of Edinburgh with a nice big glass of wine or a G&T. The best time to go is Christmas. The interior is awesome with all the decorations up and there is a great buzz about the place. Always friendly and welcoming which is rare in such a huge place.", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 4, "date": "2010-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "6PT7qdZhnYUdCRyqP3yBeg", "review_id": "0Pze1UXQql9MAPRwvs36YA", "text": "The interior \"Dome\" is magical.  I thought maybe it had once been a church, but it has been converted from a bank.  We just had drinks, so I cannot comment on the food.  Their Christmas decorations were breathtaking", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 5, "date": "2010-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "BFLcP58Al9gvBxjQ0SFxUw", "review_id": "AkagWxjw7NiPc6o3GWqLiw", "text": "This review covers the bar only - what a place to have a drink! Massive building with, around Christmas, amazing holiday decorations. Service was quick and friendly, and the crowd was a bit upscale and quite nice even though it was packed on Hogmanay. Pints weren't too expensive despite the gorgeous atmosphere, so treat yourself to one here if you're in town midwinter. Truly spectacular.", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 4, "date": "2011-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "tw3PFgey15p0ruFRVoFidw", "review_id": "K2JG8zWvEvqZrCb3Imm54g", "text": "We were sent here with a glowing recommendation for afternoon tea from the staff at The Scotch Whiskey Experience.  It was still decorated for Christmas.  Beautiful space (if a little ostentatious).\n\nThe service, however, was horribly lacking.  We felt like we were a bother to our servers (yes, they traded off, and we seemed to be the only table that this was happening with).  Maybe Americans are disliked in Scotland?  I don't know.  We never had trouble elsewhere, and were trying our hardest to be good guests.  They ignored us almost entirely, even getting the bill at the end of the meal was a 30-some minute waiting game / battle.\n\nI'm a big afternoon tea fan.  Theirs was good enough, though I was disappointed not to be offered a choice in teas (even decaf vs. caf)... it just came as it was.  Sandwiches hit or miss (the salmon was awful, the egg delicious), same with the desserts.  Eh.", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 2, "date": "2012-01-09", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "9_ACsBy6NmWRtbvuw-mLmw", "review_id": "7SF6_tXTpbFJ6vgk3C5BZA", "text": "I had heard about this place but never been here until we had family come into town last month. We decided to make a trip for Afternoon Tea and to see all the fabulously outrageous decorations!\n\nHere's a breakdown of their score: \n5 for the food\n3-4 for the service\n\nSo the food was awesome. There were 5 of us, we ordered 2 afternoon tea sets with scones, desserts, sandwiches, etc. They were technically meant to serve 4, and we were eating them for lunch, AND we still have food leftover! Yes, we probably looked like chintzy people when we asked for a take away box for our leftover desserts we couldn't stuff into our bellies after the amazing scones and sandwiches. And yes, we may have asked for foil when they didn't have any boxes. And yes we may have even taken a few of the leftover darling mini jam jars....Yes, we are those people. \n\nBut so what?! It was sooo delicious! And affordable, which may be saying a lot for this particular venue. \n\nNow onto the service. Um, it was quite lacking. I understand we were a group of 5, which is a bit awkward for tea, but they crammed us into a table in the corner near the kitchen, which kinda killed the atmosphere a bit. Then they switched servers on us..twice, I think. They just seemed like they wanted to get us out of there as quick as possible, yet when it came to asking them for extra cutlery or drinks or even the bill, they were nowhere to be found. \n\nI definitely recommend it for the experience as the building itself is really gorgeous and the food is great too.", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 4, "date": "2012-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "fWSwi74Zk1mscAQcIABMuw", "review_id": "UCcUzZyH1JRgetRZKVMxhw", "text": "After a decade of living in Edinburgh I can't believe I've managed to miss out on going to The Dome. It seemed like a fitting venue for a post-art gallery wine tasting session and positively took my breath away. \n\nFrom the minute you walk into The Dome opulence abounds. From polished tables, mosaic floors, marble pillars, sparkling chandeliers, extremely well dressed staff and that absolutely stunning domed roof...I felt like I was on a 1920's movie set! \n\nThere was no trouble getting a table on a Thursday, and the table service was efficient and attentive. The drinks were a bit more expensive than normal (£9 for two G &T's) but for the surroundings it didn't seem to matter! A plate of nachos to share was £10 but between us that wasn't much and they were delicious...and didn't last long! I've also been reliably informed that a stop here for an afternoon pot of coffee, with shortbread on the side, is a cheaper and more luxurious alternative to the more generic coffee shops!. \n\nSo, after a very enjoyable evening, we reluctantly dragged ourselves away to catch the last bus (no Bentleys with a chauffeur to take us home unfortunately!) looking forward to the time when we can get all dressed up in our finest to make a return visit!", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 5, "date": "2012-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7DxQDfrnoQI9nGALyi-LyQ", "review_id": "7-fxNP9eI7UC2ivxkLamUQ", "text": "I'm super conflicted on my review of The Dome ..\n\nAt Christmas time, The Dome is THE place to go.  Even if you just pop in to see it, see it.  It's like Christmas threw up and frankly, even for a scrooge like me, it's great.  It smells lovely, there are decorations everywhere and the tree is huge and awesome.  \n\nBut for The Dome itself?  Give it a miss.  I've not eaten here but The Man says the food is abysmal.  After a recent visit, I can however attest to the service and quality of the drinks.\n\nWe came here to soak up Christmas after a recent jaunt in the markets.  The place was, as you would expect on a Friday after work, packed.  We managed to get ourselves a perch at the bar and ordered a bottle of house wine, which was priced at £24.  £24 for wine which would stretch for a fiver at Tesco.  I realise we're on George St but that's ridiculous.\nThe biggest kicker was the fact that the bottle, with about 1 glass left in it, was whisked away when we weren't looking.  \nWhen we realised what happened we waved someone down who happened to be the manager.  He disappeared for several minutes to return and inform us that none of the staff *said* they took a bottle with wine left in it but he brought us two glasses as an apology.  It was a nice gesture and was appreciated, though there was something about the way he worded it that sounded as though he didn't believe us but was going to humour us anyway.  \n\nIn any case, by that point we were done being shoved around by the increasing crowds and we left for more relaxed climes.  \n\nIn short - expensive drinks, poor beer selection, heaving, and a mixture of too-eager and slightly off-putting staff.  Come for Christmas but don't expect the experience to match the decoration.", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 3, "date": "2013-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "-9i_zc98yuCaQz148apVgg", "review_id": "lVfWYsx3SOk-gjDHyIKAdg", "text": "Amazing cocktails. Amazing architecture. Amazing times to be had at the most beautiful bar in the world! The Dome must not be missed!", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 5, "date": "2014-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "eHiHy8RD4xVrsi1tCmBMjw", "review_id": "qsuOS606ZIVun7HoDJVPPQ", "text": "They have a Gluten Free menu but beware... I got horribly glutened here and was unable to eat for at least 48 hours after this meal. \n\nIf you are a coeliac or very gluten sensitive DO NOT EAT HERE. This was the worst \"Gluten Free\" restaurant experience in over 4 years of being on a GF diet and it ruined part of my business trip to the UK.\n\nI expect it will take at least a week to recover from this.", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 1, "date": "2014-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RWoy4fAUtwFOsW340QbrWg", "review_id": "_LVg44Bp5ibZrNT8gWoLnQ", "text": "Beautiful setting at Christmas , food was lovely as ever it felt traditional elegance .Only strange thing was people popping in to take pictures of the tree when your eating,", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 5, "date": "2014-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "qW10n0kfwZB4Hr5U2QEwmA", "review_id": "cPdUydYMyZPRrUrk-Z5LHQ", "text": "What a pretty place come Christmas time! I wanted to go for a drink with a friend in the afternoon after lunch. We were drawn to the dome thanks to the beautiful decorations outside, though expected the prices inside would be ludicrous.\n\nThere was indeed a queue.. It took about 20 minutes for us to get in whilst people waiting for the afternoon tea were actually turned away. Whilst the main dome bar was still closed we waited in the club lounge on the left with an espresso coffee. After half an hour we moved into the dome bar and were very lucky to find a table. We both ordered whiskey (unusual choice for me, but very enjoyable what with the cold weather outside and the internal chill) and got a free pot of mildly spiced popcorn to nibble. \n\nThe prices are not extortionate, indeed not much more expensive than other bars in the area. The crowds are a bit annoying, but then pretty places always attract people. The decorations in here are lovely and I felt myself get hypnotised by the colour-changing tree.\n\nI would come back here if with guests and in need to show off Edinburgh's \"hidden\", or not so-hidden treasures.", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 4, "date": "2014-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WO18iwGCR-MOEvVcMAMVNw", "review_id": "JXIdAOmwTM9xLdH7AFUVWA", "text": "What dazzling decadence.  I might have had the entirety of my Christmas light-seeing in the club room alone. \n\nThis was the first stop on a Saturday night in January.  The lights were still up and cheerily smacking us all around with illumination.  Two distinctive groups of patrons were apparent, one of the low key diners and another of the bar groups mingling in tight spaces.  Oooh-ing at the lighted brilliance, the massive selfie overloads and buzzed merriment from the bar groupies were in stark contrast to an overly serious dining crowd.  Civilian paparazzi aside, the place is a Christmas vision and apt substitute for a light show in winter wonderland. \n\nHouse cocktails listed were the usual classics plus some.  The all serious bar staff gave good care to our martinis to its minute detail.   \n\nTwas good buzz with decent drinks in a bling-diggety old bank, which topped the goodbye to a merrily intoxicated holiday season.", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 4, "date": "2015-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "-QSNRIxny2I26yJT82OWtA", "review_id": "_qkysKRdhcsROx3WsCKLYg", "text": "I was so excited to finally go for dinner at the Dome, it had been on my list of places to go for ages and it is such a big part of George Street.  I had been for cocktails before which were pleasant but the dinner was ok and nothing better.\n\nI took a friend out for a birthday dinner and because I am really strict vegetarian, I called up before hand to discuss if they could cater for my dietary requirements and they advised they could.\n\nOur table was squished into a corner and the plant on the table was withered.  The main course was nice (beetroot wellington) but there were no veggie options for desert. Everything had gelatine in it.  The waitress advised in a throw away manner that they could do a fruit salad for me, but we decided to go elsewhere for dessert as this option wasn't the most exciting.\n\nThe three stars are for the building itself, which is stunning (especially at Christmas when it is all decorated) and because they sourced me a bottle of wine that was vegetarian.  I'm glad I tried it, but I can think of many better options than here in Edinburgh for dinner, so I don't think I will be back.", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 3, "date": "2015-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SQvilGP-fAk7zt3vcLEtOA", "review_id": "98PZqB6A191fdj8Ua64hQQ", "text": "My boyfriend and I went there for his birthday dinner in November. \n\nThe decor and the building is beautiful and if you like Christmas decorations this is the place for you!\nThe food was fine but I kinda expected better because everyone recommend it, I personally would not recommend for a foodie.\n\nOur waiter was absolutely horrific. She was rude and unhelpful. She first got annoyed when I asked for a bit more time before ordering. Later after we ordered I asked her for the wine/beer menu she seemed bothered about having to go get it and when I had to ask her again 15-20 min later about it(because she didn't bring it) she rolled her eyes at me and said she was going to get it. The menu was at the bar and we were sitting at a table next to the bar.. I then saw her manager get involved and he brought it to us and he was quite nice and took our wine order.", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 2, "date": "2015-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "LfnB4N7SVSAIPOM3If_kDA", "review_id": "EzvMDIfi42aYIM2pTAk2vQ", "text": "Love this little boozer. When all around seem to be tearing out there traditional fixtures and dusting off there cocktail shakers the Malt and Hops is still a proper pub.\n\nThe pub over looks the dock area down by the shore and looks like it hasnt changed ever. I love coming here on a blustery afternoon to sit by the fire place with a pint. Nothing fancy but they do everything well. The place is immaculate considering the old man style presentation. Many pubs of this ilk can be a little grubby but they keep their bar tidy and cobweb free. \n\nThe staf are always friendly and the booze selection is great. Thumbs up from me.", "business_id": "MQo3FnweaE37sEDoG7hU5w", "stars": 4, "date": "2014-01-06", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 6}, "user_id": "wx12_24dFiL1Pc0H_PygLw", "review_id": "GoodpV56bfwgzE6drFt0hA", "text": "Once upon a time there was a girl called Jen. Jen loved books and reading and the theatre and anything that took her to another imagined world, space and time. Especially the romanticised times of days gone by.\n\nHow happy was Jen, then, to one evening be accompanied by very good friends to the Lyceum Theatre for one of the most splendid, exciting, memorable and all round awesome evenings in a long while.\n\nIt has all that is good and right about old-world traditions made modern in our near-on space age era (compared to what the Victorians were used to, we're practically the Jetsons.)\n\nContrast the square, all-glass exterior of the entrance to the plush royal blue and gold painted interior; and most especially the exquisite chandelier hanging, pride of place, in the theatre itself. Anyone who has seen Phantom of the Opera will know how important a chandelier is to a theatre.\n\nSome old-world, listed buildlings have the charm but lack the comfort. Clean toilets or warm rooms are sacrficied for beautiful cornicing. Not at the Lyceum. It was beautifully presented and maintained, a gorgeous modern entrance, warm, nice bathrooms, easily acccesible bar, really attentive friendly staff -and still with the historical features to give it romance and class.\n\nI came to see The Infamous Brother's Davenport here, running in February 2012. A Victoriana play based on the true story of the Davenport Brothers who could communicate with the dead (allegedly). Wonderful setting, brilliant actors, captivating plot. If you are reading this review in February 2012, go -go now. If you aren't, go to the Lyceum anyway for a play that tickles your fancy; regardless of the play, I'm sure you'll fall in love with the theatre itself.", "business_id": "0FlLe1SZKZqf5Tg9VK1-gQ", "stars": 5, "date": "2012-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B9p4cnBr3YPedWA8Gh104Q", "review_id": "4-6O6UbWuXC8EjoIrhxfLQ", "text": "Nice hotel although a bit out of the way but regular buses into town centre. Large bar with large screen tv's showing sport all day every day , friendly staff and food is very reasonablbly priced.Could do with sprussing up a bit as interior of bar area a bit shabby.", "business_id": "-Ub3g_uP6XqUtZwy5k8jPg", "stars": 3, "date": "2009-01-17", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "7DxQDfrnoQI9nGALyi-LyQ", "review_id": "yCEM-FHIYyKfJAaeV_5lfg", "text": "The Ettrick is... fine.  It has some definite good points as well as definite bad points.\n\nIt has a good beer garden, this is great for those 3.5 sunny/warm days that happen in the summer.  \nIt has (from distant memory) totally reasonable pub food.  It will fill your belly with stodge to soak up the beer.\nIt shows major sporting matches (or at least, it showed the tennis when Andy Murray was playing last year).  This isn't a draw for me, but likely is for some.\n... Ok I can't think of any other good points.\n\nThe bad...\nIt's pretty off the beaten track.  If you want to go anywhere else before or after the Ettrick, be prepared for the longest walk between pubs in all of Scotland (and by that I mean, like, 15 minutes).  \nIt doesn't have the best transport links, so see point above re: how long it will take to get to a reasonable bus stop.\nIt's FULL OF REALLY OLD MEN.\n\nI don't have a problem with old man pubs but this takes it further than I think I'm willint to go.  I'm 29 and I'm pretty sure I was the youngest person there.  Ok yes I'm a child, but probably about 30% of the clientele were in the 70-100 range, 60% were in the 40-70 range, and 10% in the 29-40 range.  \nI'm not even kidding.  \n\nTo be fair, I think there was some kind of old man convention going on or something, as they were all wearing the same tie, but it was a bit excessive.  \n\nIf you must come here, do it during the day when it's quieter.", "business_id": "-Ub3g_uP6XqUtZwy5k8jPg", "stars": 3, "date": "2012-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vA99rddB_NJdsiEzDDVFiA", "review_id": "HOC_im2fYFTj_kbBWmfnWw", "text": "We stayed Thursday 19th till Sunday 22nd February.\n\nAs soon as you walk into this hotel you know it's something special, from the polished brass step as you walk in to the tiled floor and lovely reception. We arrived at 1pm, an hour before our check in time so we decided to wait in the bar area. There is an extension on the side with a windowed outlook onto the bowling green and tennis courts across the road. The barman greeted us and was very attentive and welcoming and took our orders for food and drink. Food came swiftly and was well presented and delicious. An hour soon passed and we checked into our room, The James Suite. \n\nAs you walk in it's a breath taking moment as the room is extremely well presented and very spacious and decorated to a high standard. There is a lovely comfortable leather suite, smart lamps, gorgeous comfy beds and a beautiful bathroom. Our party of 2 adults and 2 children had plenty of space to chill out and relax and do what we wanted.\n\nOur room rate included breakfast and this was absolutely delicious. A full English/Scottish breakfast can be had and lots of fresh coffee and toast as well as cereal etc. \n\nThe one thing that really sets itself apart though is it's staff. They are all excellent and welcoming. Nothing is too much trouble and they're happy to advise on local attractions and buses to catch etc if you don't want to pay for parking in the city centre. The bus is only 8-10 minutes to the centre so you're situated in an ideal location.\n\nWe had a 3 night stay and during this time we absolutely loved knowing that at the end of the day we had a beautiful, comfy room to go back to and welcoming staff to help us enjoy our stay.\n\nOn our last day we had a really good chat with the owners and you can tell how much they care about your stay and some of the nicest people you could hope to meet.\n\nI highly recommend staying here especially in The James Suite and advise you to book early. If you want somewhere in a beautiful location with rooms cleaned immaculately daily, hearty breakfast and a welcoming atmosphere with A grade staff then look no further!", "business_id": "-Ub3g_uP6XqUtZwy5k8jPg", "stars": 5, "date": "2015-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_CIbEL_P937BwRJYcFHzbQ", "review_id": "wTyqNR8EIhfa7Meid_6fCg", "text": "Not the most fantastic place I've stayed, but definitely your money's worth! \n\nWe were put in a ground floor room which I'm not usually fond of, but there wasn't a tonne of noise from upstairs and I felt safe enough. \n\nThe room boasted a good size wardrobe, dressing table area, a little sofa, coffee table and reasonable enough tea facilities (clean, but no biscuits, boo!) the bathroom was lovely and big and clean, and I'm judgey on my bathroom standards. \n\nThe bed was comfy, and actually big enough for three. Blackout blinds made sleeping off long nights easier. \n\nBreakfast was good, polite staff, all you could ask for really!", "business_id": "-Ub3g_uP6XqUtZwy5k8jPg", "stars": 5, "date": "2015-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "MgzpVUdiKXfSVzg-Nbm8TQ", "review_id": "k0J5SuVX1xIwprCJNZ1cmg", "text": "It's always hard to tell if I like a place because I've got a comfy seat and they're playing the music I like, or if the place is genuinely good!\n\nA Room In The Town, however, had good service when I was in - despite the fact that I was the only person in at that time of morning.\n\nI'd ducked in for a coffee between business meetings in the city and needed to update a report.\n\nSunshine streamed in through the window, the cold was a memory...it was like sitting my own loungeroom, except someone very nicely brought be a damn fine latte.\n\nHaving only gone into A Room In The Town because the service at the Standard, which used to be my regular, was so apallingly awful, it was a pleasant find.  The smells wafting out of the kitchen, the good range of menu, and the good service will make sure I head back.\n\nThat and the fact that the music playing was by an artist I love but music I had not heard before - which means I have some investigative purchasing to do!", "business_id": "16_M0bA14jGcOE0hLmZK_w", "stars": 4, "date": "2012-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Hyd9alOhZmXSgCwt2qzfvg", "review_id": "n6JWB-VP21kHy0mzhGzJKw", "text": "Very convenient for the theatres and the Usher Hall. Also at the moment some good deals on. Bottle of wine for £8 for instance. \n\nHad a bite to eat and was served very quickly, which was quite necessary as I was going to the theatre. The staff were friendly and attentive especially for a reasonably large pub.", "business_id": "kzy5m93T7mbZJe9heq4PUA", "stars": 3, "date": "2012-02-22", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "j_Tfkj7dMS4i3LRMonZFRA", "review_id": "DuLn_MSRdpcQQ9DqlxWT4w", "text": "I'm writing this months too late so I'll keep it brief.  I remember liking the location of this Bar.  It's in a really interesting part of the city and near some really nice theaters (Like the Traverse).  Seemed like a fine place to stop for a drink but I wasn't overly thrilled with the food.  I had a burger so maybe I just picked the wrong thing, but I personally thought it was way overcooked.", "business_id": "kzy5m93T7mbZJe9heq4PUA", "stars": 3, "date": "2012-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "zEggXKgiDxiSTzRo07GFGg", "review_id": "7g53vv9ws-yur6aBlDvCFA", "text": "Sublime Spanish Tapas and what a lovely space! Very cozy and inviting. Definitely a highlight of our holiday travels.", "business_id": "9lF6-JrS2PvTkw9KVxn3Yg", "stars": 5, "date": "2011-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "w2wHU-O5ZM9tobWDzT3nig", "review_id": "U6pWNDD8D2jZ0MpawSpW-Q", "text": "Sorry, I don't get it. We came here for Valentine's Day because they were running a £15 fixed menu special. I'm not sure what the problem was, but our reservation was for 8:45 (way after the dinner rush) and the restaurant was not at all crowded, yet we waited over an hour for our main course. When it came, I wasn't at all particularly impressed with the food - the Paella was more like spanish rice with vegetables, something you'd get as a side dish to a burrito platter at a Mexican restaurant. The shrimp was like popcorn shrimp I'd get at a greasy diner in West Virginia. The best part of the meal was the awesome appetizer spread of bread, meats, cheese and olives. Other than that, the food was sub-par.\n\nIt's a shame, it's a beautifully decorated restaurant with a nice storefront. But if you're looking for great Spanish food, I'd go somewhere else.", "business_id": "9lF6-JrS2PvTkw9KVxn3Yg", "stars": 2, "date": "2011-02-14", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "mp6B3FnaVZJZx4rZyGnpYw", "review_id": "yIH6X_1PIzqwvXaS78fU3g", "text": "A victim of its own coolness.  We travel A LOT and here are some things we couldn't figure out how to do in our room:  Turn up the heat (it's motion sensor and it didn't sense us for awhile), turn off the lights, drain the bath.  Also, they could really use an additional door in the bathroom by the toilet.\n\nHaving said all that, this is actually a beautiful hotel, in a perfect location with a super nice, helpful staff.  Great bed too.", "business_id": "DIlh3Ta7-7tfjKL1apaYHw", "stars": 4, "date": "2011-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "qtC7Yonce-6VryJkJmId0Q", "review_id": "3vSt7b-0lMTdwCvkquyKYA", "text": "Definitely one of my favourite hotels to have ever stayed in! The Sheraton hotel on Festival Square is an absolute haven, and I've stayed in here on a few romantic weekends with Colin. I've never been treated better in a hotel; the staff are absolutely excellent, from the receptionist to room service. You're even welcomed to the hotel by a doorman who opens your car/taxi door to take your bags out for you! Heaven! \n\nThe rooms in here are fantastic, with a huge (and ridiculously comfy) double bed in the middle of a beautifully decorated room. There's a huge TV, a small table with a chair for reading or having lunch, an incredible amount of storage and, if you pay a little extra, a spectacular view of the castle. The bathroom is huge, with beautiful colour changing lights that you can control. There's 24 hour room service that are eager to please in any way possible, and I just cannot fault this place. \n\nI've never actually taken advantage of the spa facilities in the hotel but I'm definitely going to be making a point of doing so during my next visit!", "business_id": "DIlh3Ta7-7tfjKL1apaYHw", "stars": 5, "date": "2013-02-05", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "tZs84cKAUSOtP_nAiSdreQ", "review_id": "1amWyyxdOHIMV4PA6Ugopw", "text": "One star for grandness, one star for location and one star for Xmas dinners.\nOh and an extra star for just being awesome!  This is one of my favourite building as far a purpose built hotels go. It fits perfect on the festival square. \nI have had several company dinners and conferences here. The place is just as grand on the inside and it looks outside - though the furniture in the conference reception and bar and the decoration seem a little dated. It looks like an Old Bhoy smoking and whisky room. Not my favourite surrounding for a relaxing time, but it depend who's boat it floats. \n\nThe staff and service is impeccable and every need is attended to.\nThe food served when I had dinners where obviously mass numbers produce but still very tasty. They do buffets also and that has proven a big hit with the Xmas party goers. \n\nI am still to visit the One Spa on the roof, but from what I have seen it is quite the place.", "business_id": "DIlh3Ta7-7tfjKL1apaYHw", "stars": 4, "date": "2013-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ry_hy9B1LDhpTCLq3WEhNA", "review_id": "yyoFWES4vRQSq4gRIWhJ0A", "text": "I'm a fan for sure!\n\nI popped in here for a takeaway lynx before a hair cut, and it was mmm mmm tasty delicious!\n\nI opted for a Mexican chicken wrap. Deliciously full of zesty light fresh tomato salsa, deep dreamy guacamole, and juicy chicken pieces. Turned out to be one of the finest I've had in a long time! \n\nI followed it up with some kinda of Czech sponge and caramel cake, not too dry, not too sweet, lovely with a coffee probably (I had diet coke, for shame I know)\n\nI didn't stick around a long time to fully appreciate the cafe itself but it's spacious but kinda homely with big wooden furniture and little nicknaks around the place. And a big robot by the front door. As you do!\n\nI found myself thinking it was a little, £6.90 for a smallish wrap, smallish cake, bottle of juice. But actually it was damn tasty, so actually pretty good value I think. \n\nConsider this a recommendation!", "business_id": "mV2qIJvhYuHTI0_to25nrQ", "stars": 5, "date": "2014-02-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "VJIwFsZ7-udXymDm2inE0Q", "review_id": "INcx97y4puhFvjaNAGfTCg", "text": "damn you michael, gettin in on the good places before i have a chance.\nonce again, i concur. great location- on the shore you have shitloads of places to eat and drink- just on the corner you have fishers, probably the best seafood restaurant in edinburgh, and next it, a bar called the shore that is cozy and often has local live music.\n\nthe hotel itself from the outside is like a mini castle without the tower, so yeah, maybe just big and old fading bricks and old looking. the rooms are minimalistic. great bed, pillows and comforter.  the staff are helpful, the breakfasts are great, get the eggs benedict.  the bar seems to stay open later for the guests than any of the pubs around during weekdays, so even after i was no longer a guest i worked it.  if you are a gambling addict, there is a casino around the corner with a great buffet at midnight, often chinese. no live poker sadly.", "business_id": "VErgzjUEsusmil_DR4IYbw", "stars": 5, "date": "2009-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EoacB3Tw6FUUqd1ztmDxTA", "review_id": "7aN3zdcE_ku36PtiX71fwQ", "text": "A tucked-away Stockbridge gem that has been on my list of places to try for some months and it still is! How, you may ask, can I be reviewing a restaurant I have yet to try? Well, dear reader, I went there last week for a work christmas party and had a very good time. But I remember very little of the evening. THAT's how good a time I had.\nA small, cosy, intimate restaurant with a Mexican theme; the staff managed to make a party of 12 seem not only welcome, but a joy to behold (I'm not sure this sentiment was shared by the other diners).\nThe menu is classically Mexican, but the execution is a class above the bog-standard. Nachos, natch; chimichangas, burittos and enchilladas ditto, but all done (reportedly) to perfection. There are also Mexican style steaks and fish for the less conventional.\nThere may be puddings; I can't remember. They do serve cocktails and liquers, for which I hold them entirely responsible. \nSo, as I said at the outset, I shall return to The Blue Parrot Cantina for a more sedate and considered meal as soon as they let me back in the door.", "business_id": "nEM1MVODyaZCWOg7Cya4EQ", "stars": 5, "date": "2008-12-16", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "RH2K7RqzkGUa0pD0nSMDcg", "review_id": "bNDpR9_F5lvTD9KVgGpnig", "text": "Had a disappointing time there last night which topped off a few other slightly off visits over the past few months. Decor and layout are fairly pleasant - drinks are drinks and it was warmish and fairly lively. However at 9pm on a Saturday night when most people were chilling out and relaxing - enjoying perhaps the quiet atmosphere..... the DJ started.. and got louder and louder. \n\nIt was so loud it was difficult to talk. The massive TV was showing unrelated music videos.  It was fairly bizarre. And I really was not enjoying it. \n\nAnyway we left, I doubt I'd be back. Nothing particularly wrong but also not particularly enjoyable.", "business_id": "ZRYZBtiRjjYqA8ohMoRn-Q", "stars": 2, "date": "2011-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KN1yg6dH3myLHfZuNCdBSQ", "review_id": "DB8FoluXS8C2Icr2_VqQng", "text": "Wandering around Edinburgh, saturday night, trying to find even one bar where you can sit? This was the place. Staff was friendly, you could talk without shouting your voice off, and there was a decent mount of beers to choose from. I was happy and we had a nice evening. Working wifi was also a plus, being foreigner. Thanks!", "business_id": "ZRYZBtiRjjYqA8ohMoRn-Q", "stars": 4, "date": "2014-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "vmyURrsBhEhnWjp697_qEw", "review_id": "S0r8VYY1IVv1dGyRG81N9Q", "text": "I've been in Wash Bar a few times now and I still wasn't quite sure how to review it.\n\nIt's a fairly busy bar but you can usually find somewhere to prop yourself up with a drink (except during festival when it's heaving - because it's right next to a venue and anyway everywhere in town is mobbed over festival). They sell a good range of drinks (I could choose my brand of gin) and the prices are what you'd expect.\n\nStaff have always been pleasant to me, and I never find the music too obtrusive. All plus points.\n\nThe summation of this review? An adequate bar for an adequate drink with your adequate mates. Nothing special, but that's okay.", "business_id": "ZRYZBtiRjjYqA8ohMoRn-Q", "stars": 3, "date": "2015-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B9p4cnBr3YPedWA8Gh104Q", "review_id": "e83IGY2eu7bp8Hbsf34Yiw", "text": "this is a great little greggs to go to in the st james centre.It has a great selection of food like bakery and other sorts of food like crisps,wraps and others.Its a good quality of food as it tastes beatiful.", "business_id": "OsupIEGpLkAXW9xIg90Ksg", "stars": 4, "date": "2009-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RH2K7RqzkGUa0pD0nSMDcg", "review_id": "LqZBkkrrdc0AqUpxmjhlAw", "text": "We went here on the eve of new years eve. New year's eve eve after some beers and in much need for food.\n\nI had a (several) beer and a burger which was surprisingly nice! I say surprisingly because my companions nachos had arrived shortly before and these were decidedly lack lustre.  As had someone elses milkshake. They managed to do beer and coke ok though!\n\nMy \"english\" burger came with an egg and bacon and cheese. There were LOADS of sauces in a massive basket on the table which I approve of - however it does tend to warn of possible issues with flavour! \nthe burger however was very good with gherkin and other accoutrament that I would expect from an average burger. The chips were rather undercooked however which was a bit annoying.\n\nNeither compatriot finished their nachos, both of which looked fairly unappetising. \n\nSo good: \nBurger - edible\nService - pretty and chatty\nBeer - Wet, cold, had alcohol in it\n\nNot so good:\nNo music - normally this wouldn't worry me. But it was oppressively silent \nMilkshake - avg\nChips -  slightly undercooked (at least they were fresh...)\n\nAll in all. fairly alright.", "business_id": "Z9NI8AJnZULUD_kQBXMKwg", "stars": 2, "date": "2013-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "L1Gtm7ovUSb98XG1P19oNw", "review_id": "cVq72b_Zmz1vgV6lhHUogg", "text": "Back in the day, when there was more than one Favorit in town, you would tear a menu off from a stack of them handing from the wall. I can only imagine that the demise of the other Favorit (in Tollcross) is a result of this gimmick being retired. Nonetheless the original theme remains: a diner that's happy to pack people in and show them a good time.\n\nI've eaten here twice in recent weeks, opting for the sizable burger each time and feeling happy as Larry with my selection. The meat is plentiful, the chips (on this occasion) crisp and chippy. There's not much else to deal with, although the little buckets of relish are a nice touch - the whole meal was nice presented in truth.\n\nIt would have been great if the waiting staff were a little more friendly, but they their job in an effective manner: we ordered, got our food and drink, paid for it and were in a good state to move on and continue the night.\n\nBring back the tear off menus and I'll give the place an extra star.", "business_id": "Z9NI8AJnZULUD_kQBXMKwg", "stars": 3, "date": "2013-02-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "FQBsSK8bOMfcu1pnwDKFtg", "review_id": "oITlaBsDjC9mfjCIMIzGGw", "text": "I came here and had a tasty salad and an amazing 'natural high' smoothie. was pretty cheap and the man who served me was extremely friendly!", "business_id": "Z9NI8AJnZULUD_kQBXMKwg", "stars": 3, "date": "2013-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_lmmIZeJTv8roWn8qU3oIQ", "review_id": "mzVXYbMOEgXsQU7acBMvmw", "text": "Favorit left me underwhelmed. We came here for Book Club in December and I suffer from a terrible affliction of being unable to resist ordering food if the possibility of doing so is raised, so order I did. It seemed a good opportunity at the very least to continue my search for Edinburgh's Greatest Eggs Benedict.\n\nWell, that plan got scuppered pretty quickly when the waiter returned saying that they'd run out of Benedict Sauce. This told me two things: they don't make it fresh, and they don't know what it's called... so I am slightly glad I didn't experiment...\n\nAnyway, I plumped instead for a salmon and cream cheese bagel and a pot of tea. The bagel was just fine. I could have bought the ingredients and made one for myself just as well for about a third of the price, but it was tasty and the bagel bread was nice and sweet, as it should be, with cheese squidging out of the centre hole. No criticisms there really.\n\nThe teapot, however, was badly chipped and stained right on the pouring edge of the spout. Being a timid Brit, I grinned and bore it, but it was pretty offputting.\n\nFavorit's a diner-style caff, and it made a decent enough venue for our reduced numbers at Book Club, but it's nothing special. Situated where it is, I'd have thought it'd have to play a better game to get by. Come on, Favorit! I'll definitely come back to see if they're working on it!", "business_id": "Z9NI8AJnZULUD_kQBXMKwg", "stars": 2, "date": "2014-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jYE2KD8E359Ew587IvzUqg", "review_id": "IEsu2-bOYu2Vp3sQEx3LPA", "text": "great little restaurant.. portions of food were a bit small.. and the food is slightly over priced.. and the restaurant could use a bit more lighting.. service was decent though\n\nthe salmon and pork belly dishes were delicious though.. \n\nthis is definitely a place to check out if you're in edinburgh though..", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 4, "date": "2010-01-28", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "X8rBTAVQMzzetwv7iWtgdw", "review_id": "4D66kiYe5nCWgehssMJo1A", "text": "Ambience - awesome.  It was a bit entertaining that occasionally a few tables would get quiet and it felt like I needed to whisper, then the conversations would pick up again.  The ebb and flow of volume was intriguing!\n\nService - fantastic.  Our favorite was when we asked for a wine reco.  I'm not sure who the expert was who came over, but made some suggestions, and we went with a New Zealand red that he seemed to like more than the more pricey wines.  It was I think under 30 pounds--quite cheap for this restaurant.  Anyway we loved it.\n\nThe Scallop hors d'oeuvre was incredible.  We wished we'd gotten 3 each for our dinner...but alas, we had one.  For dinner we had the Wellington, because it was recommended highly by two of my friends.  I was only disappointed because it was 80 pounds.  It was good, and fed both my girlfriend and I...but I'm not sure it was \"80 pounds good\".  It did come with two sides: we chose Mashed Potatoes and Green Beans, which were both very good.\n\nWine = outstanding\nService = outstanding\nAmbience = outstanding\nAppetizer = outstanding\nDinner = good\nSides = grea", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 5, "date": "2011-01-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "Hc0sufBPV0ubfP-A7glUIw", "review_id": "TD-x8qYFos4j3yacnI1MmQ", "text": "The food and atmosphere is amazing at this historic restaurant by the castle.  We ate at The Witchery on Christmas Eve and it could not have been more perfect.  The lighting was dim and inviting and the small, crowded dining room felt somehow warm and cozy instead of clausterphobic.  Our waiter was very friendly but not over-bearing.  He suggested the right wines and right accompaniments for each of our entrees.  The food was fabulous modern Scottish, made with local ingredients.  The Loch Duart salmon may have been the best highlight of my whole trip to Edinburgh!", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 5, "date": "2012-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "MvZqzcdA2OYWIxmNK1jfPA", "review_id": "avw_xppyyN8N7JwjJjVxlA", "text": "It was a pampering experience but unless money is no object I wouldn't go for the food, which was fine but unremarkable. My hot smoked salmon would have passed for mediocre wedding food. The beef tartare appetizer was fine. The fudge that came with the coffee was meltingly delicious and they seem to do bottomless coffee so if you have the chutzpah to come and enjoy the ambience and unlimited coffee with fudge for 5.95£, you have all my support! Otherwise I think that the average diner for whom a restaurant with these price points is an extravagant treat is mainly paying for the maintenance of an extensive wine list you mostly can't afford anyway. I recommend the Northbridge Brasserie (at the Scotsman Hotel) for a luxurious meal that will be delicious in proportion to cost.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 2, "date": "2013-01-23", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "7DxQDfrnoQI9nGALyi-LyQ", "review_id": "r9XOrUKI-q8_FNn-fWqGtw", "text": "I've just been reminded to update my review...\n\nAfter my mediocre dining experience which included white rice instead of arborio risotto, I actually contacted the manager.  I wasn't sure if the kitchen had run out of arborio or if this was standard practice and either way I want to make management aware that, while the wait staff were fantastic, I was very let down by my fake risotto.\n\nHe never got back to me.  \n\nSpecifically, I emailed someone who got back to me saying \"I'm sorry you didn't enjoy your food\" or something along those lines, and saying they would pass my email onto the general manager.  It was the general manager who never responded.  \n\nI felt this was an incredibly poor way of handling a customer who was previously mildly put off but is now really unimpressed.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 2, "date": "2013-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "hen2cSHUagxydiaZm7hhLQ", "review_id": "39D3viAhXjMGxX_wHGF4ag", "text": "I recently got treated to a very nice meal here. Overall, it was a outstanding and very romantic experience. As we walked down the tiny alleyway to the entrance of the restaurant you can't help feeling slightly whimsical. Our table was reserved in the 'Secret Garden' section of the restaurant. \n\nI do have to agree with Jonas B. below on the bread situation. I had tomato and rosemary focaccia which was good but I think you can expect better at restaurants of this calibre. I had foie gras as my starter - which you don't see on too many menus here. It was heavenly. For my main I had the hot smoked salmon. My partner had a fillet of limousin Scotch beef which included grilled marrow. We were both impressed with our meals. We shared an excellent bottle of Chenin Blanc and creme brulee for dessert.  We were offered complimentary espressos and a latte which came with macaroons and fudge. The macaroons were somewhat stale but the fudge was divine.\n\nI think the restaurant does really well because it presents a really lovely atmosphere and experience. I've been to fine dining restaurants in other cities and there's a magical element to The Witchery that other places lack. I suppose being in the backdrop of the castle helps!\n\nI would love to come back for lunch when there's natural light shining through as the restaurant is fairly dark (this isn't a criticism, I liked it dark). \n\nI found the service excellent - not too inquisitive on how our meal was. Very professional and knowledgeable. \n\nWe finished our meal around 11ish and there were a few tables that were just being seated. I'm not sure if they regularly seat such late (for Edinburgh) diners but this might be something to take note of for future reference!", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 4, "date": "2013-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "sUXFTxyhk_bkIivNTvr-DA", "review_id": "9bf1gb_DMZLUikEP-1GjyA", "text": "Food 4/5\nService 4/5\nAmbience 5/5\n\nOur favourite dining experience whilst in Edinburgh for the holiday.\n\nIt wasn't the best food but it was decent. Traditional faire such as meat pies, haggis, blood sausages, etc. are done well. There are other michelin star worthy restaurants we ate at in Edinburgh but nothing beat the history or atmosphere of this place.\n\nSituated in Old Town Edinburgh, right next to the castle, this was apparently part of the jail barracks centuries ago. Rumours abound of haunted spirits that were tortured in these gallows still roam this restaurant and surrounding buildings of the castle.\n\nThe inside of the restaurant was very small, romantic and quaint - most doors in the UK are tiny but this place reminded me of entering a Hobbit's home. I thought it was way too hot inside, despite it being below freezing and windy outside. It was hard to remove all my layers of clothing with such tight quarters.\n\nIf you only had one night in Edinburgh for the first time, I'd highly recommend going here.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 4, "date": "2013-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UNaDMew11Dxa77sLOmOnSQ", "review_id": "-cQKPZNNiyUm1WF_I-2YJw", "text": "The Witchery will have the highest grade in presentation, just telling you now.  I'm not spoiling anything.  This is not a predictable plot with a Shyamalan-like fifth act twist.  By saying this early, I can make you wet your imaginative appetites (see what I did there) as you contemplate how this place could possibly look better that Inamo or Claridge's. \nThe Witchery matches Claridge's in their dedication to offering a fine dining experience over just good food.  I've been thinking about that, about how I prefer to have a dining experience.  I would never go out \"to get food.\"  \"Let's get something to eat\" would be replaced with \"Let's go out tonight.\"  This is why I haven't eaten fast food in five years.  I go out for the treatment and the experience as much as the food eaten.  As I sat down and took my first glance at the menu, I knew I was in good hands.  Our third water had come down with water after the second had brought the menus.  As the rain fell outside, we enjoyed the warmth of the Witchery.\nAnd then we ordered haggis.\nI know what you were thinking with that statement.  \"...and this was when it went downhill.\"  Haggis has a rather tepid reputation amongst westerners, squarely because of various negative images and connotations.  For me it, it was Highlander, where a French actor playing a Scotsman explains what haggis is to a Scottish actor playing an Egyptian.  When hearing that haggis was sheep's stomach stuffed with meat and barley, the Egyptian played by the Scotsman retorts, \"How revolting!\"\nBut let's analyze what haggis really is.  To do that, you must come face to face with the realization that you've been eating its brother for most of your life. Sausage, it's the same stuff in a different package.  Where haggis employs a stomach, sausage uses intestines.  This process continues today, though most industrial manufacturers have cheapened out and switched to synthetic cases.  So haggis can be looked upon as just a sausage ball.  How much harm could come from that?\nYou're probably thinking the other shoe is going to drop, but no.  The haggis was the first ordered, the first arrived, and was so overwhelming delicious that it sullied all dishes to follow.  The skin gave way the moment you scared it with the fork.  I'm so hooked on haggis now; I could eat it for breakfast, second breakfast, elevensies, luncheon, afternoon tea, dinner, and supper.  It was so good; I'd forgotten to take a photo.  I know; I'm naval lint.  The haggis was 9.50 and a bargain.  From there, we took in the d'Hote Menu, basically what we have been doing nearly everywhere else.  Between meals were offers of bread, the same as Claridge's.  My mother ordered wine to my water, the same as Claridge's.  Three courses were 30 quid.  Does that sound good?  It's less than half than Claridge's, so this place just got an A+ in value.  The actual starter after the haggis was offered as three options.  My mother elected for the grilled Irish oysters, pancetta, spinach, and hollandaise while I had the Tamworth ham hock en gelée, piccalilli, with grain mustard mayonnaise.  And you couldn't have a more complicated and more delicious way of saying \"spreadable meat and mayo on bread.\"\nWe both decided the main should be the grilled gigot of new season lamb, rosemary potato cake, with aubergine caviar and tomato jus.  Alas, this is where the Witchery falters.  We must have been missing a point to this because the lamb was almost entirely fat.  It was a nearly inedible minefield of grizzle forcing us both to spit portions back onto plate like we were Gordon Ramsey in a kitchen nightmare.  The sides were good but this meal was ultimately a disappointment... what a shame.  In retrospect, I should have gone for my first choice, the butter-poached potato gnocchi with garden peas, broad beans, ricotta and mint.  The mean was redeemed with organic carrot cake topped with mascarpone ice cream blueberry syrup. \nThe Witchery was sizing up to be the greatest restaurant of the trip.  It did everything else to perfection, from service to décor, to every other dish.  It still gets extremely high praise from me because this one poor dish just wasn't enough to sour the entire experience.  I would definitely return.  I would also say that you won't regret going and should do so, just avoid the lamb.\nFood:  8/10\nService: 10/10\nPresentation:  10/10\nValue:  8/10\nRecommendation:  9.3/10", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 4, "date": "2013-12-20", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "UTnB9d5KwnR6g2A-2IteRg", "review_id": "y8jF-skyMwgF2lJ_2u_3sQ", "text": "This is one restaurant I have wanted to try for sometime. Heard great things about it, the food, the location, the decor etc. The food was excellent. Can't really fault it and the atmosphere was lovely with great service. Only negative point is I'd say its a little pricey. Have been to other restaurants in town that were as good if not better and cheaper. I think if I was a foreign tourist I'd be blown away with the whole package. Otherwise a great night out and have to recommend to others if you're prepared to pay that little bit more.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 4, "date": "2014-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "xBfzrzySwmogGGbNoTHAgg", "review_id": "Ij6WLVsfcEWKRR1GD8T_IQ", "text": "The ambiance the service and the wine were 4 to 5 star. The food was tourist food. VERY unexceptional. The first meal in the UK I've been disappointed in. \n\nHad a scallop aperitif that was \"okay\". Nothing interesting about it. Had a vegetarian risotto that sounded amazing and was totally tasteless. My niece had a cauliflower soup aperitif that was bland and a potato stuffed with crab etc... she said \"I wouldn't send it back but it was just dull\". The food in a word... dull.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 2, "date": "2014-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "SSV1UOxgNVCQyVy2hSkOeQ", "review_id": "cRSm0EJtNxFlx_EGnhkQEQ", "text": "The Witchery is a restaurant with rooms. \n\n5 stars for lodging (the Library room) and for the restaurant both!\n\nLODGING: The Library room is exquisitely decorated and serviced (see their website for detail and pix). Although it is on Royal Mile, just steps from the Edinburgh Castle, the room is dead quiet (props to old stone buildings). The room is spacious and well decorated as a time piece, but not ostentatiously so. More thought should be given to adding closet space though. It is very clean and comfortable and WARM in these winter months. Complimentary continental breakfast arrives at the moment that was requested; delicious croissants, porridge in iron pots, and creamy yogurt were favorites. \n\nRESTAURANT: We had dinner in the original dining room. We almost did not because of some of the less than positive comments in other Yelp reviews. I'm glad we did, though, because it was as if those disappointed yelpers had dined somewhere else.\n\nSimply put, our dinner at The Witchery was one of the finest meals we've had anywhere. The room is well appointed, mysteriously quiet and candlelit. The service was comfortably impeccable. The lamb Wellington (served for two) was the tenderest of meats I've ever had, and deliciously prepared. The duck was equally tender and flavourful. The sides of whipped potatoes, ratatouille were sublime. The deserts - made to order bread and butter pudding and a variety plate of rhubarb sorbet, chocolate and other hand made delights was... delightful. \n\nDon't pass this restaurant by - and stay for the night if you can.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 5, "date": "2014-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iwH3PD7CNd7zaFgQsq0H0g", "review_id": "1alF9mb3eY7h9Mrj2Zo3yg", "text": "The restaurant being the go to place in Edinburgh I had to review it. \n\nThe place itself was wonderful. The decor was just lovely, it was set over two separate areas, the original and the extension (I think), I went to the original part. I was sat in the corner behind a wooden separator. I must say for all its classiness, I did feel extremely out of place when I said no to wine to have not been offered any other alternative! \n\nAfter a hesitation I then became very embarrassed to ask for which beers they served, if any at all (yes I did think that!), I am just very surprised that they didn't offer an alternative when I said no to the wine menu. Anyway I then asked for that menu, they have what I can only describe as a bible of wines. Their cellar must be huge. After fake-browsing the wine book I asked for a beer feeling quite ashamed at my lack of sophistication. \n\nIt's a shame I was made to feel that way.\n\nAs the evening went on the food was very nice and presented in a beautiful way albeit very small portions. Although I expect that from a \"posh\" restaurant.\n\nWe were however under waited on, perhaps caused by being behind the wooded separator... When we did want something I would have to poke my head around this separator and get someone's attention, but oh - don't disturb the short brunette in there because she's very frosty, perhaps the waiters are allocated tables and so I was calling over someone else's waiter? Anyway, not nice.\n\nI really want to put 3 stars but Yelp class that with a caption reading \"A-Ok\" and I think it's a bit more then that, although there were a couple of down sides to my visit I would still go back and I'm sure it would have been better.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 4, "date": "2014-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jDVzcTfMXFpJt8K6hZeJzw", "review_id": "pv0vN6of9ZplEvdJNhZb-g", "text": "The environment and food of the restaurant are all wonderful, and it is just beside the Edinburgh castle. I had lunch here this afternoon and I have to say that I really want love the restaurant. The oyster as starter is fresh and juicy, the scallops taste wonderful with the sauce. Although the price is not that friendly but the food is worthy every penny", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 5, "date": "2015-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nhf7UF6f6q7k19fkrmQSDA", "review_id": "1J0yFCEZIzzqNSTmDPtpFg", "text": "I have heard so many things about The Witchery and although it is near the castle, I was hoping that they have not fallen into the category where they charge extortionate tourist price for mediocre food quality.  Unfortunately, they have.  \n\nI ordered the steak tartare as the starter.  Presentation was great but I thought it lacked seasoning.  Of all the steak tartare I have eaten so far in Edinburgh, this has by far the least ingredients and seasoning.  I also felt it was a bit dry too.  This was priced at £12.50 and I do think that you can get a better steak tartare starter elsewhere for a cheaper price.\n\nI had the Seabass as the main.  I have a picture and if you see the size of the fish, it is just too small to justify its price at £28.  The presentation - great but again taste was very bland. The fish was also not de-scaled properly and from the picture you can see 2 scales still left on the skin of the fish.  I eat a lot of fish and from the smell and taste, the fish was not that fresh at all.  I have been to its sister restaurant at The Tower and you get a whole seabass for the same price and it was the best seabass with brown shrimp I have ever eaten in Edinburgh.  This is just a plain rip off.\n\nCreme Brulee as the dessert priced at £7.50.  From my picture, the portion is great and worth it but unfortunately, it came out as thick custard and not a consistency of a real creme brulee.  One of the lowest ranked creme brulee in Edinburgh for me.  The highlight of the whole experience for me was the mango sorbet that came together with the creme brulee.  However, the creme brulee was not sweet enough that when you return to eating the creme brulee, it just tasted even more bland.\n\nUnfortunately, I have to rate this well known restaurant 2 stars - one star for ambiance and another for its service.  Sure, if you want to pay for the decor, ambiance and service this is the place to be to impress.  However, the quality of food and certainly its value for money has failed to impress me.  At a price I have paid here, I would rather spend my money at The Tower or a Michelin star restaurant.  Sorry Witchery, you have to do better.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 2, "date": "2015-01-26", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "EBB_uJ6LNEM_lNscYI7MOQ", "review_id": "00fDrR87C9jHJ5376yWwMw", "text": "I'm extremely behind in posting this review but I couldn't not review it! My boyfriend and I were on vacation in Ireland and the UK in August when on a train trip from Dublin to Belfast, I sat by some locals. After telling them where all we were traveling they said we had to eat here when in Edinburgh and that it was pricey but a great place to celebrate. Turns out by the time we got there, we had something to celebrate! After Belfast we were in London where my boyfriend proposed. So our celebration dinner was at The Witchery. It was, by far, the fanciest restaurant I've ever been too. The wine list was crazy long so they also had a wide price range too. We had the wood partridge as an appetizer, how can you not when it said to take care when eating as it's wild game and may have shot still in it! It was definitely good. For our entrees we had the Scottish Salmon and the duck. All excellent. The only negative thing - and this is not their fault of course - the place is small with tight quarters and for the bulk of our meal there was a mom with her two kids (American I embarrassingly admit) and the daughter talked SO LOUD about everything that was going on with their life. Basically everyone in that part of the restaurant could tell they had a lot of money with the things she was going on about. Anyways, we were celebrating our engagement so I refused to let it put a damper on our evening. The food is fantastic, the atmosphere is definitely romantic and intimate so if you have something to celebrate I would check this place out. Be sure to make a reservation regardless of the time of year.  We probably wouldn't have found this place had it not been for the nice Irish girls I sat next to on the train so thank you to them!", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 4, "date": "2015-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "X55q3hN4M-cjEi9A8RDy8g", "review_id": "2CyQhanTy_HpVm5-OJ0F9Q", "text": "The name definitely denotes creepy but don't let that scare you. This fancy place requires some wait time but wait is worth. The food is extremely well prepared and the atmosphere is one of the best. This is a must if you're in the area.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 5, "date": "2015-12-20", "type": "review"}
{"votes": {"funny": 3, "useful": 6, "cool": 4}, "user_id": "qXLte7ikUM-__NHU5RaUgg", "review_id": "B2M5d--17tk85WYrSAvOXg", "text": "Love this place have eaten here more than a dozen times in the last year. Its BYOB.\n\nIf your an American longing for a taste of home you have to have the burger it is as good as it gets.\n\nPersonally my normal order is Mussels (amazingly fresh, im told they delivered for each service fresh from the Shetlands), Steak (great sirloin) with garlic butter, its served with chips and salad and unless I miss lunch i struggle to finish.\n\nFor desert theres three sugar rich options of dime bar cake, pecan pie or chococlate fudge. Im a chocolate fan so my decision is easy :)\n\nTry it its worth it :)", "business_id": "XyYSroXLSCtQIK0taL9-fw", "stars": 5, "date": "2011-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M4MVVzNPZHiJdnNvWjL8VQ", "review_id": "1zgZoSp1O-HLudI8X3oajQ", "text": "You'd be hard pressed to find a better value venue for your office Christmas dinner than the NYSP. Having known the name for years I've only this year taken heed of advice to check it out and my party of 20 were all well fed and watered with 3 courses for £18.95 & corkage of just £1 for wine (one in the eye for all the places that charge 3 times as much in the age of screw tops).\nIt's an intimate venue to say the least and the potential for a toilet queue is probably the major negative about the place but the service was swift and cheery and you're pretty much left to just get on and enjoy yourselves whilst the staff beaver away in the background. Steaks were all cooked as ordered and the main course helpings were generous.", "business_id": "XyYSroXLSCtQIK0taL9-fw", "stars": 4, "date": "2011-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "hWD_PTfJUXjIYb1UJ0wNFg", "review_id": "po2hyIS-_EU8aWAS1JpHPQ", "text": "when organising a work night out, it can be hard to find a venue that is willing to host a dozen plus women (and one man) from HR that are looking for a decent meal without paying loads of money.  fortunately New York Steam Packet fits this criteria quite well, a three course meal for £15.95, BYOB and £1 corkage.  so last friday night this is where i headed...\n\nnow this place is well hidden, thankfully getting dropped off right at the bottom of the alley way with the driver telling us it's right up there made it a bit easier to find.  however we were confronted with a short cobbled alley that had seen better days and us in 4 inch heels.  arm in arm we walked as daintly as possible to the door only to be greeted by a rather ominous like spiral staircase.  we walked up to the restaurant with a rather massive fear of how we would ever make it back down those stairs at the end of the meal!  the restaurant itself is small and they do two seatings per evening.  one at 6pm and the other at 8:15pm.  it's good for large parties though as they can accomodate about three large groups at each seating and don't seem bothered by loud laughter and chatting.\n\nthe menu is fairly simple, three courses for £15.95 with about 6 choices per course.  i went with the deep fried potato skins followed by the beef burger.  the potato skins were ok, i had expected them to have melted cheese in the middle as this is what potato skins are like in the states.  but they were literally just deep friend large wedges of potatoes with a chilli mayo on the side.  tasty enough, but not exciting.  the beef burger was much better though and i did really enjoy this.  however the fries were a bit meh with a lot of them being soggy.  my last course was chocolate fudge cake which was lovely but i was too full after only a few bites to try and finish this.  the meal in total with tip and corkage fees for 12 of us was £21 each.  hard to complain as i brought my own bottle of wine which i drank most of...\n\noverall, i thought New York Steam Packet was ok.  i had a decent meal at good value, but i wasn't overly impressed.  Also the cobbled lane and stairs up to the restaurant are pretty much a death trap for any woman that wears heels, so i had to knock a star off for this.  i'd return if it was suggested for another night out, but wouldn't rush back.", "business_id": "XyYSroXLSCtQIK0taL9-fw", "stars": 3, "date": "2014-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B9p4cnBr3YPedWA8Gh104Q", "review_id": "l0l2os78uLV-AEJK-OQdSw", "text": "Big bar restaurant at corner of Chambers Street near museums , food was good but not great portions and drink was quite reasonable , great place to sit and watch world go by but it did get very cold at our table as we were right next to large window and it was freezing outside , good atmosphere and had a good mixture of people. Waiter/ess service was quick and attentive as well.", "business_id": "dXPmE2ncXbQTPBVNRODuNw", "stars": 3, "date": "2010-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "DEc_48vZ1s70k-wfYUA2qg", "review_id": "vboW2cJXG-HZcRVZ_3Ub-w", "text": "I've never had any inclination to go here, but when it was booked for a recent Yelp outing, I went with an open mind. Unfortunately my predisposition was proven correct..  The service was intermittent and fairly dismal.. The food was mediocre and  really didn't leave much of an impression (not a good one at least).. two salads at the table arrived \"undressed\" and upon inquiry were told that the kitchen had \"run out of the balsamic vinaigrette\" which usually came on the salad. We (maybe rather loudly) suggested that maybe someone run to the Tesco across the road to pick up our own salad dressing! A bottle of balsamic vinegar soon arrived at the table and free drinks were offered as compensation for the those who'd ordered salad. Two steaks at the table looked promising upon arrival but the rare was closer to well done although the medium rare was at least about medium.\n\nDessert/tea or coffee was never offered after our plates were cleared away, we had to send someone to get the bill for our table. The vague saving grace was that they gave us 30% off our entire food bill because we had a few students at the table. (They offer a 30% student discount).\n\nI think we all left feeling rather underwhelmed. With so many options for eating out in Edinburgh, Biblos does not warrant a repeat visit.", "business_id": "dXPmE2ncXbQTPBVNRODuNw", "stars": 1, "date": "2011-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UTzpK0D8maxbXbnC8b3-dQ", "review_id": "T0CJ-kH7LVbKT43Ic7aciw", "text": "Meh. It's so close to my uni that I come here often but it's just ... so ... meh. I agree with Jenny over  here that it's absolutely soulless.\n\nOften times you'll sit down and the waitress will actually forget that you're there -while you're sitting in the middle of the restaurant in front of three of 'em standing around chatting-. Alzheimer Light? Or I-don't-give-a-shit-about-my-crappy-job. I'm guessing the latter.\n\nLook, if it's between Nero in Blackwells and Biblos, I'll choose Biblos because, well, their seats are comfier, and that's the only reason, but in all fairness, it's quite .. bad.\n\nAs a matter of fact, I should stop coming here altogether. It's just so ... convenient, damn you Biblos.\n\nLook if you want a good burger and fries, skip Biblos and head up the street to Mums, and if you want a good coffee, the cafe across the road from them -though smaller- serves far better brew, but if you don't care and just want to be left alone, sit in at Biblos, I promise you, it will be quite ... forgettable.", "business_id": "dXPmE2ncXbQTPBVNRODuNw", "stars": 2, "date": "2012-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UE3eCdm9w8i-ZAlh4a2C5Q", "review_id": "WR-M5lZpvpOeXtzpyo9ZDA", "text": "My friend and I greatly appreciated the student discount they automatically applied to our bill even though we didn't show our student ID's. Fish and chips were pretty decent but it wasn't our first pick to eat on that specific street. It was rather dead when we went in so it was nice and quiet and table service was really efficient (probably tied to the fact it was so slow). Could easily go back but would like to see what else Edinburgh has to offer.", "business_id": "dXPmE2ncXbQTPBVNRODuNw", "stars": 3, "date": "2015-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 3}, "user_id": "MsFqwxxd2xYDNg1xeqRXXA", "review_id": "-PXnrGgqDMk2qqwkENvzzA", "text": "The fading glories of the monarchy are being kept alive on this, the last of the Royal yachts. \nIn some ways it is a shame that it should have been retired, but as a floating museum it does let the ordinary person behind the scenes of the Royal Family and their life before aeroplanes were trusted with the monarch.\nIt is being kept in tremendous shape, although bits of it are roped off and the parts I would like to see are out of bounds, it is still worth the tour.\nThings to look out for are; the largest narwhal tusk I have ever seen, the ship's bell, and the stunning fittings in the personal areas.\nI hate the pre-recorded tour units, as they turn people into mindless sheep with a stream of facts they will never retain, but on a blustery winter's day, they were scarce enough not to ruin the experience.\nYou can rent the facilities for events, especially dinners, but be warned, there is only seating for ninety-six in the main salon!", "business_id": "HSYVkG67Juu-G693xz2ViQ", "stars": 5, "date": "2011-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ykAYjjgr476gvqWNcImGZg", "review_id": "lgkjp8L9r4oihU1ym-LEuQ", "text": "Spent the afternoon on the Britannia doing the tour and sampling the food & drink in the Royal deck tea room. Definitely worth a visit!", "business_id": "HSYVkG67Juu-G693xz2ViQ", "stars": 4, "date": "2013-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "TfDNVxzjXsZl--WGiytT1g", "review_id": "UAzIzAzi4aNwt4PRCfR2KQ", "text": "Excellent Tour & very knowledgable staff. Considering the cost though, I'm sure they could buy a tin of varnish for the weathered deck...", "business_id": "HSYVkG67Juu-G693xz2ViQ", "stars": 4, "date": "2013-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "XriefdZW3Kf-RoZOsVXqbw", "review_id": "Jc2FLZh0mOuMUrvat_irPA", "text": "The tour itself took between 2-3 hours (if you listen to everything). The fare includes the audio guide, which was very helpful and of a good quality content-wise. The tea room should always be built into your itinerary. The food served was great and certainly a highlight of the tour. The Royal Yacht Britannia is docked beside the Terminus which itself is a very packed shopping centre.", "business_id": "HSYVkG67Juu-G693xz2ViQ", "stars": 4, "date": "2013-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "OtR7HfadZXyFYosUzjWxhg", "review_id": "T_s-QepBzp9Mf6L2ojzRUQ", "text": "Truly excellent food. Great service. An institution.", "business_id": "5dUDkaxm5FdQanoNkP86KQ", "stars": 5, "date": "2013-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FRDbugHwLHTzsPMAfwJduA", "review_id": "bf-9vY_-YJeiA0mTNvmbRQ", "text": "Average Indian Restaurant, I have both eaten here and had home delivery, and the food and service are both fine.\n\nMost recently I had a Goats Cheese dish and Lamb Kadai with Garlic Nan, the 2 curry dishes should have been hot and spicy, they were medium hot - I think this is another Indian restaurant where they are afraid of making their dishes too hot - probably because the average British palate cant handle it - though I'm make assumptions here.\n\nPrice wise its fine also, I was £15 including tip - I can get cheaper closer to home, and of similar quality. I know Indian and Pakistani people who said this used to be a good Indian, so maybe they have changed ownership, or just taken their foot off the gas??", "business_id": "5dUDkaxm5FdQanoNkP86KQ", "stars": 3, "date": "2013-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "hWD_PTfJUXjIYb1UJ0wNFg", "review_id": "Yby56XGZ6K7DZ0kgar1J3A", "text": "i've been a fan of teuchters at the shore for many years, but hadn't been to the west end version of this pub quite yet.  mainly because i live in the shore so west end visits tend to be infrequent, but this place proved the perfect post dinner drink spot this past friday night.\n\nthe boy and i wandered in after a brief walk from thistle street where we'd stopped to have dinner.  it was about 9 or so on friday night so the place was fairly busy, but there were still some tables and seats available!  huge plus for me as i hate standing with my drink while balancing my hand bag on my shoulder and hoping no one bumps into me causing a spill.  so big thumbs up for adequate seating!!\n\nanother huge plus was i asked my boyfriend to see if they would make me a hot toddy as they had been offering these during the festive season.  the bartender said they didn't have cloves but he would improvise a bit so i could have my drink :)  the hot toddy came and it was whiskey, honey, lemon bliss all warmed up in a glass!  yes the cloves were missing, but i still really enjoyed this drink and it made me smile that the bartender made it off the menu without fuss.\n\ni sadly can't say too much more about this pub as we left after our drinks.  but as it's the same owners as teuchters by the shore i have great faith that the mug menu is tasty and there are plently of beers and whiskeys on offer!  definitely a great spot to grab a drink if you're in or near the west end.", "business_id": "2wXPLsK6VmbAzxlDhHEedA", "stars": 4, "date": "2013-02-18", "type": "review"}
{"votes": {"funny": 4, "useful": 4, "cool": 3}, "user_id": "wx12_24dFiL1Pc0H_PygLw", "review_id": "hSc5xACRNMsSysGbPW2Rfw", "text": "Central location - yey! £8.80 a ticket?!? Major nay.\n\nThis is a nice branch of an Odeon. It's always clean inside, there's no spilt popcorn. They always show some the top flicks. And it lacks the strange smell of the nearby Cameo which is why I usually opt for there. But with the Filmhouse nearby too there's stiff competition, and without the themed nights the Cameo have, or more art-housey movies of Filmhouse, it's a bi generic.\n\nGood for a flick, but only if you're feeling like Mr / Mrs Moneybags! Or am I actually just turning into one of those people that says \"back in my day it was £3.50 for a cinema ticket, and that was on a Friday night!\" (and it was!) Pah.", "business_id": "T2lP9Ayiua9MOQ-h1F_4yA", "stars": 3, "date": "2011-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "I9gB9ue3e0ec2pXW0DwYww", "review_id": "TE-HIKnC3DQo6zSDCW2Mmg", "text": "Nice little cinema on Lothian Road. I popped in to see The Hunger Games Mockingjay Part 2 with Mary, and had a nice time. Buying tickets was a simple affair at the automated machines. There are a large array of snacks and drinks available just before the screens area, and all staff members I encountered were friendly and welcoming. Screen was comfortable, good picture and sound quality.\nReally, all the things you'd expect from a cinema trip.", "business_id": "T2lP9Ayiua9MOQ-h1F_4yA", "stars": 4, "date": "2015-12-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "qaFZKPTO4LptjEXiOceODg", "review_id": "TpzyP2Fv6I3uTfeAt4l22w", "text": "OK, firstly a disclaimer - I can't exactly understand British/Scottish Chinese food (i mean.. HOT CHIPS?!@()*!()#)!(*#)(@*$ _@($*_ WTF_)*@$_@($_#$()) ... being used to your \"more authentic\" Chinese food from Hong Kong I was trying to keep an open mind \n\nWe had the chicken chow mein. beef and black bean, egg fried rice and I had the equivalent to mapo tofu (pork and tofu, spicy). Food was good - my Edinburgh-born-and-bred friends said it was really good in quality and taste. Yes, it's not traditional but I don't think that's what they're aiming for (or what the local palate demands)..The tofu dish I did have had small slices of pork in it (as opposed to the \"more-traditional\" minced pork) however I'm assuming this is again a \"regional variation :)\" catering to local expectations.\n\nService was fine, as were the prawn crackers served before and fortune cookies served after our meal. Place was busy (with both eat-in and take away orders) which is always a good sign.\n\n\nIn short, food tasty, hot and fresh. Service fine. Reasonably priced. Still don't understand the hot chips at a Chinese restaurant. :P", "business_id": "LES5wvNMruP8yGMBbl3NSw", "stars": 3, "date": "2013-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kXhCFHcz4FCKCkrdaJQsaA", "review_id": "vXAck4ql6Gy33vEpdDmENA", "text": "There are two types of food I am really particular about: Mexican and Chinese. I think it has something to do with the fact I am a Californian by birth so I know how amazing both can be. \nThis place was a disappointing from the word go, but I was so hungry I didn't care. The wait staff was rude, the food was horrible, the decor sucked. It was just a giant slice of lose. Oh well. One less restaurant I have to eat at in Edinburgh", "business_id": "LES5wvNMruP8yGMBbl3NSw", "stars": 1, "date": "2014-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "RYLQYE4vX-gsj6zux-pj2Q", "review_id": "zjavc_ttk8WDUjp4SsANKA", "text": "Cargo is in a lovely location, right at the canal basin of the Union canal - the perfect place to stop for a drink before or after a walk along the canal path. The picnic benches outside are ideal for a lazy afternoon in the sunshine... (should we ever be blessed with such a thing in Edinburgh.)\nWe went there recently for lunch and really enjoyed ourselves. The breakfast/lunch menu catered for most tastes and it was all quite reasonably priced, and I've noticed there are often lunchtime deals advertised.\n\nThe food was delicious, made more so delicious as it arrived within 10minutes of ordering. It all tasted really fresh and was perfect pub food for a weekend lunchtime! The coffee was also freshly prepared and piping hot.\nCargo is really child friendly, and the staff were incredibly helpful with our baby and toddler, offering to heat up her food for us and making sure a highchair was available. There's loads of room for pushchairs/prams, taking the stress out of eating-out with little ones. \n\nCargo does feel quite cavernous and a bit cold as it's such a big space with high ceilings. My only other criticism is that the back entrance area smells of wee - perhaps the men's toilets could do with an airlock on the door, or a scented candle or five. But if you sit away from the back doors then you don't notice it!", "business_id": "HvGG8i4asaJcwJraKrtAuQ", "stars": 4, "date": "2012-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "RH2K7RqzkGUa0pD0nSMDcg", "review_id": "-V84WgKlEwBGD1m492vT8w", "text": "I attend cargo for it's business lounge (upstairs) which is pretty good. Free wifi and free tea and coffee and 15% off for members using membership cards (this counts for downstairs too) \n\nI head there tuesday mornings for a networking thing which is good fun, but also because it's bright and airy upstairs. There is tonnes of natural light so that's pretty ace. I have a few issues in that I think the last few times I've been there has been sport on big tellies (generally a no for me). I also get the idea that it doesn't really know what it is. I think they might finally be on the right track with going the more businessy rather than studenty route. It's right in the middle of a massive area of urban re-generation with young professional accommodation, as well as some significantly large offices opening up nearby.\n\nI would certainly think about Cargo as somewhere to hold a largish but casual meeting, an event or just for dinner and drinks on a friday. Will check out the food and beer soon and update.", "business_id": "HvGG8i4asaJcwJraKrtAuQ", "stars": 3, "date": "2013-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M4MVVzNPZHiJdnNvWjL8VQ", "review_id": "lBS6tQC7TsOSF8qYmwebTg", "text": "So far have waited an hour for one burger and one baked potato + one drink has been incorrect. Apparently the machine failed to register the order so discount ahoy", "business_id": "HvGG8i4asaJcwJraKrtAuQ", "stars": 1, "date": "2013-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "PH-TR5VxMTOmOscSeufDMw", "review_id": "R8Zwdrm_owLSJYnqZy0X0g", "text": "So I decided to venture from my usual Mexican restaurant on this trip to Edinburgh to try a new one.  I read the menu while I was standing outside and that's why I decided to try it.\n\nThe first waitress kept rushing me along saying, \"This table is booked for 7.  Ok?\"  I got it the first time.  I think I had 3 waitresses during my short dinner.  The last two, however, were very attentive and very hospitable.\n\nI ordered a Corona to go with my meal...and it wasn't cold at all.  The Tortilla Soup was not quite what I expected, but I have to say it looked beautiful...but the taste...not sure if it was the lukewarm soup itself, the crumbled cheese, or the rock hard pieces of avocado, but it was not good.\n\nI then ordered the Enchilada Toluca.  The menu says that there is a cream sauce, but there was definitely no sauce on this, just melted cheese on top, however I thought it was delicious, although there could have been more chorizo in the enchilada.  The rice was pretty bland, but the refried beans were wonderful.  The beans had a lot of flavor.\n\nOverall...it wasn't the worst Mexican food I've had, but it certainly was not the best.", "business_id": "uwV0CKF9A5hBjTKLoplphg", "stars": 2, "date": "2011-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "zEggXKgiDxiSTzRo07GFGg", "review_id": "oOffxwPzl7Ce3PCEeuAajQ", "text": "Not the greatest Mexican food around. Then again, this is Edinburgh...not Los Angeles, so it wasn't very shocking. For some peculiar reason or other, the South seems to have a few decent Mexican places but there's somewhat of a dearth up here. I'd actually rate this place 1-star but our server was lovely and brought us our drinks and food in a timely manner.", "business_id": "uwV0CKF9A5hBjTKLoplphg", "stars": 2, "date": "2011-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "mprTLmLYm2Vy3iQ3Qa-wug", "review_id": "AHBx9Ikqk1AmYOhXusZsMw", "text": "Don't know why we ended up here but some of us wanted Mexican food in Edinburgh.\nThe restaurant was small and the decor a bit passed it, but the staff made us feel welcome. I was very hungry and ordered the Mexican lamb, my friend a Chicken Fajitas.We didn't have to wait too long, and my food was there, I must say, it was a little dissapointing.\nMy Lamb was served in a bowl, basically plain white rice with a couple of folded tortillas stuck in, some blend lamb in sauce on top of Feta? Cheese in the middle , that was it. I recommend the owner checks out Castro's in NYC, sorry", "business_id": "uwV0CKF9A5hBjTKLoplphg", "stars": 2, "date": "2011-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "FQBsSK8bOMfcu1pnwDKFtg", "review_id": "2KxQXJOmOPWKfY3CA7-1JQ", "text": "OMG The Chili Con Carne here was sooooooo freaking tasty it was unreal. The rice was like spicy and orange, perfect amount of jalapenos and it was such a big, satisfying portion! Really worth the price and would love to try other things on the menu too!!", "business_id": "uwV0CKF9A5hBjTKLoplphg", "stars": 4, "date": "2011-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "DEc_48vZ1s70k-wfYUA2qg", "review_id": "gNrNHTRx2tditqrN4LT8_Q", "text": "Having walked past many times, finally decided to go in and try it out tonight.\n\nOrdered a variety of dishes, nachos, guacamole, tortilla soup, poblano, ribs & rustic lamb. Food was ok. Nothing spectacular.  Service was nothing to write home about. We were shown to a table which still had napkins on the floor. \n\nI don't have anything overly negative to say but don't have much positive to say either. I wouldn't choose to dine here again.", "business_id": "uwV0CKF9A5hBjTKLoplphg", "stars": 2, "date": "2013-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1s83qEXYPhmLRDvIqIf7Pg", "review_id": "6vHLpr9Mw4y2bgG5_R2Wng", "text": "Portions are huge. I mean literally giant. We got a nachos to share and the plate was enough to make us full. Cracked crab enchiladas were very delicious, although rice could be little bit less oily. \nDecor is nice and depicts the vibe of the place. Service is fine as well.", "business_id": "uwV0CKF9A5hBjTKLoplphg", "stars": 4, "date": "2015-01-25", "type": "review"}
