{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "l_szjd-ken3ma6oHDkTYXg", "review_id": "CFiLh7WvH7dM3qVZvNiacQ", "text": "After waiting for almost 30 minutes to trade in an old phone part of the buy back program, our customer service rep incorrectly processed the transaction. This led to us waiting another 30 minutes for him to correct it. Don't visit this store if you want pleasant or good service.", "business_id": "HZdLhv6COCleJMo7nPl-RA", "stars": 2, "date": "2013-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pjI4wXdKTMePI0A3rVzLxg", "review_id": "MFZXvq5CCfLvLFbdn8weZA", "text": "We are fans of Pistella Beer Distributors simply because we needed beer one night while visiting some friends and family in Pittsburgh and they happened to be on the way to something we were doing.  It's a hole in the wall kind of facade but they do have a good selection.  I don't remember the price being that expensive but looking at the average review so far...it shows $$$$.  I'm sure they have some nice stuff, but we just got a case of beer (I think one of those Magic Hat variety packs) and it seemed similar to what we would pay in the other stores.  Anyway, we had a good experience with this place and don't really have anything bad to say about them.", "business_id": "s74Tq6WKV1b91UFRr7ch7g", "stars": 4, "date": "2014-02-22", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "a5JhPLbRxz4MLU0jDC77-w", "review_id": "IoIE3L2ldECvvdc1qDo1QA", "text": "Had a fair bit of work done to my car after a winter's worth of ice landed on the hood.  Excellent work, not the fastest but the end result was impeccable.", "business_id": "5UxCrCoS02vFlSKH0pZ-fg", "stars": 5, "date": "2011-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "6QhWTugzBJ3cdv2N4WZcSA", "review_id": "pjFNhIS_EKDyQgvdQXRkHg", "text": "Our cat recently came down with some health issues that we could not afford to address. He was in pain and we decided the humane thing was to put him to sleep. We went to the ARL and asked the receptionist there if we had any other options available to us. \"Well basically the only thing you can do is sign him over for euthanasia\" she said in the most uncaring, apathetic voice possible. We were heartbroken of course. \"Go wait by that door and someone will meet you.\" After a few minutes another woman came out and took the carrier. \"I'll bring your carrier back out in a minute.\" We said no, that's okay, keep the carrier. She said okay and took our cat to the back. And that was it. No kind words, no sympathetic gestures, no \"Would you like a moment before I take him?\" No \"I'm sorry.\" Nothing. For us this was one of the worst days of our lives but nobody at the ARL seemed to care, or at least have been trained to pretend to care, one bit. \n\nThey get a couple stars for offering a necessary service. But other than that, this place will only be associated with making a terrible day that much worse with their lack of caring or empathy.", "business_id": "VkFDer80GOrelWALdgNReg", "stars": 2, "date": "2013-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M-WLwxnBhYPaBUx7SyBUTg", "review_id": "Ty3C3ZssWSbGV7b9p7XYDw", "text": "The environment is just what you would hope for in a coffee shop: tastefully decorated with some local art in an old building with a cool ceiling and floor. A great place to enjoy a beverage, book, and music.\n\nI had an Italian Cappuccino. It was well balanced and I enjoyed every sip. On my way out I had a Costa Rican pour over that took me by surprise. It was incredibly smooth with a complex flavor. It rolled off my tongue without the thin taste of a poorly roasted bean. As the drink cooled the flavor profile changed but continued to please.\n\nI highly recommend this shop if you are looking for a place to spend a few hours and enjoy everything from speaking with competent baristas to the last sip of your drink. I will be returning.", "business_id": "83_p9vIqOq1TUIf3_GD7bA", "stars": 5, "date": "2011-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bEyGMTOF8gcAwjNz_qXv-w", "review_id": "MO7j4RZkRXvOQLlzDJ3ToQ", "text": "Wednesday is Wing night, i.e., eat your face off night. For ~ $9 you can eat unlimited wings (with your choice of various sauces) for several hours. If you can, top it off with a brownie - they're quite good.\n\nI've mostly had the wings at Blues & I like all of the sauces, but the burgers are good, as well. Whatever you do, make sure to get the sweet potato fries & tip your waitress! (Especially if her name is Meg).", "business_id": "Ts4xsKPU7FNPPZRj-nRjIg", "stars": 3, "date": "2010-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "B4PwGZYPETAHX-LOlHow0Q", "review_id": "uwGMHCYWvlb0JrLgG2JoIw", "text": "I have furnished 90 percent of my home with Arhaus items including a sectional sofa, chair and ottoman, accent tables, lamps, dining table and chairs, etc. \n\nThe upholstered items are very comfortable but the furniture finishes are somewhat problematic. I have tried a variety of different furniture cleaners and polishes and cannot restore the surface without smudging and streaking. \n\nThe sales staff members are very friendly and knowledgeable, I have dealt with 3 staff members over the past 5 years and have been pleased with their expertise and service.\n\nAll in all, I am a satisfied customer. I recommend this company if you are looking for contemporary furniture with a traditional flair.", "business_id": "Nnk1gNKSi_12ziNuK2llxA", "stars": 4, "date": "2011-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BZDv6ZW6uestHjDFe0JSCA", "review_id": "t8qNrcjT7gd85IVscJxj7A", "text": "Mr. Walter is great. Reasonable prices, he's honest and tells you like it is. As a first-time car owner, he's helped me out numerous times and been very kind and generous in the face of my total ignorance!", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2013-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DcI40NrXUgXvgag1_0P--g", "review_id": "NqyOHalbWIu7hkOjD792uw", "text": "I never write reviews... but just had to for this piece of work. I usually blow off overly negative reviews (read prior reviews about this place) assuming they are disgruntled customers looking to whine about something.\n\nWell this place has been completely incompetent getting my title transferred from out of state. Weekly calls over 3 months, and now my temporary registration has been expired for a week and they don't know when I'll have legal plates. They promise to call me back right away, and it takes a week. \n\nIt is just frustrating that these folks are this incapable of completing a simple job. Go somewhere else. Anywhere else.", "business_id": "-raHHPz6kBnQgBH-oCuDFA", "stars": 1, "date": "2015-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-7hRx1ypJfHxwssUrq99gQ", "review_id": "nOXLq5gKZQNQlhQcZcAfGw", "text": "Went here with my girlfriends last Saturday.  They were having a girls night event.  A small bar & desserts were included in the price.  It was $40 per person. We loved it!  We worked closely with a glass artist.  We didn't just watch, we were acutally doing it!  We made glass flowers, I can't wait to pick mine up!  (It takes a few days.)  I definitely recommend this as something different to do with friends or on a date! My one friend did a glass blowing event there & said that this was much more HANDS ON than the glass blowing was.", "business_id": "riqqVx-LssGUErBeQisKng", "stars": 5, "date": "2014-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "bvu13GyOUwhEjPum2xjiqQ", "review_id": "mqXqfbfI9AAclqtNUfk9Jg", "text": "Great selection of vegan, vegetarian, raw milk, prepared foods, bakery, cheeses and aged beef. Very expensive, trader Joe's and Market district come to mind as a cheaper alternative. Parking at this particular store is a nightmare.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 2, "date": "2011-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "yfH0ksVwjGmnYuJfUimBJQ", "review_id": "AF7soUC7o8b9w0lGskGQCA", "text": "I have taken my car here now for seven months (two cars really).  From routine maintainence to identifying a problem they have only shown me the best service.   They always present me with good and complete information and are honest and trustworthy.   The last time I was in they saw the problem right away and since it was a 30 second fix they didn't charge me.  \n\nI can't recommend these guys enough.  The best mechanic I have had experiences with in my adult life!", "business_id": "PaD_6AJMbLt84QU8T6ymow", "stars": 5, "date": "2012-02-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "QE6vmJ3_MiBZD2o6uN1ZAQ", "review_id": "Vovij7SfgUyj-wRvjgS7Eg", "text": "Amazing brunch! I'd never been to Casbah before until this past Sunday when we decided to check it out for their prix-fixe menu.\n\nFor $22, you get your choice of alcoholic brunch beverage, an appetizer and an entree. An incredible price for a serious amount of great food. They had many options on their fixed menu - something for everyone. From huge waffles and omelets to lamb dishes, fish and the usual brunch regulars such as eggs benedict too. The appetizers list was equally as large. \n\nI started with a bloody mary. Was a nice middle ground between heavy and light - and it had some kick to it. Very good. For an appetizer I got the cheese and fruit plate with french baguette slices. There was a soft brie-like goat cheese, a blue cheese and a mild dry sheeps milk cheese as well. All were wonderful. For my entree I went with the Salmon Eggs Benedict. It was perfect. The fruit on the side was fresh cut, and the home fries were crispy on the outside, soft on the inside.\n\nI tasted a couple of other things as well. Both the polenta and the mushroom soup on the appetizer list were great. Didn't try any of the other entrees, but everyone seemed pleased. The only complaint was from a friend that ordered the truffle omelet - and it was that he thought they went too heavy on truffle oil, drowning out the eggs. \n\nAlso, service was absolutely perfect. We had a tall waiter, forget his name, but he was one of the most professional servers I've ever had. The table was cleared and cleaned immediately...he was never pushy, always friendly, and had great suggestions. One of the best experiences I've had for restaurant service anywhere.\n\nFor brunch in Pittsburgh, this is my favorite so far. Not to be missed!\n\nNow I just need to make plans to go back for dinner.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 4, "date": "2009-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PyQue3uoOWODLoLULDOPsQ", "review_id": "csjexORn46pvPBmzhkuWyA", "text": "Went here for the brunch prix-fixe menu- such a good deal! Drink, appetizer, and main course all for $24. First, we got a pastry basket with mini-scones, croissants and biscuits. I told myself I would eat half of each to try everything, but they were too tasty to resist! For appetizer, I got the granola and berries and my friend got the creamy polenta. Both were great options! The granola did not taste like anything you get in a box- could definitely tell it was made in-house. The creamy polenta was so different and delicious- will get that next time I go back. Was pretty full by this point but that didn't stop me from completing my  main course! I got the Casbah Benedict with Smoked Salmon and my friend has the Tuscan Eggs. We both thoroughly enjoyed our meals and were stuffed by the end!", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 4, "date": "2012-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "Q3fFv_ft17OyV-NRF1iQxw", "review_id": "YVOk9ylo8bgaxwFbdNrouA", "text": "I recently realized that I had only given Casbah four stars after my first visit here for New Year's Eve 2012... What a terrible judgment call that was on my part. So I'm back to proclaim that over a year later - having dined here again in 2013 - with a year of dining experiences across the country -  I still regularly dream of this restaurant. Do I dare say it's my favorite restaurant? I'm not sure, but if it's not my favorite, it's certainly close.\n\nWe returned after NYE last year to celebrate my birthday in March, making sure to bring along the oh-so-coveted Big Burrito birthday coupon. I ordered the Orecchiette with Chicken, Cranberries, Goat Cheese & Sage Cream. Oh. My. Goodness. Don't order this if you're on a diet... but order this if you love delicious food and living life to the fullest. It was ridiculously creamy, and the cranberries packed the perfect fruity balance to the rich dish. My husband ordered the Double-Cut Pork Chop with Kale & Butternut Squash Risotto. While recently dining at a highly rated restaurant in NYC, he said, \"My double-cut pork chop at Casbah was better than this double-cut pork chop.\" That's when I knew that I needed to update my review of Casbah.\n\nFinally, my delicious birthday dinner ended with the Dark Chocolate-Raspberry Bread Pudding. I love ordering bread pudding at restaurants, and I think this is the best of them all. I would confidently enter this dessert in a bread pudding competition, knowing that I would be walking away with the blue ribbon.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 5, "date": "2014-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XFLn8hRmzikg2GGB5eRNug", "review_id": "o3UptxUpMQMzQg30GDo0Tg", "text": "I don't know of any place that comes to close to the quality of Mediterranean food offered at Casbah.  They have a daily menu that combines unique ingredients into a great blend.  My favorites on their menu are their spinach casareccia (which I customize with tuna steak instead of chicken) and their gnocchi (in that order).  They are open to customizing their menu so if you want half and half of each dish, they are happy to do that for you.  That is a huge plus for me.  They are safely my favorite Big Burrito restaurant", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 5, "date": "2015-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "cVoLtThi7TivfnHqdDWXzw", "review_id": "XQTtJkP1eGaXu6s80r1-0A", "text": "It's good when they are on, but they are so inconsistent you never know what you are going to get.  The coffee machine looks like it hasn't been cleaned in the last century which is off putting.  Generally, I wouldn't recommend it unless you are in the neighborhood and desperately hungry--you MIGHT catch a lucky break and be there on a good day.", "business_id": "PzG0XmAmtXFs6Fdnubf41g", "stars": 2, "date": "2008-02-01", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "pCXPY-BGs3iUB_BuY94eow", "review_id": "2Qeopr2FRoea5LYjReJBQw", "text": "Seriously. This place is PHENOMENAL. \nI've never gotten something I didn't like. I'm a vegan and my favorite thing about this place is that it's not what most people would typically think of as veg. food. It's comfort food at its best...big yummy burritos...scrambles...drool inducing drink selection. Its got a really cool vibe and the prices aren't bad. Only complaint (if any) is that several of the servers seem a little zonked out...like they don't really give a shit. But whatever, go there...NOW!", "business_id": "PzG0XmAmtXFs6Fdnubf41g", "stars": 5, "date": "2011-12-15", "type": "review"}
{"votes": {"funny": 4, "useful": 2, "cool": 1}, "user_id": "-Gdjho_gZhgTXkYmSPy0qw", "review_id": "tZrjvcYZxpY9565iLyC7qA", "text": "Ew. Okay, not the worst pizza ever, but it's pretty far down my list of pizzerias...and that's sad, considering I quite literally live across the street from it. This should be my go-to pizza destination but I'd rather pay a delivery charge than eat their pizza. The sauce is way too sweet (like, Papa Johns sweet) and there isn't enough cheese. There are too many decent pizza delivery places around to settle for this. The only thing I enjoy about Pizza Perfectta is that their sign hilariously claims, \"Excitingly flavored!\" Personally, I wasn't having an orgasm over my mediocre pizza. Maybe if they wouldn't have tempted me with such language I would be less pissed off at them. Two stars only because they let me borrow some paper cups when I moved into my apartment and hadn't unpacked my kitchen stuff yet. Without them I may have had to travel half a block north and grab some from a different restaurant. Thanks, Pizza Perfectta.\n\nOh, and here's a little Italian lesson for you: it's \"perfetta,\" not \"perfectta.\"", "business_id": "lHP5STO7aomlEQixH8m1aA", "stars": 2, "date": "2012-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FKxc9BUDj8pSohAkpttrxA", "review_id": "y88uY9JD9MPioa9ZANefVg", "text": "Really wide selection of products to choose from.\n\nI understand that organic, local stuff is a premium purchase over conventional foods, and there is a huge community for these types of things to support the local food scene...But damned if I'm going to pay $8 for a pound of strawberries when I can get them for sale at Kroger for $1. Everything is 2-4x more expensive than conventional groceries. I can understand paying a little more, but I can't do that kind of mark-up.", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 2, "date": "2015-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "FHofjlnlxqdvSSkQ6UkNZw", "review_id": "0AtpPhZzXvILaou-xzvpsg", "text": "I was home for the holidays and wanted to take some friends of mine climbing.  They've never belayed and don't have equipment so my hope was that we could go, I could test out of the belay class and we could top rope some easy climbs.\n\nDreams crushed.  Only people that are belay certified can even be in the top rope room.  I would've had to pay $5 to test out of the certification and even if my friends wanted to take a quick lesson on how to belay, its only at very specific times and you need to give advanced notice.\n\nSo we bouldered.  The walls are old, made of smooth plywood and though the walls are a good variety, you eventually end up right on top of one another.  You can only top out on one tiny section, everything else backs right up to another wall or and abyss.  With someone who isn't super comfortable down climbing or jumping from the top, I wasn't always super excited to fall when there wasn't a nice big cushion.  Those were only on the overhanging walls.\n\nThe place was super busy on a Sunday afternoon and group after group rolled in.  I understood why there were so many VB and VB+ routes (easier than V0's).\n\nSide note: cubbies are completely separate from the bouldering area and no food or drinks are allowed inside the bouldering area.  Therefore your water stays in your cubby, plan carefully.\n\nI expected better from Pittsburgh and heard that there is a new gym coming, so I'll be waiting for that one before I try to climb again in da burgh.", "business_id": "5V1K5DRpGrObijbtCuPbcg", "stars": 1, "date": "2014-12-08", "type": "review"}
{"votes": {"funny": 1, "useful": 6, "cool": 4}, "user_id": "nEYPahVwXGD2Pjvgkm7QqQ", "review_id": "4XUWjrMPj76MrQEq4F5O6w", "text": "This place is just lovely! When you walk in, it's inviting and cozy. You'd never know it was an old garage. Plus, it's BYOB, so that's always a perk. Let's add in super friendly service, and it's a wine, I mean win. \n\nI had high hopes, especially with how much I loved the ambiance. I love tomato bisque, so I was excited to dive into that for a first course, but it was very strangely thin. When you imagine bisque, you imagine heavy cream used, but I believe it was broth based. I just wasn't digging it. \n\nBut then our starter came out, a goat cheese-stuffed puff pastry, and it was divine! Things were looking up! It was a delicious mix of cheese, plus light and airy puff pastry that we gobbled up. \n\nMe and a friend split two main courses; the Butternut Squash Ravioli with Pumpkin Coulis and the lamb burger with fontina and caramelized onions. I love lamb and I love squash, so this was the perfect splitting combo. I was pretty bummed when the lamb burger, while good lamb, didn't give off a lot of flavor. Which was surprising considering it also had caramelized onions, which usually pack a flavorful punch. The butternut squash ravioli also didn't offer the flavors imagines. Mostly it was the sauce that seemed to fall flat with this dish. \n\nThere was a sweet ending my friends, this cute little mason jar filled with layers of fresh raspberries, cream and Portuguese cookies was an amazing finish. I only wish everything had been equally as amazing.\n\nI still feel like I'm not done with Cafe Zinho, so hopefully the next visit will be all wines, er wins!", "business_id": "l_Wey2YC6NvVUIH8vTygGg", "stars": 3, "date": "2015-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yEm1H_5yMwzoO7gbhv26Zg", "review_id": "AiBCCdBWZTGE4Fiab-AK_g", "text": "I'd rate this joint 10 million stars if I could. Best ice cream in PGH!!! They serve sundaes, milkshakes, and the old school cherry dip cones. Cool historic photos adorn the building in the back, showing how the intersection/ area looked about 100 years ago. I love Page Dairy Mart so much I want to marry it.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2013-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "3JCJYpQpNDC6lmA7JFFIbw", "review_id": "qJwRAuwkH17flL4omfaRQg", "text": "Let me start out by saying that we rarely look to dining out for Italian food. We have found that to find quality Italian worthy of spending $$ outside of our own home has been difficult to find in the Burg. Don't get me wrong, there are plenty of Italian restaurants out there, but none we would seek out for a special occasion, so to speak. We have always found the New York/New Jersey establishments more to our liking....until now.\n\nAlla Famiglia is nestled in a not so nice of a neighborhood in the Burg called Allentown. Although we were never worried, but I could see how some may feel it is out of place in it's location. There is valet parking, so need to worry about your car while dining. Now once you are inside, you will soon forget where you are.\n\nThe inside is very small and there are 3 floors where you may be seated for your meal. On this occassion, we were seated on the third floor. Way up, climbing 3 flights of stairs can work up an appetite. Once on the 3rd level however, you can enjoy some of the religious artwork and beautiful stainglass featured throughout the dining area. There were 5 tables of various sizes and the bonus was the private restroom located nearby, so you did not have to manage the steps again until you were finished with your meal. \n\nI would also like to mention that we were dining early and although the room was rather private at first, it became QUITE loud as the evening went on and other patrons were being seated. I also think the free flowing wine helped the noise levels as the night progressed. Needless to say, we had difficulty hearing one another towards the end of the meal.\n\nThere were 5 in our party and our server was very attentive throughout the night to make sure any requests or special customizations were welcomed and met. We started our meal with the complimentary bread, dipping oils, goat cheese spread and cheese medley brought to the table. We all agreed to share the famous 12 oz stuffed meatball which was enjoyed by everyone at the table. In fact, everyone was asking for more of the wonderful sauce to accompany thier bread.\n\nSeveral items are served family style and come with any of the entrees that are ordered. We were then delivered and very tasty salad tossed with a light vinegarette which included olives, nuts and cranberries. Gorgonzola was brought on the side if desired. Then the pasta with vodka sauce made it's arrival. Several mentioned that they would have just ordered this if they knew how delicious it was. And this was just the beginning....\n\nOn came the entrees, several veal dishes were ordered, as it is their signature item on the menu. Although there were also many specials offered that night, everyone seemed to gear towards the classics. I ordered the veal marsala, which was delish! It was certainly one of the best I have had. One member of our dining party ordered the special pork chop offered that was huge! Another entree ordered was the filet mignon topped with lump crab meat and gorgonzola cream sauce. It literally melted in your mouth! I decided this would definitely be ordered on my next visit. All the food was cooked perfectly to order and scrumptious!\n\nWe were all pretty full but decided to share the Burnt almond tiramisu stuffed with raspberry for dessert. It was divine! I swear I heard the angels in the nearby painting sing as we devoured it!\n\nAs others had mentioned, it is a bit pricey, but for special occassions it is a must do. I felt it was quite worth every penny of our bill which was $306 for the party of 5. (We did BYOB) We have dined at much more expensive establishments and left unimpressed, which was not the case at all here.\n\nThe only negative was the long walk down the steps through the many other diners after too much wine. It can be challenging! So, watch your step! But do make a visit, you won't be disappointed!", "business_id": "qUeBDN0D8SC93KeAHhiL-g", "stars": 5, "date": "2015-01-11", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "64GBbjUMe_n6Yhi7OH_H6Q", "review_id": "UiEmTegYfphGTvCN8FHajQ", "text": "Why did you guys close? You guys had the best pizza in and around Carrick. The other places don't compare. I would have bought the business off of you just so there would be a decent pizza place around. I know you have been closed for a few years. Make me an offer l will get this business back up and running!!!! :)", "business_id": "Ga0y-XHa4os_VvoHz21bfQ", "stars": 5, "date": "2015-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "41eMIfGx2cIbsWPzaE8ZLQ", "review_id": "fSCXfbIGRsPXMj-5cOKIFw", "text": "I must of been eating at another Max's in a pararell universe!\n\nFood was terriable, service was worse! Went and got Sushi!", "business_id": "IxQ1ATP_Wg_QujO9nywzcQ", "stars": 1, "date": "2010-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Wg8G0l8A7VMdEmP6PcNsIA", "review_id": "IT_bc48J0GyBXqBgF9Crlw", "text": "A tour of German restaurants in Pittsburgh is surprisingly brief, and it definitely has to contain a stop at Max's. I prefer this place to Penn Brewery. The food seems a little more authentic and I haven't had a bad meal here yet. LOVE the potato pancakes. Every schnitzel I've tried has been great too.", "business_id": "IxQ1ATP_Wg_QujO9nywzcQ", "stars": 4, "date": "2015-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5OduZ5IwaU0HVmSFRL4kSg", "review_id": "IcPFZlvXXJiscpRM_xyZ2w", "text": "ultimate dive bar", "business_id": "L6yf7W3uvCHdLrmLmPLJ8Q", "stars": 4, "date": "2011-12-05", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "FLxgiNF9rsiXR-zbEcWBRQ", "review_id": "Xhz45ULyageYY-EuhORJYw", "text": "the Carnegie museum of art has a rich history in the art world that most people would not even know or appreciate. the world renown international exhibitions are something worth making a trip to the museum for. this year's international was very solid in its curator's ability to bring lots of cool artists to the show and have a theme. these shows happen every 3 years as it takes them that long to plan a show of that caliber. the permanent collection is not bad considering it's Pittsburgh and not NYC. people are way to judgemental of cma's collection, don't forget you're in Pittsburgh and not a major metropolitan with millions of art folk. and the natural history museum that is connected is pretty awesome if you like dinosaurs, probably one of the best dinosaur displays I've seen in all my museum visit.", "business_id": "EEuGTah-oEssSl3o6pK-ZQ", "stars": 5, "date": "2009-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uaeRFopwclE8AaB8vWHoYQ", "review_id": "XwwSF7ZOHaapJ-ovgHo4MA", "text": "I am from out of town, and I have to say this place brings a lot of flavor and awesome hospitality. I love the creativity the chef's put into their  food for us to enjoy. This is definitely a good place for a romantic date or catching up with friends.", "business_id": "q_BKmbdlYfQJroJVHfYMUQ", "stars": 5, "date": "2012-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "11Ydte1VfE85UHK24d4QRQ", "review_id": "ll7lJcHxs0m1g6x9JLnSUw", "text": "Awful.  Worst grocery store I've ever been to.  To make it worse, they are supposed to open at 7.  At 7:10, I was told they were \"still getting ready to open\" and I should come back \"around 7:30\"", "business_id": "cZl7-Um4HiJWFgDVmMan2Q", "stars": 1, "date": "2013-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iCOPqpQ_mmQ3jaBP2Lz1bQ", "review_id": "iZpEFx1kAbkOxGZD2hPdyw", "text": "I have been to Atria locations around the city - but this was my first time at the Atria's location at PNC Park on the North Shore of Pittsburgh. My young professional group had an event there last night, so it was a good chance to check it out. Our event was held upstairs, and since we had a small group, they wouldn't guarantee the private room downstairs. It worked for the most part, but those of us that sat in the back had trouble hearing the speakers, and the lights were dim. The noise from the diners downstairs plus the house music carried through and at times it was very loud and hard to hear. I would say that it's a good place for a group dinner, but not for a speaking event. I can't comment on food/drink as I didn't have any. The atmosphere is nice BUT I wasn't too impressed with the layout of the whole place. Didn't see to have a good flow to it. Also, the bathrooms upstairs where our event was were out of order, so everyone had to go downstairs to use the restrooms.", "business_id": "Z101WZaISochG6g7tI2ZVw", "stars": 3, "date": "2011-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UDNzg_BLNaNkHCRU6YVkYA", "review_id": "PkOVD4gUf2F4o0f0QuFclQ", "text": "Ribs were so fresh and fool of smoke loved it. Sauce is home made got the mixed had just the rite bite to it.", "business_id": "Z0OGW8PysysRXE0dR7QxQQ", "stars": 4, "date": "2013-12-09", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "XE-LQ3vryarypXpt_lgX1w", "review_id": "27dkRBdYKGuveodXF2hDhQ", "text": "Despite maybe a not-stellar season in 2009, I finally got the chance to see these guys live at Heinz against the Ravens....and they won!  So. much. team. spirit.\n\nWhat I Love, and what made a strong first impression:\n-the terrible towel...everybody's got one\n-the steel curtain\n-6 superbowl championships\n-they beat out the seahawks and I'm glad they did...even though I live in Seattle", "business_id": "5GS5sBSscgcex0IFTDL9Bg", "stars": 5, "date": "2009-12-30", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "2Ndy3FQAndOopqTa9sBPlQ", "review_id": "IJrKJUbsm6JfNFsj_Lz_Rg", "text": "I've been going to Miller's since I was just a little tyke.  Unfortunately, over the years, this joint has gone downhill.  \n\nI think I really began to notice it when they put a big tv in the dining area.  Now you can imagine that you're home in front of your own tv while you dine.  Holy Hell.  It's a mess.  \n\nThe food isn't nearly as good as it once was.  The pierogi special is good if it's on the menu - they are Pierogi Plus pierogies.  The bread is Bread Work's bread, so that's good.  My favorite thing on the menu used to be the devonshire, but only the brave try it these days.  In the grand scheme of life, this place is a fine local blue collar restaurant, but compared to the days of old the food is just blah.\n\nps. The ladies who wait here are always and have always been the nicest of folk.", "business_id": "YUZVBdGmagwXV-yOhR-1GQ", "stars": 3, "date": "2013-12-30", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "0rapYZQ9bUJS90Ir-IUvSw", "review_id": "X8MURZPEziDM3lB0-9Bpew", "text": "The Huddle is like something out of my California-girl dreams, where something called yinzers talk about awesome blue collar things in weird accents and you watch hockey and drink beer.\n\nIt is so exotic! My husband, a Pittsburgh native, thinks of it as your classic neighborhood bar. But a place like this would be overrun with Hipsters in California and they'd charge 6 bux for a PBR. \n\nThey have free popcorn which is amazing. And their food looks pretty good, though I've never eaten here. Actually, once I had cheese fries and they were pretty tasty, huge plate for $4 I think it was. \n\nGreat bar! Very comforting!", "business_id": "wan0X-oHpLgGTPXqaICZCw", "stars": 5, "date": "2014-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5z6ZXMg3-XO3UmSxpZWBUA", "review_id": "aGfBELXP3wQoED_jaxO4hg", "text": "I stayed here on New Years Eve and I can't say that I had any significant problems although admittedly I was concerned given the previous reviews. I found my room to be clean, warm and comfortable, the front desk was friendly and efficient, and the price was far more reasonable than other larger hotels in the city. The issues I did have were that my quilt had some holes in it, the vending machine was sold out of most items, my remote for the tv was not functioning, and the continental breakfast was limited although granted it was free.\n\nWhile the aforementioned issues seem minor and did not necessarily detract from my stay, it is apparent that the staff does not pay enough attention to the details, which could be significant for families or those staying longer. \n\nBottom line is that while this hotel provides basic essentials at a low price and is conveniently located to the city, attention to details is very important and if the staff can improve on these it would then warrant a 4-star or maybe even a 5-star rating.", "business_id": "nvrXLcmknaYuiGRquWhwIQ", "stars": 3, "date": "2014-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "O8D8syvoblnAu_HStkm-lw", "review_id": "Wn3R-kqlEv56cXmX2s1ayQ", "text": "Love this place!\n\nEither you like it or you dont....theres no in between. The cheese is thrown on cold to a hot out-of-the-oven crust. Simplicity at its best. The dough and sauce are fresh made by hand daily (at least they were when I worked there). Ask for it baked if you want the cheese melted, but it can take 10 more minutes. You can also ask for \"No Sprinkles\". There is a lot of cheese per piece. All of the ingredients are thrown on cold. The green peppers and mushrooms are from a can. These are fresh cut: cheese, pepperoni, onions. Im sure I forgot some but theres a lot. No sausage. \n\nThe other foods are good. But dont waste your time. Just get the pizza. \n\nThey accept cash and credit cards.", "business_id": "93UCt9OgWYmypZCpXtUu8g", "stars": 5, "date": "2015-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HXhYt_M1nDOfFse0_QlLww", "review_id": "9YycERZVL2rNyRfXk3KVNw", "text": "Good local bar with lots of TVs, good draft selection, and better than average bar food. Definitely a step up from the Saloon.", "business_id": "5Udv4CASAXB2eH66TefWPQ", "stars": 5, "date": "2014-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "uT1Ls6QFjNX2mL3JjYQGpA", "review_id": "p6WAUpuBz7IzSkKdiv-lpg", "text": "For my group of friends, this is the ultimate post-5K run reward!\n\nHere are the rules (they are my rules, but you should adopt them for Dor-Stop success):\n1. Go only with 2-4 people (otherwise you are one of THOSE parties that will hold everything up and screw up the seating)\n2. Be prepared to wait.  If you do not wait, consider yourself the luckiest person alive.\n3. Order something savory (may I recommend the Breakfast Burrito or the Eggs Benedict?  Everything has a twist and a funny name, so you're going to spend some time actually reading the menu.  Get something special, don't just go with scrambled eggs and bacon - although I'm sure that's delicious too).\n4. Order specialty pancakes \"for the table\" (to share).  We haven't been able to get away from the drawing power of the pumpkin pancakes yet.  They are so thick, yet so fluffy at the same time!\n\nThe surprising news: they take credit cards (it gives off a \"cash only\" vibe).\n\nThe opportunity area: syrup that does not come in an old-fashioned squeeze bottle!  It takes me about 15 minutes to get the disgusting amount of syrup I want atop my fluffy pancakes.", "business_id": "2Igiyhi82R8_QaaPplRmCw", "stars": 4, "date": "2012-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m311Xp0w8kE7Chk3HLI8HA", "review_id": "0nfFJQm6xebbQ4XH_maJyA", "text": "I'd say a solid 3.5 stars. Been there only once, for brunch. Loved the German potato pancakes - worthy of 5 stars. But I'd give the Eggs Benedict only 2 stars. I'll be back to try more of the menu and get some more of those potato pancakes.", "business_id": "2Igiyhi82R8_QaaPplRmCw", "stars": 4, "date": "2014-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1h5T9mNgReCiykYCxvI55A", "review_id": "1VUCGPtH3MYmBBa1w4spkg", "text": "I had lunch here, and I was skeptical of the buffet at first. It turned out to be really tasty, though. Lots of variety, good spice level, and the staff kept an eye on it so that nothing sat too long. I'll definitely go back for dinner sometime.", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 4, "date": "2011-12-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "-kekTrjzO6cvYzsVxLrhOg", "review_id": "AGNgB1fdUIe5iqxMR8_CDQ", "text": "I would love to say that the service and food were wonderful, but that would be a complete lie. Beginning with the service, I would have expected to receive the type of service from a dive bar or college bar. The servers had no idea what they were doing and payed more attention to their cell phones than the actual customers. When we would randomly get our servers attention, she was rude and condescending. We waited 12 minutes to get refills and when she did pick our cups up she grabbed them from the inside, (her under nails were black by the way). As was said earlier, all the customers around our table were not being attended too because social hour was more important for the servers. The food wasn't too bad, but it wasn't anything great. I could compare it to any other bar food. After seeing the way the servers conducted themselves and how they treated their work environment it would not surprise me the kitchen was being treated the same. I have worked in restaurants and hospitality for close to 14 years, so i would think i would know how to conduct myself, my work environment and most importantly my customers. Giving 3 stars is generous.", "business_id": "qemCNgjeYGcFsRwxW9x4xw", "stars": 3, "date": "2014-01-10", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "N2ZErnVJQSW5hJwnQvHtSQ", "review_id": "IfvEb-kFeNlJqYQT6c60mQ", "text": "I love two things: beer, and hot dogs. \n\nI really love hot dogs.\n\nGross, I know right? My bf is a vegetarian and he won't come near me with hot dog breath. \n\nBut this place has veggie hot dogs too!!! \n\nNot to mention- the amazing amazing beer selection. Definitely one of the best I've seen in the Pittsburgh area. Coolers line the back wall and part of the perimeter of the store. If you get take out, it's a dollar off a bottle! Yayyy. \n\nThey also have a cooler that (I think) is constantly reserved for whatever seasonal beers are appropriate at the time. Mmmmmm.\n\nTry the Roethlisberger hot dog, it's got cole slaw and french fries on it.", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 5, "date": "2009-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ukb04UfxSSQJfE9R7BHD2Q", "review_id": "nb9LUen4Y6Lm4FA13wEIeQ", "text": "Amazing beer selection on tap as well as bottled. You can get beer to go warm or cold and do mix and match six packs. Also, they have tons of vegetarian options. Great for Veg bar food.", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 4, "date": "2012-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ZT9n5k6DaQEj2jteF3ws2g", "review_id": "GNttyytaa4KUqtigx0yifQ", "text": "This place is great.  Excellent beer selection.   The best fries in town, and dogs that will blow your mind.  If I'm leaving my neighborhood, it's likely to go to D's!", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 5, "date": "2014-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2uJyTh-unuoHMJng0dwlPw", "review_id": "6IHUQT_uLF9jyTR8hK_xGg", "text": "Love D's! I've tried about four of their hot dogs, some wings, their fries and pizza.  Everything is great! Despite it always being packed, I've managed to grab a table there without waiting (at least so far!) Service has always been quick and their beer selection can't be beat.  \n\nAre there cheaper places to get a beer in the Burgh? Absolutely. But if you are coming here lookin' for $2 cans of PBR, this isn't the place for you. Unfortunately it's just a bit out of the way for me to come in here just for a mixed six pack unless there's something really special that I'm looking for.", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 5, "date": "2015-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8fApIAMHn2MZJFUiCQto5Q", "review_id": "B3VfF3P1LMvI6Ms8fYI5xg", "text": "Just go here, and order a battleship. If Kris makes it, its even better!", "business_id": "DzOPHyrG2XuVqKEvHCnN7w", "stars": 5, "date": "2013-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2ULUgX09tOwCNNwbSHHotw", "review_id": "IUZRuEO2WwizPdzVhjt2EA", "text": "Never again. As a life long South Hills resident,  BeniHana used to be \"the place\" to go.  Birthdays, special occasions, date nights,etc...  \"used to\"  is the key statement here.  This place has gone so downhill, it's no where near the quality it once was.\nA wait even with a reservation, a wait for every single thing we needed or requested,\nOver priced sake (for basically a slightly larger than a shot glass size amount) , an up charge for fried rice,  lukewarm tea ( for the record, everyone is supposed to get tea with the meal and no one did, i had to ask for it),  a \"chef\" that responded \"I'm very tired\" when asked \"how are you this evening\" .  The \"chef\" did zero \"show\" while cooking the food very  very slowly. I repeat, ZERO  presentation, isn't that what half of the \"Benihana\" dinner is supposed to be?!   We ate our steak and chicken with what  remained of the zucchini/ onions and what remained of the rice that was presented way in advance of the meat.    This was by far one of the most disappointing dinners ever.   I give one star because the food still tasted good, but everything else was dismal.   Dirty, stained menus, dirty floor around us, a lackluster cook, a server who was slow and over priced cocktails. \nWe had a 7:30 pm reservation and left a little after 10:00 and not because we were having such a good time, it took 2 1/2 hours to complete this meal.  Unacceptable. \nI will never , ever go back here and I will tell everyone I know to spend their money elsewhere.", "business_id": "1vQLTKwmcmZXtNzfKEvMmA", "stars": 1, "date": "2015-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_e5drmTJBSV0yiFBrTimtg", "review_id": "lwbmaYE6qpn0NkZNjBhBkQ", "text": "I love love love Mad Mex. The one in University City Philly to be exact but when we moved here life was okay because Mad Mex is here too. We've been here a few times because of how close it is to home and each time there is something that just isn't quite right. The most recent time, which is why I'm writing this review, our food took over one hour to come. We repeatedly flagged down our waitress and she kept insisting that she was \"checking on it\" when finally the huz had it and we were about to let the manager have it and then walk out when the manager walked over and apologized for our order never being put in. They took care of the bill but still, left a really poor impression of terrible incompetence. Our waitress never apologized and acted as though nothing happened when she came back to see how everything was. Extremely disappointed with the service. \n\nI'm giving the 3 stars because of my love for Mad Mex and the big azz margaritas but the Greentree location really needs to step it up.", "business_id": "hhNlQWaKqGbMPoeZHoL-IQ", "stars": 3, "date": "2015-01-22", "type": "review"}
