{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1h5T9mNgReCiykYCxvI55A", "review_id": "1VUCGPtH3MYmBBa1w4spkg", "text": "I had lunch here, and I was skeptical of the buffet at first. It turned out to be really tasty, though. Lots of variety, good spice level, and the staff kept an eye on it so that nothing sat too long. I'll definitely go back for dinner sometime.", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 4, "date": "2011-12-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SDlLqXn4IEtMzNwt9sV98w", "review_id": "DLeKm31RwYf8mhJl5H50nA", "text": "NOTE :  They have moved further North along Banksville Road to the basement of the Days Inn (where Maharaja was for years and then, more recently, Billu's Grill(now closed, obviously.)\nIt's all of the renovations/new furnishings that Billu's put in (Maharaja was circa 1978-esque decor/furnishings.)\nI tried it, today .  Food was better , somehow than it ever was at the prior location .\nVery friendly/accomodating staff  .  More centrally-located, now .", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 4, "date": "2013-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "F5WW6egmmUrIWRI_ZNpbEA", "review_id": "h9acRBt0vu75EzGGhja1aw", "text": "Just to let everyone know, Namaste Indian Restaurant has moved (January 2013) from it's old location in the Banksville Plaza to 1150 Banksville Rd, adjacent to The Days Inn. I've notified Yelp.", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 4, "date": "2013-01-12", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "1zJL9PogiFyd_NhGcbgs7Q", "review_id": "UcF7UUMH_JqMbOncgxDs1w", "text": "I had dined at Namaste a couple of times at its old location.  The new spot, in the otherwise depressing Days Inn, is a breath of fresh air.  I have already dined there three times since the January 1, 2013 opening.  One walks into another world when entering this restaurant from the hotel.  It is modern, clean, attractive, spacious, and comfortable.  The food is delicious and selection of items is satisfactory, though I wish there was more broccoli and cauliflower, and breaded vegetables, all of which are offered at other area restaurants. Breaded cauliflower would be wonderful. The price is extraordinary for the quality and quantity, $6.99 for lunch, $8.99 for dinner, the lowest in the region.  Worthy of special mention is the carrot pudding offered sometimes: delicious. \n\nI hope the place will survive.  It has not been anything close to busy or filled on any of my visits, the same as was the case at the former location. The individuals that serve and manage the restaurant are generally not friendly, something which I do not understand.  I am pleasant; I walk into a restaurant with a smile and treat the staff with respect.  I tip well.  To be treated with disdain is a mystery to me.", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 4, "date": "2013-01-20", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "JziueBVOg4SDJegN9sBmuA", "review_id": "RM-6jh5SU151jZOxoyzyWQ", "text": "Great indian food. Buffet is excellent and reasonable price. Friendly staff. LOve it. Thanks Namaste...", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 5, "date": "2013-02-03", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "-c9vriPwIK7quRUwxFdAzw", "review_id": "buRHrvmgOnShUWXzZNa90g", "text": "I was very excited to try this place since the closure of Maharaja left us without a good Indian buffet on the side of Pittsburgh where I live, and I wasn't crazy about the restaurant that moved in afterward.  The place was relatively deserted on a Saturday afternoon and we were soon greeted by a woman who asked us what kind of naan we wanted (onion or plain).  The food tasted fairly good but what really turned us off was the woman who worked there and her constant coughing, hacking and wheezing without even covering her mouth!  Clearly she had a nasty cold and should've stayed home that day!  I cringed every time she went back into the kitchen (we could here her back there hacking up a lung) or came over to our table.  It was so unappetizing that we hardly ate anything and got out of there as soon as possible.  I don't think I can go back there given their low standard of hygiene.  Ick, I'm cringing right now thinking of it.  On the plus side though, it did keep me from overeating.  Maybe I should have my husband cough and hack at me whenever we go to buffets from now on!\n\nAnyway, I hate to trash a restaurant but I had to voice my concerns.  I am very conflicted about giving the second star, but the food itself wasn't bad.  Try at your own risk!", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 2, "date": "2013-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "53ZnAllrduser8WVer201A", "review_id": "2_BGFErq_f-R4MixjhQG-A", "text": "I have sampled pretty much every Indian eatery in the Pittsburgh area, and hands down, this is as close to an authentic Indian meal that I have found. The price is reasonable and the food is consistently tasty. The buffet typically has a wide variety of items to choose from and includes mango lasse and hot chai tea. It's not a typical setting for such a culinary find, but don't let that keep you from trying their fantastic cuisine.", "business_id": "8tBfgYCI6Fz9xrSYCYCYXA", "stars": 5, "date": "2010-02-04", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "_S8zEPxR0DRxIJ6YjoObfA", "review_id": "nKcbsRGO-BdHZEUwv8Tbvg", "text": "Agree with chaitiyana. This place is pretty bad. The food isn't fresh. They have a Buffet even for dinner. I stayed at Days Inn for 2wks here and was forced to eat here a few times. The mango lassi was good, the naans (when fresh) were good, but mostly it all stunk.", "business_id": "8tBfgYCI6Fz9xrSYCYCYXA", "stars": 2, "date": "2010-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UzqOYLCssQS2FBcDq5HwkA", "review_id": "UvCWn51OxyxehEAeeRwclA", "text": "I usually come for the lunch buffet which I think is a good deal.  Love the chai - make sure you get some!  I get the chicken vindaloo which isn't bad and most of my friends love the chicken mango, which isn't bad either.  :)  Definitely worth trying.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 4, "date": "2008-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Q6PGJ1UylVz9bby8wQqEPg", "review_id": "x_hY_RI0Tx6-USvX8LCfuA", "text": "I have only had the lunch buffet, which really isn't fair to write a review off of.  While cheap and I would consider a good deal, it was overall greasy and bland.\n\nOnce I go back and order something off the menu I will have to re-review.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 2, "date": "2009-02-07", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "OPHNYPp5UvGmmixIfFTVnA", "review_id": "2P2J37mTNnvhv-OO837mQQ", "text": "Best palak paneer. Hands down.did a palak paneer test a few years agos.. included graphs and etc... still have my heart. the spicey could be spicier.. ill just throw that out there....", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 5, "date": "2011-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MzyUCQD3CtIQ0ifkYKl8iQ", "review_id": "UMcssUtKEtoVveUM1Uzm3A", "text": "The food is alright, but for the buffet price I will eat alright food over and over.  The lunch buffet is full of great food, with hot milky chai and multiple chutneys included.  The restaurant isn't clean, sometimes they take awhile to refill the steam trays, and it's kind of loud.  But it's cheap and decent.  Best way to fill yourself up on a cold day on the east end.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 4, "date": "2011-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "4cW3iQW6JD1C8VxYP0eyXg", "review_id": "Im-6uy52GBgy7Nat7VV5xg", "text": "I don't care for the lunch buffet because of its limited options (mostly potatoes and beans for vegetarians, sometimes some previously frozen veggie medleys) and lack of spice (for understandable reasons), but for dinner, especially take out, I give Peoples 4 stars. \n\nI usually get either Baingan Bartha or Aloo Gobi, as well as a dal and a plain naan. The dals are confusing because there are three on the menu and they only really have two. I've tried to stop letting that perplex me, but I can never remember the one they don't have and often try to order it. Maybe my take out menu is outdated in that I should cross that one out. Ok, now on to important stuff...I order a spice level of 10 out of 10. The results are dynamite! Instead of using some cheap sauce or hot oil, I can see and taste that they use fresh chillies for added spice. They also use a ton of cilantro and delicious almost caramelized onions in the flavoring of the dishes. Each bite is a mouth explosion. And I love mouth explosions! \n\nThis restaurant has it's shortcomings, but since it's the only place in town that has satisfied the lust of my taste buds for hot oral pleasure, I am a big fan.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 4, "date": "2011-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p1dOksOeJa2PgZ5RSPNdcw", "review_id": "JKIYgYjx6HM8f-Vbt4wO5g", "text": "I've ordered for delivery a few times.  Although you get small portions for the price..the food is pretty good.  This time I and a coworker ordered 2 seperate dishes that came with rice.  They combined the rice in one container.  Why?  My coworker leaves in 10 mins with my rice....ugh!  Called the restaurant and all I get is a ...\"wellll..I don't know what I can do?\"   Are you serious?", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 2, "date": "2012-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mD_--IBjQHzeUzDbZ0CnjQ", "review_id": "3k6-k7Wd8Mm_OPsOdMNA-w", "text": "Went here for dinner twice in 1 week when I was craving Indian food. The food is pretty good compared to other Indian restaurants in Pittsburgh. Also, it's BYOB with no corkage charge. The service is also great. Just took off one star for the naan- it was a little burnt each time I came here.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 4, "date": "2014-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KOrggEZ4aa7JzVIuY-Zgkw", "review_id": "NebvBiIF194KI0iEaPHERw", "text": "I have been a few times for the lunch buffet and for 9$ it was rather good. It has your Indian basics. They use chicken and lots of veggies to keep the price down but it's still very good. I also like the small dessert bar they set up. I say if you looking for a filling on the heathy side lunch this is a good place to go.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 4, "date": "2014-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EJlDpBbUZCbj9lHKxDHrOQ", "review_id": "PvGlxMc9a-NwNnYF7wdbag", "text": "We ordered a delivery of food for seven people on new years eve. Ordering online through yelp was fun and easy. Our food was delivered with surprising speed, and we tipped the driver handsomely. The food was all there and even a little extra naan was thrown in! I think we might have been missing some rice but the extra naan made up for it. The food was very very good. Everyone agreed that the spice levels were accurate, and thoroughly enjoyed their meals. It was an excellent experience and I would highly recommend this restaurant to anyone who loves great food and good service!", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 5, "date": "2015-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "V601cA1jLqTHKNmj-8DxPA", "review_id": "JOKe565qjhpvnKTz8g0PiQ", "text": "You don't want to identify the familiar taste of your chicken tikka masala to be Campbell's tomato soup... But tell me if it isn't reminiscent?!\nI ordered our go-to chicken tikka masala and saag paneer most recently. Again, I was disappointed by the meat dish. And my saag wasn't much better. It was pretty lacking in the flavor department too... \nFrom past experience, I'd say the vegetarian dishes are  better bets at People's vs meat.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 3, "date": "2015-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hRCWkTaCs2lEWiRKH-T4IA", "review_id": "6T1GzefNuJGxE4MGZfljaA", "text": "So I had never heard of this place before a friend suggested that we dine there.  But I'm so glad that I went because the food was delicious!  On top of that, the staff was really nice.  Definitely recommend!", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 4, "date": "2015-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3h6FcRjVC5KA_o2DGO9gWQ", "review_id": "-KSRdgvptfaQ97hOTHh8gQ", "text": "I love People's. It is one of the best indian restaurants in pittsburgh. Always a solid meal, quick and delicious takeout.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 5, "date": "2015-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "UzqOYLCssQS2FBcDq5HwkA", "review_id": "8WC1ouBq_H55Tq6NjJwi8g", "text": "I like this restaurant for a few reasons.  Certainly not for the restaurant itself which is not really inviting and definitely most customers take-out or order through mealsdelivered.net.  What is good is their vegetarian selection, and, more importantly, that vegans can actually eat here with good selections.  \n\nI am not vegan though, so I actually order a few things.  I really like their Kabli Nan which is nan with golden raisins and almonds in it.  Totally delicious and like a dessert.  I usually get the paratha (whole wheat, it's better for you!) and chicken vindaloo, which isn't the best I've had - that is reserved for a place in Maryland - but is ok and certainly good value for the amount you pay.  This time around, I also tried the Mango lassi (yum!) and the Kheer (um, don't order that here, there was a weird taste to it).  \n\nOverall, the amount of food you get is great for what you pay.  And in general, the food is tasty and spiced decently.  I ordered an 8 in terms of spice and probably really got a 6, but then again, I wasn't there to tell them to make it a REAL 8.  :)  I would definitely order from here again.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2008-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LhgQq1x4n9ardg1PFo8vgg", "review_id": "AHMm7qKP4zVIiISEi3tCyQ", "text": "Tried the vegetarian thali ($12ish) and was really impressed by the quality, variety, and spiciness to order.  Will head back here with a smile.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2008-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q88CP93-o66z1c97fKLknQ", "review_id": "87FgN8wje3z9SIt_qjHAyg", "text": "I can mainly attest to the ability of this place to provide semi-off the shelf catering solutions.  We host a party annually for Diwali, and usually have Naan and Chicken Tikka ordered from this place as appetizers and bread (we make the other stuff ourselves for the party--its part of the fun).  The Chicken Tikka and Naan are delicious and the service is great.  Regardless of who picks up the food, the owners usually invite the picker upper to enjoy some tea with them.  The people who run this place are lovely (the past few years have been tough with the demolition of St. Francis Hospital in front of them and the construction of a new Children's Hospital they have lost virtually all of their lunch traffic--construction workers not being the usual target market for Indian food joints.  Now that Children's is coming back on line, I expect them to reap the benefit.  This is a great place with very nice people running the place.  \n\nAs far as decor etc.  Do not expect too much.  Upscale Indian is still restricted to a few cities like New York, DC, Chicago, and San Francisco in the US.  My personal experience with upscale Indian is that you will in fact get delicate flavors, fusion and some interesting dishes...but in my mom's words, you will also get \"Indian food for the faint of heart.\"", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2009-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Zr1mOOpqhxLkvFKWV5y5yg", "review_id": "K4lcEZ7i3E7pSDWXXJyItw", "text": "Great sauces, wonderful meats!!  The meat is always tender.  The prices are a little below average, which is nice.  I never get the buffet so nothing to say on that.  The nan was perfectly cooked.  The only problem is that they don't deliver.  Great!!  One of my favorite Indian places in Pittsburgh!", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2011-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "7PDm_RG8tTTKrauImGbPuQ", "review_id": "146ZZRH9JWDK0BksrUl_uA", "text": "I don't have a ton of experience with Indian cuisine, but I loved everything served here. The outside is a bit unassuming, every time I go by their curtains are drawn so it's hard to get a feel for the business. However, once you come inside you'll find that it's warm and inviting.\n\nThe food is amazing and aromatic, how I think Indian food should be. I opted for their lamb tandoori, intentionally deviated from the too familiar curry. It came out on a sizzling cast-iron skillet and was full of flavor. The vegetables were nice and crunchy and the lamb had a bright red color that looked beautiful.\n\nThe service was impeccable and attentive. I especially loved the breath freshener at the end of a meal; your bill comes with a whole handful of fennel, annis and huge salt crystals to freshen your breath. It's a little touch but a great way to seal the deal on an already great experience.\n\nCheck out my full review: http://eatinginpittsburgh.com/2010/08/30/unassuming-indian-a-taste-of-india/", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2011-02-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "b0voExNtICTRdRPzub1T8Q", "review_id": "Y_S4pFIIDcu3p79Ovkpg1A", "text": "Compared to other ethnic eats in Pittsburgh, Taste of India, frankly, doesn't fare too well.  Don't get me wrong: the food is good, the service is great, and if you're already in the Bloomfield area, it's a fine choice for dinner.  But, there are a few unfortunate and glaring errors that prevent Taste of India from being much more than an average-level restaurant.\n\nFirst and foremost, I've tried just about everything I can imagine, and I can't seem to get Taste of India to actually serve me *spicy* food.  I'm a huge fan of vindaloo, which is often the spiciest item on an Indian menu (at least in the United States), but at Taste of India, it's about as spicy as a can of Chef Boyardee Ravioli.  I've tried asking for a spicy level of 11 on a scale of one to ten.  I've tried asking for \"traditional Indian\" heat.  No dice.  Chef Boyardee Vindaloo, every time.\n\nAnother problem is the take-out ordering process.  My wife and I have ordered take-out a couple times recently, and each time, we placed two orders for naan and only received one.  Since we live in Point Breeze, going back to the restaurant for $3 worth of naan isn't worth the effort, but really, we should have just received the naan in the first place.\n\nGiven these issues, why do we keep going back to Taste of India?  Simple: the biryani and korma are the best dishes this side of Stanwix Street.  And, that's saying quite a lot... or at least enough to keep this review at three stars instead of two.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 3, "date": "2012-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 2}, "user_id": "RsaEvod4EOBYIdbRBBv0sw", "review_id": "nDHg2S3YC0Hn0tiKPomJzw", "text": "Jordan & I have been eating Taste of India at CMU for a while, without knowing it was Taste of India.  At CMU they offer super inexpensive lunches that are more filling than anywhere else to eat at lunch. During this winter break, we have been going through some serious withdraw while the cafe is closed.\n\nThank you YELPERS once again, in our search to satiate our curry addiction, we have found our distributor!  We were excited to read that this restaurant supplied our weekly lunches and we ordered!!\n\nI ordered the Alu Matar Mushroom at a spicy rating of 3 (yes, I'm a sissy), but it was EXACTLY what I wanted!!  Jordan ordered Alu Gobhi which was cauliflower & potato at a spicy rating of 5.  We truly weren't sure how to scale our tolerance; but we decided that next time we could both go hotter.\n\nWe also can't wait to try the Lunch Buffet! We really wish we would have known that this existed during the week in between Christmas & New Years when we were fiending for Indian food.  Now that we know, I have no doubt we will soon become regulars.\n\nWe have also tried Tamarind in Oakland, but that place just made my mouth go numb after it was all said and done (and left me with an unpleasant digestion experience).  All of the bad cliche things you hear about Indian food, is nothing like Taste of India.  You can taste the love cooked in.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2012-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K4jqIExCG_7bl9EA4i89og", "review_id": "5t16V156yIAxvrewZRPO4w", "text": "I tried to eat here tonight using a $25 gift certificate purchased from Restaurant.com.  After waiting over 15 minutes for my server to stop by for my order, I showed her my gift certificate.  She told me they stopped taking them, however I had just purchased it 15 minutes earlier.  \n\nI spoke to the manager and he wasn't the least bit interested.  He told me Restaurant.com was a scam (I have used it before with no problems) and he hasn't been able to get in touch with them to cancel.  While I was still talking to him, he answered a call on his cell phone without even saying excuse me.  He obviously didn't care at all.\n\nI called Restaurant.com for a refund, and told them what he said.  They told me that they have actually been trying to get in touch with the restaurant for weeks.  I can only assume he owes them money or something.  Either way, it is outrageous that he will not honor a gift certificate for a program he agreed to sign up for.\n\nBeyond this problem, I can't recommend this place simply based on how awfully they dealt with this issue.  I didn't get a chance to try any food and I never will.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 1, "date": "2012-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8B3cZuwCeeIBhNXVgdRRLA", "review_id": "LgFtJUmX4y11NyQYsM8zMg", "text": "This place is terrible. Pittsburgh does not know how to make any food correct, let alone the complexity of Indian cuisine.  This city is the dumpster of the eastern U.S.  Do not go here, do not ever go to Pittsburgh.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 1, "date": "2012-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0EEz2LY6JkWq63hzbCk3CQ", "review_id": "C9aw1et99yRvrHdaQdqaWw", "text": "This was my first time at taste of India. The service was very pleasant and I found the food and alcoholic beverages to be quite inexpensive. Most importantly, the food was fantastic. The flavors were well balanced and succulent. I will definitely be coming around more often.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2013-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z4PkzgCCNJFxlybpkbCSHg", "review_id": "BVFmWBJezG0fLyQKb6d_2Q", "text": "2.0/5 - tikka masala: great sauce, dry chicken (end of lunch buffet)\n3.0/5 - curry chicken\n\nGood service, brought out fresh naan near the end of lunch.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2013-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xJUhGGSwV_JXiagTEeuW_w", "review_id": "_mBo9pFmYJ2wu-uWeDHfiQ", "text": "The best Indian restaurant in Pittsburgh, or at least up there with the top few. \n\nService is friendly, the place is nice, and the food is fantastic. The Samosa is a real treat. The Tandoori chicken is amazing. \n\nNever a let down at Taste of India. Solid. Consistent. Great", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2014-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "yKR3NC978w62K2AKtoJi9A", "review_id": "emY4zyT8cjF0XW7Rrgjt_g", "text": "I've drive by, seen the neon sign and the dark windows and have been very skeptical. But I finally went inside and it was delicious! Clean, yummy, and the BYOB!", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2015-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "KOrggEZ4aa7JzVIuY-Zgkw", "review_id": "FZi7398aJPvheCt27Ct6RA", "text": "I got with the tandoori dinner. 18$ for a full meal from appetizer to a nice small desert. Level 7 of spice, it was spicy but if you enjoy extra spicy kick it to a 10. The tandoori dinner was perfect size including the lamb saag I got as my 2nd meat pick. I also got king fisher Indian beer. A Good lager. It was a cold Monday night so I ended up eating my meal and chatting with the guy working the front of the house. It was rather nice since I went alone.\n\nIn the end good service and a relaxing meal with a nice hot cup of tea at the end.\n\nIt was all very good but I have had better lamb saag in the past.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2015-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HfNQMePBC_vs601C2zFJGg", "review_id": "8EeH5uSAH0FR1nVFea4HZw", "text": "We have been ordering take out for years from Maharani. They food is good and they always have it ready with the order correct. We go for convenience but also for quality food.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 4, "date": "2009-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nMWL0d6ksboOM7WUNGTsSg", "review_id": "mTbdvSiGpuK3M7HU-ZLYqQ", "text": "it was ok, the actual food was pretty good. the naan was nice, the seasoning on both of our dishes was very savory, however be warned medium is very very mild, that was our fault not there's.  My problem laid with the service and staff, the ambiance and the loud music.  The staff was grumpy the music was loud bollywood which i think was only on for the staff and yah, i just dont know.  I think as a takeout it would be ok.   it is probably actually a 2.5 but more of a two reaching for a three than a three sliding.    food itself was probably a 3.5", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 2, "date": "2010-01-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "QPfqTIqOVPLCXM_ZtxyQ1w", "review_id": "osfsoU8YI7pHC_OhjhLYDQ", "text": "I travel to CLT fairly regular on business. Went here with some co-workers and was disapponted. Waitstaff was not helpful with the menu. The food was mediocre at best. Had the paneer appetizer and it tasted like they were trying to make a McNugget with cheese. Sauces were tasty but now I wonder if they came from a can. If you really want great Indian food... Go to Copper. If you want McIndian go for it.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 2, "date": "2010-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "STYNw0vKfJCvBkM8tUoMxQ", "review_id": "e7VhScc53YsauDoWdI4TBw", "text": "Just got back from having their lunch buffet, it was extremely good with a large selection of choices.  I would definitely eat their again.  Also had very good Service.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 4, "date": "2010-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FkLEAgKs9dl3lw8QJVtVSQ", "review_id": "6c_mEBaEeZppQEWpU8K9kQ", "text": "This establishment was friendly, clean and easy to find.  When you are visiting from out of town, that is really all you can ask for! \n\nI liked their menu selection and their prices were fair.  \n\nI also found it interesting that they had some Chinese food options.  \n\nI would recommend this place to anyone who wants a nice, relaxed atmosphere to enjoy dinner at.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 4, "date": "2011-01-19", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "fzu9zwLQJBW8RqoqADOXiw", "review_id": "JU4_ICcjrt9vhTTwy-SpDA", "text": "Had the Sunday lunch buffet recently and I guess I'm just not used the style of service.  The food was pretty good though  I don't know the names of the dishes, but suffice to say, everything was coated in a spices and moderately spicy.  Perfect for the American palate, I guess.  The butter chicken was top notch, the curries decent, and the basmati rice was a little dry, but tasty nonetheless.  The buffet food could have been a little hotter.\n\nThe service was quite creepy and brings the rating from 4 to 3 stars.  I had several servers passing by my table repeatedly with the hands folded and scanning the room with their eyes.  When I asked for a water refill, they seemed quite aloof.  Is this normal?  They did, however, refresh the basket of naan quite frequently.  Who can diss hot bread?  For a hearty $11 lunch buffet, I might return if invited by a friend.  As a novice of Indian food, I'm intrigued by what I ate and yet something tells me that there's more to be desired.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 3, "date": "2011-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "R6lRupz_Jo51n8WJGJYdOQ", "review_id": "O7-xUKHJb6ZVxga7_pElUA", "text": "Weekday lunch and what a bunch, of options that is. I am quite fond of indian food and eat it quite often, but don't ask me to name any dishes. \n\nThe spinach thing was good, the potato cake thing was good, and the spicy pepper chicken was also good. Rice pudding and a jelly like mango dessert to top it all off. \n\nMy water was always filled and when you have lunch with great peers and aesthetically pleasing decor, you have another beautiful day.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 4, "date": "2011-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "naBs2Kg2KClrKcoRgFE2eA", "review_id": "agTLFuFq73yLHlVCPVqFTA", "text": "Maharani is a pretty solid 3-stars in my book.\n\nConsidering Woodlands Indian is my most favorite restaurant in the world, Maharani had a lot to live up to...\n\nCame here for the lunch buffet on a Friday, this place was packed!  Normally, I'd be put off by the masses, but this just meant the buffet items were frequently replenished with fresh ones. \n\n$9 for all you can eat Indian food is a great deal.  There were 4 vegetarian dishes (yay!!!) and 2-3 chicken dishes. There was also jasmine rice, naan, sauces, salad, and rice pudding.\n\nThe food was good, but not great. It was tasty, but nothing amazing. It just didn't seem to be prepared with love and tedious care like I'm accustomed to at Woodlands. The naan was good, but not fluffy and not melt in your mouth like I prefer. \n\nThe service was mixed. The hostess and one other staff were a little cold and off-putting.  But I had another staff who was so sweet and kind and accommodating (brought my friend and I an extra pitcher of water because we were wicked thirsty).\n\nFYI - There's a BOGO coupon in the Charlotte Citipass book, but it doesn't apply to the lunch buffet.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 3, "date": "2012-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "s7__rr6mcNK1CgUaaC60Zg", "review_id": "x-ZJ2kWGYEXW-eiRL5qstQ", "text": "It has been a long time since I have felt the need to \"Yelp\".  Eating here night before last has brought me back to Yelp....and not in a good way.\n\nThe best thing about our meal was my Diet Coke.\n\nThe wait staff had to be reminded several times of what we ordered.  The food was not to my liking at all.  Honestly and truly ...as I was eating I was reminded of the scene in National Lampoon's European Vacation when Clark and crew at the French restaurant near the Eiffel Tower.\n\nThe food tasted like it had been frozen and warmed up.  I have honestly had better RTE meals from Patel Brothers grocery store.  You know the type...the ones that come in the box for like 3 bucks....\n\nVery disappointed.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 1, "date": "2013-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ta9CG2JpINV1piWj-jj5AQ", "review_id": "0HK0HU_o-SrR8wJgRiOKzA", "text": "I eat Indian weekly and from all over NC and SC. I find Maharani to be the best in Charlotte. Their  buffet quality is outstanding. I have eaten here for years.  I have not been to Saffron, but the one in Greenville SC is my overall favorite.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 5, "date": "2013-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PoWkVAEQ2lqrCnrw7BUy_Q", "review_id": "E5I6XwxBzl_Uw_6U1HLCPw", "text": "The food tastes good but is extremely bland and so lacks the Indian experience. \n\nThe servers were not a friendly and approachable. However the service was quick.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 3, "date": "2014-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DVDqTiyhJ3jzN8YzqX-4Yw", "review_id": "JXen6d2Yir6lTihIWCsq-Q", "text": "Won't be back. I will preface my review by saying that I am a stickler for adequate customer service. That said, I have patronized this business at least 5 times with consistent experiences. The food is decent Indian food at a convenient location. The customer service however has been lacking each and every time. The straw that broke the camel's back for me was my entrance to the establishment today. As I approached the door, there was a server standing there who clearly saw me coming in. Instead of opening the door or at the very least, remaining to greet me, he turned and walked away. Once I entered there was no warm welcome (which I should not have expected given previous visits) but instead, I was rushed through to determine if I would stay for the buffet or if I was there to pick up takeout. I won't belabor the point, I will just reiterate that this was my last time spending money in a restaurant that does not appreciate my business. Their customer service is seriously lacking and the food is good at best but certainly nothing special.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 1, "date": "2014-12-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "dsEe-vY8UEYVQ1LpZCYT4w", "review_id": "bdIXZuUEyW-LXhww9RqoZg", "text": "The reviews seemed to be hit-or-miss, but I decided to take a leap and try it out. I hadn't tried any Indian restaurants in the Charlotte area, so I went ahead and ordered several take out dishes to try. It might be important to note I'd had a huge curry craving for months. Maharani, while it definitely hit the spot, was lacking in a few areas.\n\nI called in the order and then went to pick it up. It was very straightforward and simple. They had the food ready exactly when they said they would. The servers and cashier were very friendly and courteous.\n\nI tried the plain naan, chicken tikka masala, lamb vindaloo, and mutter paneer. I even found some papadum and mint sauce wrapped up in my bag, which was nice. For some reason, having the papadum feels nice and familiar. The naan was alright, but not as fluffy as I had hoped. It was crispier in a lot of places, and I think it just needs to be a bit thicker. The chicken in the tikka masal was very good and very moist (yes, I know a lot of people hate that word. It's a good word to use in this case!). The vindaloo was decent, except that the chunks of meat and potato were enormous. I was taught to eat Indian food by a Sri Lankan, which means I eat with my hands. I'm not used to having to pick up a giant wedge of potato and figuring out how to eat it cleanly. The mutter paneer was also alright, but the paneer was kind of tough and not soft like I'm used to. \n\nLike I said, it hit the spot, but I wouldn't order the vindaloo again, and I'm iffy on the paneer. Maybe it needs to be more fresh? I don't know how paneer works. The biggest issue was the salt level in the food. There was WAY. TOO. MUCH. SALT. If you are one of those people who loves to add salt, then this is all for you. I will give it another try, but only if they might agree to ease up on the salt... a lot.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 3, "date": "2014-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Xi2uUybau7YjJ4OWyiqAsA", "review_id": "_W4XebwUhU6HuysQr5uXzQ", "text": "Visiting Charlotte for the weekend and participated in the Tour de Food event which featured this restaurant. The restaurant was clean, quaint with nice ambience. The food was very good and since it was lunch time, they featured a buffet which allowed us to sample many of their items. The curry chicken and tandoori chicken were excellent and the other items were very good as well. If you're in the mood for good Indian cuisine, this place is definitely worth a visit.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 4, "date": "2015-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_tK1j8pneCQHQl0jQt0ubA", "review_id": "Yv9NtiWobev4N9esQ30jDA", "text": "Currently, Maharani has only 3 stars on YELP. I am here to change that.\n\n5 stars.\n\nShrimp Tandoori, the most tender Shrimp Tikka Masala and great vegetarian samosas; the best that I've had in Charlotte, NC.\n\nInexpensive, fresh, clean, rotating buffet for lunch that my husband was very impressed with.\n\nFriendly staff, well dressed, very attentive, and very reasonably priced. In a really pretty area of Charlotte too. I don't think you can beat Maharani for quality indian food.\n\nIf you like spicy food, their medium spice still tastes like a mild to no spice. I'd ask them to make it hot next time, instead of medium, that way you get some sort of burn.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 5, "date": "2015-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S50_9SlqLePZN1_fT7wlUQ", "review_id": "U85Te7LxSlm6Daj-msq79w", "text": "This business knows nothing about customer service!  I ordered tiki masala and the owner wanted to charge me 15.95 however the price listed on the website was 2.00 cheaper.  When I brought it to his attention he did not handle it in a professional manner!  Copper is waaaaay better anyway!", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 1, "date": "2015-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CJcSEl69EzGlcGbDG5Mazw", "review_id": "GhfEhmgkgJYUQXDA51o_HA", "text": "Pretty good indian food.  I've never gotten anything I didn't like here.  It's a little overpriced for what you get.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 3, "date": "2015-12-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "do-fO-EruYVP_FQPMNWmZg", "review_id": "SlZisnywT74qlq34H59g1w", "text": "This review is based only on three take out orders, as I have not dined in the restaurant or checked out their buffet.  I am a pretty simple Indian eater, Naan and Chicken Tikka Masala.  Their Garlic Naan is amazing. Always piping hot with just the right amount of garlic.  I even love the subtle burnt end sometimes. As for the chicken, it is good, but the spice level has varied ever time, and they have never asked how I would like it.  I have never been disappointed with the chicken, white chucks of tender white chicken served with rice. \n\nI hope to dine in soon, but not sure about hitting the buffet. Not sure I'll be venturous enough to try some of the items. We'll see though, as I love to give things a try.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 3, "date": "2015-12-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OH71gTLUc2BduDdY069Yog", "review_id": "LgqL-ChIaKjG0zmtZ4Rh-Q", "text": "The service is a highlight. But the rice tastes... plastic-y to me. The paneer is very bland compared to what I've had at other restaurants. It left me missing Bombay Cuisine and wanting to try the Turkish restaurant across the parking lot. The sauces were really tastey and they do a good job of adjusting the heat up or down according to tolerance. The garlic naan seemed really thick- which could've been a fluke because I don't remember it ever being like that before. I've been here about 5 times.  Nice atmosphere, nice service, tastey samosas (on the hot side!!!).\n\nHere's the deal- I would go here if that's where my friends wanted to go (which is what happened last week). But I would not choose to go otherwise when there are two other Indian restaurants that I enjoy so much more.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 3, "date": "2008-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6xaw3UycZrcAJLGYGT5xbw", "review_id": "fhwppGLdXTT2sVD2ctYyLA", "text": "Great consistent quality of food & service. The lunch buffet is perfect for begginers in the Indian food genre. Very clean & pleasant decor.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2009-12-13", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "--9jRaeY1xK-2l9r9fVQWA", "review_id": "qUOlnccIaM9pDxqhU09vJQ", "text": "I restaurant is great and i love their catering services.  If you need a half pan or pan of curry for a party, they have very reasonable prices.  The dishes are filled with paneer, meat, or veggies.  They do not skimp... great way to feed a crowd and keep your kitchen clean.\n\nThey also catered my wedding.  I really can't tell you how great they did, especially since they had to make the trip to Columbia, SC for the event. The Indian restaurants in my hometown leave something to be desired, so we went with a Charlotte caterer\n\nWe had a tasting at the restaurant, the owner drove down to the site to see the venue and attended the event to make sure everything went well.  The food was perfect, looked great and tasted even better, actually, it tasted even better than the tasting samples.  We were so impressed and everyone said they would be using his restaurant in the future.  \n\nAm I gushing?  \n\nWell, I guess I am, which is really rare for me... its just that through this whole wedding process, you find that it is rare when a company really lives up to their promises.  They did a great job, very professional.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 5, "date": "2010-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RrUmJrcZ66u3_P6wfor6lw", "review_id": "6QPlXjEAjIBuL822N6VODQ", "text": "My favorite Indian restaurant in Charlotte! The food and service are excellent.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 5, "date": "2011-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z_6-ZpOJ0XUlYtmyqk4NGA", "review_id": "XyMRUKkFNhyDI5K-_vc0Cg", "text": "2nd time we have been to this restaurant and it was great!  The service was good the food was great!  They will alter the food to how spicy you like it.  I would definitely recommend this place!", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 5, "date": "2012-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Q3it5vf7qJ5oJKStMo8Klg", "review_id": "YmmfrS6D22BELfuEzbf_EQ", "text": "I had buffet lunch here yesterday. I went after 2 p.m. There was no tandoori chicken and they did not refill it till 3 p.m. By that time I had already finished my lunch. The naan bread was like a rubber sheet. They never bothered to refill the bread basket. The food was below average. The chicken curry was passable. Chicken tikka masala was below average. They had aloo gobi with uncooked cauliflower, I guess the dish got empty and they tried to refill it by throwing some half sauteed cauliflowers. Biriyani was a joke. I have tried most of the Indian restaurants in Charlotte and  I would rate this as the second worst. The only thing they bothered to refill was water. I will never return to this place and I will not recommend it to any of my friends.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 1, "date": "2012-02-12", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "uBUGZtTxmaG-8YpUWpU5_Q", "review_id": "Fj7hv9QvuCb115YegX-MhA", "text": "Our choice and the choice of our son's family when we want Indian food in Charlotte.\n\nExcellent food covering all the Indian traditionals such as tandoori, curries, samosas and other appetizers, breads, etc.  Portions are reasonable, along with prices.  \n\nCarry out is very normal and it is packed to stay hot for over an hour.  Sometimes we have picked up an order and could not eat it until two hours later and it was reasonably warm enough to not require reheating.\n\nSome in our family are spice sissies, so we usually order medium heat, but they can melt your inlays and challenge your tongue's survival by ordering level 5 out of 5, or even higher.  Always try a lower level before you take on the masters of spice.\n\nYou might want to order extra rice if you like rice to sop up the wonderful sauces as much as we do.  Their naan bread is excellent, thick and doughy.  Naan, rice, sauces:  what more do you need to yum up your tum?\n\nThe dining area is comfortable, romantically lighted with booths and tables, serving the same menu as take-out.  We think this would be a good first date place as well as a family dining experience.\n\nThere is a buffet lunch, but we have only used the Bombay Grille for dinner so cannot comment on lunch.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2012-02-21", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "OyzjdoEb6xJcFNNjnpQVxw", "review_id": "quAP7KfOozC-_OPWZet6xw", "text": "This restaurant had been recommended to me many times and while my Aunt was visiting for the holidays we decided to try it. I will honestly say my experience with Indian food is fairly limited but I LOVED Bombay Grille!  We ordered the Samosas, garlic naan, chicken korma, and chicken vindaloo. I love spicy so we got level 4 on the korma and the waiter warned me the vindaloo was very hot. I have to admit the vindaloo was super hot lol... It was amazingly good but it did make my eyes water at first. The korma was a perfect 4 and was very good! As for the naan an samosas, I was in heaven both were awesome. The rice was okay (seemed a little under cooked) And that was my Only negative. We also ordered 2 masala chai teas and my aunt was impressed said it was the best she's had! All in all this was a fantastic experience, the staff was attentive and helpful and I will be back very soon to try more of their dishes and their lunch buffet!!", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2012-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "KjP3nMoWe4VPS_V8UWJjWg", "review_id": "H6oXwggSwBQlWqtU_2rbUA", "text": "Despite the atmosphere (not too inviting), and unfortunately the slow service, the food was actually good.  This appears pretty consistent as I read the reviews before trying it out with the family.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 3, "date": "2013-02-03", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "o09k5ZqH7KKqME6E_OZ4lA", "review_id": "MWiAcBTtaQX2PG-GVLtjlA", "text": "I was very pleasantly surprised.  I've traveled to India many times and make it a point to go to Indian restaurants when I travel to other cities in the US, so I've developed a bit of a taste for Indian food. I was not expecting much, I suppose due to its location and ubiquitous name, but the food was excellent (relative to other Charlotte Indian restaurants). \n\nWe got takeout on a Sunday night (another reason why my expectations were not super high) and once we got home, I could immediately tell we had potential. The chicken biryani was very good, perhaps not traditional, but its very hard to get good biryani in any restaurant around town and this was about as good as we've had so far.  The chicken tikka was also very good - not overly creamy and thick, but not too thin and with just the right taste - not all \"doctored\" up like some places like to do. Simple, yet right on point.\n\nAll in all, very good.  I'm rethinking my top Indian restaurants in town after this experience. Bombay Grille now goes towards the top. I gave it a 4 just because I tend to give my 5s to those rare places that I think were absolutely exceptional. I have not found a \"5\" among the Indian restaurants here in town yet.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2013-02-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8sqnv0Ik4G3wKcVxfQ83SQ", "review_id": "yJNzAPtSJw5zzvwe4gPhAg", "text": "After reading some of the reviews here on yelp, we wanted to give this a try. We went here for a lunch buffet on a weekday, had to wait few minutes while the table was made ready. Were somewhat disappointed (probably due to higher expectations). There were hardly any choice in the appetizer selection and very limited options for vegetarian palate. The saving grace was the naan which was continuously served at the table, fresh and warm. The overall experience seemed somewhat disappointing.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 2, "date": "2013-02-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "egulF33iKiEwgXZkesfkJQ", "review_id": "7yQ_OhMj-VXjaBGWZoU25g", "text": "Great food!! I highly recommend this place. It was so flavorful and really enjoyed their naan.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2013-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XcNQAQDh2_uiLEU1pou8cQ", "review_id": "T7K8VjW5t8MXqdmzziu6CA", "text": "The food was awesome the waiter could have been a little more attentive but all in all great visit.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2013-12-21", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "41vF3CSz0qikcZ0y8Uwssw", "review_id": "5lWnMZQ0tt0dUKe4wgSORw", "text": "Tried takeout yesterday. One of the worst Indian meals we have had in a long time.\n- Lamb Kabobs - undercooked and falling apart. They may have run out of time or maybe they had too many takeout orders. No excuse. A big F for this.\n- Chicken Makhni - C minus. tasted bland for what is supposed to be a very flavorful dish. Very small portion. \n- Saag Paneer - C+ The paneer tasted rubbery. Good flavor though.\n\nOne can understand, this is Charlotte and thus not a Indian food destination. But the miss on simple Kabobs clearly show a careless staff. Charlotte deserves better.\n\nIn my opinion, a waste of money.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 1, "date": "2014-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "uBUGZtTxmaG-8YpUWpU5_Q", "review_id": "aZSYm7bmBDcmGWOdBzYBfw", "text": "Am less thrilled with Bombay Grill than I have been over the last 7 years of take-out, dining in and buffet.  I give it a three, but my heart says that they deserve a two-star rating.\n\nBiggest reason is the cost.  For Indian food paying $8 - 10 for a simple curry is a lot and when you add additional rice, their portion for accompanying rice is skimpy, nan bread you are into a $20+ meal and then add a beverage, esp an Indian lager, you get a bill for a couple of nearly $60.\n\nOut take-out orders are at or over $100.  So we have cut down.\n\nThe lunch buffet is skimpy as well.  After the first rush of diners many of the courses offered are gone or near gone.  There is quite a wait and it takes a number of people asking for more to roust management and the kitchen to put it out.  And the selections are not much variety-wise and on the cheap end of their menu.\n\nThe buffet might be dollar-cheap, but you get what you pay for:  not so good.\n\nDining in, which we thought would be a nicer experience and better portions than take-out, turned out to just be the same niggardly fare.  \n\nThe tastes and quality of the goods appears to have remained consistently good, but we are disappointed at the prices, lackadaisical buffet and skimpy portions.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 3, "date": "2014-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XI3FkR8uei8xFuf-RnM_IA", "review_id": "nweEEOpgNeWKr5rRT1qVRg", "text": "Good food by menu but buffet is just worthless. \n\nMy fav is fish pakora and tandoori chicken here worth spending money", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2014-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zamPsIVL88f3yNXFslONeQ", "review_id": "1G3egmu1nxFRZ2VHuc4anQ", "text": "I've been eating here for year during dinner hours. Decided to try their lunch buffet. It had plenty of meat and vegetarian options. The food was seasoned goof but nothing was heavly spicy. I did miss the spice thou. When order a single meal I also order extra spicy and they do exactly that! My nose will be running LOL. I recommend trying there buffett.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2015-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bmTBUEeeea0m9sUZ4ApPYg", "review_id": "-zpjIvvGyPNdYhaRPJtMqw", "text": "Needed an Indian food fix, my friend is 6 months pregnant and craving Indian food,so went here as it was the closest at the time, It was pretty good, I had the chicken Tikka Masala and some kind of yummy Korma. My friend really liked the dessert which was some kind of fruit pudding, I myself would rather have Kheer,Ras Malie or that Indian dessert that is made out of carrots not sure of the name\nHowever \nI really enjoyed the Chicken Tikka and the Korma. And I felt the service was great especially since we had a toddler with us , the waiter was so friendly and helpful with the toddler,  and I was impressed by that and the fact that he kept our water glasses filled and had a smile on his face the whole time. Super friendly service... A++ service . I will definitely be back. The only thing I think needs improvement is keeping the buffet re-stocked.  That is why I am giving 4 stars instead of 5 stars.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2015-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SGfp3F5G3SU04NHd76ao7w", "review_id": "TlkoXJNcTdnqEZRQyBLDnQ", "text": "This is the best Indian food I have ever tasted and the service is great too. I always get the Chicken Korma extra spicy with Naan bread. The staff takes great care of you and takes pride in this place. I love the buffet too which has almost everything from the menu on it. Please give this place a chance. They get two thumbs up for perfect satisfaction.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 5, "date": "2015-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jkyRio4b1nFXI15E_6YAJg", "review_id": "IUKb_iEg9V3oY5nJvtrpkA", "text": "Bombay Grille is one of the best Indian restaurants I've eaten at outside of London. And that's saying a lot. Both the meat and plentiful vegetarian dishes were delectable. The nan bread was warm, crispy, and delicious.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2015-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HtxNcRQr28JTzXPOf7X_fA", "review_id": "vHKLbvcwZYRZpd7ZT4ZU-w", "text": "I'm not usually a fan of buffets, but Maharajah's lunch buffet was quite enjoyable. I tried small amounts of a variety of dishes and sauces and all were tasty. Their stuffed eggplant special and goat curry were super. The food seemed to be recently made as it was not dried out or overcooked.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 4, "date": "2010-12-12", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "cLi_GrU-Nq0hmUcICMWCBg", "review_id": "C0f70kicOU_HUOR9sRWPgQ", "text": "Sorry I am indian and as a indian this place blows .. Their aloo parathas are a cop out the just use samosa filling for the stuffing ...  The spicy pickles are from a can, also their vegetable curry is made with frozen vegetables not fresh ... Also I know its not a authentic place when the serve beef...  No authentic place will ever serve beef, they will serve goat, lamb, chicken and every animal except beef... what else, oh yea two of the servers started chewing each other out in the back of the room where EVERYONE could here.... Also they should invest in making \"chaat\" food - street food of india .. they had none of that one the menu!  I will give it 1 star because the garlic naan was good.. Also our waiter was really nice it was some guy who moved here from SD... Save your indian food craving and head down to Chicago", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 1, "date": "2011-01-19", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "AXz26iQxhQQF7FFCkDNJ6w", "review_id": "bmZFqnODG63H-H-pvkT93g", "text": "I am not sure what I like for Indian food but this was damn good.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 4, "date": "2011-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SpYUyshW8GFa-9KsNkPFHA", "review_id": "8P4u1zox_ftMdacvocefcw", "text": "I have a new found love for Indian food and when I found myself in Madison I had to check this place out. It was most excellently delicious! The staff was very nice and the price for 3 people including 4 drinks and an appetizer was about $75. If you ever find yourself on the East side of Madison, you should really check this place out.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 4, "date": "2012-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sd4kstHD9zl4UIG47mSUCw", "review_id": "fZmFw1Et-hZXzh2kCajWEA", "text": "My husband and I came today with a group of 14 people for their Sunday lunch buffet and I have to say, for the price, excellent service and quality of food, I really recommend this place!  I called ahead and they allowed our group to have a semi-private room away from the restaurant but close to the buffet.  The buffet had all the dishes you would hope for and some unexpected ones as well!  I really enjoyed the chicken tikka, chana masala, samosa and more common dishes...but they also had a goat dish, fish, several biryanis, really nice chutneys, etc.  \n\nMy only complaint  about this place was that the naan wasn't in a basket with a napkin to keep it warm...it was just plopped on a plate and got cold quickly.  The naan was great and deserves to be kept warm!  The dessert section of the buffet had a ton of variety but the mango ice cream was superb.  Apparently, when you order a meal during the week (even take away!), everyone gets a mango ice cream as well.  The food was excellent but the mango ice cream will bring me back!", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 4, "date": "2014-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_WDrLSQXMgKmJbbTWMbJxg", "review_id": "JL4YDgLwpi_ZNuovqboaVg", "text": "A great noon buffet with lots of yummy choices. Not a lot of atmosphere but consistently good food choices. No one here is going to \"chat you up\" but thats ok. It can stand on its own the way it is. The lentil soup is very good as is the lamb and really everything else.It's you choice and that why I like the buffet. Go  at lunch time and for about ten bucks try everything. Its worth it.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 4, "date": "2015-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 3}, "user_id": "Pxq3kL29GNo0n1BdB9xJbw", "review_id": "2KxHtf75IYjnxnLMoaKbZA", "text": "I absolutely think that Bombay Grill has the best chicken mahkani.  No restaurants in Chicago (even on Devon) can compare!  Or maybe I just haven't found that one perfect place in the city yet...\n\nSo anyways, when I was an undergrad, I luckily lived across the street from Bombay so I would come here all the time.  The manager knew me by my first name, hahahahha that was embarassing.  \n\nYes their prices can be a little expensive but I think it's worth it.  I love their garlic naan too.  What I hate about all indian restaurants is that everything is always separate--- naan, rice, etc.  Blah.\n\nAnyways, A+ for Bombay!", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 5, "date": "2008-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "OdL7XAqENNpR7A1Z5yMPpg", "review_id": "PV7Qon2rxxrYonVA-7hZxg", "text": "This place makes no qualms about itself. It is a solid Punjabi joint, creamy curries, paneer and all.  That said, it's rather lacking in spicy inspiration - both locations didn't feature any sort of kick to their curries.  However, the lunch special is all bang for your buck...I recently went here on a lunch meeting and my professor and I were able to split one plate and leave completely stuffed!  I'm glad the only real traditional Punjabi Indian joint in C-U isn't a disaster, but it's nothing to write home about either!", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 3, "date": "2009-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yJbA4LdQzE6i3PVWyEXHJw", "review_id": "is0cnAKoP1IX_luEWdO2Cw", "text": "LOVE it! MUCH better than some of the CU alternatives when it comes to Indian food. \nI recommend the saag paneer, and they have DELICIOUS naan.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 5, "date": "2010-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-r3Tgb4NOmI72HDrLLqhgw", "review_id": "E4d84a5Reo1O8Ovnxdmp5w", "text": "This restaurant was good, fine, but I wasn't particularly impressed.  Ordered vegetable vindaloo.  The place lacks any ambiance, though it does have a nice view of Green Street.  The naan is very good.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 3, "date": "2011-02-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4omuU-xWbf3ty7vrMfbP3Q", "review_id": "_CyakCbSbIkM7E39wX72Wg", "text": "I reviewed this in 2009 to let people know that I got food poisoning here. I ate here again and am rating it more highly cause I ate the veg food and it was fine, but mostly because I highly approve of the quantity and quality of their rice.  Working class Asian Americans like myself love their rice and this place is super generous and the quality is very very good. Better than the entree itself in fact.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 3, "date": "2011-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6Gy2xDPe01rbFOqeVAc-tA", "review_id": "A1nw1HP7JCdvbBD-9OqIxw", "text": "Delicious curry, their Nan is also amazing. They have several kinds of Nan, try the garlic or cheese stuffed!", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 5, "date": "2012-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zaZzYW5NfUTNwWuYe0S7SA", "review_id": "bAdkGp7z_ekUApFdK3xyPQ", "text": "The food is really good, terrific. The only reason I would give it a 3 star because the light system in the evening there is absolutely terrible.. I could hardly read my menu there at night..", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 3, "date": "2012-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nopVtZX86LqdBwWKRMjqSA", "review_id": "fN1leWuSNXREeTQUIkvqxQ", "text": "This restaurant is dam costly and is not at all worth for the food they serve. I am Vegan and Paid $13.2 for just 3 types of sides and naan bread and custard. Food was ot worth more than $6 however we were shocked to see their heavy check. Food is not so tasty to admire. It doesnt have the true authentic Indian food taste. They make sides of potatoes and green peas which are cheap in market to keep their profit margin high. They are smart enough to rob people. Please try other Indian restaurant who give you many option to eat for less than $10.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 2, "date": "2012-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "OgWNZVQdRrW624M8xWjvAw", "review_id": "7UMNec9vf6KEicVh92rw0g", "text": "Really great Indian food, just a few blocks from campus. For a quick lunch, it's a great amount of excellent food for a good price. Their naan is fresh and flavourful, and they were great at customizing spiciness levels for the various American/Indian palates in our party. A little bit of a small restaurant, their second location on 1st is bigger and features a lunch buffet for the less-adventurous. However, the Green St. location had a variety of great food options, and a Himalayan chicken special that was divine. Great place to meet and catch up, but can get crowded when students/classes are in session.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 3, "date": "2013-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ImaaqftmypNyxaL098k0yg", "review_id": "Cd7JZIlF9u9j7ZQoZID0ww", "text": "Sub-par Indian food, which passes in town. How is that there is no good Indian food in Champaign-Urbana? There are so many amazing Korean and Chinese places. The food here is generic and bland. Not worth the money.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 2, "date": "2013-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gHTzOYMc5vT1mL65TeWGZw", "review_id": "dHnPFc2Gj5I4XqFS4jW6Gw", "text": "This place is fantastic for lunch. The Bombay Chicken Aloo is my go-to dish: I usually get it with na'an (flatbread). The na'an is HUGE and you can dip it in the sauce that comes with the chicken dish. Service is quick and the staff is friendly. I've been for dinner once and it was a bit too expensive for a college student. Still, the food is reliable and delicious - check it out!", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 4, "date": "2014-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HP56L5EKlsmFkZTsOE6ISA", "review_id": "wzo5rx66LSBoTTcEZxXIfg", "text": "Great super casual and quick Indian, with a nice guy (the owner?) who works the counter.  I concur with most other reviews,  but need to add three things: 1) Their naan is enormous (like the biggest I have ever seen!) and delicious.  2) Their samosas are amazing. Always get them! Worth every calorie.  3) Their women's bathroom is kinda scary and gross (and why I am deducting an additional star). No hot water or paper towels,  dirty, and down a sketchy hallway.  Bombay folks, please fix this!\n\nDefinitely worth a stop for lunch, and I will be back,  but use the bathroom at home or office before.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 3, "date": "2015-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S5iwpwot3tdQ3Rfya_r5Eg", "review_id": "dRvvSHHY5G3p3x9Iu7o4aA", "text": "I ordered chicken curry, the meat was spoiled and made me throw out. Will not come here ever again.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 1, "date": "2015-02-22", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "IIRBF6_xbWYPbP_mjGI8RA", "review_id": "NWJzP47S2e--AM_ksqLT3g", "text": "Decent, but just much too expensive for the quality of the food and the presentation. Really need to reduce prices rather than raising them. Mashawi slanging 2.99 falafel sandwiches is going to put every other small business (except sakanaya) on green st out of business if people don't get serious with their pricing.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 3, "date": "2015-02-27", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "zFfXgANzhIcD-JkdBygcZQ", "review_id": "HoQ6bxj_Z5H9vz4ZER70hw", "text": "I went here once with a friend.\n\nWe had the lunch buffet which was average. \n\nUntil, I saw two cockroaches crawling around. Not, even your normal cockroaches but, gigantic cockroaches.\n\nI couldn't eat anymore but, for some odd reason my other friend did.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 1, "date": "2008-01-17", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "0bNXP9quoJEgyVZu9ipGgQ", "review_id": "pMYqFBnCMERlQdLRHyW6EA", "text": "Fantastic Chicken tikka masala and garlic naan!  Gulab jamun is good, but not the best I've had.  I didn't like the palak paneer.  \n\nService is friendly and efficient.  Preparation of food can take awhile, so don't arrive starving.  Lunch buffet available, and you can even take lunch buffet to-go!  (Haven't tried it, yet though so I can't vouch for the food served.)\n\nOoh, I've got to get this on my rotation soon!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2008-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "N7lSh49zQ13sG3Jpa9E6cw", "review_id": "uwLK8Y4DtayWiD44FdDlaQ", "text": "We stopped in here for the ubiquitous lunch buffet, and I am a little torn because I wanted to either really like it, or really hate it. But I don't. \n\nIt seems that decent Indian is hard to come by out here, so I tend to stick with the same couple of places.My usual Indian haunt is Flavors of India, because the food is mostly good and it's close, but I think this place is a close second. The things that Flavors does well, Delhi Palace does so so on. And vice versa. \n\nWhere Delhi Palace shines: (within the confines of today's buffet, of course) \nPalak Paneer- even though the paneer was noticeably absent or microscopic\nBengan Bhartha- My eggplant-hating dining companion even liked it. \nMutter Paneer- The one dish with peas that i'll eat willingly. \nThe service- they weren't in your face, but they were around more than most buffet meals. \nThe atmosphere- it's classy without being over the top gaudy. \n\nWhere Flavors of India kicks Delhi Palace's hiney: \nNaan- I prefer the flattened, nearly scorched naan to the fluffy puff that was plopped on the table here. It was fresh though, so bonus points for that. \nTandoori chicken- The flavor was fantastic, but the meat was dry. \nYellow lentil daal- I'll save my colorful description of this one and just leave it at Blech. \nCurry chicken- Where's the spice? Possibly the blandest curry chicken ever. \nThe water- This sounds weird, but every time the server came by to refill water, we ended up with more UFOs (unidentifiable floating objects) in our glasses. \n\nOverall, I think it's a toss-up. The things that I like about Delhi Palace are the things that my old stand by place doesn't do well. I'll definitely be back, but not for the curry or lentils.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2008-12-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "eRtuJOuHBXoJ3GRlAe_eTw", "review_id": "lIB0047KlfGR5ET7EpSr_A", "text": "Great food, and affordable as well.  My wife and I get it to go.  It travels very well.  I've had better Naan, but overall.  It's great Indian when you have the craving.  Tip:  Don't get the Meat Naan.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2009-12-02", "type": "review"}
{"votes": {"funny": 5, "useful": 6, "cool": 4}, "user_id": "Lp_Ykqfbv5Q-oyGYlMGJRg", "review_id": "Ve2uqRzmNYoOwmYpb0tV_A", "text": "Came here last night with the girlies to satisfy our craving for Indian food.  We've talked about this place for a while, and I'll be damned if I was leaving AZ before stopping by this place!  So luckily, I was able to convince one of the girls that finals are not as important as saying goodbye to me over a plate of curries.\n\nWe got their around 8 and the place had a good crowd.  We were the only white girls, so we know we were in for a good meal.  Going over the menu took us a while, because one of the girls had no clue what she wanted, and the server was polite enough to let us take our time.\n\nBefore we figured out what we wanted for dinner, of course we had to figure out drinks.  So we all order and still continue to peruse the menu.  Then our drinks came out...huge plus for this place right here, they were huge!  My gin and tonic was in an oversized cocktail glass and my friend's Chardonnay was filled to the brim.  No skimping on alcohol here!  The waiter advised us the drinks were strong, which I was fine with but my girlfriend needed 3 more limes to take hers down.\n\nWe finally end up decided on dinner, with the shahih paneer, chicken saag, and vegetable korma, and an order of garlic naan.  I was a little unsure about the paneer, but my girlfriends swore by it.\n\nWhen the food arrived, we were excited!  Everything smelled so flavorful and the naan was huge, good thing we only got one order.  I loved every single bite I had at dinner, and the feeling was mutual across the table.  All of us ate beyond the point of feeling full, but we couldn't help ourselves!  This food was too good!\n\nLuckily, we were able to stop ourselves and save some food to take home.  I got the chicken saag and I am so excited to have some for my own brunch.  Mmmmm...I'm getting hungry thinking about it now.\n\nOverall, $20 a person including tip, with strong drinks, good food, and extras to take home we were satisfied.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2009-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8-98T_0Z1l9hBYXHfaHFPQ", "review_id": "Q077aKKB-MbPBv3J55ez3Q", "text": "Placed a take-out order of vegetable pakoras, shahi paneer, garlic naan, and papadum. Did not receive the pakoras at all, the naan was COLD (not even lukewarm), the papadum was burned, and the shahi paneer was crappy. As your lawyer, I advise you to become a patron of any other indian place in the valley but this one.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 1, "date": "2009-12-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "HZeFzs42f0iGaA-sP_hUnA", "review_id": "l3ybCe78T3bGnEQqXZ93Zg", "text": "Decent but not awe inspiring North Indian style food in east Phoenix. I haven't been for their lunch buffet in years, but dinner is good and reasonably priced. Their idea of hot is not that hot.\n\nThings to try that I especially like here - \nMango pickle\nAny of the paratha breads\nHot tea\nAnything with cauliflower", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2010-01-03", "type": "review"}
{"votes": {"funny": 5, "useful": 14, "cool": 12}, "user_id": "fczQCSmaWF78toLEmb0Zsw", "review_id": "LrhM2gcbVjEqitN62ud5DA", "text": "I cooked dinner at home the last four nights in a row... this may be a record for me.  No joke!  We eat out way too much.  But, as a reward for all of my cooking as of late, my husband took me out to dinner tonight.\n\nI suggested we try Indian Delhi Palace, and he agreed!\n\nWe walked in and were immediately greeted by Nick, Mr. Delhi Palace's son.  Nick is a college student with one hell of a sense of humor.  The banter between him and Jared made for one comical meal.  \n\nHere's what we ate:\n-Garlic Naan\n-Peas Pulaou (Basmati Rice cooked with Peas)\n-Fresh Okra with Sliced Onions, gentle Herbs and mild Spices\n-Bengan Bhartha (Eggplant roasted in a delightful pulp, seasoned with Gentle Herbs and Mild Spices)\n-Shrimp Tikka Masala\n-Kheer (Basmati Rice Pudding sprinkled with almonds and Pistachio)\n\nEverything was extremely tasty, especially the okra and shrimp dishes.  I normally do not like dishes that have onion in them, but pretty much everything we had contained a lot of it.  And actually, I still liked it!\n\nThe serving sizes were large, so we took home leftovers.  The price was a bit steep ($60 out the door), but we really enjoyed it.  I think this will be my new \"go-to\" place for Indian food, and my new \"go-to\" place for dinner when I pick up friends and family at the airport around dinner time.\n\nAs a side note, the Indian Delhi Palace building also has a large banquet room upstairs that Nick showed us upon our inquiry... it has a capacity of 250 and it's really nice.  Future Yelp event potential, perhaps?  We'll see about that.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2010-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kacOkLRg_lcNA_wPE4bb1Q", "review_id": "JdFwHqb5Uro6SdXuh9PwSA", "text": "This place has a fancy exterior and you definitely pay for the ambiance. Definitely a sit down with a napkin in your lap kinda place. I have tried the tikka masala, pakuras, vegetable korma, and naan.  It's all very delicious and the portion sizes are bigger than expected. \n\nDrawback: kinda pricey. Not a good place for cheap take-out.  I ordered out for 3 and it cost $50!!!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2010-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "rR5W8Bj-IGu6sw1_1v4m7g", "review_id": "PHI-qieRYRiEAfzrImwDXA", "text": "After all the issues we've had finding food sushi in Phoenix, I was worried about beginning to Indian food venues.\n\nLuckily, we were much more successful with this type of food. The Indian Delhi Palace was absolutely scrumptious, and just as awesome, it was incredibly affordable.\n\nThe Samosas were perfectly sized and scrumptious.  I wish that they'd brought the tamarind sauce out before them with the chutney, but it did go perfectly with the samosa.\n\nI got Malai Kofta.  Not exactly what I was expecting (it's my favorite dish), as it was a bit different than other places I've had it, but it was still delicious.  My partner got a good ol' favorite; Saag Paneer. It was a bit too spicy for her (her fault for ordering it medium), but we wound up mixing the two sauces together, and it was perfect. Portions were generous, especially given the affordable prices.\n\nThe service was so-so; our glasses stayed empty for some time before they got refills.  I wish I'd gotten a mango lassi, but it was a bit pricey, and we chose the Samosas instead. Also, I was a bit disappointed that the naan was sold separately, but I guess that's the way lots of places are going now.\n\nAll told, it was delicious, comforting and satisfying Indian food, and we were quite impressed! I can't wait to try their lunch buffet.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2010-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vhxFLqRok6r-D_aQz0s-JQ", "review_id": "CB8dEDNiVqsTsfBIXYDAlQ", "text": "Great lunch buffet, for the price, you get a ton of different types of food to try.  The naan is great and piping hot.  I will say that their chicken tikki masala is not my favorite but overall for the ambiance, this place is super pretty and delicious!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2010-12-24", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "E57V8rkRheDr5g_9MNAQwA", "review_id": "PgnC48NiwoHeCGQrYiqJHA", "text": "Let me just preface this review by saying that it does pain me to write a negative review about almost any establishment in the valley.  Unfortunately for India Delhi, it has to be done.  Honestly, I have not dined inside this restaurant, my experience is purely from multiple take out orders over the past year.\n\nLiving in Arcadia and loving food as I do, I am lucky in the fact that I do not have to travel far to enjoy ethnic culinary delights that other cultures have to offer.  If your a foodie in the 21st century, Indian food is all over your radar.  India Delhi, found at 54th street and McDowell in Phoenix, fits the bill of almost every other Indian restaurant in the valley. Nice external building, clean looking restaurant and the normal tinctures related to that region of the world.  \n\nAlways friendly and eager to take your order, the young gentleman at the front counter has never let me down in taking care of my to go order. Always checking each container to make sure it has the correct contents, etc.  On the Saturday I am referencing for this review, the young man was not there, but the owner and his wife were. In my opinion, Indian food is not a cheap venture. I always find myself wanting to try a dish as well as getting a staple that I know is going to be solid. When you add in the extra charge for rice(never included), yogurt sauce(not included), etc, the bill for myself and companion always tops $40.  I usually do not gripe as I know the quality will be there and I just love the food, what can I say.\n\nOn this Saturday though, something was different. This was evident from the moment I walked in the door, I could not put my finger on it, but something was just not vibing.  The owners wife(or co owner for all I know) was at the counter and asked if I wanted the buffet. I politely turned it down as I am not a fan of buffet food, especially with Indian cuisine.  I politely turned that down and proceeded to order tandoori chicken, saag paneer, chicken biryani, basmati rice and some naan.  \n\nWhat happened next is not something I will forget soon.  I watched as the owner walked out of the kitchen with the pan in hands and used the spinach for my saag paneer from the buffet.  The owners and my eyes met as he processed that I saw what he was doing.  In that moment, the owner sold and gave up all his culinary credibility. He proceeded to head back to the kitchen to use said items.  \n\nI waited for another fifteen minutes and took my order home.  What did I find? The chicken biryani, the only item I might add not in the buffet, was extremely hot, almost too hot to touch.  The saag paneer was warm at best. The tandoori chicken was a collection of small legs(customary for Indian buffets) and once again, not hot.  I knew what had happened and could not help feeling beyond annoyed with the situation.\n \nNormally, I just deal with what is, I do not ever send food back and especially on to-go orders.  This time was different, I could not let it go.  I called the restaurant and without pause the owner got on, knowing exactly who I was and what the problem was. He put up a fight for around 20 seconds saying that he just used the spinach as a base for the saag paneer and what not, but then finally just apologized and said he would \"make it right.\"  \n\nI do not really see myself going back here, but who knows.  This is a good excuse to venture out and try some more of the valleys offerings in this arena.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 2, "date": "2011-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "0dgQa81w5it1PMpGpC_L0A", "review_id": "SFt-aYZujcRJtOLhNqaAxg", "text": "Great, authentic, delicious Indian food.  We are always excited to make the trip over here, knowing we'll get some REAL Indian food.  The samosas, garlic naan, biryani, and lamb korma are among my favorites, and should always be had with a mango lassi.  Ah, perfection.  \n\nThe only thing that is making me hesitant to give that last star is their lunch buffet.  Not the biggest selection - which wasn't a huge deal... still plenty to eat. The problem was the temperature of everything.  I was seriously afraid that I was going to get food poisoning (I didn't, thank goodness).  This can not be a safe temp to keep food at for more than 10 minutes!  Although, the husband claims that it is pretty much the same at all Indian buffets... you can tell, I usually just order off the menu wherever I go.  \n\nDefinitely stick to the menu, and your experience will be 5-stars.  Attempt the buffet at your own risk...", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2011-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bpEDpf6_-s1CSxMUfkij0w", "review_id": "Hnd5tT0q8hrOvOOACLsZ3Q", "text": "I don't understand the low rating for this restaurant. \n\n- Great ambiance relative to the numerous other Indian restaurants I have been to.\n\n- Good service, water was refilled 3 times, naan was replaced immediately upon decimation. \n\n- PRICE. With the yelp deal its incredibly cost effective to get full off of good indian food. \n\n- The food was good, not great, not bad, but good. \n\nOf course I always compare a meal relative to how much I paid. I paid $5 dollars for AYCE indian food that had a decent selection of food, all of which was delicious. For 5 bucks this place is as good as it gets. \n\nAlways review relative to how much you paid. If you rate this place any less than 3 stars you are truly a snob.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2011-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "7Yye8K6Ei9ROVcx41To19g", "review_id": "KNDoAlxWFv_pvVNsT9JVCA", "text": "Uh-May-Zing\n\nThis was my first time eating Indian food and I am now a new  fan of it! My cousin who loves Indian food and was visiting from LA said it was the best Indian food she has ever had! The location is cool because they give you a taste of the Indian style and culture from the moment you enter the parking lot where the building has a palace shape and their is a cool looking mural on the large wall. The inside is pretty nice and the Indian cultural theme continued here with a homely feel because it is owned by one family it seemed. The chicken masala I ordered was impeccable and just my taste at a level 6 spiciness and the garlic naan was mouthwatering with the yogurt dipping sauce. The place is pretty nice but there's no need to overdress here. Best part was that they offered a 15% Yelp check in discount! Also, they have an attached spice shop if you are interested.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2011-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RbCRHWZotVygDGy1wF6wHA", "review_id": "mdU_d8Rse0lcj3l1ETFnvQ", "text": "A great restaurant.  The goat, chicken and Nan, are delightful.  Great service and authentic.  A must try.  If you like it spicy ask for hot.  Medium wasn't as spicy as I thought it would be.  Otherwise a perfect meal.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2011-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rXGV82c14TNQ2bh3oZ9WGA", "review_id": "5TTu9d3OcUs4Yjp8zup_Aw", "text": "Great food and atmosphere. Had the mixed grill, a little bit everything on one piping hot plate.  Dessert was great too, always a fan of rice pudding.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2011-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nGvxLe5jdJGbxTYt9XjScw", "review_id": "Fcyc6ZZPifN4bOA6436D6g", "text": "This is place is AWESOME! Don't get why it's not rated higher. They have Delicious Vegetable Curry and really good lunch buffet. The Naan is off the HOOK. Everyone I know that has eaten here loves it and this place has been awarded by NEW TIMES as well. Seriously you should come here. I usually get take out because I have small kids but the service is always great and the food is Delicious.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2011-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8WUFsW1Hz4dkoaPMUMq4xg", "review_id": "FJMW_VZK6l_9SSGK5pq30A", "text": "Decent. The dishes are somewhat bland and seem to be not quite as authentic as I have had in the past. The curry was ok and the tikka masala, well Ive had better. The buffet is above average and as always the Naan was wonderful!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 2, "date": "2012-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Psh8PaEh8c2Wn8YjwyGVvA", "review_id": "eCZSd0x9Nm5kUxwldmuKrg", "text": "Quite pricey. I got the Tandori chicken and thought it was a meal (as most Indian places service it with rice or other sides).  But here, it was 4 pieces of chicken, and they weren't even whole pieces.  Like the breast was cut in half and counted as two pieces. Quite odd. And it was pricey for 4 \"pieces\" of chicken. First went here with a Groupon type deal.  Only go again because it is halfway to my friend's house and we meet up.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2012-02-17", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "tiXu7D9-wjZRqLiVF13wUA", "review_id": "hAdHALjxSDnfRLMITwVUFg", "text": "Terrible.  Terrible.  Terrible.  I stood in the entry without ever being greeted, never got a menu, never offered a beverage, never helped with what to order, so went to the buffet line.  It seems it was the tail end of the service and everything was dried up and not fit to serve.  I visited this restaurant with a Phoenix Dining Card and never got my discount.  A complete waste of money and ruined my day. I will NEVER go back!  I will write reviews on this restaurant to make the point to treat EVERY customer well.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 1, "date": "2012-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gUXfVNgnNF9WU73T-d-FKQ", "review_id": "yb3BKHCvewbaPXRexuSKAQ", "text": "Big bunch of family over so we created our own buffet!  Shrimp biryani, veggie biryani, tandoori shrimp and tandoori chicken, chicken tikka masala, palak paneer, samosas, raita, and lots of naan (plain, cheese and garlic).  Everyone loved the chicken...which I don't eat, but others said it was good.  I loved both biryanis and the paneer with raita over it.  I also loved the naan dipped in masala sauce! SO glad it's close to home!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2013-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "btM5nOZBNJCM4yY6D6eTZA", "review_id": "jZCVQqi2tqzdgDJtk0aKhA", "text": "While leaving Scottsdale to drive home, the hubby and I found this place randomly without me Yelping. (Which I never do now that Yelp and I have such a deep and intimate relationship.) But lo and behold, it wasn't so bad! It wasn't the best or varied Indian lunch buffet ever, but the food was right on, the veggies were good, the mango lassi was yummy, and the naan was spot on. My only  complaint was that I was cold the whole time. But that was probably just me. Good place for a lunch buffet here in Phoenix.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2013-02-04", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "srJLMabSij0vuapVgu1H9A", "review_id": "GTG2YtZHG4KIbt1YmGl7ZQ", "text": "Just moved to this area and tried this place for the first time. Lovely, attentive staff and nice interior. The food was amazing. We had samosas, chicken tikki masala, curry shrimp and garlic naan. I can't wait to go back and try more dishes. A little pricey (never had to order rice seperately) but worth it.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2013-02-19", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "3xq5DtaHus-vgQebhxwesQ", "review_id": "W9MB2Z2y48bHEfLN-nkd7g", "text": "Cockroach on table (and a neighboring table). Lamb super mealy. Wine bottle \"opened\" in back and then brought to table with cork from another bottle. No apologies. Just arguments. You've been warned.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 1, "date": "2014-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rKxOpEXc6HO9PXQUeMGucA", "review_id": "XsSRrjgBdo9WiYt0hyhqYA", "text": "All I have to say is - I'm a punjabi and I endorse this message.\n\nPortfolio - Chicken Tikka Masala, Chana Masala, Palak Paneer. garnished with courteous service. A gem in the middle of this desert.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2014-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "yP5OE7_DhRfiRGX_ttUZNQ", "review_id": "ghN4EEhU97dfK06Zl2Fxkg", "text": "I'm not a huge fan of Indian food, but I do believe that's because I was probably eating at bad places. This place has converted me! I had the Lamb Korma and my hubby had the Butter Chicken. Everything was very flavorful! The establishment is very clean and very authentic. Our service lacked, slow and didn't ask us for drinks etc, but they were very friendly regardless. We will definitely be going back to try more!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2014-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4oBViNYcsWpPexC405Gh2w", "review_id": "TYAKGIrHY11thfn0bkFqQg", "text": "I believe this is probably the best Indian food in the valley.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2014-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KeL_ebKRFbyF0uHYpOKX8g", "review_id": "fCu1sRU17YBRqVhg0HbCHA", "text": "The worst service ever :( They messed up our food and we complained we go yield at. I will take my money some were else. There are plenty of Indian restaurants in the valley, and you just lost a customer :(", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 2, "date": "2014-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "T5Fghca6pf72clQfqPWwRQ", "review_id": "wjgYoVxdrgc5gjUe46eV7g", "text": "I have eaten at this place four times in the last two years. Initially I was not a big fan of it, but in the last year the food at this restaurant has gotten so much better. \nMy husband and I are big paneer fan, we loved their Shahi Paneer, and Malai Koftas of their Ala carte menu. Their Raita is really good too. The only draw back is that they charge for plain rice. Usually rice is given with curries for free. I chose to over look that glitch because the food was so good. I hope this helps!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2014-12-04", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "zjdVsOo6kew3F-Vq1aDG1g", "review_id": "YJ4YM5bzsHoarLpKIZ2r2A", "text": "I've never had indian food prior to coming here. After coming here I fell in love with it!! Oh my god their lunch buffet is the freaking best!! So many bold tasty flavors! Love love love it. I'm obsessed I seriously go there once a week now lol. It's my new addiction.\n\nOh yeah ask for the garlic naan!! Yummy omg it's also free :)", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2014-12-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "43NCZMFc_guSFBbo9g_0rw", "review_id": "GYZ9yS3iMX9S0DyrebFaZw", "text": "Best Indian Buffet ever!!! My favorites were the naan of course and the tandori chicken.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2014-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "__4B6UHA7x9lXOsZanUC0Q", "review_id": "qfjMUMZtueXD1iaWmoy4iQ", "text": "I went to this place on my trip to Arizona and Phoenix. Ambience, location and staff is pretty nice. The food was average. Me being from bay area may be a little rude but the food just had the taste of cream. Ordered for the following dishes:\nMalai kofta: koftas tasted frozen\nPaneer: panner was good but gravy was all cream\nOnion pakoras were awesome\nI would may be go there if no other option is available, but then it could be just my taste buds.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 2, "date": "2014-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "P110Ov4n0Patb8Iufr1suA", "review_id": "octM8sOYHPkdkR50CXg90Q", "text": "It is an ok indian restaurant, the quality is not vwry low but it is alao not high at all", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2015-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tBpi03HGA09HvYEYyRaiuw", "review_id": "z_6v6EhbaquwXCxM5AqTvQ", "text": "Awesome vegetarian food here. We tried shahi paneer and dum aloo . Both were awesome and naan was fantastic!!.though mango lassi was disappointing!!!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2015-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UvOdvgUmqx8PdFJLvVOuZA", "review_id": "kVE0U1cD5bANcbFUdeADqg", "text": "Just awful. They don't care about their customers. Had a terrible experience and was afraid to step outside since the area is so sketchy", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 1, "date": "2015-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "CP8qXKvY8inZfrFBLpt6TA", "review_id": "YNb597N9BTa5UEAV94rXzw", "text": "Not a bad place, great service.. Went for the lunch buffet, They can use a little more selection, tikka masala was good chicken was tender, couple vegetarian dishes, chicken kabob was dry. Naan is fresh made to order, I personally like the garlic naan. One good thing is that the buffet is open till 430pm..", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2015-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2PeotUk0AFuvebc6p_0-zQ", "review_id": "G-o26XRwgtOuSmH440UgbQ", "text": "3.5 stars. Ate for the first time here last weekend, and the food was great! I recommend getting one of the complete dinners if you are not familiar with what's good to order. Atmosphere is quiet and decor is a little rough around the edges, but a good place to go for a casual meal. Servers are polite, but come across lackluster in their contribution to your dining experience, although that seems to be a trend at most Indian restaurants reviewed on Yelp. 4 stars: food. 3 stars: atmosphere/service", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2015-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HXJ1P61QXyNETLo-Jm87EQ", "review_id": "BVwmIIcWHlPdBecwmTKVdQ", "text": "Do you want to start off by saying that this restaurant is amazing point blank period. The Chicken Biryani is the best. And the Chicken Curry is also my wife's favorite, just make sure you tell them how spicy you want it.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2015-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bXsssYWPY386sCq_M_8cng", "review_id": "mvERe6WJQYDl-77mndFr3w", "text": "Second time back at this wonderful Indian restaurant. The decor and setting was tasteful and apropos. Chicken tikka masala was delicious as were the peas and rice. Dip some garlic nan in that setup and you've got an Indian spice party going on in your mouth. \n\nAs good as the food was, the service was even better. Our server Sanjay was attentive, friendly, and his recommendations were on point. We ended up eating late (we arrived after 9PM and they close at 10), but there were many employees still working hard and seeing to our needs. Definitely got the impression the customer comes first around here.\n\nWill return in the near future to check out some of the lamb dishes as well as the butter chicken.\n\n02/12/2015", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2015-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0ksR9dv7l47aAeZ_fF9E9g", "review_id": "IxP6lRHC6UF7lrtWb9Qu5Q", "text": "Everything I've ordered here has been pretty good. My main compliant is that there is a great amount of variability within the same dish depending on the day. This variability includes flavors, texture, spice level and ingredients. Sometimes the dish is fantastic and sometimes it is only OK. We continue to come here because the food is usually pretty good, the turnaround for pick-up orders is quick, there is plenty of parking, the food is moderately priced AND there is nothing near us that is any better (for cost/easy of pickup). Definitively room for improvement here. Additionally, rice does not come with the curries; you are charged 3.50 extra.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2015-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rfXFEAZtuleuhVFQ3QIo5w", "review_id": "Y1oqtWyWqy69XitS1zoaag", "text": "Amazing! Extremely friendly staff. The chicken curry, naan, sweet red honey balls and bread pudding were incredible.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2015-12-12", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "_XQST1rS1iYQahvdnFXLiA", "review_id": "CtJT8AuDi2XD-CdEV7m_jg", "text": "I would not give any stars, not many options... Tasted verymuch like the frozen packets heated & served.\n\nThe buffet time is till 4 pm however the biryani is not refilled at 1.00 PM\n\nThe tondoor wasn't cooked all thru. Desers were all frozen & served very cold with pieces of ice in the kheer.\n\nThe only good thing was the fish, which aswell wasn't re-filled at 1:00 PM.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 1, "date": "2015-12-13", "type": "review"}
{"votes": {"funny": 15, "useful": 19, "cool": 14}, "user_id": "C8ZTiwa7qWoPSMIivTeSfw", "review_id": "7lAYbBQ87MIe5F3M9EyKxQ", "text": "OK so maybe I'm just a simple Scandanavian man, with an easily pleasable palette. But judging by other yelp reviews, my first FOI experience stands alone. I get a kick out of most Thai/Indian/Asian strip mall restaurants. The decor is pretty tacky. So, I tend to get my chow to go. I had the friendliest, most helpful lady guide me through the menu. We picked out a vindaloo, a tandoori, 2 orders of naan, some veggie fritters and a tikka masala. \nVindaloo 2 stars\nTandoori 3 stars\nMasala 5 stars\nFritters 0 stars ughhh \nNaan 5 stars\nKing Fisher Beer 10 stars...can I do that?\nService 5 stars\nFalse ceiling with stains 1 star\nTo go boxes and packaging on full display behind bar 1 star\nDecor...Bollywood meets flea market meets storage room\nWell, as they say in India, um, hmmm...I don't really know what they say in India. So, I settle for see you later yelpers!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2008-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "KYCW5xpBif5eqt-jvIHTdw", "review_id": "QAG-8KB_1rIt1p5_mJJU4g", "text": "When I lived in the area, I would come by here for dinner, and occasionally lunch.\n\nThe buffet at lunch is ok.  Nothing stands out and grabs you and says \"THIS IS THE BEST THING I HAVE EVER TASTED\", but by far none of it is bland.  It is a buffet so my bar is not incredibly high.\n\nFor dinner, I have never been disapointed.  The curry is spicy, the masala is sweet and delicious.\n\nMy only true complaint about the place is the decor and the music.  I have come in on a few occassions and the place looks dirty, or the Bollywood Best is cranked up to the point of annoying.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2008-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "CAlxnkAuqNetlUmWtCQ_eQ", "review_id": "-3b6tmkG8E5X32KKNXnXwA", "text": "This restaurant is good and close, which is why we frequent it.\nNot the best Indian I have ever had, but still damn good.\nThe decor is pretty standard, they have a full bar and a couple of TVs, one in the dining area playing Indian music videos which are always fun to watch. The staff is very friendly and attentive.\nThe menu is pretty traditional, as far as Indian goes, Naans, Jasmine rice and Vindaloo, Tandoori, Masala, etc., with plenty for vegetarians and carnivores.\nDinner is always good and the lunch buffet is not bad, either.\nThe prices are reasonable and there is never a wait.\nAs many times as I have been here I have never had a bad experience.\nGive it a try and see what you think.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2008-02-01", "type": "review"}
{"votes": {"funny": 2, "useful": 6, "cool": 6}, "user_id": "4UUIpbOTPmu43wuC2aSGkg", "review_id": "AX3sLTFCOJRoJuCMho7L5Q", "text": "I woke up late on a Saturday, and I was craving Indian food! To my relief, it was almost lunch time! I remembered that there was an Indian restaurant close to me that I had been meaning to try. I headed to Flavors of India to try their lunch buffet. I walked in and I was immediately greeted. I noted the Bollywood videos playing in the background, I love those dang videos. The host was also my waiter. He invited me to help myself to the buffet. I'm not one of those people that knows the names of each and every dish. As I write this I'm kicking myself for not taking notes. As a whole, the buffet was a-ok. Nothing in particular knocked my socks off. I did notice that nothing was powerfully flavorful. It was kind of a \"safe\" seasoning restaurant. I would visit Flavors of India again. There was plenty of food, the buffet had a lot of variety, and the service was good!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2008-12-01", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "3VgHutPPmF3TbWwIzlSNCA", "review_id": "sf-okFCv2iHBpXRsWr23jg", "text": "I have had excellent luck with this place by always following the same formula.  Order mid-week, get the Chicken Tikka Masala and the Lamb Kwarma, order both at least medium, preferably spicy.  Ask for an extra side of rice, I have always gotten it at no extra charge and the portion of entree does require more rice.  Always order Garlic Naan, probably two orders.  This method will easily feed six people, or yourself for a couple days. I can't comment on the complaints expressed by others, as I have never tried Flavors of India their way. My way, I have always been on the verge of food romance pants explosion.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2009-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vj4TK1FVMfFwCnZ4O4QJBA", "review_id": "jQk2v9SGfDetitadS9dLkg", "text": "We went with friends who love this place.  Incredibly friendly and patient service that presents fabulous, spicy cuisine from India.  Worth trying for a relaxing and sensational dinner.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2009-01-24", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "Z1lPtIHU7bRoIvuVa01H5w", "review_id": "GvgUpu8bBWYCTVFdy1kOwA", "text": "This isnt the most imaginative Indian buffet, but I like it for several reasons. Reasonably tasty fare, pleasant buffet service and AYCE prices around $9-10, but what I really appreciate is the subdued and somewhat elegant atmosphere, just a quarter mile south of the big do on Camelback. \n\nThere's a ton of busy Camelback restaurants, but it seems the choice is often between fast food, pizza or pricey event dining in the Biltmore or Esplanade. Flavors of India provides a relaxing, comfortable middle ground - sit down dining with real china and stemware at very affordable prices. That fills a niche this area needs.  \n\nEverybody forgets this place is right around the corner. It's rarely crowded and there's something comforting about getting out of the sun and the bustle and settling into FOI's dark environs for a leisurely Indian meal. The drink service. The naan. Chafing dishes being replenished. It's a gentle rhythm that suits me and nothing seems hurried like the corporate factories up the street. The people here seem to appreciate that you went a little out of your way to stop in, too.  I always leave feeling I've gotten my money's worth, and frankly, a little rejuvenated. \n\nIf you live in Mesa, I dont recommend making a special trip to find FOI.  It's not that good. But if you're in the neighborhood, stressed out from shopping and traffic, it's a soothing alternative, a bit off the beaten path.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2009-12-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "GXt1b29IAQulijQWBwUPNA", "review_id": "Wv0EYhOGyqSe0-upjmy9qQ", "text": "I'm giving this place a generous 4 stars because the food is actually very tasty. I've been here twice now, and I'm never disappointed. Indian food has to be on the top of my list for favorite cuisines, and I am sad to say there aren't many or any great Indian restaurants that I have found in Phoenix. Flavors of India, however, seems to satisfy my palate. I enjoy the chicken tikka masala every time. I have also tried the curry chicken, which is also very tasty. The chicken is very fresh and tender, both the light and dark meat. The naan is a bit flat and not soft or chewy enough for my taste, but it does its job. I really enjoy their basmati rice. It's not the most elaborate or flavorful I've ever had, but for some reason, I'm drawn to it, and even crave it. There's no saffron or cloves; it's a bit on the simple side, and just a tad bit sticky. The samosas are decent, although I have had better. If you are in the mood for some Indian food, and this place is close by, I suggest you head on over. Prices are reasonable. Two can eat for 30 bucks, including multiple appetizers. The food is prepared quickly. It's not the prettiest of restaurants but it has it's interesting Indian decor with a twist of Mexican thrown in. At least that's my impression. I don't like that they are closed on Sundays, since that's when I typically like to eat Indian food. The quantity is definitely sufficient, and you will have left overs, unless you like to \"pig out.\"   Try it, you'll probably like it!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2010-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7brf9WC0Gr_7bUBXEHs9FA", "review_id": "HdX0sN87UxGnpGfrEvybhg", "text": "The buffet is wonderful.  A wide assortment of Indian food at about $10.00 per person.  The chicken dishes are simply terrific.  They also provide bread on the table and a fountain drink for $1.00.\n\nThe decor is inviting and the staff are nice.\n\nI recommend.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2010-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "8VikyrWXFKL8GU1a9t-o6Q", "review_id": "75WRKGIQMMXhKMeUuCIY3w", "text": "Unlike other reviewers, I didn't like the buffet, though my friends from work think it's a good value. However, I've been going for dinner to Flavors of India for nearly three years now, and have ALWAYS liked the food. FOI is my first choice for Indian cuisine in Phoenix, out of the four other Indian restaurants in the valley I've tried. \n\nYes, FOI is in a strip mall, but once inside, the ambiance is pleasant. It seems quite clean, I never got sick from anything I ate there (that's saying a lot, as I admit to being a fussy eater), and the waitstaff is helpful. Bollywood videos on the large flat-screen wall display in the corner are an unusual feature, but the volume is low or completely muted, so you can watch or choose not to, it isn't distracting.   (Here's a footnote about that: I ate at FOI on the night of the presidential primary election. My dining companion noticed that most of the waitstaff was gathered around the TV in the bar, watching electoral results, so he asked our waiter if we could watch too. After getting the enthusiastic okay from the two other occupied tables, it was quite late in the evening, silent Bollywood was replaced by live news coverage with volume turned on).\n\nRegarding the food: I love their mattar paneer (cooked peas in a tasty curried gravy, with small cubes of homemade mild-tasting cheese).  My super-spicy friend gets the lamb vindaloo (super-spiced as he requests).  Tandoori shrimp, chicken and tikka masala are good though a bit pricier, the samosa appetizer (lightly battered and deep-fried cut vegetables) is fresh, warm and crunchy. Regular and garlic nan bread are everything they should be, biryani rice is overpriced (I'd stick with basmati rice as a side dish), and sweet lassi (a well-chilled dairy drink, similar in taste and consistency to a vanilla yogurt smoothy) is a nice treat. My spicy friend says his gin-and-tonic was weak, and they don't have ingredients to make a Bloody Mary, but hey, FOI is an Indian restaurant, so I can't fault them too much for that! \n\nOther pluses: open a bit later than many Phoenix restaurants (seating ends at 9:30 pm); very fast with takeout orders; there's lots of parking; the 16 North bus stop is nearby; silverware, glasses, white cotton tablecloths and napkins are always spotlessly clean.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2010-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yiGA-4VvmfeIhltOXMnlpg", "review_id": "5qcr9QVIajaKnxK4_gfpzQ", "text": "Let me start by saying I'm not a huge Indian food fan, but I am addicted to their garlic naan, and spicy vegi dal... Mmmmmm.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2010-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M6oU3OBf_E6gqlfkLGlStQ", "review_id": "2TH2NmCiWoDKtZQ5NpDEZA", "text": "Quite the ironic name for this restaurant.  I think their name should start the term \"Americanized\" or \"subdued.\" The dishes on the lunch buffet were standard but they lacked the vigor that good Indian food has. \n\nI have gone here a few times for lunch with co workers, the vegetarian selection is decent. The fried items can be a bit soggy from sitting out too long.  The lunch buffet now is topping $10 which is pretty steep of a mediocre lunch. I feel like there should be a discount at places like this for vegetarians. The Naan, and water is brought tot you by a server so you may feel the need to tip on top of the buffet price. \n\nThere is the stereotypical bollywood music videos playing on the TV, with their psychedelic colors and lavish garb. Many of the serving trays make extensive use of aluminium foil which I doubt meets health code.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 2, "date": "2010-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YZ82I51Zedr9U6e13DO82A", "review_id": "IgBqCBJ1qSYmL9MyJXwZeg", "text": "So I just moved to Phoenix not too long ago and have been trying out new places. I love Indian food, and a friend recommended this place. I'd been to other Indian restaurants here and wasn't too impressed. This place was different.  The food was very good, though since I went for the lunch buffet it probably wasn't as fresh as it would have been ordering from the menu. That said, I saw the staff bring fresh stuff several times and it tasted great. The place smelled just amazing- I think my sweater smelled like Indian food for two days (in a good way!). The staff were very attentive and helpful, even though they were obviously very busy, too. Good service, great food and reasonable prices...what more could I ask for? This place is definitely a keeper!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2010-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1ggf9iT4TNT09e15Zoj73g", "review_id": "ore0onHBza2syU1jhfQK8w", "text": "This was my first time here. It was a nice experience.. And I found that I really like Indian food ! Good stuff !", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2010-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ey3VjXX9CTwyY-KXysbBUw", "review_id": "um4jL7HjD5nPeg5Nc-q34g", "text": "Wide range of vegetarian options. Great chicken tikka masala! Very friendly and attentive staff. If you're into Bollywood, this place plays videos too.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2010-12-16", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "-OMlS6yWkYjVldNhC31wYg", "review_id": "FxWXUCHHZ4YC0Gwb9FFm-A", "text": "I am a big fan of Indian food albeit an unadventurous one.  I always get the Chicken Korma.  The creaminess of the korma just soothes my soul, especially when it is the right amount of spicy.  And there is garlic naan to be had.  I have been to Flavors three times now and each time I have left with the best kind of fire in my belly and smile across my face.  This place is almost never crowded and the service is pretty decent.  They play Bollywood movies for an added cultural effect.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2010-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "vhxFLqRok6r-D_aQz0s-JQ", "review_id": "G3IfBkYDQRSmoZy_e5UnmA", "text": "Reliable, quick and accomodating.  It's probably not the best or most authentic out there, but when you hae a hankering for chicken tikka masala, they really do make the best.  They are good at accomodating changes (I always get half chicken, half paneer) and they have a great mango lassi that doesn't taste like it came out of a premade tub.  Little pricey though.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2010-12-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HvaVgP0S0dFaCbBDIQIkag", "review_id": "d_V2Rx7Ze-VqSH3fHEm2nQ", "text": "Pretty standard Indian. And by standard, I mean this is what you will find at almost every Indian restaurant in America. I am no Genuine Indian food expert, but your average USA Indian restaurant will have the same menu as every other one, no matter what city or state you're in. \n\nThat being said, if that's what you're in the mood for, then FOI will fit the bill. It's in a very sad-looking strip mall, and the management of the restaurant must be very anxious about all of the empty storefronts around them. But the interior of the restaurant is spacious and comfortable, and when I walked in to pick up our takeout order, I was immediatelly greeted by a very friendly host. \n\nThe food was good, as far as overly-oily typical Indian fare goes. We ordered the Tandoori chicken, Tandoori fish, naan, and a cauliflower and potato dish. All were very tasty and served with basmati rice. \n\nI have two criticisms of the food:\n1)the onions in the tandoori dishes were raw. Perhaps if we had eaten there, they would have been served in a cast-iron skillet, which would have improved matters. I'll withhold final judgment until we try it again. The meats were all very good, though.\n\n2)OILY. Oh my goodness, there must have been equal parts oil and vegetables in the cauliflower dish. I wonder if Indian restaurants are under the impression that Americans really do want their food swimming in oil and that's why they make it that way, or if true Indian food, in India, is also as oily as what you'll find at restaurants here? I don't have the answer. \n\n**I will put in a plug here for Bombay Spice, at Tatum and Shea, which is Indian food made healthfully, without nearly as much oil or cream as most restaurants. I wish I could count on that everywhere. **\n\nSo, it was a solid 3-star experience, given that it met my expectations of very oily, very tasty average Indian food. It would definitely earn another star or two if someone in the kitchen made an effort to cook with health in mind. It's really not hard.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2011-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "0LuN0DGTCkzpjAD3NyNN8w", "review_id": "9KS758NV77k8CaaukjBh7g", "text": "My friend and I decided last minute that we wanted to go out to eat last night instead of staying in. Since it was a holiday we didn't want to try our luck at any of the restaurants nearby so we headed over to Flavors of India which is right down the street. \n\nThe place was a lot cuter and nicer inside than expected. We were seated right away at a large booth and the hostess gave me a rose for the holiday. They had a special of a large plate of grilled meats for $13.95 which our waiter said was enough for 2. So we split that and also ordered our usuals, Paneek Pakor and Naan. Our waiter also suggested Indian Beer, and I can't remember the name of it, but it was very good. \n\nThe food was all very, very good. The naan was much better than the other Indian restaurant we frequent. I can't wait to go back to try my favorites (butter chicken and tikka masala) although everything they had looked so, so good. \n\nI was really impressed overall and I love supporting local businesses like this one.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2011-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wiqyTpHUG3diuTXcdqjlsg", "review_id": "mFTJcdY8nxGZR_CWCwEczA", "text": "I only stopped in for takeout.  The employees were very helpful and attending while I waited.  The restaurant was slow to middlin' for a Friday evening - but the smell was mouthwatering from the parking lot.  My food was fantastic and the nice sized portions ($11 or so for my meal, plus rice and nan) afforded me lunch the following day.  We'll definitely be back for more!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2011-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qeVLQCePbacAwFL9mBaRbQ", "review_id": "OiZwnoV9YL3x3rRquDPmEA", "text": "It's fine. The dining area is too dark and the lunch buffet is mediocre. I have a feeling dinner is a better bet than lunch, but haven't had the desire to bother given the mediocre service and lack of options at lunch.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 2, "date": "2012-01-11", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "IhbboazAqdNxz9tg5T2rkw", "review_id": "TLTcYNzfd2t5pjOK1NlOjg", "text": "At first glance, I almost turned around and got back into my car. It was in a dark stripmall, everything in that stripmall was closed, etc. The husband and I walked in to an almost empty restaurant, again I almost ran. I'm so glad I didn't. To put it simply...I adored this place! The service was great (not overly attentive but didn't ignore us), the decour was great and more importantly the food was great! I had the lamb Marsala (mild) and found it delicious. My husband enjoyed his meal too. This place is definately on our list of places to go.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2012-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RTJTKHU5U0GSBpdGbh4eEA", "review_id": "LCu-UCWzizbS2Fnd2q_XLw", "text": "We eat here for lunch quite often and love the food! Service is great and the dishes are always on the spot when we eat here....highly recommend!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2012-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jtoMxWFYqNMECS6Q6CdU8g", "review_id": "Roo_lLkEN51QPB9yPNi-qA", "text": "Great dinner and reasonable prices. Server gave us lots of attention even though the place was packed. We've come here several times and also been happy. Glad we live close.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2014-01-18", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 0}, "user_id": "EWHQYclHZu3WDyaaG5irUg", "review_id": "oRRbadLpcDLZ8aw9dXgs7Q", "text": "My newest last meal. \n\nWhen I die, I'm going to miss my crummy Dallas Cowboys and eating. Finally, a place that gives me what I want!!!\n\nExtra extra hot and spicy, extra garlic chicken vindaloo. Get it if you love the spice.  \n\nJoin me.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2014-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UvOdvgUmqx8PdFJLvVOuZA", "review_id": "qAb7aaYbM-K6sS9fxKnueg", "text": "Decided to try this place for the first time since I was in the area. I love ethnic food, especially indian, and I've tried a couple in the valley, however none have been as good as this one! The vibe is calming yet the music makes it a little upbeat. If you're going for something low-key, this is the place! \n\nThe food was great, a little spicy, so if you're not into that I'd ask for Mild. But the service was great, I had the pleasure of being waited on by the owner's son, who is extremely cute. If only I was a few years younger :)", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2014-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QMiHZJC-BgkkAnj0DVZjTw", "review_id": "08S2Y38yRXsJL8STbC8omA", "text": "My favorite Indian food in Phoenix. The menu is huge, the takeout is quick and always fresh.  The only Indian restaurant that does \"Indian spicy\" correctly. \n\nIt is a little quiet, and could do with more ambience, but the quality of the food more than makes up for it.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2014-12-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F6MQ_wwsvSpa-FWygNlkdw", "review_id": "3c24M6XG0zOg4Zik0yxdzw", "text": "Just searched on yelp and went there with friends. The food was really nice. Liked the chicken makhani that I ordered, my friend ordered paneer masala and it was yummy ! They charge you $0.99 per bowl of rice, but definitely worth it , it had a great taste !! Overall very satisfied with the food, the service could have been better due to which I am going for 4/5", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2014-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "__4B6UHA7x9lXOsZanUC0Q", "review_id": "qIJz1Yz79DmkeQvI-GUR_g", "text": "It was a nice restaurant. Coming from bay area what surprised me was extra money for salad, extra chatnis etc. Food was pretty good when i compare it to india delhi palace. What we ordered:\nDal tadka: was pretty good\nGobi Manchurian: was hopeless\nPaneer was tasty\n\n\nAll in all the food was good and i would recommend people going to Phoenix to have food at this place once.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2014-12-30", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 0}, "user_id": "-9G7cH_cBwwgcJFLrSynRA", "review_id": "yFuvqFIj5FgahRsl1LP9AQ", "text": "Ate here a few times and the food was good. Then on our last visit we opened our menus and baby roaches fell out.... NOPE!\n\nhaven't been back since.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 1, "date": "2015-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_AyoML64uHlWrFbbPRieXg", "review_id": "QHL_urTxnjes08Pg0SvWcw", "text": "My friend from the U.K. Showed me this place years ago. I still go there to this day. The staff are very friendly and the food never disappoints.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2015-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "hn_DclKLzdxABRGGAuqKgg", "review_id": "9_zfahr2BvCyjzju06LE7w", "text": "Small buffet with some OK dishes. I thought the chick peas were cooked well and flavored nicely. The chicken curry was spicy but executed poorly. The rice in the buffet line was old. The fresh naan was nice but we were ready to leave by the time they brought it to our table, which made the meal all the more sad. Not coming back.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 2, "date": "2015-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OHalNcFle43Ly9KqIqAmRA", "review_id": "mIOAD57YdcZP-S94F6unBg", "text": "This place is a bit pricey for dinner. Chicken vindaloo, rice, and naan ran me $17. I ordered spicy, but it was closer to a spice level of medium. Portions were about what to be expected, maybe a touch small on the vindaloo. The chicken vindaloo was good but was nearly half potatoes, not what I am used to. Naan was warm, tasty and not undercooked or served cold like some other restaurants I have been too.\n\nI would like to rate this place higher, but the price makes justifying that out of the question. It is standard Indian fair that is good, it just simply isn't great.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2015-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "foBgKqvbfwanA6EK0xAYxg", "review_id": "wq1CJC3_WwA1iAU_pTzeyQ", "text": "Just finished with the lunch buffet here and I must say they exceeded my expectations. The service was great and the food was better. I will definitely go back and order off the dinner menue. If thd buffet was this good I'm sure the dinner items can only be better.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2015-02-03", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "mvNxfRNBSY-lJzOpsr8-tQ", "review_id": "pTWf6G_CZOuasc0p03b4rw", "text": "If not for the slow naan bread delivery this would most certainly be a 5 star review. The food is delicious and for the price it can not be beat. The lunch buffet is always a smart choice and I feel I have to specifically point out how fresh and insanely tasty the naan bread is. I would come here for that alone.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2015-02-04", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "fi5y6-daDzTIQ7wOKaR7xg", "review_id": "EIR1AhrnNeFeyOy448KoKQ", "text": "This is a great place to drop in for a quick lunch.  Everything is served buffet style, so you can arrive and immediately start eating.  I would give 5 stars, but the service is super slow and getting some naan bread brought to your table can be a chore.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2015-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TZmYyfKgjnlY1BtS9mTi0w", "review_id": "KqZjuPhiozs-mksNqhMj2w", "text": "My favorite Indian restaurant. I was taken here first on a job interview when I flew into town. Remained a regular stop for me for last 10 years. I still visit any chance I get when in Phoenix. Lunch buffet has only a few dishes but they excellent and fresh.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2015-02-11", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "fcFfdEbHK-bx2vJlKIpzMA", "review_id": "E-c3paJNq2lbBjhcS2pRrA", "text": "worst customer service ever!! dont go here ever.. would have given it zero stars if possible..!!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 1, "date": "2015-02-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "ltw3G32RME0vhwivkFNwug", "review_id": "xCszeLrzwTKlSsPbYtyRwA", "text": "Bad restaurant.... Never come again\nFood was very bad... Don't come here\nWe came from California and owner was so rude", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 1, "date": "2015-02-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "9PRRm4QrU5LNkRellejTEQ", "review_id": "Y2k_sY-6xMFOtCoJ-_G9yA", "text": "Worst food ever I had in my life in all Indian resturant I tried in my life I ordered tikka masala and mix grill platter each chicken piece was more than half pound worst garlic naan... I was hungry but I Cudnt eat anything my money was wasted", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 1, "date": "2015-02-24", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "NPzNkzMlZAxuDWEkm1Nb8A", "review_id": "OQXTL5ysLYES1f67UfgqFw", "text": "I am in Phoenix for business and I always have a craving for Indian food. I asked around the office where I could find some great Indian Food! I am pretty simple when it comes to indian food, all I want is butter chicken rice and naan oh and Mango Lassi. I ordered the food to go and was so excited to get back to my hotel room to devour this food. \n\nTo my surprise, the butter chicken taste like Tomato soup with chicken in it. I know the butter chicken is a tomato base but this butter chicken was not very good. Maybe I went on a bad day.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 1, "date": "2015-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Td7Nxzak524kEyYB3I-NzA", "review_id": "Dn7omVd5fufDr1IdU6zqEw", "text": "Thank you for the most amazing dinner tonight - we are from Chicago and we were incredibly impressed. We will be back. Thank you so, so much!\n\nHighlights were delicious fish, peas and potato, chai and dessert. Elegant, sumptuous and friendly. Pure gratitude.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2015-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gDcqui7bKoZGAR6jLmpoNw", "review_id": "nDTrrRsOFSddR_Blalz1fQ", "text": "The alligator was better than what we had in New Orleans!  Red beans and rice were great, fried shrimp was great fried chicken was great.  Fried green tomatoes were chips and soggy.  Seasoning for the breading was good, but a quarter cut would have been better.  They don't serve alcohol.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2015-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ACPvn9jxLA-fXDGN-rfkHQ", "review_id": "yjxxNopYFPFwXobLOu5DbQ", "text": "Went here for lunch and it wasn't the first time I've been here but I was still pleasantly surprised by the food which was amazing! The chicken makhani, which in most places means big chunks of tough chicken, was surprisingly tender and delicious. The vegetable pakoras were absolutely delicious, the best I've had in the valley. The mushrooms and eggplant dish were both very good. The mango pudding, although sounds plain, was absolutely delicious and tastes fresh. The chai tea actually tasted like chai tea and not like tea with milk, you can actually taste the spices in this one.  I was very pleased with my meal. The only downside I can say is that for a buffet it is a bit more pricey than other buffets, but this delicious food is definitely worth the extra expense. This place really does live up to its name Flavors of India. If you love Indian food you must eat here.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2015-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "CAlxnkAuqNetlUmWtCQ_eQ", "review_id": "8DqY1EGOXvMHNqlzeVTvhg", "text": "This used to be one of my favorite Indian restaurants when I lived closer.\nThe last time that I visited it wasn't as spectacular as it used to be, but it is still really good and I would recommend it.\nIt is nice dining, linen table clothes and napkins, well dressed staff, so it can be a nice evening out, but you wouldn't feel out of place dressed casually, either.\nThe service is good and the menu has a lot of great items.\nAnd, of course, a great selection of vegetarian dishes, as most Indian restaurants.", "business_id": "vA9aCw2kTgN8p2SLdm2mDA", "stars": 3, "date": "2008-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lHZsCZ4KZsxeiixQ1lBxLA", "review_id": "_dJ7UfbX5zSgPXfB26SX1A", "text": "This place used to be a favorite but the quality continues to deteriorate.  It appears there are new owners.  \n\nThe buffet items are overly greasy and spiced oddly.\n\nLast time I was in not one staff person there even said a word to us.  It was weird!", "business_id": "vA9aCw2kTgN8p2SLdm2mDA", "stars": 2, "date": "2009-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "NQDdhVEhAvqirltBhNXeCQ", "review_id": "UOAtOKaZcMzMc2rn_xEibw", "text": "Just stopped for lunch before driving off. Food was below average. They had about 3 vegetable dishes and 3 chicken dishes. Nothing great .. Probably won't ever go back.", "business_id": "vA9aCw2kTgN8p2SLdm2mDA", "stars": 2, "date": "2010-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kl-r-eY4PpsvWvLwpyTzuA", "review_id": "1W0x824IcZn2LTGJdDe8Fw", "text": "Good Food....The Part-Time Hostess Is Awesome....", "business_id": "vA9aCw2kTgN8p2SLdm2mDA", "stars": 3, "date": "2010-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5caTZPPbG49_t_1PLzIKcw", "review_id": "Wd0cNHX3M0GmSPMcgoHkIQ", "text": "Don't go! On a scale of 1 to 10, I would give the food a 3, service 3 and ambiance 5. Prices are high and serving size small. \n\nThe tandoori chicken is the worst I have eaten in AZ. For a moment there I was envying my dog's chew stick. Really, it sucked.\n\nWonder how they survive.", "business_id": "vA9aCw2kTgN8p2SLdm2mDA", "stars": 2, "date": "2011-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Hi7VohxSS5OBt98w4j8t4A", "review_id": "PzhPjXZC5AHngisl6m1iFQ", "text": "I made the mistake of going here once for lunch. Blah. The food wasn't good and the service was bad. They seemed to hate me for some reason.", "business_id": "vA9aCw2kTgN8p2SLdm2mDA", "stars": 2, "date": "2011-01-08", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "7brf9WC0Gr_7bUBXEHs9FA", "review_id": "Nj36iAivvdfgsTB0R-nnTQ", "text": "I stopped by the restaurant a few Saturdays ago for a quick buffet lunch.  The place is generally dark with tables, not booths.  The place is clean, but the mood is chaotic; papers on some tables, chairs stacked, boxes around, etc.  It is difficult to have a relaxing lunch when the atmosphere is simply distracting.\n\nI said about four words to the waiter (literally two thank yous for the water refill).\n\nThe food is basic Indian and is good, not great - tandoori chicken, palak pannear, etc.  I was hoping for something unique, or at least a signature dish, but my hope was not realized.\n\nThe price of the buffett is under $10.00.  It is worth it, but I do not have a strong desire to return any time soon.", "business_id": "vA9aCw2kTgN8p2SLdm2mDA", "stars": 3, "date": "2012-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DBCgOkxxF3AhSKDAqQcR7g", "review_id": "3o2aSVXn0JRWyUfRNb9o3Q", "text": "I'm not an Indian food connoisseur. I'd only eaten it once before, I can't even remember what I had and it was purchased from a little hole-in-the-wall in NYC. Lately, for some reason, I've been wanting to try more. I took some friends and family to Star of India on a Saturday night. The place is dark and the smell is strong. It wasn't very crowded, but we showed up a little late. The food was delicious and most of the portions were huge. We had an assortment of veggie and meat dishes. The rice was particularly good. Service was awesome - our waiter (who I think may have been an owner or manager) was very attentive and brought us extra rice and dessert on the house. \n\nIt's a little more expensive than my regular restaurants, but I'm definitely going back!", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2008-02-25", "type": "review"}
{"votes": {"funny": 9, "useful": 7, "cool": 6}, "user_id": "emNXAAschSlcvqmDZFj5TA", "review_id": "P2LK1hTIkG6ysXC0iiha-w", "text": "I've lived here for three years and this was my first visit to Star of India. Not sure what took so long, other than I had no idea it was here ... buried in the back corner of the strip mall in Ahwatukee that houses the Trader Joe's I frequent. (That's where I procure my cornbread and my tea tree lavender liquid dish soap, among other staples.)\n\nAnyhow, I give Star of India 3.5 stars. The food was great and the digs were what you might expect them to be for an Indian restaurant buried in the back corner of a strip mall in Ahwatukee: simple but clean. We didn't come here looking for a scene, we came in search of fine ethnic eats, so the modest decorum was cool by us. And the eats were indeed fine and ethnic.\n\nThe staff was friendly. I do have some advice for our server, however: you have a nice smile and were seemingly helpful in making suggestions from the menu, but try being a little more reassuring once I settle on something. I have enough uncertainty in my life. Example:\n\nServer: \"How spicy do you like your food, on a scale of one to ten?\"\n\nMe: (thinking, 'Gee, this is nice. I'm used to the one-to-five scale offered me by most Thai restaurants. There must be a favorable exchange rate right now, what with the economy and all.') \"I like my food mild to medium, so let's say five.\"\n\nServer: \"Are you sure?\"\n\nMe: \"Ummm ... I think so. Is that considered mild to medium?\"\n\nServer: \"Is this your first time eating here?\"\n\nMe: \"Yes.\"\n\nServer: \"You may want to go easy, then.\"\n\nMe: \"So ... three?\"\n\nServer: \"Really?\"\n\nMe: (thinking, 'Don't do this to me. I have enough uncertainty in my life') \"I don't know. Again, it's my first time eating here, so I don't have a barometer by which to measure your one to ten scale. What do you suggest?\"\n\nServer: \"Five should be good for you.\"\n\nMe: (perplexed) \"That's what I was originally thinking.\"\n\nServer: \"Do four then.\"\n\nMe: (again thinking, 'Don't do this to me. I have enough uncertainty in my life') \"Let's go with that.\"\n\nServer: \"Positive?\"\n\nMe: (really unsure now) \"YES!\"\n\nThe Aloo Parantha was great to start with. It's like naan, only whole wheat and stuffed with potatoes and green peas. Tasty. My Chicken Tikka Masala was very good, although I will do five next time. Alexis S. had Vegetable Korma and they were very accommodating so as to prepare it without nuts. (Something she has grown increasingly intolerant to, especially recently. Sigh. Lucky me.) I snuck a taste when she bent down to pick up her napkin. It was excellent. The Korma, I mean.\n\nUncertainty in my life aside, one thing I'm fairly certainly certain of is that I'm pretty sure we'll be going back to Star of India. I must try the korma next time. And yes, I'm sure! (I think.)", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 3, "date": "2008-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZsqSDOeYGb-DinY6x3-YgQ", "review_id": "FZ1tMOMc03GuzFjyPry0jQ", "text": "The best Indian food that I have had since I left Seattle and on par with the best that I have ever had. Loved the Tandoori Chicken and Garlic Naan. The rice was outstanding, very aromatic. The rest of the meal was equally excellent. Although I don't know what it was. My wife orders and I just enjoy. Some vegetable plate, some spinach maybe some potato looking things. I don't know the names but I do know great food ! Happy we found it and will be back.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2009-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8-98T_0Z1l9hBYXHfaHFPQ", "review_id": "nASrp8X6DG6eqUO4QRUREg", "text": "The food was pretty good, and the 1-10 spicy scale they offered was helpful. Service was excellent. Naan was excellent. The only reason i won't go back is because it's too far, and there are definitely indian food places that are on the same par with this one closer to my house.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 3, "date": "2009-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xCBFKNXyfhyQtLsABNpgcw", "review_id": "7ypvMOvddSnW6wNJ6fxgqA", "text": "Well, my beautiful bride and I were headed to the Indian Paradise in Chandler... closed for good (we sought yelp for this one). So we remembered the Star of India in which we visited a couple years prior. We remembered the food was good (not great), but we were not impressed at the time because this restaurant was not ready to open at their scheduled time; and not only were they not open, it seemed that they were just arriving.\n In todays competitive market, I dont know how a restaurant could not be ready at 5pm, we had to wait another 15 minutes to get in and another 15 to place our order. They really should be ready at 4pm... I believe restaurants who suit their own schedule instead of what people seek, will be out of business soon. I don't eat dinner that early, but there are many folks that prefer that time slot. \n     \n   Tonight we got there late... 9pm; I know we can't expext the best service or quality of food 1-hour prior to closing, but why not. \nWell, tonight we had three issues:\n\n1) We were seated quickly by the water girl, but waited a good ten minutes to figure out who was our waiter/waitress before we could even ask a question about the menu or even place a drink order.\n2) The owners daughter was running around and at times yelling or crying. Not really a big, big issue because we have young children, and when we first sat down this cute little girl landed on my wifes lap; we have a daughter around her age, but there are times when you leave the kids at the grandparents home and rarely get some time for one another, and you don't want to hear yelling or crying, especially from the owners child. It tells me they either are not watching her or they are not paying attention to their business. Maybe that is why I found a strand of what seemed to be part of a brush of some sort in my food. The female owner/waitress tried to play it off as a part of an herb. Not quite...I know what it was and my wife verified it\n3) Their curry, rice, and naun bread is tastey, but their veggie kofta balls in the curry were hard and the lamb (lamb curry) seemed a few days old.\n\nI see some good reviews here, but we will not be back; they did try to accomodate the bristle brush strand with a $10 coupon and free dessert; but the lack of smiles, poor service, semi fresh food, and denial of the bristle strand, will have us put this \"Star\" out.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 2, "date": "2011-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fMfy2O2nPk3XWWmWSbszag", "review_id": "OomGzqdzr2mh8g5l3cO03Q", "text": "I went for lunch and it was very good.  The reason why it isn't 5 stars is because the selection was limited.  Definitely a place to go for lunch.  :)", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2011-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "btTx6B1JDp0cAiGtJ21xsQ", "review_id": "xac_h5HwlaiUc9yz2KX-2g", "text": "I LOVE Star of India. I have been there three times, and every time, the service and the food were spot-on. You absolutely cannot beat their buffet. They have a huge spread with tons of vegetarian options-- there's something for everyone. On days when they don't have the buffet, they also have a sampler platter on their menu that is good. The buffet and the sampler are great introductions for people who have never had Indian food before. Their vegetable samosas with yogurt sauce are my personal favorite. This is a great restaurant for both vegetarians and omnivores alike.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2012-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "U1VhMJAKHaTqCSIp9RoRcg", "review_id": "5jqJpDe8P22HtS4GH4kZ_A", "text": "This is by far my favorite Indian restaurant in the Phoenix area and the best!\n\nThe food is very delicious and the owner, Preet, is very hospitable.\n\nToo bad I no longer live in Ahwatukee.  All I could think of when I was at a restaurant down the street from my place earlier, is how mouth-watering Star of India's chicken tikka masala is.... Yumm!\n\nA must visit!", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2012-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "_wO4h6Tq3INW6wYAK1oFYA", "review_id": "5dx6vNvKmbieZdHo-YzjUg", "text": "Very delicious! And really great prices! I had the Tandoori Shrimp Masala (Medium) and it was absolutely amazing. Hubby ordered the Lamb Vindaloo and he really enjoyed it. His only complaint was that he went to order it \"Hot\" and after an \"Are you sure?\" from the server he changed it to \"Med-Hot\" and he wished it was hotter. My medium was flavorful and I was very pleased with it though. Everyone has a different take on heat level, so he will try it Hot next time and I am sure it will be great. We split an order of Garlic Naan which was absolutely delicious! Overall, a quiet little place, with good service and great prices. We have finally found a restaurant in Awhatukee where we were not disappointed! We will definitely be back.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2012-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DGxe6OiaTYLxbqrcwks6-Q", "review_id": "QTsLxJlRDusjTb3pjHSIyg", "text": "First time we went I was very impressed...owner is such a nice man. Food was really good.  Our seconds experience we ordered for takeout and not as good. Latest time we had a groupon. We were there for at least 2 hours. It was very warm, none of the tables were clean, service was terrible, there was a little girl running back and forth screaming and worst of all was the food. They have gotten very skimpy. I think our food was sitting for a while before it was served because all of it was cold. Too bad because it was so good the first time.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 2, "date": "2012-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x3k2jOCW1ZrWGFu9dNu7EQ", "review_id": "AnLe-BRzchF3EJMCI38_og", "text": "This is the best Indian food restaurant I have ever been to.  I highly recommend the lunch buffett - they usually have Chicken Tikka Masala, Tandoori Chicken and some type of lamb dish that I cannot think of right now.  The Naan bread that they bring you is also amazing.  I have lived in Phoenix for over 13 years and this place is better than anywhere else.  This the place to go if you like Indian food.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2013-01-22", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "8rmeO9dhjsMSVV-HF9ZsCw", "review_id": "2M-tmPc6pux9OwaLkGXtxg", "text": "food is better than average. the owner is a great guy.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2013-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "ap9zLoa3xuriOpURUcelgw", "review_id": "bMGY3XUksn0A0Qiaf-7SoQ", "text": "Great lunch buffet here today. Good selection and tasted freshly made. Good naan, too. I'd go back again.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2014-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4a5X_LLKAswF3P2pbS-GiA", "review_id": "vazV2zbqAu9dH3AcLS-zmg", "text": "This place has some the absolute best chicken tikka masal in the valley... The courteous staff makes it even that much better. This dish can range from mild to blow your taste buds hot but they always seem to get it just right unlike other places. I would recommend this place to any and everyone!!!!", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2014-01-30", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "oovShYF-Qz0twrwngcGqHg", "review_id": "t5acqED7b9x0aLs7pJrR_A", "text": "My favorite indian restaurant in the Phoenix area.  Staff are very friendly, give good recommendations.  Everything comes out fresh and hot.  They'll make your food as spicy as you can handle.  The meat samosas, chicken curry, chicken tikka masala, shrimp korma, aloo gobhi, naan, and garlic naan were all delicious.  It does take a little time for food to come out but that's because everything is prepared upon order.  Have to say, didn't want to write this review in hopes the place wouldn't get busier but I have to give them their dues.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2014-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4JPojjaxeeNvNj4jxisMZA", "review_id": "jBOWyaB7doRS4bc-qeZZGg", "text": "Very good food and the staff is friendly. The atmosphere is very India, and that's cool cause you definitely get the authentic experience being there. I loved eating with my hands (which is not a requirement, I just did it personally, I think that's what they do in India any way) and that was fun. The drinks are pretty reasonably priced. But for a buffet I would say it tasted pretty fresh and good, not tasting like the usual tasteless stale buffet. Definitely recommend this place!", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2014-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Gf-7bqM-dTaImuvfZGhJ2g", "review_id": "1i2UknWhsECM3tEL-Fo2eg", "text": "This place is absolutely amazing.  The service is incredible, and you can tell that they really care about their customers and the food they provide.  It seems to be family-run, and they are extremely attentive and helpful when a dumb American such as myself is trying to order things he doesn't know about or understand.\n\nThe food is awesome.  I like spicy food, and I order a '7' out of '10', which gives me some real heat and keeps me reaching for my Kingfisher beer.  Everything is amazing - perfectly spiced, cooked, and portioned.\n\nThe atmosphere is wonderful too.  I don't know what a traditional Indian place is supposed to look like, but it's authentic enough for me.  The last time I was here, there was a large indian family sitting near us, and they kept talking about how wonderful the food was, so apparently it's the real deal too.\n\nI confidently give this place 5 stars.  There is nothing I would change.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2014-02-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "0mnDDQPG4Rz1ZEugsPMt9g", "review_id": "XQaJlcmNMj34TPLvt8nvgw", "text": "Star of India was first recommended  to me five years ago but I was a bit hesistant because I had never tried Indian cuisine before and feeling a little adventurous one night we decided to give it a try we were amazed and instantly fell in love with this restaurant from the delicious food to the very kind owners who make sure that each experience there is as good as our first if not better. We have been to other Indian restaurants in the valley and in California but this place by far has won our hearts and taste buds.  We have taken many people here to try Indian food for their first time and each time they too fall in love with this restaurant. We love things extra hot and we are never disappointed with the spicy saag or tikka masala, my daughter loves things on the mild side and they always accommodate to her tastes as well. Don't forget to try the naan or the deserts too...Enjoy.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2014-02-18", "type": "review"}
