{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "nEYPahVwXGD2Pjvgkm7QqQ", "review_id": "5ClL6pOSc0LV0cKn-EXZiQ", "text": "I just realized they remodeled this one recently-ish. Well, in my world recently because it's been a while since I've been here.\n\nThey've added more seating which makes it way more conducive to having a meeting here. Which is my concern during the week. I imagine during the weekend it just fills up with tweens getting their sugar rush before hitting the movie theater. \n\nThe coffee, or tea for me.. Is still same old same old. I don't imagine one single Starbucks will break the mold and make original drinks...", "business_id": "3gmBc0qN_LtGbZAjTtHWZg", "stars": 3, "date": "2013-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_GinkIw8tpdWfxG_1j1CdQ", "review_id": "2_UnuPkJzFyvCPCP0MRd9g", "text": "I can remember the time when I used to strictly drink mocha frappuccinos from Starbuck's thinking that it was the be all end all to coffee in my younger teens. Don't we all miss those days of being so naive? \n\nAdmittedly, I never finish any coffee that I drink, not only because I'm apparently wasteful now that I think about it, but also because I'm a slow sipper and everything settles at the very end. Make no mistakes, I will finish any coffee drink from Tazza D'oro and at record speed. It is delicious to the very last drop and the best part is, they don't think that third degree burns go hand in hand with their coffee -- it's ready for drinking the moment you receive your order. Let's not forget about the food, which is also delicious. it's clear I have nothing bad to say about this establishment.\n\nSome of the staff remembers your order to a tee and all of them are always very courteous. The prices are reasonable and the location is great, tucked away in Highland Park.", "business_id": "83_p9vIqOq1TUIf3_GD7bA", "stars": 5, "date": "2011-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Iseb_IvqOEfY_p1m9OwTrw", "review_id": "cnpv29O9ZXkiBIqYdU2gHQ", "text": "Who would have thought that a vegan-friendly hipster restaurant would be one of the best places in Pittsburgh to feed a hangover? \n\nSeriously, go hungover, and you will be in love. Get a super-stuffed burrito. They put mashed potatoes in burritos along with hearty beans, scrambled eggs and cheese and yummy salsa. Your stomach will thank you. \n\nWhile you're waiting, have some coffee. At under $10 for a VERY filling burrito and a bottomless cup of coffee, I thought it was a great deal. \n\nIn addition to their regular menu, they also have daily specials and themed brunches. I can't wait to go back and try other things on the menu. It's great to have a full-service restaurant where you can get oodles of vegetarian items.", "business_id": "PzG0XmAmtXFs6Fdnubf41g", "stars": 4, "date": "2009-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "7KXsHW_EQYp26XNhqSCAxw", "review_id": "Ps_JqNOy0ywAsj67DSlMiA", "text": "I came into Quiet Storm not intending to have lunch, but just a latte and hang out to answer some emails for a little while (working from home makes me stir crazy, so bouncing around local coffeehouses, completely NOT fitting in with the crowd kinda makes my day sometimes). \n\nI walked up to the bar and was just going to grab a seat there, but super hipster server guy asked me to take a table, because it had an outlet to plug my laptop in. I didn't need to, but  ... good lookin' out. \n\nAnyway, ordered my latte - good espresso, but pretty weak foam. Served in a pint glass. That's fine. \n\nMenu actually looked really good, so I went for a sammy with apples, seitan sausage crumbles, and cheese. They offer different sides, but my super hipster server guy didn't ask me what I wanted; so being a newbie I figured maybe that was only with certain menu items. I was wrong, when the guy taking care of the table behind me was asked what he wanted. My fault for not speaking up. Sandwich was good, not to die for though, and frankly kinda small for $8. \n\nI'll finish with this: Internets are free, right? So, where's the code? Did I need to ask??\nI'll definitely go back though, intrigued by a few other things on the menu (like bbq tenders and pulled 'pork' quesadilla), and hopefully be a little more impressed.", "business_id": "PzG0XmAmtXFs6Fdnubf41g", "stars": 3, "date": "2012-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Nhvkukz5MECqEUQVfh6A6w", "review_id": "JAinls7R4idjhRdc92IHdA", "text": "Starbucks Coffee + Internet + Comfortable Seating =happy remote working experience.", "business_id": "f0eAe5PZMy_MEvxEEBYAcQ", "stars": 4, "date": "2015-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "9HCfCmd0t5GErgm7He6AeQ", "review_id": "X1O-zEkE0sI8aIrlnk991Q", "text": "My son and I stopped in here since he wanted to buy coffee. I looked around since it has been quite some time from my last visit here. They specialize in both coffee and tea. They have the tea brands you would normally see in a grocery store.\n\nThey also sell items to press your coffee as well as tea infusers to name a few. In the back there is a take out area if you want to order coffee, tea, or a sweet snack to boot.\n\nThe place was so crowded that a man asked us if we were in line. Both of us couldn't tell since we saw two groups of people opposite each other. Since we were headed to see a show, my son did not want to wait around to order his coffee.\n\nI really didn't get to try anything here but since I am familiar with the brands they carry it is nothing new than what you get at the grocery store. My son told me the coffee here is good so will have to check it out again on a future visit.", "business_id": "J7I85lTCEGr9-qp6AXPUjQ", "stars": 3, "date": "2015-12-12", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 3}, "user_id": "So32N7bSbUd1RwhFtI6jTQ", "review_id": "ks6uZ_ZKmk_Z35ab0wo87A", "text": "Yummy, yummy, yummy, I've got cheese in my tummy.\n\nThis place is very compact.  I felt a bit overwhelmed. There is just so much to look at.  On my visit to PFF I got a 16oz cappuccino and a grilled cheese with bacon. \nMaybe you are asking yourself how awesome can a grilled cheese sandwich really be please read on.\n\nThe cheese on my sandwich was melted all the way through no cold center to be found here.  The bacon was perfectly crisp too.  I was a little concerned about this because from across the deli counter I didn't see any real cook station.  It looks as if they are back there working with a microwave and a toaster oven.  But really I had nothing to worry about because the sandwich came out perfect.  There is some real magic happening behind that counter.  I seriously doubt I could ever hope to replicate that grilled cheese at home with my toaster oven...maybe it's industrial grade?\n\nBonus,  they served it with a little pickle.  \n\nThe cappuccino was also very good. The foam was knuckle deep. Now that's something you're not going to get a Dunkin Doughnuts. \n\nPrestogeorge makes food...but there is only one table inside that could probably seat about 4 people comfortably.  You might want to be mindful of that in case you're looking to dine in.  I was able to snag the table with it being 7 degrees outside...it wasn't too busy and it was Wednesday too.\n\nMy only hang up is that the 16oz drink is the smallest drink size.  I ended up wasting about 1/3rd of my beverage.", "business_id": "TASUnYvk_nvTUyKtroCJSA", "stars": 5, "date": "2013-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jrOkca2HJ1-C5mpnRYHuMg", "review_id": "MzfwSfpEntVhruCkxYTrIQ", "text": "The kinda place that makes you wonder how Starbucks ever became a thing.  Pastries are amazing.   Iced Tea is always fresh.  Best coffee shop in the area.", "business_id": "DJKpwLp4mISNDNDpNz67tw", "stars": 5, "date": "2015-02-15", "type": "review"}
{"votes": {"funny": 6, "useful": 3, "cool": 2}, "user_id": "FDG85sQMtHuI2a0ix9ZBcw", "review_id": "iyftLY31Q_iNhySgFO6RWg", "text": "ok ok ok.... (I am a \"give'm a couple tries 1st kinda guy) so, I made my way over to grab some kinda of warm pick-me up during this soggy, melancholy, grey day. \n\nNo lines, I ordered a Chai tea something.\n\nI asked the guy behind the counter, \"Whats up with a secret card society \"S.E.S\".. The guy laughed his butt off. I said i've been here a few times and noticed a few people using them. Asked him is it some type of \"Fight Club\" thing? What do i have to do to get one.\n\nHe was clutching his stomach at that point.\n\nAnyway, he gave me one. (still don't know what it does) and rang me up. I left with a \"customer card\" (see picture), cup of Jo, and still unsure what I asked for in this card. \n\nI guess i'll tape up my hands, do push ups and wait to see. \n\nlol\n\ngo enjoy!!", "business_id": "5j704vZBOmW88yJLhnCOEA", "stars": 3, "date": "2012-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "sg5ldkbhYUjd-P7pvg9Esw", "review_id": "_pi4Fj7RZceS1yghUWCioQ", "text": "Fast And friendly. The lunch rush subsides by 1pm. Go for the potato salad as your side. My go to is the falafel.", "business_id": "qqVmZ3H7j06pcJFaSA4pcg", "stars": 5, "date": "2011-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "LRd5CZ8tkdV2Pa4Zz2pSbw", "review_id": "uJKKFBW1V4Hlb9-ZAcoFTA", "text": "OK, it's close to UNCC and it has outdoor seating.  Beyond that, this Starbucks ain't nothin' special!  The biggest negative is the lack of seating.  There might be 5 of those super small round tables with 2 chairs and one small section of the soft cushion over-sized chairs.  The staff is friendly but beware that the line can get very long very quick.  The worst that I've experienced is around 7:30 AM on a weekday.  I'm thinking many students and professors who have those 8AM classes just have to soak up the caffeine!\n\nI really don't visit here unless I have a meeting and even then I try to relocate to the local panera that also has free Wi-Fi or a similar venue.  It just cramps my style.", "business_id": "UdcvNApAUs7Z7NkFSFTl8w", "stars": 3, "date": "2011-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Q_GXQnF7sSwA1uCWC6uJSg", "review_id": "1cpxNcl8iecbZX9ITUJxQw", "text": "It's going downhill.  We love an occasional coffee date this morning DH ordered a peppermint white mocha, I had a latte with raw sugar and a piece of gingerbread.  His peppermint mocha wasn't,maybe gingerbread? My loaf was stale and when I took it to the counter the manager was condescending and told me it's a dense loaf and then yelled at the \"food girl\" to get me a different piece, she was apologetic and very sweet.  I think the demise of this place will be the manager.", "business_id": "3jpKGDkFrCHpjEYVEgcG0A", "stars": 2, "date": "2015-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "9yAsh0pQgH7451dHv2k4sw", "review_id": "ldEQUsMBNalfvXOC20fRqQ", "text": "I'm not going to do too much of an in-depth review, most of the basics have already been covered below....but I must note that their lattes are astounding. I never actually had a latte prior to going here, but just decided to go for it since they have $2 latte Wednesdays....the Carmel Latte here is excellent, now it's a mainstay of mine. Also great for its obvious proximity to the Psych building, even though I've only taken one class there. A little excessive on the Starbuck's bashing though...hoorah pretention!", "business_id": "40KhR3J9snVooFfTdc-8ZQ", "stars": 4, "date": "2008-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "67KYMQXVpzdk0UKC0XOpCQ", "review_id": "h_c0Efowj_F2V4_wo6KELA", "text": "My boyfriend is interviewing at Volition today, and I wanted to spend my time studying, reading & yelping (of course). Kopi was a random choice & it fits my purposes perfectly! It's quiet, large (no problem finding a table), and I am in good company. I'll have no problem spending hours here, without feeling pressured to keep buying coffee. They even have sandwiches for when I'm hungry again!\n\nIf we move here, I'll be back to Kopi!", "business_id": "yzInxReAkf7r0aRbwj02Yw", "stars": 3, "date": "2010-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HqaXK9toBpQdcz-0-rVwKw", "review_id": "XHRQUwgIxNAERK1E2eDZ5w", "text": "If you like hot chocolate as much as I do, this is the place to be in CU. They specialize in chocolate, so there are several types of hot chocolate you can get. My favorite is the Ocumarin, which is dark chocolate infused with a blend of spices. The mix of chocolate and spiciness can be shocking, but it is well worth trying. They also have cafe standards- coffees, Italian sodas, ice-cream drinks, pastries etc. \n\nOf course there are chocolates, but they are pricey (some are $3 a piece!) and lack any sort of smash that would make them worth paying for. I hate to say it, but they are very American and their texture is somewhat commercial in its glossiness. They don't exactly melt in your mouth.\n\nAlso, lack of free wireless makes academic types very sad. Nearly every other coffee shop around has wireless, so it's a bit strange that they don't.", "business_id": "31LKw0AjFdCvGH2fIE0cwQ", "stars": 4, "date": "2006-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1GL8b9uNkrk3Udq5gSIIFA", "review_id": "46b96i1nOBYjmX8BtEpNsA", "text": "We have all been to Starbucks, and know the deal, so I will just say that the baristas here are super friendly, and the atmosphere is very welcoming.  Plenty of seating, and you will always find an array of people on their computers, reading, etc.", "business_id": "TGb6D6zmx1KP4aDDH5Aihw", "stars": 5, "date": "2011-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e4TQFVfepzHf--hnBsjntg", "review_id": "MWzzL3wyRQzKxwI4OywHAA", "text": "UPDATE 2/8/06\r\n\r\nWell, I had to take a star off because the Spanish Latte at LGO (Le Grande Orange) seriously kicks ass.  I hate to say it, but Hava Java just can't hold a candle to it.  But I still really like Hava Java for coffee and it is a nice place to sit.  It also had the bonus of being connected to a genuine gelatoria.\r\n\r\n\r\n++++++++++++++\r\n\r\nThe best coffee I have had in Phoenix.  I wouldn't give it 5 stars in the greater coffee universe, but it is way better than what you will find at Starbucks or Coffee Plantation (which hardly qualifies as coffee in my book).  Until I find better in Phoenix/Scottsdale I will let the rating stand.  Bonus points for being connected to a gelato shop.  Baked goods/pasteries are average.  Pleasant atmosphere.", "business_id": "2h9LsLPdJ7OvZrYJZhVdAw", "stars": 4, "date": "2006-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bFV0q0Q-EeWJamY74lPxQA", "review_id": "0i4VCNDxawFgRUd_QJHpZA", "text": "My iced tea was spot on, service was courteous, wifi was free, patio was pretty relaxed. All in all my Hava Java experience was pleasant but nothing to go crazy over. \n\nI will say, my hibiscus green tea was delicious! Perfect level of sweetness with a finished that makes you pucker just enough. And at $3 it was definitely reasonably priced for a 32oz tea! \n\nThe inside of the shop was nice. It's attached to the Gelato Spot so you can roam freely between the two which is unique. But it's lacking something. The atmosphere was pretty forgettable. I wasn't dying to stay and hangout by any means. The patio is very pleasant but right next to a bustling parking lot. Aside from sucking down the fumes of BMWs, Mercedes, and Range Rovers for the duration of your time on the patio, it's really nice. They have decorated it with some trees and stuff and it's well shaded. \n\nHava Java is good. It's slightly overrun rich moms and private school kids, but for a good iced tea, it's a good choice.", "business_id": "2h9LsLPdJ7OvZrYJZhVdAw", "stars": 4, "date": "2015-02-27", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "8UFPWVBy5cTjNwLYD_7teQ", "review_id": "-SsECcOR_7wMgiY1Z78S7w", "text": "Awesome coffee and tea. Awesome employees and treats.   One thing that's awkward are the mass amount of creepy old men. Really creepy.   Eeeeh", "business_id": "Mb46iSlA4qmTwXf-WrqtQA", "stars": 4, "date": "2010-01-22", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 3}, "user_id": "7cR92zkDv4W3kqzii6axvg", "review_id": "J_gRRu8cFqVDm5b5D4LWPw", "text": "What a great little neighborhood donut shop!\n\nFree Wi-Fi, great cappuccinos, and DONUTS! What else do you need?!\n\nOh, and they are actually doing Yelp deals! I did my first Yelp deal here, getting a discount on my order for checking in on Yelp!\n\nIt's like free donuts! Woot!!", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 3, "date": "2011-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pjx0YGCx-MkSXO0_D-sL_Q", "review_id": "q82yXnfJw0MRHI5HJN09qw", "text": "Always fresh, coffee is roasted in the store once or twice a week and nicely blended. The owner and staff are real people and involved in the community. Doesn't have the corporate clone franchise vibe.", "business_id": "4eFIVmbeCvJGCrhzmd-VYA", "stars": 5, "date": "2015-12-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "66tWp8ThwPATFUxYNPyYLw", "review_id": "xwXztPIBFVoV3SV_FWn_wA", "text": "So I'm actually sitting here in Seattle Espresso, writing this review on my new laptop using their free Wi-Fi.\n\nI'm not much of a coffee drinker.  I only use a french press at home, and only buy beans if I'm expecting someone to come over that might want coffee.  When I do drink it, I want something that's above the cut.  \n\nI came in an noticed the atmosphere first, lots of live plants, and some interesting artwork.  For a long, skinny store, they've made if feel spacious.  It's clean and moderately busy for a Sunday morning on a long holiday weekend. The music is nice, and at reasonable background volume, and with my iPod on, I can tune everyone out if I want.  The lighting here is also great for working on a laptop, not too bright, so I'm not glare blind, but bright enough I don't feel like I'm in a cave.  For those who have selected to read newspapers, there's nice lighting above each of the booths that provides plenty of reading light.\n\nThey were very friendly, and from some of the other people here, I can tell they remember, and care about their regulars.  I decided to try the White Russian Mocha, hot (they do offer it in iced as well.)\n\nI'm a little hungry, but sadly their pastry case had nothing that made me want to buy.  The only thing that stood out in the random assortment of typical muffins and danish was the banana nut bread, but as I'm mildly allergic to bananas, I decided not to risk it.\n\nAs I sit here and sip the coffee, I'm very pleased.  It's great, full flavor, and a nice sweet mocha flavor without being cloying.  When I have a Frappuchino, I always feel as if I'm about to go into diabetic shock and it leaves a weird film in my mouth.  This has none of that.\n\nIn fact, this drink is something I would make for myself at home, if I wasn't so lazy.  So they get high marks on service and coffee, but they could do more with the pastries for a high rank.", "business_id": "C5TGxBqOae4uKCtpHGFMEw", "stars": 4, "date": "2010-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WLw5aQWdFPNPe_RfZy_Qkg", "review_id": "6xafcm3wWppZyciZaEOd-Q", "text": "You always know what you ate going to get when you are at starbucks, but you can't always assume it will be a great experience. Here you can. Everyone who works here is a great person and they amazongly remember so many peoples faces, names and drink orders. A lot of the regulars are great people too. This is also a pretty nice location to study with a table that seats 4 with outlets, 3 two peron table with outlets and the two comfy leather chairs also have tgeir own outlets", "business_id": "Vpg_FMSzMTBPvzpwbbRa7Q", "stars": 5, "date": "2013-12-31", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "p6I4YVLXU9V_Sh9ZhQKJyQ", "review_id": "_4U4iz-g_QPKRUMsqWfBYA", "text": "The \"Meh. I've experienced better.\" that pops up after giving this place two stars could not have been a better choice of words to describe the service here.\n\nI do understand that they may get busy during the day but when it slows down to one person every 5 minutes (as it was with my visit) then take the time to relax and speak with your customers. I don't think the coffee is the best in the world; I have had better. So in my opinion, in order to keep people coming to your store, you should have excellent customer service skills. My order was taken, name taken, money accepted and then I moved right along.\n\nNext time, I will find another location. If there is not one to be found then I would rather purchase coffee from the gas station.", "business_id": "5kW3gHsqag1WD6Z1_HD54Q", "stars": 2, "date": "2013-01-21", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 4}, "user_id": "JffajLV-Dnn-eGYgdXDxFg", "review_id": "sduBtaPhnn7pTT7Y3ZBRXQ", "text": "I have frequented this place quite a few times, and its okay.  The things I like about it are the late hours, \"free\" internet as long as you buy a drink and the indoor and outdoor seating.\n\nWhat I don't like is how they now regulate the internet.  When you purchase a drink, they give you a reciept for only 3 hours worth of internet service.  It's not that I personally need more then 3 hours of service at one time, but why regulate the Wifi?  Maybe its to stop people from camping out and hogging up space or something, I'm not sure.\n\nThe staff has always been nice to me, but I'm only there on average about once a month at best, and its usually to take advantage of thier late hours.", "business_id": "l1MZjZK2tLxfFRB62lQmsg", "stars": 4, "date": "2008-02-26", "type": "review"}
{"votes": {"funny": 4, "useful": 6, "cool": 1}, "user_id": "_HvJzf1-4g5isNFaOEAIrQ", "review_id": "53Qdo-mTLUYqLh5b2DBgvw", "text": "I have many friends who are in love with this coffee spot. That being said, they are the kind of people who order milkshakes masquerading as espresso drinks. I have never been impressed by the coffee here. \n\nAnother thing, they are extremely expensive for the quality you are getting! Now, I'm not opposed to spending 4 bucks for a latte at Cartel or spending however much when I'm in LA at Intelligentsia etc. But I asked for a soy latte with sugar free syrup (my dessert for the day, not my typical morning jolt) and it was something like 6.50. INSANE.\n\nAs a result, I have tried to bring my own drinks to their outdoor patio when I have met friends there. The \"baristas\" have repeatedly come outside to tell me to throw my outside drink away. On an outdoor patio. Closer to the lake than to the business itself. Cheap motherfuckers.", "business_id": "l1MZjZK2tLxfFRB62lQmsg", "stars": 1, "date": "2011-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "GRpQwHEQMTKpK905kfzmog", "review_id": "WLPzmLaI7TxnBz_nts2TBw", "text": "I have tried so hard to like this place. The lakefront and the hip vibe are really cool and all, but every single time I visit I leave wanting to cuss someone out. I'll use the last three visits as examples. I was there an I ordered a black coffee and a baklava. The coffee was actually cold in my mouth. This I thought must just be a one time oversight, and I went in to see if I could get a fresh pot. The barista (short guy with dark hair) told me that he would have to charge me for another cup, so I just tossed it in the garbage and went back outside to eat my baklava. I took one bite and was repulsed because I got a mouthful of pinesol. I went back in to get a coffee to go, and noticed that there was a bottle of pinesol on the counter behind the pastry case. I ate actual pinesol. What.\n\nThe second time I went there, I was with a friend and her little sister, and when she tried to order for her little sister, the barista said \"excuse me I think she can order her own drink\". We left and went to Starbucks.\n\nThe last time I was there, some friends and I had just finished eating at a nearby restaraunt, and came to coffee rush to sit and chat. I ordered coffee and my two friends sat down with me. It was late, we were the only ones there. The barista came outside to tell us that one of my friends had to order a drink because they had a \"majority policy\" or some ridiculous greedy thing. Irritated, I handed him a five and said \"chai latte\". He responded by saying \"uh you can come inside dude.\" If you're going to walk outside to tell me we need to order another drink, you can also walk outside to bring me said drink. \n\nIn conclusion, absolute worst customer service I've ever had, an absurdly misplaced elitist sense of self ignorant hubris over some of the worst coffee you can throw away a dollar on, and to pin it all down, a filthy establishment with no regard for the integrity of their own product. They appear to believe they are worthy of respect and admiration if only because they're not starbucks. If I could give zero stars I would. I have also been booted from two other locations for the same \"majority\" crap. Total Nazi's.", "business_id": "l1MZjZK2tLxfFRB62lQmsg", "stars": 1, "date": "2015-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Zx47hhjQ46pML36Qe8Q-vg", "review_id": "mIjd52FEeqelIuq2b6zZMg", "text": "Greatest Starbucks on earth. Baristas are awesome and they keep it personal by remembering my name.", "business_id": "yMkXrAbKr3C1BjXIj6CIzA", "stars": 5, "date": "2013-12-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 3}, "user_id": "w1LjSa5wMexRIQ-82LKWmQ", "review_id": "UTXXK0KrhxzNIYvS1tcddw", "text": "Wow... what a surprise Liberty Market is. I'd lived in the east valley for about 3 years before ever setting foot in Liberty Market. It honestly doesn't look much different from the outside than all of the other places I've never set foot in inside downtown Gilbert (although that's probably MY problem, not theirs). But, with help from a lot of friends who swear by Liberty Market (and seeing them be so interactive on social media sites, like twitter), I have now been there multiple times. Their food is amazing, I have yet to be disappointed by anything they have served. \n\nIce Cream Cookie Sandwich, FTW :)", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2010-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DfJ8B8T1fgNA6_ZT-aeUlQ", "review_id": "F5zsfitsnM_3ZZbPRkzR-w", "text": "Love, love, love this place--not only because they saved and renovated an old grocery store, but because their food ROCKS! \nSandwiches, salads, pizza and a few desserts (which I am NOT wild about once tasted, but they are pretty, if you know what I mean).\nI am sold on the Italia salad, as well as the Farmers salad, oh, and the Picnic salad. My hubby loves the sandwiches (because for some reason, he won't be caught eating a salad in public). \nThey have some good, inexpensive wines, also. I've never tried any of the beers there but it doesn't seem like it would go well with my salad. \nThe salads are good size, but not overwhelming. Try one, you'll LOVE it!", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 4, "date": "2010-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tg5zCm3dlMDM_mwOfN1Rqw", "review_id": "jUONMywtIl1upux0JR7iDg", "text": "Having visited this restaurant on numerous occasions, I knew I needed to write an updated review.  The double Cortadito is a favorite when I am in the mood for coffee.  Breakfast is exceptional and the \"Best Chicken Sandwich\" is entirely aptly named, so much so that I rarely order other items, though I have on occasion enough to know that everything here is good.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2011-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z4xZrZi_AMtOR6I24dPrHQ", "review_id": "HHzs1EDHjbi8lUAv1hABUw", "text": "I was at Liberty Market this morning for breakfast. The grilled bread pudding is amazing. And the bathrooms are so adorable!", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2012-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W6B9DFINxAWgzrESGkygSw", "review_id": "gXEzxAsdlKrY-aHjfxehRA", "text": "Had the grilled chicken pasta and it was REALLY good. I was surprised though that for the price it cost, there wasn't even a piece of garlic bread. It's cafeteria-style ordering but they deliver the food to your table. Kind of pricey for not being a full restaurant type place.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 4, "date": "2013-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "T0Esg9YPuCQCyYucVmhZRw", "review_id": "kodpPdd62l21cxydXis14w", "text": "Not overally impressed with the quality of the lunch here. Food was average at best. They actually brought the wrong burger to my wife and instead of fixing it like a great establishment would, they simply brought her the extra toppings. Lame.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 1, "date": "2013-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "O1P6flLSit3mZYESmnLPNQ", "review_id": "rZWzMB4FCp8LtCoLKv6ZcQ", "text": "Unbelievably uninspiring breakfast. Chilaquiles was cold so I got the biscuits and gravy. Dry biscuits and gravy under seasoned and lacking flavor. I have never posted a review on yelp but this meal was so bad I felt I had to. Nothing original on the breakfast menu..will not return.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 1, "date": "2014-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2BJ33YTPP4Dm2Rs7CbbB-w", "review_id": "hfONcs9JvFVkatgH4egF-A", "text": "I really like the food and service. A great place to eat.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2015-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RmiR-4M-OkQXuMdL1yyFGA", "review_id": "o-rZn5aTA__C8eT0ZtvnAA", "text": "This place is awesome!  Take a date or go as a whole family.  Great food.  Great service.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2015-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h3HWVA2S5hvYjaLhF3mCDA", "review_id": "xWLu8w5kFvRmDBDaVJk4WQ", "text": "Best Chicken Salad in the valley. \nTry a salt river bar and thank me later.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 4, "date": "2015-12-12", "type": "review"}
