{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aV53uUNDFtY3cDhTEqem3A", "review_id": "B8Uqa6gFYbJ_MwzVwmhzuQ", "text": "Doesn't look much from the outside, but this is a good little restaurant with great quality food. Good service but can sometimes be a little slow.", "business_id": "aFVO6hoFlOCN8pKsmJbWjw", "stars": 4, "date": "2014-12-19", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "XV6347X2iSGMb2gICfyXcA", "review_id": "OpuwA3g07NCKgge_bxE1aQ", "text": "You get to park inside the grounds if you are with someone with a disabled badge ... if you were a dishonest person one could just proceed to the house and not bother to get tickets.", "business_id": "F1-S8DkAsFIyrkfTl9MmlA", "stars": 3, "date": "2011-01-11", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "6cEjxKwdxNeet2vt55XDfQ", "review_id": "gfXFMOnPggzHgsxDCO9E_g", "text": "Every local has a special place in their hearts for the Cameo. The cinema is a bit of an institution and recent attempts to take it over or close it down have sparked huge uproar. Well done Edinburgh I say- it would be such a shame if this place lost any of its charm. The Sunday double bill is my favourite offering from this place- watching two films which are somehow related makes a real afternoon of a cinema trip. The bar area is also great and offers free wi-fi. Staff are lovely and drinks are reasonable. A great cinema!", "business_id": "vW_krCghxf4GYPRfkgZ06A", "stars": 5, "date": "2009-01-08", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "wx12_24dFiL1Pc0H_PygLw", "review_id": "6clCihFWWnes6xxhtZaAag", "text": "After a rather big crowd of Yelpers came here for the Yelp Brunchy Munchy (around 15 of us), I'll give props to Hamilton's for dealing well with a big crowd.\n\nThat, on top of their rather good food, and nice Stockbridge atmosphere, makes it a pretty good pub to come to for an evening drink, mid-week meal or weekend brunch.\n\nThe brunch menu isn't that extensive, and is mainly (or, actually, only) full breakfast, scrambled eggs, eggs benny, french toast. So kind of a mixture of eggs, bacon, bread and some salmon or haggis thrown in for good measure.\n\nBut if that's what you like, they do it well. I just had a breakfast roll, with a fried egg and bacon. The roll was nice and toasted and the egg perfectly fried. The other breakfasts looked awesome too, especially the full Scottish breakfast and the scrambled egg with salmon.\n\nThere's always a mixture of folk in Hamilton's, usually there's at least one dog and a few kids there too. It's a family place during the day, I'd say. So if you've got a raging hangover and want to avoid kid's on Nintendos asking awkward questions loudly, maybe steer clear. But if you like cute wee dogs and kids then it's all good.", "business_id": "KqgeyLdYbfsd9veyR6UGtw", "stars": 4, "date": "2012-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "mp6B3FnaVZJZx4rZyGnpYw", "review_id": "YLJWhz60Td2mkqZW6J0NuQ", "text": "It might just be that I'm too old for this place.  I've been coming to Bar Kohl for oh...15 years or so.  They used to have a more extensive list of flavored vodkas but the ones that remain are still delicious and unusual.  The space has tripled in size since I was there last and lost some of its coziness so for that it loses a star.", "business_id": "QPsNlmETw14k-_RqX-RULw", "stars": 4, "date": "2011-01-05", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "-ZtHkOGsagtYTsx0J8Trbw", "review_id": "jkixFOvc4FE_dnjvO4SaeQ", "text": "Love the rosetta rolls and the bombolini. Some of the food is very pricey but you get what you pay for, I suppose. I tend to buy one or two very special things to accompany other bits and pieces from the supermarket. It is somewhere that quality matters.", "business_id": "NLjG1EDhI2Aa71ZoLFqbQQ", "stars": 5, "date": "2013-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "gV5MYRAb3ooZnJAUaKZpIA", "review_id": "dJctjjdmtFrIXJ0sKYU5kA", "text": "Mixed feelings about Bert's.  It was a busy day when we popped in so perhaps that's why things just weren't up to scratch. Food was luke warm (though they replaced one dish with a piping hot one) and we had to wait for half an hour for it to arrive. Id expect a wait like that for a complex order, but we're talking steak pie and chips and neither was much to write home about. \n\nGood selection of beers with a few decent labels on show so maybe a good place for a pre-town pint. For anything else I'll be heading elsewhere.", "business_id": "2Yd7GEhU7uqzraztlLpWKQ", "stars": 2, "date": "2013-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0fkw1NL1ieKEXz-Arr7vaQ", "review_id": "bgibwTuYoWed6NUluqTw-g", "text": "Das Hilton in Edinburgh ist im Vergleich zu den anderen Hilton Hotels die ich kenne eher im unteren Segment anzusiedeln.\nDas Gebäude, oder genauer die Gebäude, sind recht alt, mit quietschenden Holzfußböden, Teppich und Fenstern die nicht wirklich dicht sind. \nDennoch ist es ein angenehmer Ort sich aufzuhalten und der Einrichtungsstil ist sehr wohnlich. Der Service ist sehr gut, was die nicht so tolle Qualität des Zimmers und Gebäudes selbst etwas aufwiegt.\nWLAN gibt es, es ist aber nur für Hilton Honors Gold Kunden kostenlos.", "business_id": "e8wCD4XNCcxSeTSrAU6xLA", "stars": 3, "date": "2015-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "3is4uSKNOqj9k-6UrEFRvA", "review_id": "rgJZyN-cKD7JjYGg8M1iEA", "text": "Met a group of friends here for a few drinks. It was a busy night with everyone seemingly having a good time. \n\nDoor staff seemed pleasant enough, if somewhat disinterested. Service at the bar, once you could push your way past some very drunk and obnoxious lesbians, was quick but somewhat curt. A smile wouldn't go a miss. Drinks were reasonable with some decent offers on the go. Sounding good so far??\n\nA fight broke out....4 or 5 lesbians..The security staff were really quick to handle the fracas and looked to be well in control. However, moments later we were asked to leave. No reason given, just leave! I asked why were we being ejected and was told to shut the f--k up and get out if I knew what was good for me.\n\nI have never known anything like this in my life. We were standing having drinks and chatting then were suddenly set upon by these security personnel. Mistaken identity or what and despite our protestations, we were ejected from the venue.\n\nSumming up, unless you want to go to a venue crammed full of Hens, that think its cool to go Gay for the night, or want to be in the company of some really chav lesbians who bump and push their way through the venue, then this is one place that needs a wide berth. It is embarrassing to describe here as a Gay establishment. Maybe years ago under different ownership, but not today!", "business_id": "lSIyCvaWZl-Ex9y3r2nDPg", "stars": 1, "date": "2012-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vIZM6RHwFd8s5V12slRE4Q", "review_id": "MZPim5WA6Wq7X13qRALIAw", "text": "Gorgeous place! Was there for Hogmanay while all the Christmas decorations were up. Just lotsa pretty going on here. And it used to be a bank! How awesome is that? I was served the best Cosmopolitan I've ever had the pleasure to sip, hands down. Amazing stuff. Next time I'm around, this will be the FIRST place I visit instead of the last.", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 5, "date": "2014-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NW9mFdWAJpw9ArnnyU37rQ", "review_id": "psGRsodOb83UWPAw9nVAPg", "text": "My husband and I have stayed at this hotel twice since my initial review. Our most recent stay being new years eve 2015. Two years of guests have taken a toll on the hotel. Our room was a big dinged up here and there but still lovely. We also stayed in a standard room on the SPG floor this time versus a castle view room on the Club floor. There is a definite difference in the Club floor rooms and the SPG floor rooms. The SPG (and consequently standard floor) rooms are much smaller than Club floor rooms.\n\nThe free wifi is slow, like terribly slow. The bed was comfortable and the temperature in the room was someone of a problem to control - it was too hot, then too cold, then too hot, etc.\n\nOverall, still a great hotel in a great location but I no longer rate it as the #2 hotel on my list of best hotels I've stayed in. Sad.", "business_id": "DIlh3Ta7-7tfjKL1apaYHw", "stars": 5, "date": "2015-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "CvRLrapGuX02gscMc1-5UA", "review_id": "7vZqJITTRRlaI41DckXGAw", "text": "I have a hard time giving high-rated restaurants five stars, but The Witchery definitely deserved it! We had a large group of 13 and they not only were amazingly efficient, they knew everyone's wine preference by memory, had amazing food and were the nicest and most amenable staff for such a large group that I've seen. Hats off for great food, service, ambiance and overall dinner experience.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 5, "date": "2014-01-03", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "VJIwFsZ7-udXymDm2inE0Q", "review_id": "8obNDdx2MZqaozJX6OAFJA", "text": "i have never had a nicer, happier or  friendlier server in my life. the man was a pure delight. so its somewhat painful to do this, but dont come for the lunch buffet. bland crap bland.  \n\nthe highlight is the starter, which they serve you before allowing you to go to the buffet. we actually got up to hit the shit out of the buffet but were told that we had to wait til we were served the apps. all good.\n \non the buffet the best were the condiments. the worst would have to be the food. not good. there is a much better indian lunch buffet around the corner that i will suss out and up-star.", "business_id": "5dUDkaxm5FdQanoNkP86KQ", "stars": 2, "date": "2009-02-03", "type": "review"}
