{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "kTucxiqnRk2Qlh9MC1tRbw", "review_id": "yPSLzUVZRWshN-_ECEzuzQ", "text": "This is a guest review from my wife Jodi, who grew up within walking distance of the Little Pink Doughnut Shop and came here often on her way to school and on weekends.\n\n\"Best doughnuts created by man.  I'm totally thinking about flapping my wings up to Pittsburgh right now at 2am to get some donuts.  Super-delicious.\n\nThey usually only have doughnuts until about 8 in the morning and they are SO DELICIOUS!  I used to get my lazy ass up at 6am to walk here and get some doughnuts, which is saying something because I like to sleep until 1pm.  I'd be like, 'Oh, it's a day ending in Y, I need to get my ass to the little pink doughnut shop.'\n\nThe doughnuts are so good I got the school bus driver to stop.  I offered to buy him one if he'd just stop long enough for me to go in, and he totally did.\n\nGo get some! Why are you still reading?\"", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2008-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vDpNMIiwVIBmO8kbucC7oQ", "review_id": "bWMDRYIHVXljlujWf6bR_Q", "text": "While en route to the grocery store with doughnuts lingering in my mind....I just happened to pass Rainbow Doughnut and flipped a quick u-turn.\n\nThe Bacon Doughnut tackled my craving with ease.\n\nIt's a quick in and out friendly service.  Now just have to bring a dozen into the office.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2012-02-09", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 3}, "user_id": "7cR92zkDv4W3kqzii6axvg", "review_id": "J_gRRu8cFqVDm5b5D4LWPw", "text": "What a great little neighborhood donut shop!\n\nFree Wi-Fi, great cappuccinos, and DONUTS! What else do you need?!\n\nOh, and they are actually doing Yelp deals! I did my first Yelp deal here, getting a discount on my order for checking in on Yelp!\n\nIt's like free donuts! Woot!!", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 3, "date": "2011-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PA7iyQYEtzvzqeqIOjxPKw", "review_id": "6URFiSqqK1FraKlfc1dJrA", "text": "Let me tell you! This maple whip cream bar with blue berries was delicious honey!! Its both healthy and unhealthy so it cancels it out :) donut holes are always good but you gotta get them early before they dissapear!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2015-01-31", "type": "review"}
{"votes": {"funny": 8, "useful": 10, "cool": 9}, "user_id": "Icjho-pebXEplw0vRwAcsw", "review_id": "Muc5GGzajVdjhcqpcqR8_g", "text": "This is a typical Krispy Kreme Donut store. It's in the same plaza as Home Depot, and is easily accessed from Craig Road. I've stopped here often in the last four years. With the decline in donut demand evidenced by the closure of several Krispy Kreme and Dunking Donuts here,  they seem a lot less busy than years past and is looking a little shopworn.  They're like the long lost cousin that got a job in town, became a temporary house guest, then lost his job.  You're glad he's still here but just not as fun anymore. \n\nA few years back, you'd have lots of families stopping in on weekend mornings with kids thrilled to see donuts being made.  Their glass walls let kids put their faces near the conveyor where donuts pass.  Then when they'd make hot donuts, the red \"HOT donuts\" sign would light up, and people would abandon Craig Road and stop  inside.  Then, they'd give everyone walking in a warm super soft donut.  They stopped giving away donuts, and people don't spontaneously stop in anymore. Everything else is pretty much the same.  They still have free wi-fi, definitely a plus. They still have fundraising opportunities and wholesale sales. \n\nI usually get their special, like two donuts and coffee.  I generally think their regular glazed donuts are their best, most consistent item, but they have some featured donuts that are hit and miss. Service is generally decent, and they sometimes have a few different types of coffee - Light, medium, or dark as well as decaf.   Drive through is farily quick. With a regular glazed donut still only 150 calories, it's a cool sweet snack.", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 3, "date": "2009-12-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "L6j7KNncXIOrinkUB-rrXA", "review_id": "Sd4aQVUUaM7-MNjK3VC3aw", "text": "I am not a donut person. At all. I can go months and years without having one or even desiring one. Perhaps after years of only being exposed to Dunkin' Donut and Krispy Kreme many could understand why. The only donut place I have ever liked before was Voodoo Donuts in my hometown of Portland. I'm not sure what made me stop into Real Donuts but I am glad I did. Nice chewy donuts with just the right amount of sweetness. I would definitely stop in again.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2013-02-04", "type": "review"}
