{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "L8MoQHZj4cCLKzjeewZvfA", "review_id": "CtRnNJ0JuFDkx_Xu8PAzdw", "text": "I normally don't have a problem with Dominos--you pretty much know what you're getting for your money.\n\nUnfortunately, this Dominos, even though it is less than 3 miles away, won't deliver to my address. Not only will they not deliver, but they will take my order, ask me what the cross-streets are (so they KNOW how far I am), and wait 30 minutes before calling to tell me that they cancelled my order.\n\nThey could have checked my address when I gave it to them, or they could have called and asked if I wanted to pick it up instead, but instead they simly cancelled my order--and didn't let me know until it was supposed to be at my door,", "business_id": "x5Mv61CnZLohZWxfCVCPTQ", "stars": 1, "date": "2013-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NvOqcnPhBgVI0Fs7lUzOSA", "review_id": "am8hj398LL2tkY_GBX6aIg", "text": "I have been taking my vehicle's to this shop for the past 5 years. Before then I \nwould float from shop to shop ......never satisfied with work or price, if work is\nquality I can justify it with price, but if workmanship and price don't match up \nits frustrating. It is so hard to trust in these type of businesses especially when \nyou are a women with no knowledge of anything to do with a vehicle, sometimes\nyou feel you are being taken advantage of. Since finding this shop, I hope they \nnever ever close their business doors, because I am a forever customer. I will \ndrive whatever distance I have to drive to get my vehicle here in their most \ncapable hands. Their customer service is unsurpassed. They provide transportation\nto and from your work or home. Their workmanship is excellent. They may not\nbe the cheapest in town, but if you haven't already learned this lesson by now,\nyou will \"You Get What You Pay For\" . Trust me.....This business will not disappoint!", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 5, "date": "2013-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jOs47GO0b7iPsbYZe-lLSQ", "review_id": "VloAjW5xDZ87nLWYNLP6xg", "text": "Good Pad Thai. Cold Singha beer. I order the same stuff every Thai restaurant. Coconut Ice Cream is good...ate at the bar....they let me have the remote to the TV too....perfect.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 4, "date": "2010-01-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "5xUUzFaKAcrFOPTgMKBfww", "review_id": "N2LtITbdYL0Gf_13OFO1wQ", "text": "Two Words. Holy Basil !!!\np.s  thai spicy...", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 5, "date": "2012-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wUEp87FqOB9ew27Iz6zk_w", "review_id": "WKp-MzGP6Wa8J8eBfDyzCA", "text": "Ordered takeout from here last night and was disappointed.  The portion size for the chicken curry was very small and I asked to add extra vegetables to the curry (bc otherwise it only comes with potatoes and onions) and didn't see that they had added any.  The amount of rice they provided with the curry was also teeny tiny.  On top of that, a takeout order takes 35 minutes (I ordered at 5:20 pm, not a peak time).  Also they were out of mango for their sticky rice and didn't have any alternatives like custard or anything to serve with the sticky rice.  Meh, never ordering takeout from here again.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 3, "date": "2013-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eEaQW2LUVRlCCKMKVy4Vkw", "review_id": "PKLkkDMGZKXESS4VEcRSDQ", "text": "Food has gotten so much better. the vegetarian 24K rocks my world with Thai pumpkin, eggplant, veggies in spicy green curry. get it hot!!! delicious. service is fast and friendly too.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 5, "date": "2014-12-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "wO6krk1RDGLe7BScP_iSaA", "review_id": "SX8zclV7UijjPtMbPb5_pg", "text": "I watching DDD and saw this restaurant on the show. I was so excited to try the place out. My husband and I went in on a Monday evening, it wasn't too busy. Got seated right away, then it went downhill from there.  Had to ask my waitress 3x where our food was. We sat there for a full hour watching all the tables around us get their food! I told the gal I was over the wait and that we are leaving. She told us to hold on... I thought she was going to call the manger over. That was not the case, she was so nice to bring our bill over for the 2 sodas that we were drinking while waiting for our food that never came. WORST service of the year award! We haven't gone back since!", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 1, "date": "2015-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "mR7LQurf_awsKqDK46NRew", "review_id": "NI_AVqEK01zu4Hfv7jjR0Q", "text": "I have to search long and hard for things in this store that don't expire the day I'm purchasing them. They don't have a lot of the things they offer in their weekly ad, which I try to plan my grocery list around. The lines are always SUPER long. The store is always dirty. I keep telling myself I'll go to another store but there isn't another one in the 'hood to go to, so I'll need to make a better plan to head further away for a better experience in another chain. I've tried to talk to assistant managers about my issues at the store and have been blown off or they act afraid and stutter a lot. \n\nThe only good news: The gentlemen that bag groceries and collect carts are VERY nice and helpful.", "business_id": "7Z7IkR_-94AjUuDw0fbI7g", "stars": 1, "date": "2013-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6OWHDbEq23f24Vki_veHBA", "review_id": "1G4Lu-rJv6NtkARGCxr-dw", "text": "2nd stop on the dine around. \n\nOur group gave them a 3.25, which I'm rounding down to a 3. \n\nWe were seated quickly and ordered a round of the grand canyon margaritas. We were brought chips and salsa, which unfortunately was the best tasting thing we ate at the restaurant. I had the carnitas taco, which was sadly underwhelming. The pork wasn't too flavorful. Jon had the corn crusted calamari. I don't have a calamari palate so I can't rank it against anything, but he said it was just average. The drinks however were BOMB (margarita with cranberry, lime, and prickly pear juice), both frozen and iced. Our server was super sweet and chatted it up with us which was nice. I don't know if I'd make the trip back for dinner, but if I was in the area I'd definitely come back for a margarita and some appetizers.", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 3, "date": "2011-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kGkum7Ks7iF3X8CCFGY4mA", "review_id": "cyRaSFhlMRTlqEvZD6HTsQ", "text": "Absolutely the worst service I've ever seen. We waited for a half hour before grabbing a waitress.", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 1, "date": "2013-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "aThkIdpPnim8OLES1WVvgA", "review_id": "xoqfJM98tSAl1PVnenX1JA", "text": "I agree with some of the reviews, this place has the potential to be a go-to Downtown Phoenix restaurant, but falls short on so many levels. The only part of my meal that I can say was good was the chips and salsa - that is the only thing they have down. The staff was okay.  But there are so many other restaurants near here that it is going to hard to come back.\n\nThey have a great outdoor patio and location so they have the ability to thrive. My coworkers and I all felt the same way, our main entrees were awful.  All I had was a salad and soup, and I'm not sure how that can be messed up but it was.  There was not enough flavor and overall zest.\n\nCanyon was kind supplying us with white peppermint chocolate tamales for dessert, which were quite tasty. But that is not going to be enough to win back the meal.", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 2, "date": "2014-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Oi_F-xCj9Ul9bQoRljqtoQ", "review_id": "0OZAV5Nvqhj4eGva_UzKbQ", "text": "Beautiful church...always open. Be sure to look closely at the remarkable stain glass.", "business_id": "545sP7uSdCcKDZ-reeVOgQ", "stars": 5, "date": "2013-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EA5JiRv7RocRiKFTaCUHCw", "review_id": "07tIAoK3ArFqOF4vFJYmHw", "text": "Fantastic museum. The Indian exhibits are expansive and usually heart wrenching. It is worth going on one of the free guided tours (they run frequently). My guide was very knowledgeable and provided much insight to all exhibits, including the temporary Georgia O'Keefe. The main entrance area is a nice place to lounge outside and have a picnic or something. The staff is very nice and friendly. Parking was easy.", "business_id": "SG_gEmEXL4ID6RAEinC5Bg", "stars": 5, "date": "2014-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6OWHDbEq23f24Vki_veHBA", "review_id": "Y4lU3YTq99KF36QgOIQkZQ", "text": "Having passed this place numerous times, I was excited to get the chance to see the world premier of Ten Chimneys here last night. We made the short walk over from dinner at the Arizona Center and I was really impressed with the venue. Super clean, very aesthetically pleasing, and the staff on hand was very nice. We found our way to the seats and in the inside of the theater matched the expectations from the outside. Plush red seats, nice size staged, a very intimate set up I think. While I didn't check out the bathrooms or any of the other stages, it is a really cool place that I look forward to visiting in the future.", "business_id": "RA2EuX04SHqmayKpLhpNvA", "stars": 4, "date": "2011-02-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SAAMpBGcVVNAww_4yZpIoA", "review_id": "aDYNwfsXWjyVzGoeTtJLAA", "text": "Can't believe I've lived in Phoenix for 15 years and have never been to Herberger!\nIntimate, clean, well-maintained--not a bad seat in the house!\nWill definitely be back!", "business_id": "RA2EuX04SHqmayKpLhpNvA", "stars": 5, "date": "2013-01-21", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "xiJtOY01ROyp7S0UElOmpQ", "review_id": "U-nu4SpgC6PxIiAKj3rh7Q", "text": "02.07.10\n\nGreat place to catch the big game.  TV screens everywhere, projector screen on blast.  Surround sound.\n\nBeer isn't cheap, but the wings are on special during football [http://www.yelp.com/biz_photos/kHpXJ2vciumu2KhNHg0hYA?select=8PgwEaa1nqdCt9c0zP3tBQ]!", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 4, "date": "2010-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "Fz5il511JS0pPxRKIh5Guw", "review_id": "4OWgTbnWeFNUjy7S4jtClQ", "text": "My husband likes Majerle's because it's nostalgic for him.  He grew up when Thunder Dan played for the Suns.  We keep coming here because we like the food and the atmosphere. \n\nYes, it's a sports bar.  If we can't be at the game, my husband wants to be in a sports bar watching the game. So we go to Majerle's.  \n\nWe've never had bad service of all the times we've been here.  We came here during a Suns game one night, with the intention of watching the game, and since it was a big game I remember the service being slower than at other times but I didn't really care because we intended to be there a while anyway.  \n\nI've never had to ask for a refill of my water.  Our order has always been correct.  (My husband and I are notorious for substitutions.)  The hostess and waitresses are always friendly too.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 4, "date": "2013-01-26", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 1}, "user_id": "eUZI6rWAFh70lF2O_GDEyw", "review_id": "__tdQ3Dj6KwGIL1Gr7-E8Q", "text": "Way too many fucking issues.   Lets start with the customer service when you call for a cab.  Unprofessional, talk in slang.  I called for a cab and then got a call telling me my cab was there, went downstairs never saw the cab.   Called the taxi service number and they kept insisting that i was the idiot n said well the cab is there waiting for you.  Puts me on hold and tells me 5 minutes later to tell them what im wearing.  I said a black shirt and why is that relevant.  Lady says quietly we're going to send another cab.    I said another cab? There wasnt ever a first one.  She insisted yea there was until she finally admits 30 seconds later yea sorry he wasnt there.  How the fuck can u call me to tell me my cab is waiting downstairs when they werent ever there.     \n\nNow my actual can driver.  First thing he asks can u pay cash? I said sorry i only have card, then he goes, \" can we stop by atm?\"   I said no because im already late enough because of your company.  I know its not your fault but i need to get to te tempe campus for a meeting.    Thia fucker still asks to stop at the atm cause its 2 blocks away.   He doesnt fucking understand i dont have time.   Then asks for directions to tempe campus.  Idiot gets lost and asks to borrow my phone as gps. \n\nFucking whack.", "business_id": "yR3U7jOgoD0V0sGovuyt0Q", "stars": 1, "date": "2013-12-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "pEVf8GRshP9HUkSpizc9LA", "review_id": "6KTUUdS3XokVfdewn0rv2g", "text": "I absolutely love Perry Monge Salon!  I have been going there since 2004 and it has never disappointed.  The entire staff is friendly and makes you feel right at home.  Marina is amazing with hair...I only wish she could style my hair every morning!  The extra perks beyond an amazing hair cut are the chair massage before your wash and the hand massage during your cut!  I spend 75% of my time in Dallas and 25% of my time in Phoenix, but insist on only having my hair cut at Perry Monge!", "business_id": "Og03_vbBCVAFNHXgdflRLw", "stars": 5, "date": "2011-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2uz3B-11DieFlELzqUCAlw", "review_id": "SqgAp633b-BwXrgTfM2GoA", "text": "Never disappointed with IHOP. I always asked for extra strawberry sauce for my pancake.", "business_id": "P7wKlbSRsoRrfH3DFOY08A", "stars": 5, "date": "2015-01-17", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "A99dyhEqcd_yXKPfBWeZHA", "review_id": "HRstBDOzKDvq0fYbY27lFQ", "text": "My family and I have been coming to this place for years... back when it was called 'Crystal Palace'.\n\nWe still go regularly, mostly for my dad's or mom's b-day celebration.. or with my in-laws.  One thing I've noticed throughout the years about this establishment is that they have the same waiters ... I'm talking working there for at least the 15-20 years that we've been going to this place.  That is kind of impressive, you know.\n\nSo, what to order?  Well, if your idea of a Sunday afternoon (when we usually go) is to have a nice lunch and then have a functional, productive afternoon... don't eat here!  It doesn't really matter what you order.  99% of the time what you will be served is an elliptical plate with a 24\" major diameter that is chock full of greasyass refried beans, brown (aka Mexican) rice, and some other main dish that is covered in creamy salsa, cheese, or both!  \n\nI'm not saying it's bad (yes, it's bad for you) tasting, because it is actually quite tasty.. but, you 100% of the time regret ordering these dishes because of how you feel afterwards.  You're just bound to feel like a pig... heck, just wear your stretchy pants and one of those puffy blouses (gals, they are in style now) that way you can hide the bulge that will be your bloated belly.  Sigh... this is why I just get the fajitas these days...\n\nThe staff is mostly Spanish speaking (fine with me) and so are the patrons of the restaurant.  You'll pay a nominal price, be surrounded by lots of Mexicans, hear some typical Mexican music (hey, maybe you'll get a song from the mariachis that stalk the tables), and eat like a pi... person that has been starved and has finally been fed.", "business_id": "BESmH-lmMm34_EefL8X9fQ", "stars": 3, "date": "2012-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sd8zBDiW1nClCLrPerRamQ", "review_id": "chMrrXTi9crQxV9xxLrUMQ", "text": "I liked the carne asada cheese crisp and ceviche a lot. I ordered the carne asada chimichanga enchilada style (meaning they put some sauce on top). I thought the sauce was good, but the meat itself was only ok. I was generally satisfied with my meal though. The service was very nice. Also, the portions are huuuuuge, so come hungry or be prepared to take some food home afterward.", "business_id": "BESmH-lmMm34_EefL8X9fQ", "stars": 4, "date": "2015-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "UMCSDwIHapGy9au8ysJ6hw", "review_id": "vphnQrTwPkK9VF7R5wHS5Q", "text": "Phoenix Theatre consistently puts on excellent productions. As a jaded ex-New Yorker, I was honestly worried about finding \"culture\" when I moved here. Never fear. Between the theatre here and the touring productions elsewhere in Phx, and the opera, ballet, and symphony (not to mention Spring Training and the beautiful Phoenix Art Museum), I'm not missing out. \n\nDefinitely worth subscribing to their season. \n\nAnd be sure and arrive early, they've renovated the lobby (and added a black box theatre for more intimate shows), with a snack bar (sandwiches a bit overpriced but reasonable pre-show drink prices) and a bar-bar for hanging out.", "business_id": "X9ih9Iotd-VEZ8tTYfoarw", "stars": 5, "date": "2014-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lgHiNylLvG68L_WchVpVeg", "review_id": "dqsJhKZ9SU81bSJm0KvQ4g", "text": "Definitely a place for take-out rather than dine-in, Chico's is not a chain as at least once recent reviewer has stated.  It is family-owned and non-franchise.  I highly recommend ordering the following:  ranchero-style carne asada burrito fixed enchilada-style.  It's deliciously saucy, not on the menu, and the only thing I'm interested in at Chico's.  It should make your day (or at least your lunch).  One last piece of advice:  Unless your in a pinch, don't bother with the breakfast burritos.", "business_id": "D09yG6Z3gcsh24Qn7Y4gYA", "stars": 3, "date": "2012-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FxxYCRPcpd__yhRRmmtyMQ", "review_id": "nCVjyjc7pCFHTJvkit3F3Q", "text": "This spot was always a regular drop for me when I was spent time studying for the GRE at the library. From what I've heard, this place has been around for quite a while which is a testament to the food they serve. It's important to know that this place isn't authentic Japanese, it's American Japanese, so prepare your taste buds accordingly. So far, this is the only place that I've found in Phoenix that serves Japanese curry. This isn't like hot sauce over a dish, this is the real deal.\n\nAs far as the food goes, it definitely hits the spot and is always sure to please. My usual tends to be the chicken curry. They really know how to pack in the flavor and make a portion that's not too big and not too small. My only complaint is that they tend to go a bit over on the onions. Another thing to pick up while you're there is their Japanese soda. I forget the name of it, but it comes in a glass bottle and it has a glass ball that rolls around inside. It's refreshing and fun to drink as well. The sushi here is kinda \"eh\", but it fills you up and chances are that if you're eating there you're not looking for top quality sushi.\n\nMy impression of the place is that it's family owned by the women that work there. The older one is really friendly and makes sure that you're enjoying your meal after she serves it to you. You can tell that they really appreciate your patronage and want you to come back. It's always a good thing to know that the owners of a restaurant are passionate and take pride in what they do and treat it as more than just a job.\n\nIt's been a while since I've been here, but I really need to swing by again. Some people would probably just brush this place off as some small food hut on a street corner. That would be a huge mistake. This place is like the Yoda of Phoenician restaurants in that it reminds you that, \"Size matters not.\"", "business_id": "kaIue7GRCmkPzDeHDBTttQ", "stars": 4, "date": "2009-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DBGuQbQy0tPe7Muoawq08Q", "review_id": "X_GaaYaN8tm9qd3boy2kCg", "text": "Small.  Great food.  Great price,  exceptional staff.  If your downtown,  try this place.  The servings are good sized and the quality is hard to beat.  Fresh taste.  Will be back.", "business_id": "kaIue7GRCmkPzDeHDBTttQ", "stars": 5, "date": "2013-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NW0Vvz55ayqnzQ0swfuZKQ", "review_id": "RqPkgspqskU9Ns8GbMvyqg", "text": "Went here as  part of a companies social gathering this week. First I must say I was highly impressed by the layout of this corner restaurant located in the downtown district of phoenix. \n\nMy visit was during the modest hours of 12pm, so I was greeted by the afternoon crowed. Taken to the upstairs portion of the resturante, this must have been some type of VIP room, decked out with couches, plasma televisions, private bar, and outside patio. This is a great location to hold a private event I thought to myself. \n\nThe prices on the menu were between 12-30 dollars(approx).  The food came quick was was large portions. I had the BBQ Chicken Pizza which was so fulfilling I hate to take half of it home. Very good service. \n\nMy one complaint would be that I didn't hear any music while upstairs, tho they had speakers, and I wish they would have been more intentive to ask my group if we wanted the televisions on. Which would have raised the overall atmosphere rating.", "business_id": "j8nyAaN_w5t6wYv-ni23sg", "stars": 3, "date": "2009-12-18", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "-F32Vl8Rk4dwsmk0f2wRIw", "review_id": "0omNi4UODOS4mc29fVKusg", "text": "If the city of Phoenix were to ever put out a book \"Downtown for Dummies\", Fate would land the cover spread.  It is like the Mary Jane of downtown establishments, a gateway drug into our city's inner core.\n\nLeery suburbanites -- and oh are they visible -- lurk into the restored bungalow and mingle with the Scenies.  After eating here, they are convinced that they want to come downtown more and urban-out.  For this, I am very appreciative of Fate.  We need more people downtown after-hours (5PM ... booo!) and Fate is their subpoena.  \n\nAnd this is just what their gentle palates need -- swankish pan-asian pabulum that outshines P.F., but in reality would all make us feel and look a little silly if we boasted it as our premiere Asian restaurant to a New Yorker, Seattlite, or San Franciscan.  Fate is a sleek little spot that feels cooler than it is and keeps you coming back based on the atmosphere and above average food.\n\nI have absolutely no problem eating here -- its good for groups now because their outside patio is huge -- but I'm not going here to be wowed by the food.  I have my two dishes that I don't vary from now and I suspect that once you become a regular you will have those dishes that you will rely on when the time comes for you to throw your divorce party with all of your other psycho suburbanite girlfriends before hitting up Postino.", "business_id": "VsO_rhXi5lgbaGxNwoEZsQ", "stars": 4, "date": "2008-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "7GC9fVWKa4a1ZmBGLH6Uww", "review_id": "aYYq2UkoiSKQRRFXV-PT3g", "text": "the bf and finally decided to brave the LR to go downtown...well to get out of the house. i tried recommending some places i liked along the rail to hit up for lunch, but he was set on trying something new for our \"journey of personal discovery\" as we had began referring to our LR adventure.\ngot off at jefferson/washington and central/first ave since there's plenty of lunch spots. right away i honed in on thai elephant, a place i wanted to try out, but since we were in that off between lunch and happy hour time downtown, it was closed for another hour. continued to meander til we found matador. $9 enchiladas isn't normally my take on mexican food, but the $10 pitcher of margaritas sold us.\nfor quite possibly the first time in my life, i was not in the mood for mexican food. i can't explain. fortunately this place has alternatives, but more than like the usual one burger on every mexican menu (i always wondered who goes to a mexican restaurant and orders a burger - damn, i was gonna be one of those people? i wasn't sure how i felt about this) but they also had like french dips, and tuna sandwiches and gyros?!?! i guess since it's downtown they're going for a \"catch-all\" crowd of lunchers. i braved the gyro - a risky move, but i banked on \"homemade cucumber dressing\" that came with it.\nshocking - it was delicious. the pita was toasty golden, with plenty of thinly sliced, bacon shaped pieces of gyro, along with onion, tomato, pickle (weird) and fries. the food came out literally two minutes after we ordered, so it was HOT and good. the BF got the colorado burrito (when he asked the server, who seemed out of sorts and older - maybe the manager called in to replace a no show?, she seemed confused by his calling it exactly as it appeared on the menu, then said \"oh, the burro.\" look lady, a burrito and a burro is the same goddamn thing, condensend me, man...)\nanyway, he ate the whole damn plate of enormous burrito and said it was good, but the \"chili\"-like filing she described he compared to dinty moore. ouch. well, my gyro from a mexican place was delicious, so we'll call it at wash at2.5 stars? was three, knocked a star because the margaritas had little to no tequila and was a waste of $10, got another half a star back bc that was seriously a delicious gyro sandwich.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 3, "date": "2009-01-02", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "EXBOkXWPNYZk5HFBg5NbTQ", "review_id": "fGr2XJZ-k2EejuAG0MLQxQ", "text": "I ate here a few times when I was working on the phoenix fringe festival earlier this year, and it was always delicious, but I went in one day for lunch, asked if I could place a to-go order, and the response I got was: \"sure, but my cook isn't here, I'll have to call her. it'll be about 20-30 minutes.\"\n\num, what?", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 3, "date": "2009-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IO3AsR6cdMto7VCwfPzf2w", "review_id": "jh9mPFuTz1q1A89aJ-uWRw", "text": "I went here to grab lunch and a beer between classes. The service wasn't all that great. I don't think the waitress ever told me her name. I ordered the fish tacos and a tall beer. They start you off with chips and salsa. The chips were really good but the salsa could have been better. The fish tacos were just okay. They needed something more. The food came out quickly which was a plus. As others have mentioned, this place definitely has potential but needs a bit of work. I definitely will go back in the future during my lunch break.", "business_id": "-lOSaCuBRAvX5JBifx-EMw", "stars": 3, "date": "2011-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ovpa3S8xD96dLE5eDxcxJg", "review_id": "PMDe0UvbxF6X-kT0VpQ9TQ", "text": "A few months ago I would've given Baja Fresh five stars. No joke. I don't know if it's me getting older and more frail, but for some reason my body can't handle it as well as it used to be able to and I go into a food coma for a good 45 minutes to an hour after eating it nowadays. \n\nIf that doesn't slow you down, it actually has some of the more authentic tasting mexican food around. Cilantro dominates the smell of the entire restaurant, and they even have a wide selection of salsas of different varieties for all to sample. I am a fan of the burritos, but, then again, that's almost unfair. I'm a fan of just about every burrito I've ever had. \n\nThe chicken quesadillas are good but are heavy on the grease. Unless you have a stomach of steel (like I used to) go with the tacos or a burrito.", "business_id": "XI-_Y2XRw03mozGx0Z90Gw", "stars": 4, "date": "2007-02-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TgNS26sB-q78rlS2Llre9g", "review_id": "L6wZKVbSNzyIszJE2VtU_Q", "text": "I went to Hooters after a meeting with some friends. This was my first time and my last time. I got the spring garden salad  with chicken. The chicken was awful on the salad. Something in the salad was offputting. A friend suggested I try a wing. The parmesean chicken wings were not fried hard as requested. I put my salad in the trash. I always heard the food was good so my surprise when it didn't pass muster.", "business_id": "qsWxbgQwuomXvMseg23DGg", "stars": 1, "date": "2015-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bUy80XymVAeKV9_QR0y8ug", "review_id": "45Sc31oLCG_7fRQ0Zi82dg", "text": "I have been a frequent diner at The Old Spaghetti Factory for my entire life...literally.  My parents dined here when I was still a wish on a star and it was still The Spaghetti Company, and my first meal \"out\" in my infant carrier was here...\n\nI really enjoy this place.  The food is always solid, the atmosphere pleasant, and the waitstaff, though it seems to turn over often, is usually very good.  The fact that most of their meals are inclusive, coming with a drink (soda not included), soup or salad and a choice of spumoni, sherbert or vanilla ice cream at the end is a real bonus!  A great place before a game downtown, to take familiy or friends from out of town, or just because.", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 4, "date": "2010-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sRMG12fVSNEV3v--hxv70Q", "review_id": "mafv--CSRPgG8TXLyXJbuA", "text": "The Brown butter sauce and pesto ranch are both worth trying at least once.", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 3, "date": "2013-01-02", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "6hTsKE8lmOZ9ofC9Vb2ZDg", "review_id": "65mlPYqnShpPnqCn9y8kVQ", "text": "After taking The Light Rail downtown for the Super Bowl Fan Fest, we saw this at one of our stops, and my wife and I decided we would come here on our way back. Boy, am I glad we did. The food was awesome, as was the service. We agreed that whenever we took Light Rail, on our way back, we will stop here for dinner.", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 5, "date": "2015-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vSlO67EsdSfAJFKXCgvaPA", "review_id": "vtzNRiMn7xY_eEx90MWWAg", "text": "Just happened to be walking by and wanted a place to relax.  'Ended up ordering the chili  nacho plate and my husband had a beef dish.  Good food.  Nice atmosphere.  Bartender David & staff were very nice - good service.", "business_id": "2I666dqzs1XB6xigIKa9bA", "stars": 4, "date": "2012-02-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "31OZmHva7Q0dTNqpM4TKug", "review_id": "ziIqQLcXKeMr9BYCaWdXeg", "text": "Ok, so i didn't try the cobbler.. after reading Brad S's i guess i am glad i ate too much..  What i did have was the fried catfish and some cornbread, clean fry all together, not greasy.. going by what i had i would go back next time i am having a cajun craving", "business_id": "yExYqENb4F6qH6kJxTOaSQ", "stars": 3, "date": "2012-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q5XhtP5Q3OR0cC9gmGjfYQ", "review_id": "DHdZ647eC3SZ1QK_L-S7jg", "text": "Brought my car in last weekend for the supreme wash option. I have been going here for years...never a disappointment. My car looks like new and smells great every time. The employees are always courteous and pleasant. Try them and you will be hooked!", "business_id": "Li5LOL873Ep8HoPRML18sw", "stars": 5, "date": "2014-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "A65PpTYuKCl3GKbmfU6D0A", "review_id": "RRQHO6TGI8po711O-GmtgA", "text": "Quality was okay and food is kind of bland. You can see the sheriff come in here quite often during lunch time. Don't try to get breakfast menu items past 11, they'll say no. Also don't try to substitute and make sure you get what you want and not what they push you to get. Sides are optional but are good.", "business_id": "9BH18avE46LlHMvJn67MaA", "stars": 2, "date": "2013-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BGzYj1GQ1gwIhd5cYIfU8A", "review_id": "_i02sLIathtaW-rfsi9udw", "text": "We pulled over to grab lunch here this weekend based solely on the appearance... It looked like it would be great!\nTheir menu didn't seem that unique, but the girl who took our order was extremely friendly and offered some advice on her favorites, which included a pita and for both of us to get sides of the pasta salad. For 2 people to have lunch, I though $19 was a little steep, but we tried to stay optimistic as we found a place to sit. The environment was great- roomy, clean, bright, colorful. When our food was brought to us, my pita already was torn all the way down, so there was no way I was going to be able to manuever eating it with my hands. I probably should have said something, but instead just went up and asked for a fork and a knife. \nFlavors were good, nothing special. Chicken was dry, and the pasta salad was nothing I would write home about. \nWe left full, somewhat pleased, but could have had the same experience for half the price.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 2, "date": "2010-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VXjN2jnKs6dilqClSN053Q", "review_id": "0FUUq-jasmrYiwyERRR_6A", "text": "I have been a member for for over 40 years and this credit union is the only credit union or bank I would ever consider using. I go to the one in Goodyear and absolutely love all the ladies there.  They are all friendly and courteous, they greet me with my name,  and the loans are all extremely reasonable. I have never had a bad experience with anyone there, they are great people with good rates and convenient locations.", "business_id": "Pxbs4p0gzg_NS8yrrz2rCA", "stars": 5, "date": "2015-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d1HQAouAzU27WCcSJLHYBA", "review_id": "lR9b_PYMNHrDJHrAN1Q2hA", "text": "Fun atmosphere and awesome appetizers. Our waitress was quick and it was a convenient location since we were taking in a Suns game after dinner.", "business_id": "gkv2XvXpFgiq4Bb2XK7YmQ", "stars": 3, "date": "2012-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5p8cCKiCbru9FL7HNDYCbQ", "review_id": "21BrIkN9s0smvnCJBWzMig", "text": "pizza is good and you can get 2 big slices with the lunch special, friendly, family owned restuarant", "business_id": "If2DUhmWIvlu2JFc_rR-Bw", "stars": 3, "date": "2008-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "y5_vrqIylhXMrejM_-x_vA", "review_id": "Y6sx-vovH2_jgtxgSPUd3w", "text": "It was time again for  the annual health and fitness expo for the PF Changs marathon and half marathon. I never opt for convention center parking because it's $12!! Instead I usually just drive around and try to find a meter. This time we lucked out and found a $3 lot. \nThe convention center has a few eateries on the first floor. I've never partaken because I always stuff my mouth and pockets with free samples from the expo, but a lot of people were eating there and it smelled good! \nThe expo room is a good size, carpeted, big bathrooms, compared to other convention centers I've been to ours in Phoenix ranks as one of the nicer ones.", "business_id": "F6BedoYgbAQHqwKX9F0zDQ", "stars": 4, "date": "2013-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "Ovpa3S8xD96dLE5eDxcxJg", "review_id": "oK2WK_ZM67M5eJshGIT6AQ", "text": "This is the one I call the \"Other\" Jordan's. Not because it is any worse, only because it isn't the one I grew up eating at.\n\nThis Jordan's is downtown, along a little strip of restaurants including the Caddy Corner, Durant's, and Thaiger. And the food here is slightly different from the other Jordan's, but just as good. \n\nThe service here is quicker but more in tune with a lunch crowd, since most of their customers pop in from neighboring office buildings. It is very dark inside but it serves as a nice respite in the summertime when the sun glares at such absurd temperatures. \n\nThey have some lunch specials that aren't available at the 7th street location, and even some deviations from traditional mexican fare like ham and cheese sandwiches or burgers. My recommendation is to dance with the fella that brought you, so don't stray too far from the tacos and enchiladas.", "business_id": "x8WoC_7WHzXNmt6J13Nbvw", "stars": 4, "date": "2007-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e6mebLMV6GCnXzzGw2aQNw", "review_id": "a9b8PLILI_rgUR07CNZcSw", "text": "Best Philly cheesesteak in town!", "business_id": "OoHWabV-ym7_HWlHeXTsVA", "stars": 5, "date": "2012-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RflGivGcMhghpLNT5ZFeaw", "review_id": "BFPRvnHZzGCxE6uJeytjoA", "text": "I live downtown and this is my go-to place. The first few times I went, I was a little underwhelmed but their pricing and quality has steadily improved. They remember your face and conversation is great. I'd definitely recommend it.", "business_id": "NdHDqKjNyeocNRShjUPyZQ", "stars": 4, "date": "2015-01-31", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 3}, "user_id": "2xlbZgrIfb-khxurvT0QLQ", "review_id": "bMxGbXZoO3snFMk5iyIWdg", "text": "Dry.  Bland.  Gristly.  Bad cuts of meat in sickly sweet sauce.  This place only makes me love my favorite BBQ places more (oh Fat Matt's Rib Shack, why do you have to be all the way in Atlanta??)\n\n...and no greens on the menu?  For shame!", "business_id": "q1nDSpmV-FdTBNj6UuZvTg", "stars": 1, "date": "2007-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pi_f7sm9mclhBMtRHvGL1w", "review_id": "Yr1z2cm1oGO5p9-g7SXBSQ", "text": "Good wholesome BBQ, but they were out of collard greens :-( The cornbread muffins weren't the best either, but the brisket and cowboy beans are worth coming for.", "business_id": "q1nDSpmV-FdTBNj6UuZvTg", "stars": 4, "date": "2013-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ja8FvcWiWHEXME2vmTPTkA", "review_id": "KNrKyDXPVwejco05w57lJw", "text": "A good amount of meat on the pulled pork.  Crappy bun.  Sauce is good.  A few pieces of pork tasted like paper had gotten into meat.  The mac and cheese was crap, and so not worth 2.50.  My roommate loves BBQ so the idea of rubbing this one in when I came home backfired.  \n\nThe take home message here is OVERPRICED!!!!", "business_id": "q1nDSpmV-FdTBNj6UuZvTg", "stars": 2, "date": "2015-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "nl4s4jCbuLTl2hL2dL1sKg", "review_id": "6KG1IiIOVxgEal8s-bXmZw", "text": "Amazing. \na. If you impress me with a chicken breast you are doing a DAMN good job. \nb. Spanish plate with Manchego, Serrano, date-bread and all types of other goodness = epic.\nc Basil and gin martini, wtf so odd but awesome... and i hate gin!\nhttp://www.yelp.com/biz_photos/hU6sN5r6vayqm_RMgvPGOQ?select=1641PJE2BHJbwTD1t6z2PA\nd. Todd and the nice manager lady, both good peoples. \nc. Did i mention AMAZING chicken breast, yes i am actually raving about CHICKEN... granted chicken with lemon piccata, capers, arugula, and home made 'gnocchi' which were more like a pretzel bread than a gnocchi but none the less amazing.\nd. OH and pumpkin bread pudding... wow.. effing wow. \n\nGo for the page-long cheese menu and affordable yet varied wine selection.  I can not believe this place has been here for five years and i just now visited it. The Spanish plate, two cocktails, two glasses of wine, two entrees and a desert was only a bill... cant get that in LA.", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 5, "date": "2009-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jd_A8MB3M33Xy9Dd7UJ7_Q", "review_id": "KIYthC_7hgY4taycMqiY5w", "text": "Wild red flight with cheese!  Try it. Helpful staff, very friendly, especially Todd and Drew.", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 5, "date": "2012-01-26", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "kG8jkVFgOAOq6Ht6RvAjEQ", "review_id": "AL-Y-_Ywz20ZABsfkHukuw", "text": "I have been to Alice Cooperstown MANY times over the years but it was the most recent experience that made me think back to all those times and wonder why it is I keep coming back? \n\nThe food is bland. I don't know how much simplier I can be. The Big Unit--Bland. The Ryne Sandburger--Bland. French Fries---DOUBLE bland. Onion Rings---Bland. The BBQ dipping dauce for the onion rings--BLAND. There is absolutely NO FLAVOR to this food! Thank God for ketchup and mustard cuz otherwise it would have been your basic hosptial food. And every other time I've gone here, it's been bland bland bland food. Nothing pops at this restaurant when it comes to the food. And the drinks...blah at best. I once ordered a Waborita and had to send it back three because it was so watered down. You'd have to spend a lot of money to get a buzz on at this place because the drinks are very watered down. The beers are crisp and fresh, but the drinks..not so much. \n\nNow if you are looking for ATMOSPHERE, Cooperstown is your place.  The staff all have the Alice Cooper-esque eye-liner which is cool. There is Alice memoribilia covering every inch of every wall in the place. And of course all good theme restaurants have a gift shop.  They have great live bands that come out to play and when there is no band, they have great piped in music too.  \n\nCooperstown is a novel place to take out-of-town guests before a game, but if it's just you and your family, you won't feel empty if you skip it.  It's just too much money to spend on very bland, uneventful food.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 2, "date": "2009-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EoTooNBcxu0Hy0-XeZI8aw", "review_id": "5cEq7_Zih0WOYjFsEX1sfw", "text": "When we lived in AZ, my biggest regret was not coming here. I've always wanted to try it.\n\nDoing our road tripping this week, I was able to. \n\nParking was easy for a weekday...we went in - through the wrong door. Oops. The server who was stocking things seemed surprised, but rolled with it. She said we could sit anywhere we wanted (we were a party of three). We chose a table for 6 so we could spread out a little and not be so squished. She immediately snapped, \"Not that - it's for 6 people.\" I almost said, \"Then don't tell us we can sit wherever we want...\" I refrained. That surly girl nearly spoiled it, but luckily our server saved the day.\n\nI saw the hot dog...you know, the 22 inch insane monster on the menu. I split it with my friend. We didn't even finish it. It was delicious, if a bit salty. I knew it was a salt overload because in under an hour my fingers were swollen. :( Oh salt, why must I love you yet be so affected by you?\n\nWe didn't finish it, but definitely enjoyed it. If I get this again when in town, I'll get it plain and still split it with a friend.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 3, "date": "2011-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IspRCiRtgYbqUWsbrbQKsw", "review_id": "mJVQ6w2mp2PtInNWW93yhw", "text": "Don't bother- bad food, non-attentive staff, snobby management. Why bother...... the food is mediocre at best. Zeezs at 2nd Ave and Jackson is superior in every category. I agree with previous reviewers and think that possibly with a new staff and management the place could be salvaged...\n\nRUN don't walk from Alice Coopertown!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 1, "date": "2013-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "c21toQC8mnF_Qf1vLSxw5w", "review_id": "qAHRJl-5nwvRC43qv9641A", "text": "The food was just \"ok\" for the price I paid.  I got s groupon and decided to try something new. \n\nGot the sampler platter:\nBeef brisket was dry & tough to chew\nPulled pork wad good & wet\nTurkey was fantastic! Moist, flavorful & can be cut with a fork.\nSausage taste like a hotdog\nRibs we wet with sauce but we're dry- not good\n\nThey messed up the order, the waiter retired to take my still half full cocktail away ...though the atmosphere was fun.  I don't think I will be back anytime soon.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 3, "date": "2015-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Ovpa3S8xD96dLE5eDxcxJg", "review_id": "rouQ_gnkKxh_wu69BuOqlg", "text": "Now called the US Airways Center, this is one of my favorite places to be. Not only because I am a huge Suns fan (which I am), but it's just a generally good vibe in there. Food is, well stadium food, but who goes for the food? The sound system is good and the seating structure is intuitive and easy to navigate. \n\nThe Suns still have the best introduction ceremony I have ever seen and I think a big part of it is this arena.", "business_id": "uFJwKlHL6HyHSJmORO8-5w", "stars": 5, "date": "2007-02-01", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "jdeNI5TTTuM6mj3HTgstRA", "review_id": "XM-WFOHsSEbT0DrBmGlp_Q", "text": "A cool place where thousands of basketball fans can gather, watch the game, and leave without flooding local traffic for miles like Westgate does. Came here trashed for a Suns/Lakers game, and was happy the seats in row 14 didn't completely suck for someone with super long legs like myself.\n\nI don't know much about arena management, but with zero hassle, US Airways is doing it right. A lucky win and rowdy crowds make it comfortable enough to watch my favorite team and enjoy every minute!\n\nProtip: Parking is easy if you just stop a half mile (northwest) away.", "business_id": "uFJwKlHL6HyHSJmORO8-5w", "stars": 4, "date": "2013-02-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5GIFaWq2GxeBOUD4LbvGPA", "review_id": "hTV_KoHb27leSdeBlXYwGg", "text": "Enjoyed the Suns VS Bucks last night! Great game even if Suns lost the last 3.5 seconds of the game. Bummed.", "business_id": "uFJwKlHL6HyHSJmORO8-5w", "stars": 5, "date": "2014-12-16", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "8Fhyi6U9-3OZC0j8DY3TPQ", "review_id": "a4EZE1Tpz28wFKGuRg6A6g", "text": "Awesome atmosphere for D-backs game. A must do once a year.", "business_id": "1-1VcGTL3GyCqUpXZLFTZA", "stars": 4, "date": "2012-02-18", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "D5J4mKahKvUBJUTWanZwdA", "review_id": "M_E5yEdI_ZoNx0LJG4ZxYQ", "text": "Culture! Now I have had my cultural experiences in my past, and it has made me stand a little more upright and eat more with utensils. With that said, I have reached an all time high, or low (to some), by going to the Nutcracker with my GF. As I entered the Phoenix Symphony I had to wind my way thru little girls in poofy dresses and lost men with their girlfriends. The entrance is somewhat plain, but once you enter the hall you feel like you blew it by not wearing your ascot. Needless to say I was very entertained by the Nutcracker and the Ballet Dancers and Symphony were fantastic. I am very surprised that little girls don't get creeped out by the Nutcracker guy. I see that thing come to life and I'm running!\n\nOh yeah, now I know what the hell a Sugar Plum Fairy is too!!!", "business_id": "dNEAXZDrZ3TtK4d7Pl2Ydg", "stars": 5, "date": "2013-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gcyEUr4DXcbjnGRAWFtfAQ", "review_id": "iNOZ7aKKrJRaCiMjxnTETw", "text": "Glad to have found a dope local spot for a Gyro. I finally checked this spot out for lunch and am happy as a clam. Caled in my order and was ready in about 10 minute. I got the gyro pita with feta, onions and tomato. It comes with a side, so I went with fries. Next time, I think I'll try the salad or potato salad. The Gyro was perfect. Great grilled pita, super good Tzatziki (sp?) and just the right amount of flavorful gyro meat/veggies. The fries were bland and soggy, but that didn't bother me that much. I saw a ton of other stuff on the menu that I can't wait to try. Can't wait to go back.\n\n***Parking*** I found it super easy to park on the East side of Central on Garfield and pop a quarter in the meter to just walk across, that's probably the easiest way to handle it", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2011-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V5SOpcPoul01FuTZdwj59A", "review_id": "zOaY_8XS38DANea5hIWY7g", "text": "I hadn't been to the Science Center in probably 4 1/2 years, the last time Bodyworlds came to town. Yesterday, I experienced it again with my now-five-year-old son. \n\nSince we went for the reduced evening fee, we were only able to get an 8:15 pm entrance into the exhibit, giving us more than two hours to explore the rest of the center. My son was pumped, and we spent nearly that whole time on the first floor. He is a Lego fanatic, so 30 minutes with Legos, building an intricate house with a backyard nearly killed me...but I digress. After herding him into the rest of the first floor, the fun began. Luckily, my son is very bright and inquisitive, so he did more than just push buttons on interactive exhibits. He learned.\n\nIt took a bit of effort to pull my son from the rest of the activities into Bodyworlds, but he got there and was very good in the crowded, hot, and close spaces. We looked at everything, and I gave him a little instruction at each piece. Thankfully, I had prepped him prior, so he had cursory knowledge of body parts and how things work together. Also, his father is a nurse, so I'm sure he'd heard a few things there as well. \n\nOne of the things I like so much about the AZ Science Center is the interactivity. I've taken my son to the Children's Museum of Phoenix a number of times and that just feels like playing. Here, it feels like learning disguised as playing. And, to me, that's the best way to get a child to learn. I'm thinking a membership is in our future.", "business_id": "MwmXm48K2g2oTRe7XmssFw", "stars": 4, "date": "2011-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lBMCBwbAhfgb5oKqilA7CA", "review_id": "uSMgzBkTOIoR7uHAf_z64g", "text": "I've noticed some of the reviews say best for older children but i've been taking my son since before he could walk and absolutely love it! He has the greatest time. Even though he doesn't quite understand the science behind everything, he loves running around and pressing all the buttons. The weather machine is his favorite. During the warmer months he loves playing in the ball fountain. We started going here after getting a free cultural pass at the library and loved it so much we ended up getting a membership. It is definitely worth it to get a membership. We go a few times a month and it never gets old. You can find discounts on memberships on living social before the holidays. We've gotten our memberships for 50-30% off over the past two years. \n\nIf you have a toddler best time to come is when school is in session and after 1pm. This place gets packed with school groups in the mornings.", "business_id": "MwmXm48K2g2oTRe7XmssFw", "stars": 5, "date": "2013-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rodF6YO7jnUOdeQE_yUuKQ", "review_id": "QPaG2xK14jblywKrDetyqg", "text": "I have been to this subway at 16th st and thomas many times. What I like about subway in general is they fix the food rite there in front of you (I guess most sub shops do now that I think about it) so the chance of them botching your order is low.\n\nAs far as THIS location, yes, it's not located in the best part of town. I was once confronted in the parking lot by some guy riding a bike saying he could fix my car, he started touching the undercarriage and trying to say a body part needed replacement. I take great care of my car so I knew that was a scam. The food of course is great, I love their cookies, always big and fresh. As far as the employees, they are pretty friendly but being it's a sandwich shop, yes you cant count on seeing the same people there too long. My biggest gripe about this location is I have been there more than once when they are supposed to be open in the morning and they arent. Their hours posted on their door even say they should have been open. If someone calls in sick, doesnt subway have some kind of backup plan? The first time it happened I just blew it off. But it happened today and I complained on subway.com. It can be especially frustrating if you find it closed when it should be open on the last day your coupon is good for. They oughta give you a raincheck or something.", "business_id": "ldIxXmxD3Cku0vODGYb9dQ", "stars": 2, "date": "2014-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_T1n_tMYvgt73Ned56TwGQ", "review_id": "Okwd1Ulg_vHjtB3CxhPf6A", "text": "Wow! every dish I've tried here has made me wiggle in my seat with happiness.  Love the sauces.  Delicious. Homestyle goodness.", "business_id": "hWhVP-28LYP3llaMlAJ_JA", "stars": 4, "date": "2009-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "EZvu6phgzFBSnwId8cYKkw", "review_id": "gVXBetuOPHNPNcootKinaw", "text": "I sat down at 2p saw server she gave me salsa no chips. Ordered food at 210 and 230 rolled around still no food told server I had to go she said she would be right back 5 minutes later she comes with my food. I seriously had to go so I asked for a box 5 minutes later.box comes. Horrible experience.", "business_id": "hWhVP-28LYP3llaMlAJ_JA", "stars": 1, "date": "2014-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HXkojbgCi1m2qXjCt6Isdg", "review_id": "HC3JOZPRccVusHnn-4Ysig", "text": "Food was OK. Have had better and also worse. But check your bill before paying. Just had 3 people add the bill and all 3 had different totals. Seemed like the server was trying to get away with adding additional gratuity ON TOP of the already added gratuity for a larger group by \"adding wrong\". That doesn't sit well in my book. Check you bill people.", "business_id": "hWhVP-28LYP3llaMlAJ_JA", "stars": 2, "date": "2015-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "oCOpTI1-LgjYaNzylJ46-w", "review_id": "CheLIHZQwuSur-TM2Y_wgA", "text": "Love this place.. i've been coming here for almost 8 years maybe more :) Love the atmosphere, music, the drinks are fabulous, the staff is great and the people are so fun to dance with. I love how it's not all country it's a mixture of music which's great.. Everyone gets a long and we're all just some kind of family when we all get together dance with each other n share some great laughs.. Love that they have dance lessons too it was the first place where I was taught two step and line dancing. This place is awesome and the HOTTEST OF THE HOTTEST Lesbians come here... Hope it keeps going strong for many years to come.", "business_id": "c6sTwXAwIAgf2YQtA4ZWHg", "stars": 5, "date": "2015-01-23", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 1}, "user_id": "xkTbpCc-YhU8-EXZDA7u0g", "review_id": "tiVvvfT0J6atyuUi_0PJcQ", "text": "Man, if I wasn't scared to death to park in That's a Wrap's death trap of a parking lot, I'd be there all the time. The wraps are awesomely huge and a tremendous value, and they really put together some killer flavor combinations.\n\nLast time I was in I grabbed the In Like Fin, which packs ahi, mango salsa, a peppery ginger slaw and garlicky rice into a tomato basil tortilla. I couldn't finish the thing. \n\nAnd, as a bonus, the people behind TAW are opening a new concept soon. Keep your peepers peeled!", "business_id": "ZoQAOnEFnyHjSpomtfqesA", "stars": 4, "date": "2010-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "VeV02NK_4RQm_f-qNxmyPg", "review_id": "yDyaB7s84Y2w2SgvBsC0fg", "text": "My horchata was tasty.  The carne asada tacos were not.  I ordered just the 2 taco combo. Came with beans and rice.  Rice was kinda dry, I had to mix some salsa and beans in with it to eat it.  The carne asada was super greasy and the tortillas were not warmed up enough I think as they were kinda stiff.  The gordita's my dude ordered looked far superior to my food.  \n\nI like how they had a little market and bakery in there.  The self serve salsa bar was nice.  This ambiance was very authentically Mexican.  Colors, smells, sounds, everything.\n\nI'll be back to try something different.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 3, "date": "2009-01-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "N6q91wGo-JY1yo-fMycjGQ", "review_id": "l05Pmldf8u34ICHeRRibwA", "text": "Some of the best Mexican food in the valley! The ribs, el pastor gorditas and chicken chimichangas are some of my favorites. The prices are also very affordable!", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2012-12-12", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "1PWFPOmqvLx3sGKuuKQr9Q", "review_id": "XLdbHY5j0KAbiUOkLsqApQ", "text": "I really don't understand all the complaints about this place.  I've been going here for years, and the food has always been solid, cheap, quick and really tasty.  The menu is huge, and I have no complaints about the service or cleanliness of the place, either.  \n\nI usually get the fried tofu with garlic sauce.  It's transcendent.  Crispy, delicious triangles of fried tofu and a fantastic mushroom-garlic-onion sauce with some brown rice....I have dreams about it.  If I have the cash, I'll get some spring rolls with spicy mustard, which are a hot, crispy delight.\n\nHaters gonna hate, I guess.  I just wish it was open all night!", "business_id": "ykfTh6HI219NoMsWBxulxw", "stars": 5, "date": "2010-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "e0Rls_7QxkVcFJtUXDaA0A", "review_id": "JjGs2tEJXqKLElUWsokXpQ", "text": "The sad fact is that most yelpers will eschew this place for it's two more accessible neighbors - Filiberto's and La Santisma - and that is a damn shame, because nestled right between those two restaurants is a superior dining experience.  \n\nTacos Mexico is the truth.  Don't go expecting fancy furniture or Day of The Dead iconography - this place isn't trying to serve you a Disneyland version of Mexico - what it will give you is an authentic taste of some damn fine Mexican tacos.  \n\nPS - their red salsa will burn a hole in your tongue.  If you treat it gingerly, however, you will be treated to a flavor bomb like no other!", "business_id": "McdTNj-TUMOlfkHwQWs4rg", "stars": 5, "date": "2014-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "Cp-PV8rsypbO-xBrQ6KmQg", "review_id": "0AuPpLLHVa-nwRoqaAPwEw", "text": "Quaint little diner - a great example of kitschy 50s Americana. It's the sort of thing 5 & Diner tries to be, only more authentic. The menu is very simple and it's nothing you couldn't get elsewhere, but the food is very good. You didn't really come here for the food though, did you... no, you came here for the atmosphere...\n\nI went during the summer and it was pretty hot inside the little box. There were some fans working overtime to help compensate, but with the cramped quarters, the dining area is pretty close to the stove. \n\nYou can tell that for the people that own and operate this joint, it's definitely a labor of love. It's such a warm and inviting place to go. I can see eating here once in awhile for the experience, but it's not the kind of place I could see myself eating regularly... maybe it's because I don't live in the neighborhood. People in walking distance would definitely become addicted to the place. \n\nI really enjoyed the food here. There were funny little books available for us to read and there was a notebook where customers could draw in. The whole thing was something I'll always remember... fondly. You owe it to yourself to at least check this place out once.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 4, "date": "2007-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2BS05HwuXcnFL-YqlyhtnQ", "review_id": "DP1r_xSrU95BRsgba4t4Vg", "text": "Amazing food! We had the fried chicken on a biscuit sandwiches  one was with the sausage gravy - and the other was the  buffalo one both very good. We had the Hurricanes also very tasty. Definitely going to be on our list of favorites!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2013-12-27", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "V6rhoTCw7S6H8eHwv2M6Vg", "review_id": "Zk8AiQTMp1c9Kh_bZeM4pg", "text": "I remember hurricanes.\nThen I remember nothing.\nSo they must have been some pretty good hurricanes.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 4, "date": "2014-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0rOIvxlURdppFMU9u5Ep5w", "review_id": "QfztKIK-JlWHex7kXMoCWw", "text": "Grew up in Canada and Poutine was a staple. This was different with southern gravy instead of brown gravy, but it works especially on their fries. Wed. has a happy hour featuring those same fries with pulled pork and a very special Cole slaw. Add a burger and a beer and you've got more than enough for two for dinner at under $25. This is serious food, done by m who really care about doing it right.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "uHQ2ZRacs1Zhi_38MQz2BQ", "review_id": "ahbYDD4kHuP7edkPBv0CJA", "text": "I love this place. What a neat little local gem in the Garfield Historic District.  The food is delicious and the drinks are made with love and real juices. This is my favorite brunch spot downtown, and any day this is the best place to eat latenight. They'll give you the best comfort food you could possibly need, and serve your friend the best lovingly-created vegan food simultaneously.  The staff is amazing and their product is flawless, quality , and local. Love love love!!!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ACYNilUq0mjbXoJWXkbbxQ", "review_id": "_G6ogWdGX18k8zFc272DXA", "text": "I really had high hopes for this club.  New to the area I was excited to try a new place. The drinks are good. But the added dust bunnies being blown from the ceiling are a deal breaker.  It's rather disgusting.  This place needs a good cleaning.", "business_id": "0VpsHbGLHDVKIKAi0ZliyQ", "stars": 2, "date": "2014-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zaZD-L-hP55v9RRkcL7nVg", "review_id": "ZQdTC6rt3dxjuU7V-5gmHw", "text": "Disney Land for Foodies. Fresh Baked Goods, Salsas, Mexican dishes (the torta cubana is to die for) and an awesome atmosphere, plus more produce than the human eye should ever behold. My favorite place in Phoenix.", "business_id": "VXIkI9_EbDbYHeO9IzKjJg", "stars": 5, "date": "2009-02-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "y73f-Vv38NWs2wIXOemfuQ", "review_id": "oXo6W8xwcGpHeMbaOxYtgw", "text": "I'm spoiled by the Cardenas franchise in the Coachella Valley so this is just an okay Mexican market. A lot of the fruit was cheap but overly ripe (avocados, kiwi, etc). The corn tortillas are cheap, a fresh packet of 70 is only 2.99. Also got good deals on herbs (cilantro & parsley). I would not buy meat here. The couple in front of me bought ground beef & the plastic had come off of the top on the conveyor built. Neither they nor the cashier seemed pertubed by that!", "business_id": "VXIkI9_EbDbYHeO9IzKjJg", "stars": 3, "date": "2014-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "CWhlfXfnwhfyM40GdZpbzg", "review_id": "IkTL9jtQHjMRmUkrVcsXhA", "text": "Ryans pet supply has a wonderful staff in the repair shop. The best customer service in town.", "business_id": "Dj3i6a_vboALYTRKTmBABQ", "stars": 5, "date": "2013-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DwU7KVfebA70AlVtX0iOWw", "review_id": "v11cKlFw0-TM37AtjdHing", "text": "Yes it is an Asian Donut shop, but they know donuts. The Coconut Flake, and Coconut Toasted were super fresh, moist, and totally delicious. The Chocolate Cake with Chocolate Icing & Nuts was good, bordering on the dry side. Still good mind you (what donuts aren't) but not as tasty as the fresh glazed base of the Coconut. Yes the outside looks shady, but when you walk in...Donuts! Rainbow is a great find.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2011-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ps0_3XcqKKM5jex4VkICNg", "review_id": "4ThmpbMmR2GnTfwoaNGTgw", "text": "We have been here twice now and we have left both times with huge smiles on our faces! The wait times were minimal and the entire staff was amazing! The tech took her time with us and never once made us feel rushed and was very informative. i am a talker and she listened and answered all my  questions and was very sweet to us. We had the pleasure of having her both times too!!! She had remembered us from our last appt from 6 weeks previous and was referring to things we had talked about last time. She even tired to get us specific pics for a cute frame we had bought. She was GREAT!!! I would def recommend PPA to everyone! They have been nothing but wonderful to us.", "business_id": "K4yExVqUtW2sRE4grXU8Zw", "stars": 5, "date": "2015-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lQvNzq90fTJzW1CjA9Httg", "review_id": "VXA8lURJkfwpDhG_unF-0w", "text": "Pupusas are the perfect combination of cheap and delicious. 10/10, would go again.\n\n(Friendly note here: it's spelled pUpusas, not pApusas.)", "business_id": "rbiRLiFTG098z9JaK3Nshw", "stars": 5, "date": "2015-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WdMOJohw_WzN5-G2xzg66A", "review_id": "zC6o8FUdgPpxyxGYyIJPsQ", "text": "Nice location and the food was good.  Service was initially quick but quickly things went south when the restaurant filled with people.  I think we may have been forgotten when we came here but they seemed to have been short staffed.  I don't totally blame the staff, but simple requests were quickly forgotten and 20 minutes later we were making the same request again.  Perhaps they should hire more people -- otherwise id recommend this location.", "business_id": "SZvYxcvYYVRue9MXcEDjsA", "stars": 3, "date": "2014-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kq5Pdsy8Znyh9KEkxWT_QA", "review_id": "-VZWBoM6sZ_VaXmpR49apw", "text": "In a pinch, I had to find a place for lunch that was downtown, not overly expensive, and served both delicious soup and salad. A coworker suggested the Coronado Cafe, so I looked up the menu and happily discovered that it more than met my criteria. \n\nFor lunch, I had half of the Turkey sandwich and a small Coronado Gorgonzola salad. YUMMMM!!! The Turkey sandwich has a sort of cranberry relish instead of mayo (much healthier and much more delicious), and the Gorgonzola salad had apple slices and candied walnuts. It was the exact meal I was in the mood for. \n\nThe restaurant itself is almost too cute for it's own good. It's small, cozy and the absolute polar opposite of any chain restaurant. The service was great, and my food arrived quickly. I can't wait to eat here again!", "business_id": "5-X03Zc0nN7U5eoe8uFUdw", "stars": 5, "date": "2009-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q8_dOUh6_YAzhpVTtsEFWA", "review_id": "1eFI2prqHWR-mdH2QTL4pQ", "text": "Nice place to hang out and have breakfast or lunch. The ambience is pretty and food is excellent. Crab cake is a must have.", "business_id": "5-X03Zc0nN7U5eoe8uFUdw", "stars": 4, "date": "2012-12-21", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "y7sq26EXGz7XG7DSo8TOuQ", "review_id": "Ked_2wxhmhnzQvOFt5cuFA", "text": "Sonic, eating with you is a crapshoot. You either are oddly surprised at how good your food is or you are smacked in the face with the blatant fact that you are eating some of the most processed food you'll ever have.\n\nYou are generally quick, and sitting in your car... well, I just love it when my car will smell like a chili dog.\n\nBut your drinks. Gosh, you come up with some masterpieces. Nerds in my drink? Who would have thought!? DELICIOUS GLORY!", "business_id": "0De3TQ_uSOXwgduKL0va3w", "stars": 4, "date": "2015-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "8Oug5kS4s3ExAe-GCjQqXQ", "review_id": "Qdi15DU0sm5wqu-s9edz7A", "text": "Great atmosphere and delicious food! The chocolate shakes are great and the sandwiches are refreshing. Definitely a lunch spot to remember :)", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 5, "date": "2012-01-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "ZMLASyA3TdOqku8CqP7JpA", "review_id": "Jam3hFkZGaQKzfUMXM8QRw", "text": "I had an uncontrollable urge for an old fashioned soda so Yelped \"soda fountain drinks\" in the area. MacAlpine's popped up with some good reviews. From the outside we would never have walked inside!\n\nThis antediluvian restaurant/coffee shoppe is really pushing the limit on dirty vs nostalgic. The wait staff were dressed in mismatched outfits, grungy socks and shoes. The shelves in the restaurant itself are packed full of ageless classic memorabilia. It was fun to sit and let your eyes wonder over everything ~ almost overwhelming. We're talking \"out of control packed\"!\n\nWalking in we really did not know if we were in the right place because you don't walk directly into the restaurant. There are technically three rooms that cross in the center room which is the restaurant. Each of the side rooms are small and hold antiques, clothing, furniture pictures and misc. items. \n\nOur waitress was friendly and service was OK. I had an old fashion soda with lime syrup, vanilla ice cream and a shot of phosphate. It was refreshing. The hubster had a tuna melt and a root beer shake. There is plenty on the menu to please any palate.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 4, "date": "2015-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M6oU3OBf_E6gqlfkLGlStQ", "review_id": "TOH49jMW0wAcb1iWQ4vGKA", "text": "Their food is so good they need metal bars to protect it. Seriously the order and pick up windows are behind bars, but it may be due to the neighborhood.\n\nThis is a place the Yelp is good for. There is no way you will find this driving by as its off the main road and has no sign on the outside. The only indication was the line of people going out the door.  \n\nSeating is limited to some dilapidated picnic tables on the adjacent patio. \n\nThe menu board is quite simple only listing burritos and chimi changas and tostadas, apparently there are some off menu options that are not posted.\n\nI ordered the a bean chimi changa, It was a bean burrito deep fried and then dolloped with guacamole and sour cream there was cheese sprinkled on top of this. It was served on a small bed of shredded lettuce in a white container.\n\nThe Beans are flavorful and runny like a bean dip, the fried tortilla was great a it should be, the guacamole was a neon green fake variety and the sour cream was cold and firm . \n\nThere were down sides, the price was a bit steep considering the location, potion size and lack of seating. They ration the hot sauce and charge $.15 for a thimble or $.50 for a small cup.  Drink are cans of soda only. And the line was long and poorly structured. this is why it only gets 3 stars, the food is good but the drawbacks hurt it. \n\nAlso Note CASH ONLY", "business_id": "Xo9Im4LmIhQrzJcO4R3ZbA", "stars": 3, "date": "2010-02-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "btLssxZq0qOFKKBbYP8L6w", "review_id": "Mx9JZ-QaeJh5eToOOnneSQ", "text": "Well.  WOW.  I honestly can't believe how good this place is.  I have been a long-time fan of Carolina's so I feel bad for saying this, but Rito's beats it hands down.  I went for the Green Chile Burrito Enchilada Style (I meant to specify green sauce but I didn't so it came with red) and it was amazing.  I can't wait to try it again with the green sauce.  My friend ordered two shredded beef tacos...and wow.  You can't go wrong here.", "business_id": "Xo9Im4LmIhQrzJcO4R3ZbA", "stars": 5, "date": "2013-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2Yc8jyDLnyv_yhGEor3Maw", "review_id": "_G0r-dvLSY-blhhBDrHVXw", "text": "This place was delicious...I got a green chili burrito enchilada style with rice and beans...The chili was homemade and not from a can...One of the BEST burrito's I have had in a very long time...Will definitely go back.", "business_id": "Xo9Im4LmIhQrzJcO4R3ZbA", "stars": 5, "date": "2015-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tL_QF_iIGoaPd-otIGa22A", "review_id": "-zLZrTaKhV5W_M_Hg08XVw", "text": "I was kind of turned off when I pulled into the parking lot, but I decided to try this place after researching and it got amazing reviews on Yelp and other websites.  Although the outside is a little unappealing, the food was so so so good!  The salsa was very spicy, and tastey!  I would definately go back for some good Mexican seafood!", "business_id": "NYBx4sdSVrN-I5Q8RfLMPg", "stars": 5, "date": "2011-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "oziKrQusQSHo9QKwYKpl0g", "review_id": "eob3b4KmpMkqpIvL_SEdvg", "text": "I selected this place based on all the great Yelp reviews, and all I can say is that I was very disappointed.  I'm fine with it being kind of a dive...my issue was with the food.  We both got ceviche apps, which were pretty good.  I had a fish filet & my BF had the dish with chicken, shrimp and beef (forget what it's called).  I found the food to be pretty salty, which I can't stand.  My fish was swimming in some kind of liquid, which totally turned me off & the salad it came with was drowned in some kind of yellow Italian dressing (Wish Bone out of the bottle?  not sure).  My BF's dish was ok at best...the beef was chewy & the shrimp & chicken were salty.  I hate to be so harsh, but I gotta call 'em as I see 'em.  Would def. not return.", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 2, "date": "2012-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zeb8aK80RrwxjcudsmUbjw", "review_id": "487TCMZ1tkS6FdbLobssvA", "text": "This place is INCREDIBLE! I stumbled upon this restaurant through Yelp and it's raving reviews - well everything the hundreds have said before me is true...you MUST try this place out!", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2014-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LUESm405yl4gtJvEJzzwnA", "review_id": "D9VGIVPlENuGzcjeHXQByA", "text": "Awesome food, ceviche, shrimp cocktail everything! Sometimes they are crowded and super busy but bring you out a free ceviche tostada to hold you over. Great Place", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2015-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s7NrYz-UVyL4Z_po_mBQsg", "review_id": "j6zpIY2jBBzawgQnGnjwXw", "text": "I love this place!  Great for kids because they have activities for them and in the spring the butterfly garden is teeming with life.  Always have a something great on exhibit.  Being a member there myself, I know there are a lot, no, a ton of classes and walks and guides there almost daily.  Classes from the arts to landscape design.  \n\nThe experience is never the same there on the trails and in the exhibits, which is what makes it so fun.  You really have to go there and walk the trails and hear the jazz played at night!", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2009-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dcnkH3B6ZjlNJfKKWLU4Mg", "review_id": "98-Xq3Gkm4hRMozMKd88Sg", "text": "Oh you have to see this if you go to Phoenix. Like entering the mind of Dr. Seuss--gorgeous, different, whimsical educational.  The desert is remarkably rich in life and diversity.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 4, "date": "2010-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Lzug6WSdwzdGECzcgHPEyw", "review_id": "TJ5dBIFTRjmnxfR_0QTC6Q", "text": "Wow, what an overhaul! I haven't been here for 12 years and wasn't looking forward to returning ;-p They really ramped up the place - paved walking trails, a multitude of cacti, wildflowers, and other plants I had no idea existed. \n\nThe guides giving informative talks were actually nice, knowledgeable and entertaining, it was the first time I didn't bolt! Well managed and organized and offered arrows where to go (thank heavens!). \n\nMy mother in law (and myself, who am I kidding?!) would have appreciated a twinkie stand here and there, but was really well landscaped. Only negative was the price - $18 pp. Good thing I had my student ID from 18 million years ago and the sun hid my grey hair, else I would have had to forgo dinner to get in! ;-)\n\nDefinitely a do for out of towners and locals.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 4, "date": "2012-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Nms3T3WN9-bzr7wP5rxZfQ", "review_id": "df7AYgLzaSgzI8EbuLbqsw", "text": "Every time I visit the Desert Botanical Garden, I kick myself for not visiting more often. It's usually one of their amazing annual events that pulls me in - Luminarias, Chiles and Chocolates, or some other special exhibit - but there is so much to see and explore and learn in this garden, even when there isn't a special event going on. The collection of plants is extensive and impressive, the way it's organize and displayed throughout the garden makes turning every corner an adventure, and their dedication to showing off the beauty of the desert is enough to make any Phoenician proud. If you are a photographer, this is one of the best places in Phoenix you can go for a wide variety of photo opportunities, any time of day and any time of year. Whatever you're interests may be, for out-of-town visitors this should be at the top of your list of attractions to experience, and for locals you should make it a habit of visiting at least once per year.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2013-12-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "R4Ax3btoJ6qLXhqq6J50VQ", "review_id": "Uxm_BBYo1IQriwA2LnAvrg", "text": "All I could remember was ... heat.  We went on a mid 70 day and it was still exhausting to walk in the heat.  There are a few really tall cactus' that are cool but honestly..... I wouldn't go back nor would I bring anyone visiting.  I can't seem to find entertainment in plants ! Don't take my opinion on it and go at least once.  The glassblowing exhibit made it a bit more enjoyable.  We stopped by this food area that had really good garlic fries... being foodies we even tried to food.  There were a lot of quails .. we spotted a cardinal which was pretty cool.  Other than that.. a few tips buy online to skip the line, bring water, use your student ID.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 3, "date": "2014-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yzZl5u3mkE0i82aVcXrngg", "review_id": "4Xi4XpPexgn27gqQu9tWFg", "text": "Judging from the photos, it looks like the best time to visit was when they had the Chihuly installation. There are a few pieces still there and they are absolutely breathtaking. It was cool seeing all the different types of desert plants, and I'm sure it's even better if you're able to time your visit for when they are in bloom. \n\nOne of the coolest things was learning what it looks like inside a cactus. I would have loved to see a plaque or some interactive exhibit with a cross-section of a cactus that showed how everything works. \n\nAll in all, I think it's a great stop if you're visiting Phoenix.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 4, "date": "2015-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "mU5GwCA4uiD0-RH1qt3jrQ", "review_id": "Kr6prF8h9ZaSztrAHtA50w", "text": "Room:\n- A suite with a living room and bedroom.\n- Soft and comfy king size bed. I love the down-filled sheets and pillows.\n- Wolfgang Puck dual coffee pot, coffee, and tea! \n- Has a mini fridge, microwave, and mini safe.\n- Neutrogena products \n- A TV in the living room, as well as the bedroom\n\nCheck-in:\n- Warm and soft chocolate chip cookie! Yum!\n\nFree Continental Breakfast:\n- Includes: french toast, sausages, bacon, eggs, fried potatoes, fruits, cold cereal, milk, and pastries\n- A sit down place for eating\n- Guests can pay extra for gratuity\n- Food is decent for breakfast, but the pastries taste better warm\n- If you want hard boiled eggs- that costs extra\n- For those who cannot sit down to eat, there is coffee and pastries before the eating area.\n\nFacilities:\n- Conveniently located near the freeway\n- Has a computer area near the hotel entrance\n- Outdoor pool and jacuzzi available\n- Exercise room with some treadmills and weight machines\n- Lots of parking available in the back of the hotel", "business_id": "qIhBNeE64skjowRs6TTwJA", "stars": 4, "date": "2008-02-01", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "uB3wr0H0sOesP3dbkeH42A", "review_id": "uw4ZmTKejXTdXBAFKDRZWg", "text": "Love this place. Service is always excellent-- it's usually the owner that waits on you. The food is wonderfully flavorful without using a lot of spice. Natural flavors are what makes this place tick.\n\nI've eaten here many times, and my recommendation is that you just order every appetizer on the menu and forget the entrees. At least, the first time you go anyway... You'll want to try it all.\n\nVery good food!", "business_id": "q2SZa5g85758iW1L9sSL1g", "stars": 5, "date": "2012-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ve_1EvDHMfzNPPna6wnIEQ", "review_id": "YkFdOqDyKkY49s7fPbmeaQ", "text": "Worst customer service EVER.  Wanted to return items with my receipt but they were purchased from a different store.  The store manager simply refused to do it even though they were new items and they sell them.  He blamed it on the area and then eventually blamed it on them being locally owned.  He then proceeded to talk about a return policy and when i asked where it was posted he pointed to Christmas return policy sign from 12-31-14.  \n\nI was going to purchase additional supplies and materials to take care of my new apartment totaling well over the $32 I was trying to return.  Convienence was what ACE had.  I will now drive out of my way to support a store who values service.\n\nCustomer Service is because you want to not because you have to.  As a small business.....you should value your customers, or else the big boxes will win!", "business_id": "Im62ug5-qDonp9Kne1sCUQ", "stars": 1, "date": "2015-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bpEDpf6_-s1CSxMUfkij0w", "review_id": "Hnd5tT0q8hrOvOOACLsZ3Q", "text": "I don't understand the low rating for this restaurant. \n\n- Great ambiance relative to the numerous other Indian restaurants I have been to.\n\n- Good service, water was refilled 3 times, naan was replaced immediately upon decimation. \n\n- PRICE. With the yelp deal its incredibly cost effective to get full off of good indian food. \n\n- The food was good, not great, not bad, but good. \n\nOf course I always compare a meal relative to how much I paid. I paid $5 dollars for AYCE indian food that had a decent selection of food, all of which was delicious. For 5 bucks this place is as good as it gets. \n\nAlways review relative to how much you paid. If you rate this place any less than 3 stars you are truly a snob.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2011-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "__4B6UHA7x9lXOsZanUC0Q", "review_id": "qfjMUMZtueXD1iaWmoy4iQ", "text": "I went to this place on my trip to Arizona and Phoenix. Ambience, location and staff is pretty nice. The food was average. Me being from bay area may be a little rude but the food just had the taste of cream. Ordered for the following dishes:\nMalai kofta: koftas tasted frozen\nPaneer: panner was good but gravy was all cream\nOnion pakoras were awesome\nI would may be go there if no other option is available, but then it could be just my taste buds.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 2, "date": "2014-12-29", "type": "review"}
{"votes": {"funny": 6, "useful": 3, "cool": 4}, "user_id": "APLIPfq1Rf8QyhHHk2uAyA", "review_id": "0wjtqQJ56A86C4UqmW9VPQ", "text": "Dodgy. Sketchy. Shady. Skeevy. Whatever you call it, it's all the same and it's at the Breakroom. \n\nRodeo was on TV. Awful tone-deaf people were singing. I'm sure many a deal was happenin' too. Here's one place you're sure to score. \n\nBut, c'mon, it's not THAT scary. Granted, I ain't going by myself. But in a group or with a friend, this place is fine. They serve drinks just like anywhere else. \n\nOnly thing unique and vastly different about the Breakroom is that their patrons are bonafide true-blue people probably dealin' with real-life issues - not broken nails, bikini waxes or studly tans. Their stories are written all over their faces, and let me tell ya, after reading a chapter, I wanted nothing more than to put the book down and walk away.", "business_id": "W41CEzdKJe8wdDB-Rd6KJQ", "stars": 2, "date": "2007-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vx7sGIg26g3sBKkCyzq3vw", "review_id": "BQ0IA-YhhX7sBAyBsC7QVw", "text": "My husband and I LOVE Red Devil. We eat Ina few times a month and order take out at least twice a week. Red Devil never fails to deliver an excellent meal. We generally eat dinner late (after 8pm) so we rarely wait for a table. Dinner hours expect a wait, but definitely well worth every minute!! The take out guys are awesome!! The entire menu is delicious! You can't go wrong with red devil. Enjoy!!", "business_id": "PEHJjxdw11TGFma9Zhz3ng", "stars": 5, "date": "2013-01-01", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 3}, "user_id": "usQTOj7LQ9v0Fl98gRa3Iw", "review_id": "KSYvRyYojiMxVMqmvX3mJg", "text": "{solid 3.5 stars]\nOn a whim and with little thought I purchased a ticket for an event here. A spoken word event [well technically it was a psychic/medium that has quite the following, who I never heard of]. But I am not here to get into those details. \n\nI pulled into the lot and noticed a sign \"$5 Parking\". WTF?! I had already paid close to $70 for the cheap seat for this event and now I am being charged for parking. Making my way to the box office to pick up my ticket I was intrigued by this round building in the hood. Walking into the \"Club\" portion of the venue I glanced at the prices. Pretty standard $5-10 depending on what your drinking. After paying $5 to park and the cost of the ticket, I had invested enough in this venture already. \nDetermined to get my money's worth I did make use of the ladies room, which was relatively clean. I then stood in line waiting to get in. \n\nThe staff I encountered were friendly. Having not been to this theater before I asked for directions and was directed there with courtesy. The seat numbers were a little confusing. luckily there were not many seats in the row and I was able to count the seats to determine which was seat 8. I was 7 rows from the stage in this small intimate venue. Not bad... \nI could see how this would be nice for a comedy show or a mellow musical performance. [After reading other reviews from Rock/Punk performances I can see how places like the Marquee and The Clubhouse would be more suitable.] \n\nWhile waiting to get in I read the reviews. Several mentioned tight seating. Now I am a big girl and that concerned me. If this is anything smaller than the width of an airplane seat, I am in trouble. Luckily it was better than expected, which doesn't mean much and I was pretty cozy until the people occupying the seats on either side of me sat down. Both ladies had \"super\" purses. You know the ones that hold EVERYTHING, unwilling to put them on the floor and swinging them around everything they would get up. And the other lady spilling her soda on me barely apologizing saying it technically wasn't her fault since they over filled her soda. WTF?! Anyway the tight space was making my patience ware thin. \n\nHowever the theater is becoming quite innovative and in tune with technology. As I waited I was handed a card that advertised the Theater's app for iPhone and Android. This app was designed to keep people in their seats and a theater usher would bring you drinks and snacks ordered directly from your phone. Someones thinkin'..... \n\nWhile I would never spend that much to go see that performer again, the crowd was more entertaining. I can say that depending on who is performing I would not hesitate to go back to Celebrity Theater.", "business_id": "BcBxTyj09Wu-w0KA1QvKTA", "stars": 3, "date": "2011-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rx2w-qyAY6Yi56K1r1MReg", "review_id": "66G901cmXyx1jckDaduxXw", "text": "Horrible. The seats are dangerously small and lack room in front of them. I am 6'2 and I have bruises on both knees from having to wedge my knees into the back of the seats in front of me for Aziz Ansari. The entire two hours was miserable. Please please renovate the seating.", "business_id": "BcBxTyj09Wu-w0KA1QvKTA", "stars": 1, "date": "2015-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ngD5RF07pxwlq4euexSluA", "review_id": "iGUuINhpxsiZqw1uvcMZww", "text": "Dan is 'da Bomb!\n\nIf you want an HONEST assessment of the extent of your phone repair, and competent, reliable, and fairly priced service, Sun Cellular is the place to go.  If you want a pretty picture, a low ball price, then an unpleasant surprise once the other guy has torn your phone down, go somewhere else.\n\nBrought a phone in with an oddball part needing replacement, that needed to be ordered.  Dan was very specific; he let me know the part was unusual and needed to be ordered from manufacturer, how long it would take to get it, and the cost.  I wasn't thrilled with the wait or the cost of the part.\n\nI called a few other places, who told me \"yeah, we can have that done today (or tomorrow)...\", widely varied pricing, all on the low side.   I asked them to verify that they had the correct part in, and NONE of them had it, and the cost and the wait time went up with all of them.  I can just see it now... you bring the other guys your phone, they tear it down, THEN tell you \"oops, gonna hafta wait, cost is higher\".  Now you're a captive audience, and they have your phone.  BAD news!  \n\nNeedless to say, Dan got the phone, and fixed it.  He was right on the price, right on the wait time, he knows his business.  Labor fees are low.\n\nHe's got my business for life.  Thanks, Dan!", "business_id": "4anyLAWqWVZh5BFpol9czQ", "stars": 5, "date": "2012-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "usQTOj7LQ9v0Fl98gRa3Iw", "review_id": "BxRce05hEgYskupkxvFjCw", "text": "Now I hold all my BBQ reviews up to my favorite standard and that is Rudy's (a TX based chain with stores in ABQ).  Now I have only been here (Honey Bear's) once on a suggestion from a friend who said it was as good as Rudy's.  Well now I can't say that just yet.   \nI stopped in on a whim for lunch.  I decided on the pulled pork sandwich and a side of mac n cheese.  I added a few jalapenos, but I could have used some fresh onions (I guess I should have asked).   \nThe mac n cheese was good and creamy (velveta like in texture)  and the bbq sauce thin but very tasty (not to sweet, not too ketsupy or vinegary and a nice kick).  The sandwich was that type that required some fork and knife work, especially if you are like me and add more sauce.   \nAs for the restaurant itself, when I was there it was clean, no frills cafe style.  You go up to the counter to order and pick-up and find a spot to sit.  I enjoyed my meal and plan on going back to try more items off the menu.", "business_id": "xfk9eY8gmwn8qsbyd-W6lQ", "stars": 3, "date": "2010-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "i94sMKEeWy2ipDaTqyK1Fg", "review_id": "8EUactM1Sxr9FpQ2gRkapQ", "text": "The best BBQ in Phoenix, hands down.", "business_id": "xfk9eY8gmwn8qsbyd-W6lQ", "stars": 5, "date": "2014-01-12", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "SvaIOy69Fb9Yz0rOE8Svsw", "review_id": "jJMQjTskinAEx-cb65XnEA", "text": "LOVE the Phoenix zoo! My son and I are there at least once a month for regular zoo days and breakfast with the animals (special program for youngsters to learn about a specific animal and have breakfast at the zoo) \n\nIn addition to regular zoo days, we enjoy their special events. We spent \"Noon Years Eve\" there--they had a special event for kids, they brought in snow for the kids to play and even had a cider toast at noon. We also went to zoolights (holy crowded) on my sons birthday.\n\nI also love that the zoo has a social media presence. They're active on Twitter and always have deals and contests going on.", "business_id": "1Ap6ZNCvyLLKHP0wvCk9yA", "stars": 5, "date": "2010-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8tT5cnZBiu2zQkYezotmMw", "review_id": "dY2VD8rs5ZMIAXQ3egnxhw", "text": "This zoo is great!  We have brought our two year old son here several times and he loves it!  They have a lot to see and do.  It is great idea to but an annual pass.", "business_id": "1Ap6ZNCvyLLKHP0wvCk9yA", "stars": 5, "date": "2012-01-24", "type": "review"}
{"votes": {"funny": 6, "useful": 9, "cool": 10}, "user_id": "VexAJmqOClKzm8KbY7xs5g", "review_id": "k9yg39WOnIh4yTOjMYGclw", "text": "The zoo is pretty big. I liked playing with the sting rays and walking around looking at the animals during the day. Whenever I go to Zoolights during the night, everything is asleep.\n\nIt's the usual zoo with your jungle, desert and whatever animals. There's plenty of shops and snack shops. You can go on a tour, ride the camel, go on the slides (which is really expensive because it's $3 per ride going down a slide), get up close with the giraffes and even get up close with the elephants.\n\nGood place to take the kids and spend an entire day there. Let them look at the animals and also about them too. Bring some water and snacks so you don't have to pay for it at the zoo.\n\nOh... FREE PARKING.", "business_id": "1Ap6ZNCvyLLKHP0wvCk9yA", "stars": 4, "date": "2013-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "C-U5fpKz8NjK1ZOEOoW7iw", "review_id": "uHQ9OQ3RJEe4_yXsbRFcvQ", "text": "Pretty good Zoo. I'ts a zoo, very much like most of the other zoos I've patronized but better than average in my opinion;  but my kids never tire of it. We go to Zoolights every year on Thanksgiving night as a family tradition.", "business_id": "1Ap6ZNCvyLLKHP0wvCk9yA", "stars": 4, "date": "2015-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qK_o6Chm8VakPzeMCurtWA", "review_id": "74edykYo47tU9zThAbicCw", "text": "Great service and friendly staff.", "business_id": "_yGo2ubkwQPXcKrdcURSNw", "stars": 5, "date": "2013-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "THXFpGuTXM0QSmDs_BSn-w", "review_id": "S5G2me8ko2L1YTHudz_WeQ", "text": "I should have known better, I figured hey it was good in north Phoenix so why not?\n\nOrdered a burrito and it was tiny, the guy behind the register couldn't explain the menu to me, much less run the register.  Basically it feels like a ghetto Taco Bell.", "business_id": "_gXpjRIjb5fv5f5IVGXvsw", "stars": 3, "date": "2015-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FgbBjf2XCDXw9bRWka5R-w", "review_id": "yR2CadR48887md9FptBhjA", "text": "Do not rent here. Staff in the front office is horribly rude. They don't care about their residents at all.", "business_id": "MfqEPdcw0UYVdDoV3p77tQ", "stars": 1, "date": "2014-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RCmLs2zkBnI3sWOQ3Ps9mQ", "review_id": "OYcXcOpvPXbrE0tIdQxZoA", "text": "The staff is friendly, very helpful and knowledgeable! They have a great inventory, and are willing to order parts to have on hand just in case you may need them.\n\nIt feels like an old time Speed shop of days gone by!\n\nPrices are comparable to those online, and cheaper than other places around!", "business_id": "pOgvHSiPd4hRlCkekZsBZA", "stars": 5, "date": "2012-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uf0LDargK58IA3fbz6DPxg", "review_id": "WL-tQrOKi3ggISaqtagbog", "text": "The store never look so good really cleaned it up made it a place you want to go to. Great selection of liquor and all kinds of beer and wine including craft beers . People in the store friendly and the drive thru makes it great when you're in a hurry", "business_id": "BHd2uFlGhHldJVhDPqBWDg", "stars": 5, "date": "2015-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vM3r9l4q24ya6TDtrbWFcA", "review_id": "99Z6AMjQGCUKi7EVwZev_g", "text": "I found my MB 380SL through this repair business and I have taken it back each time it needed attention. It was an amazing car when I bought it and after it's last visit this car is running as good as the day it rolled off the showroom floor in '85, even better then the day I bought it. I found this business through a MB blog and then I checked M B Motors on out on Yelp to check out another 380SL I'd bought. This business was very highly rated and rightly so. I will use this M B Motors the next time there is the need.", "business_id": "0Xnduj9w6aYHOtN_RlHUng", "stars": 5, "date": "2015-12-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "opjBZ0ImnKv5eRNQZ-98DQ", "review_id": "Ew1hABhQ3bdNyhBREQ9QDA", "text": "In short: I got a run of the mill Chinese meal here, but I didn't know to ask for the \"real\" menu. Service was excellent for as busy as they were.\n\nSo I went to the Chinese Cultural center on Sunday, Chinese New Year, looking for Chinese culture. I found a street fair with such cultural gems as a booth for Wells Fargo loans, and one selling \"crazy Chinese hats.\" I wanted authentic food, and the booths selling egg rolls and stuff from the market buffet were pretty much the opposite of what I was there for. So my date for the event and I decided to try one of the Chinese restaurants at the center, and I chose Szechwan Palace because I was in the mood for something spicy.\n\nThe place was packed, which was to be expected. Since a good portion of the conversation I heard taking place was in Chinese, I was hopeful that that this would be an experience similar to what I'd get in Seattle's international district. I knew that wouldn't be the case when I saw the menu, which was basically the same menu you'll find in any americanized Chinese restaurant.\n\nSo we just ordered the Szechwan dinner for two. Hot & sour soup, crab rangoons, fried rice, general tso's chicken, szechwan shrimp, and a rice based desert that I forget the name of. I thought all the dishes were decent, but nothing had the spice I expect from Szechwan cooking.\n\nAfter consulting Yelp, I know now there is a \"real\" Chinese menu here. That explains why this place could be so popular with native speakers. I wish I had known. This review reflects the disappointing experience I had with the menu I was presented with.", "business_id": "yQONzVpX-DEpGSuKMIov6A", "stars": 3, "date": "2010-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ea0-et3X8OrHsVBd-wzwTw", "review_id": "tvz2OW45OVWFTEomCEzptw", "text": "There are lots of great restaurants near Phoenix area, as a Chinese student, I would like to say the Szechwan palace can represent the authentic Chinese food.  I ordered Mopo Tofu, Chongqing Hotpot and Boiled beef and fish today. All dishes are really spicy and I really love it.", "business_id": "yQONzVpX-DEpGSuKMIov6A", "stars": 4, "date": "2014-12-05", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 1}, "user_id": "T9YQap5vl8r-tuMlIpEqQw", "review_id": "edgbPP5LvTfOb9F3_2qLZQ", "text": "And my streak of staying in quality hotels comes to a screeching halt.\n\nWhen I'm not vacationing and just need a room to crash in, I tend to be a utilitarian when it comes to hotels. I just need a clean place to sleep and shower and I'm pretty much satisfied. You'd think a hotel by the airport from a national brand would be a safe bet. But no.\n\nFor starters, the neighborhood is just disgusting, and I am not easily fazed by such things. Meth labs would count as urban gentrification. I went to check in on Foursquare and the first suggested location that popped up was PROSTITUTES - HOE STROLL.\n\nThe old building had a fresh coat of paint, so I maintained my optimism. We got into the room, which was spacious and mostly clean. Acceptably so, at least. It looked like it had been remodeled sometime recently, although the carpet had more cigarette burns than the arms of a working girl who can't make Daddy's quota.\n\nI was OK with mediocrity for $49 a night until I walked into the bathroom. The door was literally hanging off its hinges. And the window had been shattered. And there was a smear of feces on the wall.\n\nIf walls could talk, right? These would say GET THE POOP OFF ME.\n\nI was thinking two stars at first, but then overnight, I could barely sleep because the paper-thin walls let in every sound from the whole unsavory neighborhood, from the hookers pretending to enjoy their work, from the drug dealers outside, from what sounded like feral cats in heat.\n\nWe got the hell out of there as soon as we woke up and drove around Phoenix randomly all morning rather than spend another minute in the room.\n\nJust awful.", "business_id": "GF95bWp-19I5YbNtr9VluQ", "stars": 1, "date": "2013-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "_E6PCedBoqRofBEGAxlHXA", "review_id": "5P-1DGC-ZGqvWEdPbVrRwA", "text": "What can I say, it's Costco!!! You can buy excessive amounts of merchandise :). Always a pleasure to be here especially when they're serving samples.\nThe workers are very knowledgeable about everything that they carry, have great customer service, and they're quick to get you out, unlike Walmart on Thomas lol.\nI always have a good time here. So should everyone else. Costco ftw!", "business_id": "XLqnjlLYt0_q_NG7l_BpMA", "stars": 5, "date": "2014-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4l41zxNSqZfZgGp4gp9bKA", "review_id": "5Mch9KIEhAi9Hq0uUE7i0Q", "text": "One of my favorite little spots to go to! The food and drinks are very good (wings and Long Islands are regulars for me). Jeanine was a server there the first two years I start going, and she was the best one, hands down. Unfortunately, she is no longer there :( Needless to say, the customer service slightly shifted. I go about once a week, and I am usually unlucky enough to always get the same rude, snappy, uninterested server. (Older, tall blonde lady) I brought in a friend of mine once, because I bragged so much about the place. Well, little Mrs. Rude was her normal nasty self, and we ended up leaving before ordering. If it wasn't for her, I would definitely rate it 5 stars. I'll see you this weekend, Rudey, McRuderton!!!", "business_id": "IgaruuknYwCr9afeDYQ_yw", "stars": 4, "date": "2015-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "UlsgY-HnJngOLC6FvQ1tQA", "review_id": "16Ws1B0Psia5WPEk7PSV7Q", "text": "Fantastic sandwich shop all Blimpies are suppose to be the same but this one stands out the best out of all of the Blimpie's. Mike and his staff has the best customer service and the soup what can i say but the soup is by far the best. The attention to detail it's just all the little things they do that make them stand out. Five stars all the way", "business_id": "_8Y-XNHmQ76xmxUQIrn0sA", "stars": 5, "date": "2015-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "i2Y-eCZxklOArj2k20wXhg", "review_id": "xuNuEYGGx36B6nEz1nsqYw", "text": "This was the worst experience I've ever had at a restaurant. We order drinks when we sat down 10 minutes later my husband got up to go to the bar was still sitting in the the reader and they had not filled it. The manager brought it to the table. Then while we were sitting 25 minutes waiting for our food we noticed another customer at the bar trying three times to get the manager and the bartenders attention by waving. They didn't give her the time of day we had to flag him down and get their attention so that they would pay attention to the people at the bar. Are food came 25 minutes later. And yep you guessed it it wasn't correct. We had asked for water didn't get it another girl came by and asked if she could remove my cup I said no I would like some water please she said all will let me just take it and I'll bring you another glass of water over 10 minutes later she brings me a glass of water. We had to ask for our bill so we could go and when we got it I walked over to the manager and let her know that I felt that the service was inadequate and she said oh you're the one that had to weigh me down she fully acknowledge that she had to be waived down to serve a customer she didn't offer to pay for our meal she just apologized to pick up our bill and Cassius out. Way to go Sally that's great customer service we will not be back", "business_id": "hzUOqxpcnYYBgLlrgvjQYQ", "stars": 1, "date": "2015-02-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "bHlVnMXvZ3Wp28rRfqnG-A", "review_id": "NZo4Lct5TbV_KfrWjEln9A", "text": "Ate here with a small group from work mid week for lunch.\nOrdered the Green corn tamales.  I don't find these often enough and order them whenever I find them.  Very good.\nSevice was good, knowledgeable.  \nAmbiance was fine.  The place is a local chain, i believe, but it is good.", "business_id": "jzPMl-NoB5F2fwoHX3hN8A", "stars": 4, "date": "2011-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QT5IcBJLHqPesBhMCy4DWg", "review_id": "WL0hPreUIcOGW3x_EHsQEg", "text": "I love this restaurant!  I love the way it looks outside.  It's a beautiful building and that sign really stands out and makes it easy to find!  The food is great and the staff is very friendly.  It seems like they have a really good rapport with each other which is a great feature to have with staff in the event it is busy.  Server was very knowledgeable and made my experience exceptional.  His name is Wil.", "business_id": "jzPMl-NoB5F2fwoHX3hN8A", "stars": 5, "date": "2015-12-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pk9DbYTH3mrDRmmjvMq72w", "review_id": "TbtCq1HejQhpip4XDbDCBQ", "text": "I stayed here this week for three nights.  The front desk was always very helpful in answering my questions.  I needed to extend my stay an additional night and had no problems doing so.  \n\nThe hotel is a bit dated but is very clean.  The two room suites are very nice and the bathroom was gigantic.  There was plenty of space to do work, sleep, and not get cabin fever.  The bar had good beer selections and a great happy hour.  The bartenders were very friendly without being meddlesome and even remembered my drink the second night. \n\nThe hotel was within easy walking distance of a few places, including an Asian fusion restaurant, a breakfast place (The Good Egg), a Starbucks, and a Jamba Juice. The hotel is located near a light rail stop, and the hotel will drive you anywhere within a two mile radius that you need to go to.\n\nA few downsides: The restaurant food is mediocre at best, there is no outdoor pool, and wi-fi is not free.", "business_id": "urBWfXQjyyWIO5B7FvnOpg", "stars": 4, "date": "2014-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "6ts41fCsDKHbFZaKOMNmVQ", "review_id": "i89gggd4RUs8c0OcIyuZaw", "text": "Little shout out to Lori and the floral department staff. \n\nI needed some special order flowers that were in season but not a common item any store carried. I called and spoke to Lori and she told me that she could get them in for me.\n\nThe day I picked them  up a very nice girl in the floral dept. helped me out. The flowers were amazing! I will for sure be going back here for floral needs!", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 5, "date": "2011-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J3ihZoXdMhzLzIV0yhdgGQ", "review_id": "cTwCGsGkt_ngw6h7qczaLA", "text": "This is a no-nonsense pizza delivery place.  Always relable and always good.", "business_id": "JN2qXIuDXnV2d8WnSqd28A", "stars": 4, "date": "2012-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "iC_ziyx6v0FVwQRwXzmHaA", "review_id": "4z30eqf9oC1fIQvRAj69lg", "text": "Pane Bianco has, by far, the best caprese (mozzarella, tomato, and basil) sandwich that I've ever experienced.  The mozzarella is incredibly fresh and creamy, and the tomatoes are always super ripe and flavorful.  Last week I tried the caprese sandwich at Cafe Centro, who does have an amazing ham and swiss, and nearly got homesick for Pane Bianco =) If not for one mediocre experience with a pork sandwich I would give them 5 stars. Oh, and being next to Lux (http://www.yelp.com/biz/lux-coffeebar-phoenix) doesn't hurt one bit.  Great way to spend an afternoon!", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2007-12-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M6oU3OBf_E6gqlfkLGlStQ", "review_id": "OJHyaHg4fA2ztqt0SOATyQ", "text": "Pros: Great Bread, great fresh mozzarella cheese\nCons: Price, Lack of indoor seating, Lack of fountain drinks\n\nI come here for one thing and one thing only mozzarella cheese, the fire baked bread is a plus.  Every sandwich comes with very chewy caramel candy. For beverages one must choose from a small selection of designer drinks. You must eat outside on a wood pick nick table or take your meal to go as there is no indoor seating, which can be a bit of a problem when the summer is 100+ degrees. The line can also spill outside in to the heat too. \n\nThey are lunch only  .\n\nThe front of the store acts as a small niche marking with some very pricey natural options. \n\nIf you want some of the best mozzarella cheese ever go here and try it in sandwich form with some fresh basil and nice red tomatoes. It is worth the trade offs.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2010-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dv7buwZ16bX75jKufhOc3Q", "review_id": "KZ93RTCeQ-TASbtU09YykA", "text": "The Housemade Mozzarella, Local Tomato & Basil sandwich is as good as it gets in the sandwich world.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2011-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Gh1EXuS42DY3rV_MzFpJpg", "review_id": "i8w_SDfDfx2EfszBCeNM2w", "text": "Yes, glad I finally tried Mr. Bianco's famed sandwich spot.  Added bonus was that they now serve pizza next door, no more 2 hour wait. \n\nThe food is fresh and delicious.  Every dish is a culinary masterpiece and a palette pleas-er.  I would suggest the Mozzarella Sandwich (a Caprese on bread), but always check out the daily special.  Decent selection of craft beers and wine.  Just go and enjoy.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2012-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Brl48VfxNW-euavSmmGDkw", "review_id": "nMmtUswb1YuMLLAKMMcyVQ", "text": "Pane Bianco somehow got even cuter.  Since the last time we were here, they added a cool full service eat-in dining room where the cafe next door used to be. \n\nOn this visit I had the Market Sandwich which this time was an Egg Fritata with spicy sopresota, manchego, tomato, greens and onion.  I actually thought the locally grown tomatoes were the star - much beefier and tastier than the grocery store tomatoes we get at home. I wanted more sopresota, but I got my fix with a piece of my sister-in-law's sopresota sandwich with aged provolone and wood-roasted onions. This is my favorite sandwich on the menu, which I ordered myself the last time we were at Pane Bianco. According to our server, the most popular sandwich is the mozzarella, followed by the sopresota.  I'd put all of these sandwiches up against any of the best sandwiches served anywhere.  Our kiddos loved the focaccia as well. \n\nThey bake the awesome round bread in the wood-burning hearth you see when you walk in, they make and smoke the mozzarella on the premises and the veggies are locally sourced as well. Great place.  #amazingsandwiches", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2013-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4TmAgCeJMt1lIOfjmWmdWg", "review_id": "gic6kisWXmdxgmwMLQ1yuA", "text": "Loved this place- hipster-ish sandwich shop (perfect considering the location). The inside decor was awesome- mismatched shabby chic chairs and tables. We shared a sandwich and salad and both were great. Very fresh, tasted freshly made, and with great ingredients. The service was super friendly even though we showed up in bike helmets and all sweaty after having ridden 12 miles there. The gentleman manning the take-out counter happily grabbed enough water to refill all of our backpacks and chatted us up while we were waiting for our sandwiches. He knew the menu and had his own recommendations for what we might enjoy, which were spot on.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2015-01-22", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "xm47wfTVHLq8-72HR5nPmw", "review_id": "RqmF6EQG5mXSxI7E3lLnwQ", "text": "The G&D captures most of what an English pub is all about - to a great enough extent that I have actually forgotten I am in Phoenix when in there on occasion.\n\nThere are some excellent beers on tap, including Abbott's Ale, IMO the best beer one can obtain in Phoenix.\n\nThe English Sunday Lunch is authentic and pretty good. I won't say excellent as I cook better, but for somewhere out it is more than good enough and on a par with pubs back home - and at a VERY reasonable price.\n\nThe Cornish pasties and Shepherd's Pie are 'ok', but not as seasoned as I like or cook - but a safer bet to appeal to the masses / American palettes...\n\nDave the owner is a very nice chap and always friendly and willing to talk to people when he is there as is his brother who is often found serving behind the bar.\n\nAll in all a very worthwhile place to snag a bite to eat and a pint - and play pool, darts or watch soccer on TV if they take your fancy.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 4, "date": "2008-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LwbCh2rhnfaFOhzw7gE1TA", "review_id": "az-yuixQx0ILTtTNM3ZVQQ", "text": "I love the Pub! I don't get there very often any more but I wish I could! Trivia Night (Thursdays) is a blast! They have a Great Beer Selection, Fantastic Drink Prices, and it is always a Good time!", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 5, "date": "2010-02-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "QLqQ9kqP0EHah-8im_TOgw", "review_id": "Hq-WmQUJgbegkuLwfiACIw", "text": "Love coming here for team trivia night on Thursdays.  They have Guinness on tap, which makes this girl very happy, and decent irish food.  We love the team trivia guy.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 4, "date": "2013-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VJg0poe-mD2dqHdua81HfQ", "review_id": "trPJxT-40MqLgbRb2ABjXw", "text": "Kind of a dive but it's always hopping.  Not my personal scene but drinks came fast and food was ok.  We had a huge bar hopping crowd and it's nice that it is so close to the light rail stop for a good time.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 3, "date": "2015-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QFgoJO1GSS2RadBsEop7yQ", "review_id": "FK24RgcJvh_9_QXs_SLokQ", "text": ":)", "business_id": "VAHiEHdVPlG2DVG3YO6C7A", "stars": 3, "date": "2015-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "ZWiGSbjUtuE5bmX1s4z3KA", "review_id": "LKRAOcSi6YjeGiNBan1HwQ", "text": "I've had a few friends over the last few years that have mentioned I try Bikram yoga. I had reservations, felt as a guy I'm not sure if I could be comfortable doing hot yoga. \n\nWell last month my friend suggested this studio that she also attends class. So I finally worked up the courage and came to a class with her. \nThis studio offers a $20 2 week unlimited intro. \nI have been going 2-3 times a week ever since. It has been about a month at the moment I'm writing this review.\nEveryone has their own favorite instructors, Justin is my favorite. \nI have since lowered my blood pressure dramatically and can feel my stress levels decreasing. I think that partially has to do with one, the cardio I've been receiving from the class and partially the knowledge I've come to learn about how I deal with my stress and how I can let it go, remembering what I've learned in yoga. \nThey say at this studio yoga, true yoga starts when you leave class. \n\nI really believe that now. \n\nI would recommend this studio to anyone.", "business_id": "5EyT-ZbhJR6LwtVaPyE3bg", "stars": 5, "date": "2014-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Ii-grwgqNIjXjfsEzrCrJw", "review_id": "LfjWzkUqqdjPDsvuST-4iQ", "text": "Very happy with the install. Quality work, and great customer service as well!", "business_id": "Hj4MJTYn7vUdXdkiI6JK4w", "stars": 5, "date": "2015-01-31", "type": "review"}
{"votes": {"funny": 1, "useful": 7, "cool": 0}, "user_id": "raMSkwLdZ-kFea1fTY_-Ew", "review_id": "i1TcomQkg1MT9wPrmU5ipQ", "text": "I went looking for non-VOC paints.  When we walked in, I stood around looking perplexed for about a minute before one of the salespeople came over.  When he did, I informed him of what I was looking for.  He wanted to know whether I wanted eggshell, matte or gloss.  Having had an experience several years ago with some soy paint that washed off when I scrubbed it with vigor, I was unsure what gloss when he informed me that some cleaned better than others.  So, I asked what the ingredients were in their paint...curious whether it was that same soy stuff I'd used awhile back.....and so starts the drama.\n\nHe told me he didn't know.\nI asked him if he could find out.\n\"I guess so\" he says, obviously annoyed, and off he goes to print something out.  He brings it back.\nNo info on the ingredients.  But it does tell me that their paint is NOT zero VOC because it does have a small amt of VOCs in it. (why is it labeled non-VOC???)\n\nI tell him that there are still no ingredients on this and then he gets even more huffy and ask him again if he can give me the ingredients in it.  He's angry, but I ignore it and he goes off to print me the MSDS sheet for the paint.  Back he comes with totally useless information unless I plan to eat the paint and need to know whether I'm going to die.\n\nBUT what the hell are the ingredients in the paint????  I point out that there's no info on that sheet either.  He's super pissed at this point.  I tell him to go away and get me someone else to help.  Over comes a young man who tells me that they do not know what the ingredients are but he's sure they are just fine and everything's ok.  LOL.  What am I...a sheep???\n\nWe leave.  Down the street there was a Sherwin-Williams.  I stopped in there hoping maybe I would have better luck.  They were wonderful.  Great customer service...very amiable.  When I asked what the ingredients were, they showed me the can...the ingredients are on the can!!  And, it was actually ZERO VOC and the pigments they add are also zero VOC.  To top it all off, there's a designer on staff to help with colors and design!\n\nGO Sherwin Williams!  Don't waste your time at Dunn-Edwards.  Their customer service is at best spotty and uninformed...at worst, just plain old rude and ignorant!", "business_id": "kzd7xOVYLFdXx6xDkaNPTg", "stars": 1, "date": "2012-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "4SzXh0CIdKHhdT0jAxaioQ", "review_id": "HlIjXgL5KyjUePk70zsQqw", "text": "I went to Mania and worked with Miranda! OK, and Gina, too! The entire experience was fabulous from the very beginning. Gina took my call, we chatted and laughed like we were longtime friends . . . she even told me I will get along well with the Ide Mania crew! She hooked me up with Miranda, but also assured me that anyone in this crew will make me happy! And after my first visit, I believe her :) Miranda is a color AND cut expert! She even used texture scissors on my hair--a first for me and I LOVE it! My color is just perfect. I tend to be a one stylist person and I literally stumbled on this salon . . .and I will be back. Thank you Mania!", "business_id": "1iP6SyuWpm_4E6Mx6zOS9A", "stars": 5, "date": "2012-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ErqnuSHSXEmoQNPTc3zE8w", "review_id": "gk9pbG6mPguXZ_9ZFjbYZw", "text": "Dr. Emily Cyr is wonderful!  I had my consultation today for some testing that I'm going to have done next month, and she made me feel so comfortable.  I actually teared up a bit,  and she made me feel like a little less of a dork about it.  Haha.  Anyway,  she's super friendly, as was the office staff.  The building is beautiful.  It's brick and home to several other offices; so,  give yourself some extra time to find exactly where it is in the building (hint: 2nd floor). Show up early,  like they advise,  since the office gets busy.  Dr. Cyr  booked my follow-up appointment next month over her lunch so that I don't have to take another day off of work (school holiday).  Seriously,  how sweet and kind is that?  I'm going to highly recommend the office to anyone in need of an OBGYN, even if it's not for anything other than annual exams, as in my case.  :)", "business_id": "eovEq5kDSdf0WF_P_bD2Uw", "stars": 5, "date": "2015-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bXbs7Ccw5VUy7zpq_xq60w", "review_id": "-BKUUzL97rh2Rv6qHNFsSw", "text": "When I moved here 8 months ago, I was overwhelmed by the amount of places to eat.  I ended up trying numerous \"trendy\" offerings around the area, but always came back to Boston Market. It is now my favorite restaurant in Phoenix.  So consistent in food quality and serving size and the employees are always outstanding. \n\nI never leave this place disappointed and I am always full!", "business_id": "cIwMq5KNq0ASQzoTP1dE9Q", "stars": 5, "date": "2014-01-04", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "7bdCfESkLLta4vwxO5tyHw", "review_id": "eN1aYpVPxVZib4srRWDsqg", "text": "Let's just sum it up quickly. Wait was terrible on a late Thursday night. Finally seated, 15 mins before they took our order. Food came out, cold and or overcooked. Only good thing was our waiter, he was doing his best. Will not be returning with all the late night choices down Central.", "business_id": "cjUmPLRT43wN9Z87A9BOpg", "stars": 1, "date": "2014-12-08", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 0}, "user_id": "tXhlRAnR3_GoWvewfQni4Q", "review_id": "KIEUv-ap6Kr0j770q976FA", "text": "Change your name. I went to cheese 'n stuff to buy cheese and the choices were laughable. It's not even a cheese shop. If your interested in purchasing cheese go to Duck & Decanter, Wedge and Bottle, or AJ's.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 1, "date": "2013-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lNKKhv7qf3i7IjNACh671A", "review_id": "xOqcOZ9QA27Ezvphr_10tQ", "text": "If you're looking for a more traditional Chinese experience for your pallet while in a traditional American setting with actual silverware look no further. Always yummy, it's one of my favorite Chinese places.", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 5, "date": "2010-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "adbGzWWooOw2C0mqUic10A", "review_id": "7f63dUp0HQIhNSuCKkLKCw", "text": "Some friends of ours brought us to this place a few days ago.  The food was amazing.  We ordered the Phoenix platter for four people, which gave a salad, appetizer, soup, and about four or five different meals....all of which, awesome.  The food was delicious and fast.  The prawn rolls were my favorite.  Looking forward to going back and trying other things.  My friends who brought us here told us that they have tried nearly everything on the menu and haven't had anything bad there....it's all been great.", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 4, "date": "2013-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DP-ZeMS81oTQBPHeKkhw1A", "review_id": "J78IFo7g9JmH406wstYi6g", "text": "The orange chicken and house rice were perfect together.  We added in a pork dish and it was a great combo.  They seated us quickly and had our drinks out right away.  The server checked on us consistently but wasn't annoying!", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 5, "date": "2015-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TwYRH5iuY7i5kSz_tuHlTA", "review_id": "XJk3pie1kYtLjTAw70EkIQ", "text": "Always love getting a meal at Jamba! The service here was amazing and the employees made my drink and flatbread perfectly! Thanks for the awesome dinner!!", "business_id": "a5N-FJqNPOmhoTV5JkQrww", "stars": 5, "date": "2014-02-24", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "gq_G5VCDziyEV2-bzGuqzw", "review_id": "QxgfmM4c1B0cCHDGj4dIsQ", "text": "It really isn't bad for what it is. I'm currently mowing down on one of the most bizarre and wonderful salads EVER (okay, there's mac and cheese and some orange slices in here too), and with a drink, it cost just under $8. \n\nWord to the wise: My roommate taught me the clever trick of getting a to-go container. Cram as much shit in there as possible and try to shut the lid. Theory is this: You probably couldn't eat it all in one sitting, but you can refrigerate it, so you could squeeze 2 meals out of it. Eating there promises a fat belly, but no to-go.", "business_id": "wTiQXYB9fE9rcSZDsZgbtQ", "stars": 4, "date": "2008-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "szbTVEtATfn8f9GxbGGO5w", "review_id": "Kn5nJjU4HcpxX_CHh0qxnA", "text": "Well, I was driving between work locations and in need of a quick lunch when I saw Yoshi's through the windshield.  I thought I remember hearing this was owned by the same guy who did Yasu Sushi (which is sublime) so I went in despite the large Pepsi banner outside.  I should have known just by that a lackluster experience was about to be had...\nI ordered the spicy dragon beef bowl and gyoza and an iced tea :)  The beef had an interesting flavor akin to melted plastic.  I kept waiting for the spicy to kick in but it never did.  The gyoza were cold, yet amazingly enough they were crunchy enough to chip teeth if you weren't careful.\nThe tea wasn't bad...", "business_id": "L19_1cG2ALVjdBQ456h26A", "stars": 2, "date": "2010-12-16", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "yGs16xQiN3dLo03OQyto8A", "review_id": "zo4thGkhQO6B8ashj2mTbg", "text": "Jeff P has it all right. I've been going to AABC for a really long time, and they've always been my favorite shop. \n\nThe owners are always up to help you, and the staff is excellent. No matter if I'm in 1 time every 6 months, or every week, Eddie always has my books pulled and he knows my box # by memory. I don't even know my box number.\n\nI've been going to AABC exclusively for years, and I see no reason to change.\n\nAtomic is trying too hard, and they don't care about you. Samurai is good, but not my style. They are great for indie and anime, but I'm a Marvel guy.", "business_id": "y9cQ0DBC0qFNgkpTXHzokA", "stars": 5, "date": "2009-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lB9am5K-npXTD6TB6GC6Rg", "review_id": "8D5vqsSE9BcwDua_iM6ThQ", "text": "By far the best!!! I moved my kids from a prior daycare I was unhappy until I moved them here!! My kids have improved academically and emotionally since they have been here the staff is great the teachers show my kids so much love I couldn't be happier. Including the location so convenient for me easy to get to. Very much recommended to any parent.", "business_id": "m-yfs3tlXTP-wYcb_rEQPQ", "stars": 5, "date": "2015-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "7zDqr2I0-xpw9HF5Ha54cA", "review_id": "Z_rv4UaR51sti7Kf3bEm9A", "text": "For a long time I heard from various people that the lights are phenomenal at Hinkley's but that I would pay for it dearly. I'd just like to state that in no way is that true.\n\nI went in needing something different, something fun to change up some spaces. Looking through the store I was more worried that none of the displays matched what I wanted exactly more than the price. Hesitant, I went to the counter and asked to look at some flush mount lights for a hallway that are more of a brushed metal finish.\n\nWhat did I end up finding? Lights for everything I needed that were exactly what I was picturing in my head. The price probably exceeds Home Depot, but these aren't your typical lights. After doing some price comparison, the lights were very reasonably priced and I went in the next day to place an order. Jennifer, the woman that helped me previously, answered all my questions and helped me with everything. In the end, they were even able to swing a discount on some of the items, thus lowering the price more.\n\nIf you are looking for lights in Phoenix, please ignore all the misconceptions about insanely high prices at Hinkley's. The service is fantastic, the lights are gorgeous to look at, and the prices are insanely competitive.", "business_id": "nV_7lAYFVISEs-Te4e39gA", "stars": 5, "date": "2011-01-04", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 6}, "user_id": "SbzANP6hRVwDU5pbtz5ANw", "review_id": "yBUUCTBHR_mk0-G75TPIEw", "text": "The Sonora Brewhouse is the epitome of a good, clean, moderate, Phoenician pub/restaurant. Which means that I was really hoping for more. I was hoping that this place would be a little lived in, a little less polished, a little less new Phoenix. It's kind of odd that big box chain food spots work at trying to get that aged look by throwing junk up on the walls and hanging it from the ceilings. Not at the Sonora Brewhouse, they'll have none of that here, but that's okay.\n\nYes, they brew their own beers and yes it's good and more than decent. The food is better than average and always cooked. Even when you ask for your Kobe burger to be cooked medium with the hope that you'll see some red, it'll come out with no pink at all. Sadly, I wasn't expecting anything different.\n\nDo I sound disappointed? Do I sound like I'm sitting in a box of self pity? Oh woe is me, they FULLY cooked my burger. Oh woe is me, the beer is good and the steak fries have the perfect crispness on the outside and mashy-goodness on the inside. The quality at Sonora Brewhouse is what I expect at any of the big box chain restaurants like Gordon Biersch, but never get. The problem here is that they can be so much more. Food + Ambiance (personality) = Greatness. Sonora Brewhouse is missing the heart.\n\nThey're polite and not offensive in anyway, walking the definition of middle.\n\nThis is both surprising and disappointing since they have been around for a while, but also because just a block to the east, Rosie McCaffrey's is overflowing with heart and soul, more than you can imagine. If they can find it, tourists probably love Sonora, but remember, tourists often love going to another branch of the same TGI Friday's that they have in their own suburbia, while on vacation in a different town.\n\nOkay, so Sonora Brewhouse isn't anywhere near the low level of a TGI Friday's, but it's almost as clean, boring, and devoid of personality, being almost completely unmemorable. Oh. They also probably have the thinnest Kobe burger patties I've ever seen, at least the steak fries and beer are good. My advice? Go a block east to Rosie McCaffrey's and actually have a good time worth remembering.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 3, "date": "2008-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WavzQE_0yoy05hF-637EoA", "review_id": "1XAYS_nU6RcklMN1IqZKNA", "text": "First and foremost, take advantage of their happy hour all day on Sundays. \n\nAfter visiting two other breweries the same day, I have to admit that Sun Up was my favorite. Their beer sampler is definitely a good way to get started. It's served in a row of glasses slightly larger than shot glasses. You'll have to ignore the temptation to pound them one after the other... at least on your first go-round. All of their beers are certainly quality and quite enjoyable, though there didn't seem to be a huge \"wow\" factor with any of them. In no way will I hold that against them though, as none of the local AZ brews (that I've tried) seem to be doing anything very far outside of the box.\n\nNot only should you visit Sun Up to check out their craft, you should definitely go to try their eats. Their wings are probably the  best I have ever had; fried perfectly and still nice and moist, plus their \"hot\" sauce had a finely-tuned heat factor. Their sliders were dynamite as were the accompanying sweet potato fries and garlic parmesan fries. \n\nThe service was fast and very friendly, and the establishment (men's room included) was very well-kept. All I have left to add is: Way to go Sun Up!\nSee you next Sunday.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 5, "date": "2011-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "G550WlW6ifOGJHvMkYWDQQ", "review_id": "Kppho79HRyxgjaUf1vj9Yg", "text": "we didn't even know this place existed until I saw a living social deal and snagged it. then the deal sat and sat until almost expiring.  After spending the morning hiking we were in the area and decided to pop in.  The living social deal was 2 beer flights, an appetizer and 2 pint glasses to take home.   The sampler was a tasting of the entire line up, so 7 samples.  Found a few favorites and a couple we didn't like, but the vanilla porter was delish!   Not our typical style of beer, but will most definitely order it again.   Instead of getting the 2 pint glasses to take home they honored our request to have a couple pints of beer instead!\nOur server was just amazing - she was friendly and informative - big props to Angela for great customer service.\nWe loved the atmosphere and oh - the food.  It was good.  For our appetizer we got the green chili dip with chips.  It was good - not amazing, but we were starving from our hike and cleaned the bowl.   We also ordered a BLT breakfast sandwich from the brunch menu which I thought was great.  It was your typical BLT, but served on a croissant with a fried egg on top and served with home fries.   So very good - next time I won't share though and order it only for myself.\nThey definitely seem to have a local following as everyone that came in after us seemed to know someone else already there.   When the locals like it and keep coming back you know it is a good thing.\nWe will be back!", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2013-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8nvZS9yG9A3VGIWBq_g_Fw", "review_id": "89ps7nrXk15-Sl8NWGNujw", "text": "Nice and quiet  bussiness area, friendly staff, rooms were clean. Not the best hotel in Phoenix but for the price this place is a good stay.", "business_id": "KQzpjBmnAMXPqipeWTKG0w", "stars": 4, "date": "2014-12-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "mLLfJtVhVf84jlpOJjfU3Q", "review_id": "SEc2yYSVhY5KVkbJdcur7w", "text": "I am waiting in this Starbucks for my friend to finish a conference call so we can go have some shopping time and relax later by the pool. Yes, I am on vacation and I have my work laptop and I really may never be really really on vacation because there is always something to finish, just one more thing, and if I go and do it I won't have to do it later. Enough about me. \n\nThis Starbucks is near the downtown and near the metro rail line. There are about 30 seats inside and 30 outside, which now is great because it si about 70 degrees outside. I imagine from May to November the outside seats are insufferably hot. I got adequate service here, the coffee is the coffee. \n\nI can feel shane m.'s pain because I was a Starbucks supervisor back in the day too. This place passes at this moment, but you can catch the wrong partner at the wrong time and Boom! One star. \n\nI will come back here if I am ever nearby when I need a SBUX fix.", "business_id": "dSQh1Hx2BiSrYog4ad740A", "stars": 3, "date": "2010-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "xqsk4LUMt2T9a3GGHQwpug", "review_id": "QrYG9prVWUkofrBzAAP2Iw", "text": "I headed over here today because 1) it was close to the house 2) They are open on a Sunday 3) I'm giving birth soon and NEEDED a pampering pedicure\n\nThis place is next to the Basha's and is pretty no frills.  They have the standard massage chairs and mine worded just fine.  Water was the right temperature.  The lady doing my pedicure asked if I wanted them trimmed short which is exactly what I needed since I don't know when I would be  back.  Pretty typical pedicure.  They do use a salt scrub briefly which is included in the price of the pedicure.  She filed my nails and scrubbed my feet well.  The foot and leg massage lasted a good amount of time and didn't seem rushed at all.  Polish was nice and even and looked like any pedicure I've gotten elsewhere.\n\nI got just regular polish no design and the cost was $20 bucks.  There really wasn't much of a difference between this pedicure and ones I've gotten at \"higher end\" salons except for maybe having more options to customize your pedicure at other places.  Regardless, I would go back.  It's close, inexpensive and they do a good job.   I figure it will make a quick \"momma time\" escape once the baby gets here.", "business_id": "f9WABGuw1OBfO_lw5HFiJw", "stars": 4, "date": "2013-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lND1_sIXaA1GYDxVduyMsA", "review_id": "ae9GUohsZgPXwXm_czWcyA", "text": "Food is good, not great but the best is the price. Best price for Mexican food around. We go in the early evenings and it's full.", "business_id": "DeAnVirgOxQnI36V1W158A", "stars": 4, "date": "2009-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7T7oXOr2BOtIZs0WDsKQng", "review_id": "qNmTbbjZg6c-MQ75dJerbQ", "text": "great food!!!!!", "business_id": "DeAnVirgOxQnI36V1W158A", "stars": 5, "date": "2014-12-24", "type": "review"}
