{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-11rZ6onKMV1u0IH65zQ2A", "review_id": "HwE0GP7MjdQmI2d9ccPXgA", "text": "Mediocre  Food  Service and Atmosphere.\nBetter to stay clear and save your money.  \nJudging from the empty tables the luster and joy of the Namaste we remembered is no longer.\n\nWe experienced the following sub par  dishes while dining after 8 pm on a Friday evening in an empty restaurant:\n\nBland reheated Samosas.\nFlavorless Malek Paneer. ( the cheese pcs were quite good despite)  inconsistent  and barely there flavors of certainly fresh frozen spinach mix. \nBarely reheated Naan. \n\nWe traveled to eat at Namaste specifically based on delightful past experience. Obviously that feeling is long gone.  The staff  were content to chat with friends and answer frequent texts and cell phone calls while we ate. \n\nThe loud thump of bass from modern indian music with the  electric din of the TV playing Bollywood extracts might have been a nice distraction in a busy restaurant.  Instead  when added to the ding of texts and cell phone calls the loud background noises detracted rather than added  anything to an already mediocre dining experience.", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 2, "date": "2011-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "J_q8jN623uew8ZzMChXBCA", "review_id": "92A001ihNQdCdSpcuhQhXg", "text": "I've enjoyed eating at People's Indian Restaurant for years. I appreciate the authentic cuisine, the reasonable prices and excellent service.\n\nThe menu has lots of vegetarian options. The Vegetarian Thali is an especially good choice.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 4, "date": "2015-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "SAfayJOdbhzl3BNVPQmdmw", "review_id": "BpMWn_zKjE9TYlbJ2bg88Q", "text": "The atmosphere of Maharani is nice. Quiet, with modern decor and Indian artwork.\n\nThe service is good; the staff always keeping an eye on our water levels.\n\nThe food was disappointing; not just my dish, but my three friends' as well. We got an array of vegetarian, chicken and lamb dishes and everyone left with a very \"meh\" opinion. The spices weren't as distinct as most Indian places, the quality of the vegetables and meat were subpar, and the authenticity of the flavors fell short. I ate the small amount of Gobhi Manchurian I scooped onto my plate and then just chose to not finish it because it was so terrible (and for $12 I usually don't do that).\n\nI'd adventure elsewhere to Indian if I were you.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 2, "date": "2011-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "naBs2Kg2KClrKcoRgFE2eA", "review_id": "atGi83JNG-GLUrKlC1k3rQ", "text": "Visited here for the first time on 1/21/2012 with a Groupon!\n\nAtmosphere was nice, dark with lots of recessed lighting, you could definitely go casual or dress fancy and be in place with either. The service was really good, fairly quick to take your order and bring out plates. Plus, they had a waitress constantly refilling your glass of water (which can be a blessing at an Indian restaurant if you accidentally order something to spicy for your taste!)\n\nHalf of the menu was vegetarian, thumbs up for that!!\n\nI was impressed that they immediately bring out a complimentary plate of very thin flat bread and chutneys as soon as you're seated. We ordered the veg sampler appetizer, which was pretty good. I definitely preferred the paneer pakoras and cauliflower pakoras over the samosas. I ordered the malai kafta as my main course, good. Garlic naan and paneer bread were very impressive.\n\nI enjoyed Bombay Grille, but it doesn't top the quality of food at Woodlands... I'm forever spoiled.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 3, "date": "2012-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 4}, "user_id": "nhejixbS_FRfRPt6yxBQTQ", "review_id": "EaP302SRz7yANCj_pcKI4A", "text": "We went for the buffet on a Sunday morning, and are so glad we decided to give it a try!  My husband's favorite is Chicken Tikka Massala - which they had on the buffet.  I'm pretty new to Indian food, but there were so many options and so many things I liked!  \n\nThe service was amazing!  Our water glasses were constantly full, which is good considering some of the food is really spicy!  We're not from that area, but if we were in the neighborhood, I would consider going there again!", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 4, "date": "2013-01-28", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "HJnszqeMUpFiWshaAswueQ", "review_id": "hAAG_NTEK8TTog-wO23Huw", "text": "Lately, I can't seem to get enough of South Asia in my belly. I have my Valley favorites (India Gate in Chandler and The Dhaba in Tempe), but I wanted to give a new joint a go. So I decided to try the rather palatial-looking India Delhi Palace in East Phoenix because I had heard good things about its lunch buffet.  Luckily, my foodie friends aren't liars. \n\nI arrived shortly before the lunch rush. I was greeted promptly and politely. I then asked if the buffet had a large selection of vegetarian options, and he actually gave me a brief but thorough tour of the veggie offerings, which, much to my delight, comprised much of the buffet. I promptly filled my plate with aloo matar and daal maharani. But don't worry, omnivores; there were plenty of delicious-looking meat dishes on the slate as well. \n\nThe food was very tasty, but what makes this place stand up above other Indian buffets was the exceptional, attentive service. A team of servers worked to make sure I received fresh naan with my meal, my water glass was always filled and any questions I had were answered. I don't expect much in the way of help when it comes to buffets, so this was a pleasant surprise. \n\nI will definitely be back one of these days to try something from the menu (bengan bhartha, I'm looking at you).", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2009-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qSZPGbD6sQPV4TFkpkG9Mg", "review_id": "REcSMZPToTGaWqpxDUX-Xw", "text": "Very satisfying fix for my travel-induced Indian food craving. Delicious lamb biryani and an eggplant dish the name of which I can't recall. Attentive, perhaps slightly pushy service. Definitely recommend.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2013-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "UzsKmJRX6x8E1PX6ClSw1Q", "review_id": "N93sfQ949Y6IQG2F7fsEfw", "text": "what a treat. i'm not gonna pretend to be a super discerning indian food critic but i love it here. the staff is kind of formal, place is usually quiet. never very crowded. got lamb korma, chicken karahi, a bunch of garlic naan & rice, and a couple kingfishers. i don't leave any bites of food in the bowls at this place - wish the portions were a little bigger.\n\nsometimes i feel like indian is unnecessarily expensive but i think these guys really do go the extra mile on ingredients and presentation. got out of here for $27 or so and i feel that's reasonable. this is a go-to spot to eat comfort food with family. last night i brought a friend who had never had indian food and he's now officially on board, so that's a great sign. \n\nif i came in with the intention of spending $100, i would leave really happy.\n\ni have a little concern that they'll close down because there's not a ton of traffic through there and the space is enormous. we'll see i guess. i'll keep coming back regardless.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2015-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kvBcEmrcMAdxA31A3dhYfw", "review_id": "UpqlMZ_5IrhO12FgKvUR8Q", "text": "Not very good, this was probably some of the worst indian food I've had.  (I've been pretty spoiled)  At one point there was something that was hard in my food and I cringed when I bit down.  I'm not sure what it was.  I'm used to very well flavored Indian food, and the curry was bland.\nThe service was good, and it was inexpensive, but I think I'll try some other local places first before returning.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 2, "date": "2011-01-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "6XMSuu8QydTjSQyGrWJ2zQ", "review_id": "TP5DI6KOj_53rWw2ukEtUw", "text": "As soon as I walked into this place the staff here was so welcoming and kind (I was wearing some cloggs coming from a pedicure and they still welcomed me) and sat my friend and I right away. Great food! I got the chicken curry and a mango lassi yummy!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2015-02-06", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 1}, "user_id": "8cJ-n5BEb1LAR0qFM9zrxg", "review_id": "r6G8JqoBbfolBNlVj9nupg", "text": "Since the place is right in my new 'hood, I had to check it out. It seemed slow for a Saturday night -- we were seated right away in a mostly empty dining room. Usually a red flag for me, but times are tough.\n\nEveryone working there is really nice, and different people popped over to the table at various times to make sure everything was okay. Very friendly and attentive, which is awesome.\n\nUnlike some other reviews here, we were not offered any kind of \"scale\" of hotness other than \"medium\" or \"spicy\". I always go with the mid-range until I have a good feel for a place, as did my wife. Hers was quite a bit spicier than mine, which I thought was odd.\n\n I had the Malai Tikka which came out sizzling in a bed of onions. It was very tasty but the chicken was quite dry. I ordered naan and rice with it which was pretty much a necessity... I'm not sure who would want to eat a big skillet of chicken by itself, so I'm not sure why they have these things as extras instead of just coming with the meal. My wife had the Karahi Tandoori Chicken Saag which looks like thick pea soup but it's extremely tasty. She grabbed some of my naan and rice because, as I mentioned before, you wouldn't really just want to eat a pile of Saag by itself.\n\nYeah, I have a takeout menu sitting next to me so you can stop being impressed that I remember the names of the dishes, har har.\n\nOverall, I'm very impressed by the service and ambiance but the Malai Tikka left me flat. I will be back and I'll try a vegetarian dish next time.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 3, "date": "2009-12-20", "type": "review"}
