{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "txFiQcsDnXxV-0IhR8Ymww", "review_id": "jbi7ApYfjpjscYGFqkEXJw", "text": "I had a fraxel treatment done here to remove some hyperpigmentation.  Along with the $1000 treatment (and this was 5 years ago), I also had to purchase the Obagi Nu Derm system.  I was told that the treatment felt \"tingly\" and that I would experience some \"bronzing\" afterwards- like a mild sunburn, but that I would be just fine by Monday (treatment was on a Friday).  \n\nFirst of all, the treatment felt like they were rolling a rolling pin covered in hot needles all over my face.  Anyways, I went home, washed my face with the appropriate product, put on some ice, and slept with my head elevated per their instructions.  \n\nThe next morning my face felt like orange peel and was so swollen I couldn't even open one eye.  I was completely unrecognizable.  Over the next few days my skin started massively peeling and crusting.  It was excrutiating to smile, chew, talk, etc.  I wiped away built up scabbing with sterile water and used antiobiotic ointment on the open wounds, but other than that I could not/would not touch my face- the exfoliating and bleaching obagi system was out of the question.  Eventually my face healed, but I couldn't go out in public for almost a week.\n\nThe kicker? After all that, the treatment didnt work at all.  The hyperpigmentation came back worse than ever.  Of course, when I complained I was informed that this was actually my fault for not following their recommended skin care regimen.  6 months later I went to a dermatologist who prescribed triluma.  1/10th the cost, very little irritation, and it actually worked.", "business_id": "1IxCNVVW9aKbK3BfQpI7eg", "stars": 1, "date": "2014-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_9FhAcrJJ8r3KlpUgZ23Aw", "review_id": "91JvqT4YanjH-Ppz7yRgPg", "text": "Madison's North Side is working class, mixed to low income, not walkable. Not prime coffee shop territory. It can't be easy to keep a coffee shop in business up here, but this place is a local institution. Great ambiance, a wonderful place to go to work alone or to have meetings. I have not tried the food, but the coffee is always really good.", "business_id": "OYZOzzipfXdWrYe1A2zeKw", "stars": 4, "date": "2015-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2_OIo9KHuot8U6HuQ3U8Rw", "review_id": "JOFxPYu_Cg-KKxr8-fUZgA", "text": "Cute place, very laid back experience, friendly people! Not to mention my girlfriend's hair looks great! :)", "business_id": "T9l9Z3FKMSCIYvsP2g4efw", "stars": 5, "date": "2013-12-29", "type": "review"}
{"votes": {"funny": 5, "useful": 2, "cool": 3}, "user_id": "Bvh3IHeMzSPnJAe5QlBsSw", "review_id": "idtP_C96apaBLXJW4cHg7g", "text": "Madison's great historic small concert venue.  Lot's of great bands play here.  I saw Weezer on their Pinkerton Tour with Nerf Herder (remember them? The Van Halen Song? Yes, I'm that old).", "business_id": "f5ntGOT9_0pCdeUaUVi9cg", "stars": 5, "date": "2005-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0cLhHMSrQzzBWLHVXtmIGg", "review_id": "vEoDsbeoaeFe0N6tmoVYVQ", "text": "Good shrimp jambalaya but great cornbread in a developing neighborhood.  A future spot on Food Network's Diners, Drive-ins and Dives show.", "business_id": "cpGv6ES2hzPCtCUQgipwXw", "stars": 3, "date": "2012-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YldO-SVnCUtTI_B7AWBMkg", "review_id": "UTLJJ89kuAD5h2xqzvt63A", "text": "My wife and I stopped in there for a quick lunch on the way to a movie.  The initial service was OK but ultimately slowed to a crawl making us dash to our movie.  The decor was like it was when I was in high school (20 years ago) and desperately needs some updating - making the entire dining experience feel dingy.\nNow for the food - the food was served on vey hot plates (which I think covers for improper cooking) and came relatively quick.  No sour cream on my burrito as ordered but we'll move on.  My food was extremely bland; ground beef rolled in a flour tortilla does not a burrito make.  I couldn't even finish my meal it was so boring and tasteless.  My wife had pretty much the same experience with her chimichanga but the black beans saved her meal (a little).  We paid and bolted for the door (partly to catch the movie but mostly just to end the experience).\nThe place would do well with some aggressive management, quality control out of the kitchen and a remodel/deep cleaning.", "business_id": "wPidHd5FxspPRgVqdEQ-Xw", "stars": 1, "date": "2012-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "omOnbJjKaJUkvYi3reIB9w", "review_id": "IS9bODqmPd_O6I0RnF8maw", "text": "Wow, this place is so hit or miss. I'm honestly just not sure what I'll be getting for delivery each time I order (the same thing). They must have a different person cooking the stuff every single time because nothing ever comes to me the same as the last. \n\nI have had some great General Tso's here, and I have had some horrible way too spicy un eatable Tso's here. It's just so confusing.\n\nI enjoy the lunch special the best. Most lunch specials are around $4.99 and come with fried rice (or white/just ask) and a egg roll. Great! It's enough food for a second meal for most. Who can beat that? Pretty much anything and everything is offered under this lunch special as well. What a deal!\n\nGreat egg rolls, Very good Rangoon! Awesome soups! \nYet...like I said, you can't expect the same dish every time. It's a surprise to what quality of food will end up in front of you. \n\nPretty quick delivery (usually around 25-30 minutes). \nGood sesame chicken, orange chicken, beef and broccoli.", "business_id": "pSiRWeCqs7a1xvS9ycLoTQ", "stars": 3, "date": "2014-01-17", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "RBEaNqUxLLSyzVFwS3gV0Q", "review_id": "6A0bYYhA10wIcrfhlD6Zmw", "text": "Since giving up my car, I've resorted to ordering a cab on bitterly cold days to go to work, and the occasion of going out for the night. \n\nGenerally every cab driver I get is super friendly, and makes some kinda of relateable small talk. And their rates aren't too terrible. It'll be about five to six dollars plus tips, for me to get to work.. which is a mile away ( yes I order a cab for only going a mile away when it's below zero. ) All in all, I haven't used another cab service cause I'm sincerely pleased with union cab!", "business_id": "5TQQy_x_ArR3_5L5L0fFVQ", "stars": 4, "date": "2015-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "D89LE6sj7Gb16mxaf1u1hw", "review_id": "y4wj79xcmaiqprF5nQ9lbA", "text": "Best Sarku in the USA! I traveled the country and this is by far the best location! Other states had low quality chicken and veggies..Get it at East Towne!", "business_id": "9vgu6o1CwP5NakVkb29z0g", "stars": 5, "date": "2015-12-19", "type": "review"}
{"votes": {"funny": 3, "useful": 0, "cool": 0}, "user_id": "lZq-CaPk58whjRxjnLIPQg", "review_id": "7E5bIaJl8GX1EUimBQDIUA", "text": "Let me preface this by saying that I'm usually a Burger King guy (I like their mascot better, McDonald's is too funny looking).\n\nHowever, my friend was in town, and I thought, \"why the heck not? live a little!\" so I brought her here.\n\nOn our way to McDonald's, also known as \"Mickey D's\" in other areas, I begin to worry that maybe I should have called to reserve a table in advance.\n\nHowever, upon arriving, we were pleasantly surprised to find no line!! \n\nWe did wait a minute or two to be seated, but apparently, this is one of those seat yourself places.  \n\nAs I approached the front, I was immediately mesmerized by their huge selection of burgers. Their menu ranged from McSingles to McDoubles to even McTriples!! They also had a dollar menu consisting of items costing $1.07 after tax. \n\nI decided to go with their house special, The Big Mac, and their seasonal Chicken \"McNugget\" Pieces.\n\nWhen I opened up my box of chicken nuggets, the pale-golden/yellow skin indicated that it had just came out of the storage unit next to the fryer. \n \nAs the freshness evaporated with every bite, I really began to taste all the other kinds of meat that went into making the nuggets. I think I even tasted some pork, but don't take my word for it. \n\nOh my God and then you have the dipping sauces! These little containers held the perfect blend of artificial sweetener and manufactured taste  \n\nAs I eagerly unwrapped my Big Mac, I was slightly disappointed to find that it wasn't as advertised (the picture on the display made it seem a lot bigger!!). Oh well.\n\nI would really like to commend the chef on making the buns just how I like them, extremely soggy. I was even more impressed that the soggy, limp buns were able to maintain their round form. This is some pretty advanced cooking technique!!\n\nAnyways, as I bit into my Big Mac, the first thing I tasted was the mayo. Actually, it was the only thing I tasted, but it was some damn good mayo. \n\nFinally, if you're watching your waistline, they have a plethora of drink options. Choices like Diet Coke, Diet Coke Zero, Sugar-free Diet Coke Zero, etc... ensures that there's a perfect diet drink for everyone. \n\nPS: Perfect date spot for Valentine's Day. Highly recommended!!", "business_id": "311yXufoXR2dFngMHS9MFg", "stars": 5, "date": "2014-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "eiPJkVypnpWcihTryYITLw", "review_id": "qiI7HEJPQk-rla25IVWERw", "text": "I was staying at a hotel for an interview the next morning. My shirt that I needed to wear got something on the collar on the plane ride. Despite it being past normal pick up hours, they made an exception and had my shirt picked up from the hotel.\n\nIt was prioritized for the next morning.", "business_id": "01gRLh9-kr_ZYABrGwNxpg", "stars": 5, "date": "2014-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G_KAMSJ_9unBxAnQ0N_O_w", "review_id": "fGI_wgVokmjlXBTelCSWSA", "text": "I've been to Dexter's fish fry on multiple occasions. Their basic beer battered cod is among the best you'll find. The perch is multiple small portions of fish. It's good but not great. I can't speak for the walleye or shrimp because I always get the beer battered cod- it's that good!\n\nThe only drawback is the wait on Fridays expect an hour plus.  They have a great beer selection to entertain your taste buds while you wait.", "business_id": "HTplzElel_F_U_qhWuDKdg", "stars": 4, "date": "2014-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 3}, "user_id": "omOnbJjKaJUkvYi3reIB9w", "review_id": "tT9MwwmAlOzQCUoKWtWsQg", "text": "If you are craving a massive bar burger from a towny bar, this is the place to go. \nThe burgers are so large that you should plan on cutting it in half and take the other half home. They are excellent!\nIf you order the bacon burger, you can expect at least 6 plus long stripes on bacon on it, I was completely amazed with the quantity and quality of the burger. Amazing. \n\nI have also been to the Eagle Crest on Taco Tuesday. Prepare yourself for the largest taco you will ever see. If you order the taco salad they give you a very large plate stacked high with chips and all the fixings. It's great. More than any one person can eat in one sitting. \n\nThis is a bar people! Don't expect proper waitress service, the bar tenders are serving you most of the time. Just be happy that this particular bar has amazing food. \n\nSince this is a bar, maybe the best Bloody Mary in town. It comes in a large mug with 2 huge shrimp, a beef stick, pickle, and green olives. A meal in itself. \n\nIf your hungry and don't want to spend a lot of money, this is the place I would suggest.\nMy new favorite bar.", "business_id": "QdSGdvZATzejDkSs435Rdw", "stars": 5, "date": "2013-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "q1BK60UjzZqLLaYJUMRaFQ", "review_id": "LKpHHd7lqE72Tq_AR0EXpw", "text": "2 tries and still can't get a simple pizza order right!\n\nNormally I'm not that critical of chain pizza joints, they all pretty much follow the same american average pizza rating. \n\nHowever, I placed an order online this evening a prompt 45 minutes later I hear a knock at the door, dinner time! Hold the phone, this isn't what I ordered. So I called and spoke with Donnie who was courteous and offered to remake or credit my account. I chose the remake option. 30 minutes later I get the replacement pizza (PS - the drivers seem to be on top of things.) \n\nImagine my surprise when it's made exactly the same as the first. So, I call back, spoke with Donnie and who tells me that he made the pizza himself and that he knows it's right even read my order back to me. So it's at this point in the conversation that I point out that was not the pizza I received; Donnie retorts that he knows it's right. I feel at this point like I'm being called a liar and state such (I'm still not sure what the point of lying about a pizza is...) Donnie replies that he isn't calling me a liar, but that we aren't in agreement on the pizza.\n\nI will NOT be ordering from this Papa John's again and I suggest you avoid it as well... unless you're looking for a grab bag mystery pizza, then by all means this is your place.\n\n--side note; here is this incredibly complicated pizza I'm trying to order; half sausage and mushroom/half sausage and pepporoni--", "business_id": "7uoxZ35biPZfl8m5w2_XRA", "stars": 1, "date": "2015-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "tBctER6R_riVNVBAQBCOYA", "review_id": "OEuLZjcoW9vOKA3i_Gp_Xw", "text": "Yummy, yummy, yummy!  Has always been one of my favorite diners in Mad-town.  Delicious veggie chili, spicy cornbread, malts and desserts, as well as the amazing array of other veggie options.  Just yesterday, I tried the new Spinoccoli Quiche with fruit, which was pretty darn good...coffee is always hot and refills frequent.  Still have yet to try the famous zucchini pancakes, but next time, I must.  I must also remember to save room for dessert!  Look forward to returning sooner than later to try some of the other new lunch options on the menu.  Only downer is the wait/lack of parking on a busy day.  Overall, two thumbs up from me, Monty.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 4, "date": "2008-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h4fjgz-44HFE_kGy6p8P-w", "review_id": "JFpOoStFuG9cG6Eu5ka2vA", "text": "Everything here was okay. The food was okay, the service was pretty good, and um... the atmosphere was okay?\n\nThere's nothing particularly compelling here for me to write about. My food was enjoyable, but nothing to write home about. There seemed to be a lot of vegetarian options, but since I'm not vegetarian in the least, that didn't make much difference to me. Again, the service was pretty good and our server was friendly, but overall nothing too exciting.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 3, "date": "2011-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "qy9xGKT_77fekC7Tt2eYqw", "review_id": "ff8DJgXdNNfXUVfzfSxN7g", "text": "First, the decor and the building itself is super cool. It really gives you that diner feel. The pies and desserts right when you walk in are also a great touch - they look absolutely divine!\n\nWe came on a Saturday at about 1:30. We had to wait for about 15 minutes, not too bad considering how small the space is. Service was okay. Our server was friendly but we had to ask about 5 times for silverware until we actually got some. They have a great selection of breakfast items, I honestly didn't pay much attention to anything else on the menu. They are really good about marking what is gluten-free which was super nice. \n\nI ordered the corned beef hash and it was very good. The hash had great flavor and the eggs were cooked perfectly. The biscuit looked delicious but I of course couldn't eat it (devastating). One of my biggest pet peeves though is when there is food on the plate that isn't meant to be eaten...and they put the fruit on a leaf of iceberg lettuce. Not a deal breaker obviously but something that has always annoyed me. My boyfriend ordered the country breakfast with bacon and scrambled eggs. He said it was really good, especially the potatoes. \n\nThis place is officially on my radar as another great breakfast option!", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 4, "date": "2014-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "EgJMgG2PBsI3W7BhlaiXmw", "review_id": "0zPViFNj91TcQwcgq7zzng", "text": "Classic diner and menu style with modern twist (includes vegetarian/vegan options).  I love going here for breakfast.  The breakfast sandwich (with goat cheese) is divine.  My family always wants to come here when they visit.  Food is always fresh, staff is always on top of things, and it's a cool environment.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 5, "date": "2015-02-21", "type": "review"}
{"votes": {"funny": 3, "useful": 0, "cool": 0}, "user_id": "pOmhEB7tBWhYofKPixLfNw", "review_id": "DFu9GFZeLGv4m5XhLGRMUg", "text": "A comedic collection of hipsters and hobos, peppered with semi-pro poker players and and a hanoi-jane pissing target in the urinal.  Swing by the Stop-N-Go on the way out and grab a Sparks.  Quite real.", "business_id": "YlznKuAxnd7j3QfXFzoIog", "stars": 5, "date": "2009-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 1}, "user_id": "SAp9B5CFdW5Nfi0Z6hxyOA", "review_id": "wEtDBBdEifVLKfzRoijFbg", "text": "I came here every year for Reverance and had a good time.  It's a little vacation for those of us in Chicago who want to \"get away\" but still hang out at a club together.  I've driven up for quite a few shows during the weekdays since I love how up-close-and-personal the stage is.  There are 2 bars, so it's nice not having to walk too far away to get a drink.  \n\nThe atmosphere is cozy and there's plenty of comfy seating for anyone whose boots are hurting their feet!  \n\nI enjoy going here, and I love how they always have a pizza vendor there!\n\nPS - watch out for the steps when heading towards the back.  I've seen so many people fall face-first over that thing!  =)", "business_id": "XTGb5b3LBuhWHhJS1xPnQQ", "stars": 4, "date": "2008-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "t1chUYWLm39VrttHOXDU2Q", "review_id": "j6HKTgWdHsacH6FVfQGPAg", "text": "I should start this review by stating that it is for their events coordination and rental services only, run by a woman named Patti Jorensby who needs a serious reality check or a different job wherein she does not interact with paying customers who are attempting to coordinate one of the biggest, most important events of their lives. \n\nThe GOOD: We were able to get married in the beautiful, warm Bolz Conservatory in the middle of winter this January, surrounded by our immediate family members. And because our wedding reception was small, we were able to secure the gorgeous many-windowed Atrium Room (which seats about 65-70 for dinner), rather than the horribly ugly, low-ceilinged and outdated Evjue Commons, which looks like some mistake out of the 1970s that never received the proper updates.  The Atrium Room was the perfect amount of space for 65-70 people, even with a dance party after dinner. \n\nThe BAD: The event coordinator was nearly impossible to work with and her customer service skills were lacking, to say the least. \n\nShe called me the day before the wedding and indicated that our reception room set-up sheet was \"All wrong\" and \"would never work.\" As I nearly had a meltdown on the phone - we had visited the room four different times, during the busy Holiday Train Show, attempting to make approximate measurements and we had a pretty damn good idea of what would work, table-wise, at that point - she then softened a bit and said that the room set-up helpers at Olbrich would try to make the room set-up look like we had indicated on the sheet. \n\nWhen we arrived for the reception, it was set up exactly as we envisioned it, so she either doesn't have very good spatial awareness or just enjoys harassing stressed-out brides while they are at work in an office four days before the wedding. \n\nWe emailed back and forth about 17 times trying to set up a ceremony rehearsal. She basically told us, \"No,\" 17 different ways. She stated that we couldn't rehearse around 7 p.m. two days before the wedding, even though most of our party was from out-of-town and wouldn't be in Madison until Thursday evening. She then told us we could not rehearse Friday morning, due to a ceremony already occurring in the center. We also were not able to rehearse during open-to-the-public hours with instruments (acoustic violin and guitar) in the Conservatory, because it would be \"disturbing\" to others who were trying to enjoy the space.  Her idea? To rehearse the DAY of the wedding, at 4 p.m., with our ceremony scheduled for 5:30 p.m. \n\nHAHAHA! \n\nAs if we didn't have other things to do for the 90 minutes before the wedding, like, oh, I don't know, get our dresses on and take photos?\n\nThat's fine, we said. We'll just do a walk-through with my parents, the two of us, my little sister and our officiant the day before the wedding, while the Conservatory is open to the public. We didn't bring any instruments. We didn't bring any speakers with any pre-recorded music. We just walked in, showed my parents and little sister around, showed them where we would stand and get married and how we would walk in together and discussed a few more details. \n\nThe UGLY: Patti then comes storming up to the Musician's Terrace (which is the only logical place to get married in the Conservatory), and, during \"open to the public\" hours, demands to know what we're doing. I explain that we are just talking about the wedding ceremony. She says, \"Well, it looks a lot like you're rehearsing.\" \n\nIf her loud insisting doesn't disturb the peace of the public trying to enjoy the Conservatory, I don't know what would. After my blood pressure returned to normal (and after we had an absolutely lovely ceremony in the Conservatory), I drafted this review two-and-a-half weeks later, and realized I'm still pissed. \n\nOlbrich, please consider someone with better customer service skills to manage room and Conservatory rentals, for weddings especially. Couples spend a lot of time, money and thought on their wedding rentals and planning, and they don't need this kind of treatment throughout the grueling and stressful wedding planning process, ESPECIALLY MERE DAYS BEFORE THE EFFING WEDDING. \n\nThe spaces are still gorgeous, though - that is undeniable.", "business_id": "Q3GGB4ZMajP-Qmtdr1cVZw", "stars": 2, "date": "2015-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "01JQIjU6SVSSOq6U5RYsIA", "review_id": "3DdoAcddXUcg2mstbD7PeA", "text": "I can't believe I haven't reviewed this yet. This is one of the better Chinese places in Madison, although it can be a little spendy (not too bad, though) compared to your run-of-the-mill Chinese take-out joint. It's worth it, though.\n\nThe menu here is huge, and the portions match. I've never come here and not had leftovers to reheat the next day. \n\nThe food itself is almost always excellent. The wonton soup and anything with duck in it, in particular, are really well-flavored. \n\nThis is also one of the few Chinese restaurants I've been to that does an equally good job of catering the adventurous eaters and people who are a little bit less comfortable with something out of the ordinary. \n\nService is also always friendly and quick, especially considering how big the restaurant is.", "business_id": "eC4iEcRR3p5NLq9Zf80ZGg", "stars": 5, "date": "2014-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 2}, "user_id": "o46EXQpXhenCTs6RU51CSA", "review_id": "UUEv4noW7BCrDWmIVehXiQ", "text": "Came in for a fish fry last Friday night. The place was busy, there seemed to be a short wait for tables. Luckily two people had just gotten up from the bar so we were able to snag 2 bar seats without waiting. And boy, were we lucky, because the bartenders here are FANTASTIC. Incredibly knowledgeable and engaging, they make great traditional Brandy Old Fashioneds. They also have some of their own infusions that they do, like a honey chai infused bourbon (also great as the base of an old fashioned). \n\nThe food came out relatively quickly. It is a pretty standard fish fry menu. You can have either Cod or Walleye, breaded or fried. I had the fried cod, and it was definitely worth the trip to the near east side. Light, not overpowering batter, and thick pieces of cod. Fries were pretty standard, but the house-made cole slaw was a nice touch as well. \n\nAll in all, classic Wisconsin Fish Fry experience. Really cool little place, great staff, good food, and great drinks. They also told me they are opening a Speakeasy right next door, which is really exciting. They do a lot of their own infusions so I can't wait to see what drinks they come up with for this new venture. \n\nNot quite sure it was good enough to unseat Quivey's Grove at the \"Tip Top\" of my fish fry list, but it came darn close (horrible joke free of charge).", "business_id": "JJFoeKZXgi2_LeECDMkkoQ", "stars": 4, "date": "2015-02-10", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 4}, "user_id": "lC0KGXmIhyjzghBUlVnkhQ", "review_id": "it0F_9EIFg_I-lQC0QfrvA", "text": "If this place were called Cheers, call me Norm. \nThe small town feel with big, helpful personalities is exactly what I expect from a hole in the wall and WA is nothing less. So thrilled that Steve L got me there! \n\nCash only!", "business_id": "pSYCSXgabSKKJrIEJG-FLQ", "stars": 5, "date": "2014-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Zb2TPbKq0T1WMXMC30MdKA", "review_id": "KhSKp8xMWkxkx7zJ0DpQxw", "text": "WwoOOW!  It is really that good here!  If u don't stop u are missing out BIG TIME!  Great food!", "business_id": "HLWtNcf3l-wKb6v9duteMQ", "stars": 5, "date": "2013-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pYYvlPynPqTPJGI1zqQ90g", "review_id": "jrKFMAVLa_MFfuey315_iQ", "text": "Called ahead asked if I needed an appointment to bring my vehicle by, said it was ok to drop off anytime. Brought it by that morning and explained the brake problem I was experiencing. Was expecting a call back later that day, but did not receive any follow up. Called back the following morning, and the vehicle hadn't been looked at but I was told they'd have more information for me before lunch time. \n\nGot a call back with a $1200 estimate. Explained that although the part that needed replacing was not expensive or tough to replace, much of the brake system needed replacing because of rust and dry-rot. Picked up my vehicle later that evening and took it to another mechanic for a second opinion. \n\nEnded up getting the job done for $500 less than Chet's quoted, with much of what was said needing repair un-touched. Even got a comment from the second mechanic at how solid the vehicle looked underneath (hardly any rust for it's age). The vehicle has spent all but one year of it's life (1990) in California/Arizona, so it was good news to me that one year in Wisconsin hasn't beat it up too much.\n\nShop around for repair quotes if you can.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 2, "date": "2015-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "8ITVDdfK07owxCA1x878Vw", "review_id": "c7A3sUY1Vfg7mXcElJUgNA", "text": "Sure, you could e-file but then you'd miss out on the pleasant banter and helpful advice I picked up from Duane.  \n\nReasonable rates that clearly pay for themselves.  Even with my simple filings, he found some things I had missed that bumped up my refund.  Did an even better job with Kate and her new business enterprise.\n\nWhile not glamorous, it was a pretty excellent way to spend $65.", "business_id": "jm3K37BEkL8-a_aytbCXvA", "stars": 5, "date": "2007-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "TbrTV-oYi-jYXMgAWZoEQg", "review_id": "CXHAHi4uCvcm3f-tk7Fypg", "text": "Cottage Cafe is a Classic Breakfast Joint. Yeah it's a joint... A locals joint. But as soon as you walk in, you will be greeted and treated like a regular. \n\nI had the Biscuits & Gravy special with over easy eggs and hashed Browns. I tried to order a pancake as well, but was waved off and encouraged by the waitress to go with the baby cake. \n\nTurns out that the baby cake was as big as my rather substantial head. The full size pancake ergo must be larger than a grown man's head. \n\nThe biscuits and gravy were a hit - smooth and creamy. At one point I managed to get the over easy eggs and hash browns all mixed in with the biscuits and gravy and added several shakes of hot sauce... Delightful. I'd been hankering a big sloppy breakfast for a couple of weeks and the Cottage Cafe did not disappoint!", "business_id": "MONajnUQ5-IRtv8PSPn_yA", "stars": 5, "date": "2015-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-ZSPer3Fb79GxWLUIq7Dfw", "review_id": "2aS7aifPvZmM5hb2ajCh-w", "text": "Dave was fabulous. He explained every thing he did to my car every step of the way to ensure I understood before he did any work. He was extremely accommodating and very friendly.", "business_id": "IlE4UouTsBEGiJ_bNrb5ug", "stars": 5, "date": "2014-02-01", "type": "review"}
