{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "_CtkjL-e6O_lMShkN6HuSA", "review_id": "nuZlz-65cXIsLZPGk6EwDw", "text": "Take it from me; avoid this place at all cost.  The only time I go is when I am starved and don't have the energy to cook or get edible food.  And then after I have been kicking myself.", "business_id": "SQ0j7bgSTazkVQlF5AnqyQ", "stars": 1, "date": "2011-01-12", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "qlcwfLpIG62p2VccbG-idQ", "review_id": "gqEhkoed1ljMNWIFZS57dw", "text": "If I had to pick my very favorite chain restaurant, it would be PF Chang's.  I'm aware that it's not authentic, but that doesn't mean it's not delicious.\n\nWe stopped by after some shopping in the area on a snowy Friday, and were able to get a table pretty quickly.  The hostess and server were both friendly.  My husband enjoyed a glass of sake, and I had a mai tai that turned out to be delicious.  We split an order of lettuce wraps as an appetizer; they don't custom-make your sauce any more which is disappointing, but they did happily provide us with chili paste and hot mustard to doctor it up ourselves.  His Chang's Spicy Chicken (extra spicy) turned out great, and provided the extra requested heat.  My Orange Peel Shrimp were as good as I'd remembered-- perhaps better because they have some fresh orange slices included as well.  We also ordered a Great Wall of  Chocolate.  If you like  chocolate cake at all, you'll love this one.\n\nPF Chang's consistently provides good Chinese in a trendy (but still casual) atmosphere at a decent price, and I'm always a fan.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2015-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "D1G8W0SgCbsKTv7cAqKcNg", "review_id": "wgrd8HfMtnJENILJ-IBOlA", "text": "Got take out from this place on the weekend.  Ordered kung pao chicken, steamed dumplings, and pork egg rolls.  I was really hungry so it hit the spot, but there wasn't that many chicken pieces in my kung pao chicken - a lot of peanuts (as expected) and a whole lot of celery and carrots (aka filler).  So I was a bit disappointed in that.  \n\nThe steam dumplings were good, especially when fresh and hot.  The egg roll was tasty as well - I didn't find it too oily.  Very affordable and a generous portion - I had the leftovers the next day.", "business_id": "TyIsuojeKcTb4Acfg7xqew", "stars": 3, "date": "2012-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8VXrX5qbxtfc8DYosbbTaw", "review_id": "clNcL09tzhV8Q_40_1y5nQ", "text": "Good food and great prices. Lo mein was delicious! My boyfriend said this was the best Chinese delivery we've had in our area. We will definitely order from here again.", "business_id": "KnlNwiIELDWAR686Bk2WJg", "stars": 5, "date": "2015-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0xIQG-NrqMx5id6yJpQp8Q", "review_id": "MgNaPF3zTo_-jgDdmmGOAA", "text": "China Palace offers both Americanized Chinese Food and more authentic style dishes.  A good portion of their menu is populated by items such as General Tso's Chicken and Moo Shu Chicken, but there are also more authentic dishes such as Szechuan Water Boiled Beef (shui zhu nio) and Yu xiang Eggplant.  Personally I have to say the Water Boiled Beef is both the best Water Boiled Beef I've had in Pittsburgh and also the best dish I've had at China Palace, I like all my spicy dishes with extra spicy.  Their Americanized offerings are also cooked pretty well, definitely better than take out restaurants.\n\nContrary to popular belief, China Palace actually has a Taiwanese owner and not an American owner.\n\nChina Palace is nice as you can go there with people with more Americanized palates if you have a more Asian palate, or vice versa, and you can please everyone.\n\nPrices run from around 9 dollars to upper teens for some of the chef's specials.\n\nHighly Recommended.", "business_id": "Q9BXMPu2HnRDMq9X_2rHrQ", "stars": 4, "date": "2009-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WcDdWdsxmOYPxtbRRr1IaA", "review_id": "b3lIoC-kHhsI2YzIf9BqNw", "text": "This has been our go to place for Chinese food, mostly because we support family run businesses, and because it's good. The whole family is friendly, and welcoming, and their various dishes have been hits. My favorites have been their Szechuan spicy tofu, Beef Broccoli, and their beef fried rice. They have one of the better tasting Hot and Sour soups in the area, and their steamed dumplings are tasty, filled with a ground pork mixture, and if it's not pork, it's still tasty!\n\nMost of our orders are take out, but they do offer free delivery. Getting into and out of the parking lot can be tricky, but it's worth it.", "business_id": "7QBJDNVH6VPAStSvOM_lZA", "stars": 4, "date": "2010-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fll72LFE_P2Dq-p9zfzJ8w", "review_id": "K4NVkBywDJoLYNQMfkWQyA", "text": "Wouldn't recommend. Giving 2 stars instead of 1 just cause I've had worse. \n\n1. Ordered at 7pm on a Wed. Took a little over an hour to delivery.\n\n2. Boneless ribs weren't typical. It was just sliced pork with a sweet sauce on them. Not rib meat. \n\n3. Sesame chicken. A pound of seeds. All I could taste. Very dry. Little sauce. Some funky tasting pieces in the mix. Don't expect all white meat. \n\n4. Crispy noodles were actually tasty. Fresh made. But bags were COVERED in grease. I had to wash my hands just from opening the bag.\n\n5. Rice was over cooked. Complete mush.", "business_id": "Zm9uQ4SYpZzUb3epDMeb7A", "stars": 2, "date": "2015-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "OEJQoj8LetSPZW6HowjTVg", "review_id": "oLh-cpmhkz17QaFVEb9BEA", "text": "Seeing that I'm Asian and originally from NYC, I know what \"authentic Asian food is\". The food by best is subpar and barely mediocre. The lady at the front desk is absolutely RUDE RUDE RUDE RUDE. Disgusting phone etiquette and completely APPALLING. Not only that ? I asked for $2 more extra meat. Does 5 slices of beef equal $2 ON TOP of what I originally ordered ? NO. I also asked the rude lady for a side of sriracha, but she purposely gave me hot chili oil. I rarely ever write such negative reviews, but the quality, quantity and disgusting attitude makes me NEVER want to return. They lost out on catering opportunity for my team at B of A as well. So sad.", "business_id": "rT-iPtIXMKj3dTcl87lbOw", "stars": 1, "date": "2015-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CUNj75g1qpHysc3I6KwU8A", "review_id": "i3Mj-bmyGYaUagoJRYK2sw", "text": "Great food here. They are fast and give you a good portion of food. The general tso chicken is awesome!", "business_id": "cibtubYc6gd8T6Y-nPPByw", "stars": 5, "date": "2014-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "71Rf3H8jIczD04a64NHtWw", "review_id": "aZsYQtLvckV6bi6pRAFvWw", "text": "Fortune Cookie is definitely my spot that I call when I want chinese delivered. So much so that I got a group together for lunch at work and their delivery service was par excellent again!!!", "business_id": "G3EsKzy3i-CvrEDjZzTV0g", "stars": 4, "date": "2013-01-28", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "Xka9DFYAEVOow2zxdmtT6A", "review_id": "l6c7zs4yrb9yMVXJqf-SIA", "text": "Oh yea I'm a fan for sho!! So, my better and half and I frequent this place quite a bit!  It's awesome!  Make a reservation, they're always busy!  So for a surprise bday party, they were incredibly accommodating for the 12 people that I had invited and even allowed for me to bring an ice cream cake and borrow their ice box for it!  The waitress was a rock star by far this passed time.  She got every ones order correctly entered and the kitchen rocked it out!  I recommend the curry veggies!  Yum!!!  \nAs far as the bday!  Oh yea, he was surprised and the cake was Epic World of Warcraft..with people coming from around the restaurant to check it out once the kitchen prepped it..  I hear I got some bonus points for this one :)", "business_id": "4CPrhBc4Ado90fj7PG6jrA", "stars": 5, "date": "2011-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MNc245holuEc7-vWSFs1BA", "review_id": "71hr_hjVzfjMfupgd5Rbpw", "text": "My husband and I took our daughter for lunch today and were extremely disappointed with the whole experience. The food was not as good as we had remembered and the service was horrible. Our daughter spilled an entire cup of Egg Drop Soup on the table. Our server witnessed the incident and never brought over a rag to clean it up. We sat there for about 10 minutes with soup spilled all over the table. When our food came out, the man proceeded to place the food around the spill and then told us that he would bring a rag out. A few minutes later we still didn't have a rag and our food was getting cold. I eventually used diaper wipes I had in my purse to clean up the spill. Our server returned to the table at least three times and never mentioned the spill or the lack of help cleaning it up. The rag never did show up. We will not be returning to this location anytime soon.", "business_id": "4CPrhBc4Ado90fj7PG6jrA", "stars": 2, "date": "2015-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QiU5jxOR3iu9ZxoJQG32wg", "review_id": "GrOCyXNWeeyaD8W4kDAiLg", "text": "Really good quality Asian cuisine that is always reliable. Been going there for years and I've never had a bad experience.", "business_id": "s-cFWOk9LXXZCrm4lKpjEg", "stars": 4, "date": "2013-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "5KZmI27uVZxliUthxg5GoA", "review_id": "WJcWcuBDDtZKPHVGLrdYKg", "text": "My dad's Christmas party was held upstairs in their private event room.  The aesthetics of this place is a little too dank for my liking.  Their upstairs has no handicap access either.  We had to carry up the individuals in wheelchairs.\n\nOn the other hand, the food is simply amazing.  Each dish brought me to Chinese heaven and back again.  Since the meal was pre-determined, I do not know the menu name for each dish.  We had fresh fish, duck wraps, beef and asparagus, seafood soup..and I'm sure I'm missing much more.  The duck wraps were one-of-a-kind delicious!\n\nI would definitely come back!", "business_id": "i-tKO0n-1Tq6sTFUrhg9-Q", "stars": 4, "date": "2011-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PM2jXrlVzik1jDwwahLJJQ", "review_id": "rJVhlJ8PhAhHg2iE0xPfeQ", "text": "Stopped in for lunch, they have a pretty good lunch menu with comes Ruth steamed it fried rice and a spring or egg roll...\n\nI tried the trio with shrimp, chicken and beef and they make it spicy! The food was hot when it arrived at the table and that extra spicy sauce really added to the flavor, I chose the steamed rice which was also very delicious and a perfect combination with the trio!\n\nEverything was good enough to make me want to return and try something else!", "business_id": "qam5QKFE2a8MQBkxznrr3w", "stars": 3, "date": "2012-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dTZ22xz-muriW5nyNaJy_g", "review_id": "ZAw7SbsSpDiGjAdKq4uxEw", "text": "Be careful, they charge 18% tip togo oreder too at lunch time. That happen to me today. I ate with my friend in dinning and 3 order for to go. But recipe including 18% tip for 5 order so they charge me 3 togo order also. I feel not good.", "business_id": "qam5QKFE2a8MQBkxznrr3w", "stars": 1, "date": "2015-12-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "PpkKVodWC0sdn74TbHQLzA", "review_id": "Sin3OumojHRJyl6jt9W9bw", "text": "Yen is Back! !  !  Gourmet Chinese at its Finest!\n\nBest Chinese in Charlotte!  Best Chinese I have had since the last time I was here!  This is another place \"55\" introduced me to about three years ago and is one of the few places I want to eat Chinese!  Mr. 1,2 really sold me on this place and told me about the OPEN Kitchen.  Told me to sit at the Bar and talk to Yen as he cooks.  I've been here enough that they know me, though have not sat at the Bar yet.  The \"Bar\" is your Kitchen-side \"Table\"! \n\nLast Saturday I arrived about 5:45 pm and was warmly welcomed by \"Jean\" (I'm guessing on the spelling of her name).  This place has a great following and they seemed to know every customer by first names!\n\nI ordered a Stir-fried Chicken dish, one I have never had nor heard of with: Bok Choy, Mushrooms, Peppers and Onions. The Fried Rice was Better than most Fried Rice Entrees of any ethnicity and Egg Drop Soup as good as the Best Egg Drop Soup I have had anywhere!\n\nDining here feels like being a popular family member visiting after a long absence!", "business_id": "Ylef457BBvxuv7wq-20lkg", "stars": 5, "date": "2011-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aQZM7L_HPqTsRdFXhQExZw", "review_id": "xTUg5ZFk6-hqZExh-DGGvg", "text": "Hands down the best Chinese food in Madison. The chicken chow mein has been a favorite since I was a child. Try the egg rolls and the jasmine or chrysanthemum tea. You really can never go wrong here! The decor is beautiful, and makes you almost feel like you could be in a restaurant in China.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 5, "date": "2014-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "SUiDl5RRnIYyOM4a9Z62vA", "review_id": "x7PI_fAe2iON003hZfWUgA", "text": "This place has great take out. There are just a few tables to eat at, but seems most of the business is take out. The people that run it are very nice and seemed to know everyone picking up food when we were waiting for ours. The restaurant is very clean, and the kitchen is open so you can see them making your food as you wait. They have all the typical dishes, but seems more flavorful than some we have tried. We will definitely take out from them again, just wished we lived closer.", "business_id": "wl-7A4jC0f27MOEmW-XTbQ", "stars": 4, "date": "2015-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "TRWkEPiLuIWqeCnv5YVhNQ", "review_id": "6fDGQJrR1dP83DB_HYlujQ", "text": "Always very good and the price is right!  The staff are friendly. The place is clean. The portions are huge and flavorful. They have a tv and it's never crowded.", "business_id": "9hf_gSaDn3cdLsE6vTsUfw", "stars": 4, "date": "2014-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-6l7CsWbTPJeFgflI-V4Fw", "review_id": "fHR55jEJsIsZt49G1Rh7rg", "text": "OMG! When it comes to Chinese takeout there is no better. I cannot count the number of times I have sat in some posh Chinese restaurant in LA fantasizing about First Wok. They have a ton of options (healthy too) and will customize your dish to your liking. Everything is good! Definitely try it!", "business_id": "vubRS4bmJ_8yXpn-67wNZA", "stars": 5, "date": "2011-02-02", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "5PaVfxJ6HS_NuhLjnV-nSA", "review_id": "hd5IxVeU9gYSDWFOgv_C6g", "text": "To reiterate what has been said a couple times already, NEW OWNERSHIP/MANAGEMENT. Over the summer of 2012 they completely gutted the kitchen and put in all new appliances according to the owner. Home of Gourmet should be considered to be on par with the other respected Chinese venues on campus. In fact, six years ago the current owners of Home of Gourmet once operated Cravings and they they sold cravings to its current owners\n\nThe lunch and dinner serving styles are different. Both are extremely good deals. Lunch is served like a school cafeteria with 6-9 entrees offered that alternate daily. 2 entrees + a ton of white rice + free drink = $5.50.\n\nDinner is fantastic. Variety on the menu is incredible; over 100 different dishes offered. Portion sizes are huge and i think prices are extremely reasonable especially considering 2 people can share most entrees (from the Chinese menu) as a complete dinner. Free Hot Tea.\n\nMy favorite dishes: The stir fried green beans are unbelievable. They chili oil fish is fantastic if you like spicy food and fish. The \"Indonesian fried rice\" is identical to the jakarta fried rice from cravings. Ma Po Tofu has a truly authentic mala spicy taste. The employees are very willing to tweak any dish to any preferred taste.\n\nDownsides: Small venue so it gets extremely crowded noon-1 and 6-7.", "business_id": "u06X5C_pIAVuOXOznIcPYw", "stars": 5, "date": "2013-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VbGvSYdxH5eRIoOwr_qkKA", "review_id": "56v5k4M_2cIg4XY_S3mYRg", "text": "I have to say, from the outside, I was scared to go in.  I quickly learned not to judge a book by its cover, because the inside was really well decorated.  It is decorated in a modern-traditional style and is light handed on stereotypical Chinese restaurant decor.  It felt very cozy and welcoming, which is a great feature.\n\nThe food was very good!  It was presented attractively and the portions are enough to feed you for dinner and again for lunch tomorrow.  I ordered a vegetarian stir-fried noodle dish and was totally happy with my selection.  I tried a bite of my roomate's fried rice, which was a bit oily for my liking, but still tasted quite good.    \n\nI will warn you against ordering the egg rolls, because they are the frozen kind.  They taste just like the ones at Panda Express.  I think I would give this restaurant 5 stars if their egg rolls were bigger and homemade.  Over-all it was a pleasure to eat here and I will definetly go back!", "business_id": "Kck9wE9Z1S_xxzglh1Qdwg", "stars": 4, "date": "2009-01-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Aggpf1EWooD85fhOhoRxPg", "review_id": "pf5pVYNuJeEiGdSuZpPH9g", "text": "It must be fate that the other place we wanted to eat lunch at wasn't open--so off to Fate we went. The food was fab, the decor was--well, it's kind of like a post-apocalyptic movie where Mad Max and his merry band of nuclear war survivors would eat. Sorry guys, I'm just not into the bare look! But since I love old houses, I'll forgive you for that. And of course, in the interest of full disclosure, I'm terminally un-hip, so all  you urban pioneers out there will just love the decor.\n\nBut I'm still gonna bring hubby here sometime to eat, once again, the food is fab!!!", "business_id": "VsO_rhXi5lgbaGxNwoEZsQ", "stars": 4, "date": "2007-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0H9ne5frm1GjO6TjUwbxlw", "review_id": "xp5zkhCxVLQGVyvnxQJfig", "text": "I love the food and semi-dislike the ambiance. I don't like eating in plastic lawn chairs. And most of the servers have that  \"I'm way cooler than this in real life\" attitude. All that said, I could eat the fried tofu in dragon black bean sauce every day....and I don't really like tofu - but this is just different and wonderful! Lots of fresh vegies, wonderful creative ingredients on the entire menu and the cocktail menu was pretty cool as well. My husband tried some sort of basil ginger tini last time - it was wonderful! I would give the place five stars if the seats and service were nicer.", "business_id": "VsO_rhXi5lgbaGxNwoEZsQ", "stars": 4, "date": "2009-02-16", "type": "review"}
{"votes": {"funny": 3, "useful": 0, "cool": 0}, "user_id": "BjwXX-sChcjx2E55B_7rXg", "review_id": "a2w8ZqnZmgOoxVY8HbT2LQ", "text": "If you can look past the giant Meth billboard right outside and the general uncleanliness of the entire establishment, it's pretty wonderful... especially if your intentions involve eating a whole lobster, like myself.\n\nGourmet House of Hong Kong has the cheapest whole lobster dishes I've ever found, anywhere. I don't mean a measly, mid-western, tourist trap restaurant kind of lobster, I mean a damn good, meaty, savory, juicy morsel of deliciousness.\n\nIt's served a number of ways, but I usually go for the black bean sauce style. Then, I eat like nobody's watching, vow to never let my boyfriend see me like this, and usually end up getting sauce on my face, clothing, table, neighbors, etc. Go messy, or go home.", "business_id": "ykfTh6HI219NoMsWBxulxw", "stars": 4, "date": "2012-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1g8Crb6WGQUsA2l2X3yVGA", "review_id": "0z4A9aIPk9Tc-pAlhuMXiw", "text": "Did not care for the food at", "business_id": "2unQHR9uaRxk3dsW6f3MGA", "stars": 1, "date": "2011-02-25", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "M6oU3OBf_E6gqlfkLGlStQ", "review_id": "3Cl3j-p8CxQW5kdrG1HbVA", "text": "I used to hate studying, but one must study the massive menu before placing an order.\n\nThere are 2 Menus in one. Dishes that start with an A are the gringo dishes, Kung pow xxx mu shu vegetables etc. Then there dishes that start with a C, this means a dish unaltered from china. In come cases this means unusual ingredients like pork kidney, or just copious amounts of peppers as with the seczuan dishes. \n\nBeing veg it took a bit of time to tease out dishes that were meat free and still had flavor but we managed a decent array, however I really want to go back and try some of the more exotic dishes and see if they can be made meat free. \n\nWhile the food is good, they may have a bit less service than the number of tables need so don't expect white glove service. But at these prices $6-8 for most dishes who cares.", "business_id": "yQONzVpX-DEpGSuKMIov6A", "stars": 4, "date": "2013-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vj9qgmK0dgNioG5zdWaXUA", "review_id": "H5zjpxzV7WQnBafhwnN1zA", "text": "The best Chinese food I ever had here in Phoenix. We ordered shrimp crispy, beef Szechuan and wanton soup. I can't believe the food here is so great. Definite I'll be back here before flying back to LA and after the super bowl games", "business_id": "yQONzVpX-DEpGSuKMIov6A", "stars": 5, "date": "2015-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "7-ly4LI9XWLXkFiM2vHxrw", "review_id": "jWLcYYdKjh0XfFSGeW2w3w", "text": "This place was delicious before the light-rail pushed it back to 3rd St., and it's still the best Chinese take-out in my area.  I've been about 10-15 times in the past year, and haven't been disappointed yet.  My guaranteed winners:\n\n* Spicy eggplant\n* Boiled wontons (in peanut sauce)\n* Mongolian beef\n* Sliced pork\n* Hot and Sour Soup\n* Crab puffs\n* Green beans with sliced pork\n\nI'm sure there's more--the menu's pretty sizable.  Takeout ready in 10-15 minutes is another big plus, and the dining room is clean and comfortable if you choose to eat there.", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 4, "date": "2009-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "ESrdXpT1yF7KZX52bPpnJg", "review_id": "jHlGDPeuDLzctVgE7rVLMQ", "text": "They have good lunch specials, but your options are more limited than at dinner time.\n\nI have had the pleasure of trying almost everything on their menu, as I have been going here for years. Good quality, HUGE portions, but the servers can make you feel rushed to order and pay sometimes. They're open pretty late on Friday and Saturday, 10pm, so that's nice if you live downtown since most places close when the sun goes down. \n\nMy favorite items- The house chicken, chicken corn chowder soup, pillow chicken,  ma po tofu, sizzling rice soup, black pepper beef, and the sichuan prawns. \n\nI'm sure you could find chinese food of this quality in almost every city, so I don't know if I would make a special trip to eat here. But if you're in the area, I highly recommend stopping in for a bite.", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 4, "date": "2012-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NRMImSpm558LJ0bUfgQLIg", "review_id": "KtalkwUfa7x6yieYGjKxeA", "text": "This used to be my favorite Chinese restaurant near downtown now they raised their prices and are charging for bland fried rice for lunch and the soup looks like a bowl of snot! I will not be back!!", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 2, "date": "2014-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hA_8cYKY1p8O0TXWkGnrIg", "review_id": "Ek7FQA0MOzA6biI29CKENA", "text": "I've been going here steadily for the last 10 years and it's by far the best chinese buffet in the valley. They've got tons of fresh sushi and any kind of food you want. The spicy chicken and sweet shrimp are my favorites. The place has been completely overhauled as of the last  months and it's never looked better. The owners are always on site, and if you want a specific kind of roll/sashimi/nigiri  they're very happy to accomodate you.", "business_id": "naUFPFYH2CqHtTrV3IAJrQ", "stars": 5, "date": "2011-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 1}, "user_id": "ZrUZtLgLOn15v2NIZl-oKQ", "review_id": "nNPYCwg20enlQpYjYfa_zg", "text": "I went here on Christmas Eve for lunch because I was always curious about it. Plus, the Chinese food choices in central Phoenix are pretty sparse. I would actually give this place more like 2-1/2 stars. I liked the tofu and pork clay pot we ordered. But the pork and kabocha squash dish was waaaay too salty. I feel like it was a spice, not MSG, that was the culprit. Either way, I had to scarf down a lot of water every time I ate some. We also had fried green beans with XO sauce, which is pretty simple to make. I know they have a buffet too and judging by what I saw during my stroll, the food seemed like nothing special. I did crack up at the using a tortilla container for the steamed rice. \n\nI could see myself going here if I was really craving Chinese food for dinner or lunch. But I'd get it to go rather than eat it there. The inside is the usual old-school Chinese restaurant decor with booths and tables. As someone from the Bay Area and who grew up in a Chinese household, I could definitely say I've had better. I know the owner is supposedly a chef with 30 years experience so who knows, maybe I went during an off day.", "business_id": "UxMnY3Dxafucv5cXHyfBSA", "stars": 2, "date": "2014-01-06", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "_1PmRIeiFmevDYJtHz4bkw", "review_id": "-TN2LO3ihHKaJKobbjATkA", "text": "Gross, plain and simple!  I'll crave some quick Chinese Food and then I'm always upset.  What a waste of money!", "business_id": "nLpV9fo8xml-QHOKyOje2A", "stars": 1, "date": "2012-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "PNS9z4aFDbfhpIsHCfNvNg", "review_id": "6f9pb2-bUdxlsQqJs8-cSQ", "text": "I'm on the constant hunt for good Chinese food in Phoenix. After many disappointing meals, I found Desert Jade and haven't looked back. The restaurant is super clean and quaint inside (even a big fireplace) and the service is great. Each of our servers have been super friendly and attentive. The food is really good. It's not going to blow you away, but it's fresh, portions are just right and I've never left unsatisfied. \n\nI really like the Kung Pao Chicken, the Mu Shu Pork, Spicy Chicken with Vegetables (lots of them), and my husband loooves the glazed walnut shrimp.\n\nIf you're looking for an easy, casual Chinese meal in Phoenix - I promise you this is one of your best bets.", "business_id": "m9Wqqma30o-hH2fAX7dnug", "stars": 4, "date": "2012-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w9yneCFjacLCEEeG8ET5lw", "review_id": "AI9JitbQa_UKoDhiGV-Gzw", "text": "Desert Jade has become the only Chinese food we'll order! I have never dined in, only gotten take out, but they are extremely pleasant when you go in to pick up the food and the restaurant seems nice inside. Food is consistently delicious, fresh, with quality ingredients.  We've gotten past the no-delivery, but major downside is not being open on Sunday (our usual takeout night)! We broke down and tried our old place last Sunday and it was nowhere near as good... Until they change hours, we'll be forgoing Chinese Sundays! Desert Jade is the best!!", "business_id": "m9Wqqma30o-hH2fAX7dnug", "stars": 4, "date": "2015-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "91flJaXtNKecLmfkCMB02w", "review_id": "cKtJmiYsBnqd7IzKFvIsrw", "text": "I used to LOVE PEI WEI\nNO MORE to their positive they catered my business's X Mass party and it was great.\nBut on an individual dinner basis I have been disappointed. Also they are running a gift card special and have the signs almost hidden. I spent $170 for the office party wouldn't it have been nice for someone to point them out. Why have the offer and not promote it.????", "business_id": "9Vu9KhK2-kBSM-FXvxXGNg", "stars": 2, "date": "2014-12-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "T3n2nvbGKVeAoBeDcoLZnA", "review_id": "HjBMnRDuWqg4qEZYJR8uYA", "text": "Very good food! Fast delivery!", "business_id": "BicQSnGZnY_yuGEDkhVfnA", "stars": 5, "date": "2014-02-13", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 2}, "user_id": "zHH2Iz49wCZYYDLBTv0YOg", "review_id": "j3hXFt_h1ooXWiTj2vxU5A", "text": "Decent food, but bad service. Our waitress must have had an egg roll up her butt or something that was distracting her. In all my years of dining I don't think I've ever had a server come to the table, ask only one of the two people sitting there what they wanted to drink, then walk away. Seriously - she got my friend's drink order and walked away! WTF? But then, get this, she did it again, when she came back with my friend's drink and asked if we were ready to order, I ordered my drink, and then she turned to my friend, got her order, and then turned to walk away. I stopped her this time, of course. Oh, and then later, she took my glass to get me a refill, and when she didn't come back for ten minutes, I started looking around for her, and there she was, wandering around the restaurant with it, no idea which table it was from.. The food was decent, like I said, nothing special, but edible, but with that kind of service, I ain't going back.", "business_id": "F3SEkW6v2LJ5y6Ldo5pPaw", "stars": 2, "date": "2010-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IhcTLLWKS6ZiNyIX9oQQPQ", "review_id": "rJw65TmFqUI_lBb9XVti_Q", "text": "Still the same great service.  I reccomend the egg flower soup and the hot and sour soup for anyone with a cold and sore throat.", "business_id": "PkBqPU83bf1zArumGVHqcw", "stars": 4, "date": "2014-01-22", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 1}, "user_id": "TvivyYguqZSse8BZLgIO0Q", "review_id": "noVrW4bZQFot5xSKkERAVg", "text": "I got the Flamingo Chicken and a Puu Puu plater and it was delicious! It was pretty reasonably priced and the sauce that came with the platter was fantastic. I also felt like I could run faster and jump higher after eating here as well. Strongly recommended!", "business_id": "aozcOaCMwOHG8s-lbZ6_gA", "stars": 5, "date": "2013-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "eRaumxPQaxx2M3037hNg8A", "review_id": "3-G8vbPGIXlBS26JEDpIkg", "text": "Really good, old school authentic food.  Very affordable and quick.  Highly recommend.", "business_id": "zTfBa__ldlTdbVgSl5h31Q", "stars": 5, "date": "2011-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Yq_dXtlD9QFcvBlCAwu7vA", "review_id": "AgrcyDPvxzOgzHgafVYw4A", "text": "While I read the negative reviews and agree with their reasoning, I don't believe a 1-star or a 2-star is fair.   yes I will agree their egg drop soup was bland but it wasn't terrible.  Yes the egg rolls were heavily peppered but I ate mine with some sauce on it.  Yes again the fried won ton was lacking, but it was un-needed calories I was willing to skip.   My Mongolian beef wasn't the best I've ever had...but I liked it and ate all of it. My mother, my daughter, and I enjoyed a pleasant lunch for a great price. True, the place was not very full and busy but I tend to like a calm atmosphere. \nSo it wasn't the worst (1-star) and it wasn't the best (5-star).\nI'd say 3-star is O.K. and I'll stop in again eventually if I'm in the neighborhood.", "business_id": "oMtqDDzpMcFrQwHfeYc1iA", "stars": 3, "date": "2012-12-19", "type": "review"}
