{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q7MrNVt1FE23rwtWmPYWHg", "review_id": "i6x9-7ODFBd4_2OlgZxZAQ", "text": "We had food delivered to our house last night from Knossos. I tried their pierogi which I found to be quite good. Also tasty are their broccoli bites and their huge ice cream sandwiches (homemade). Very recommended!", "business_id": "PSlOtPIo28BvWOzdLmRRRQ", "stars": 4, "date": "2013-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xvf7jAD0eTJmeVcv-JciVQ", "review_id": "S-e-jwMrcO5DxCoHhw8rLg", "text": "We were downtown looking for some place to eat before the show when I man standing outside showed us a menu. Boy, we were not the least disappointed. After hummus and pita chips, we all started off with an excellent very tasty fresh salad. The leg of lamb of excellent as was the sides of grilled vegetable and rice. I don't usually like hummus but it was tasty and excellent. The Jackie O cake is to die for.  We agree that the waiter were sort of odd, but in a very good way. Excellent prices. Homemade wine was also excellent.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 5, "date": "2013-12-20", "type": "review"}
{"votes": {"funny": 3, "useful": 0, "cool": 2}, "user_id": "d8y98FiNtI8OQFAp2tvoKg", "review_id": "jCaVgX3km-Gu5hClEWiFhw", "text": "OK, it's Showmars.  So all you snobby food Yelpers need to take it easy.  You know what you're getting - the cute little old Greek guy on TV.  But it ain't all that bad.  This location on 7th Street is right next to a bunch of cool shops (Heroes, VisArt, Ho Ho Cherry House, Sunflour Bakery, Philosopher's Stone, etc.)  So make a day of it!\n\nAnd it's right next to a fun intersection - try not to get hit by a car, it's like playing Frogger.  Yep, you're the frog. Good luck!\n\nService has always been great here.  They are sooooo nice.  Monday night, kids eat free with a paying adult.  And Jason Frame does magic at your table.  His card tricks are really good.  They also have a good variety of side dishes, unlike other Showmars around Charlotte.  I dig the fried okra.  They also have root beer to drink, which is always a bonus.", "business_id": "8PsQqhrAH5uqJ7HODOmXYg", "stars": 3, "date": "2012-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lgNGOlBYaxoWIAPeydQ8cA", "review_id": "_vu-vOnORcjSc_pg1UypBQ", "text": "great place for weekly jazz music, amazing gyro sauce and falafel and hummus and fries and imported beer. when i ate meat the gyros were very good too! service is always friendly and the ambience is nice: i dig the high ceilings with its detailed patterns. i miss this place wish there was one in chicago.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2008-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "fAiVqZv7P_oc5CzGMX_G9w", "review_id": "cxvnCZ8CFq41WxHLHinLkw", "text": "So this isn't the best Mexican food in town by far, but it isn't the worst either.  My sister works just down the street from here, so we have met for lunch there a handful of times.  The decor is pretty old school and the menu is kinda all over the place with Mexican and American dishes, but they do the stand-bys pretty well.\n\nThe lunch specials are really the only reason we go back....Two Enchiladas with rice and beans is like $6 on Thursdays...and the service is so fast that if you are in a rush, you can still go to a sit-down place.  They have been there forever, so they must be doing something right.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 3, "date": "2010-02-15", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 1}, "user_id": "HCBo0Kvfm9yXErR-YuqVGA", "review_id": "2ARoxd00mWMgAh3hOO7tFw", "text": "My food hasn't come yet but this place already gets five stars cuz I know it's gonna be delish. My mouth watering as I type and enjoy the live and quiet guitar playing really incredible classical stuff in the corner. This place is uber cute and gets beaucoups des points for personality. Tons of eye candy in this little euro cafe lookalike, I feel like I'm back in San Francisco. I sat at the copper bar and was waited on by a hipster type.  Really nice and laid back service, but not record speeds.  They serve loose tea in little mesh bags that hang over your cup with a bamboo stick....more points.  My turkey brie and cranberry chutney sandwich was out of this world and the brie and pesto app I tasted was also pretty tasty.  It's coined as a meditteranean place but I'd probably call it fusion food.  Too many gourmet flavors to be strictly med.  The best thing about this place is everything.  Ambience....my favorite type...food is inventive and flavorful.  Nuff said....I'm still craving that sandwich and my only regret about this place is not asking that guitarist what he was playing.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 5, "date": "2010-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "trZV_m1qcHYWfsGDT5yJYQ", "review_id": "WklgN5rDBdjORUTVimrh-A", "text": "This was a fresh take and a nice change from the \"normal\" fast lunches I am used to. One my first visit I asked the lady helping me what she recommended. She said the steak kabobs are excellent and so are the chicken. My partner and I got one of each, lets just say this has become a regular stop for us. Food was fresh and tasty and the staff have always been very pleasant.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 5, "date": "2012-12-19", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "JC7nd7_Vf3QL9-PAnEpU7Q", "review_id": "DcBjPoyYi8EZjip-GHReaw", "text": "Having gotten delivery from here a few times when I worked downtown I found that they had a diverse menu and prices where reasonable for the amount of food you got. The Gyro's where good but the Stuffed Avocado was EPIC. It is my go to item here.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2013-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_EYJs7w10luJ8XpElMZyFA", "review_id": "AFm29tnKyQjmlwm1m-d5AA", "text": "We had a wonderful meal at Greekfest on a recent visit to Phoenix. Authentic Greek food and prompt/courteous service made for a lovely evening. Our server even offered to take a photo of our group before we could ask him to do so.\nThe only drawback I could envision for this restaurant is it's tucked away from the road. We had trouble finding it, even with our GPS. I'm so happy we did though!", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2014-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LOENjNpItvW21f2BHYnlMQ", "review_id": "oG3ZxUJVsSTwRMOyROMrhQ", "text": "Our family stopped here on a whim to get a snack and ordered greek fries and bruschetta. Both were generous portions and good values and so delicious we were looking forward to visiting again before finishing our food. The service was friendly, but slow due to only one server working.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2011-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XyaIK2hN3SNMohT5AbKxbg", "review_id": "8duglBmObLD8O5zsxt74yg", "text": "My wife and I have been eating here for a few years now...Mainly just for lunch.  Stopped by today to grab a gyro sandwich to go...it was good, can't beat the lunch special price!  \n\nWe usually just have the lamb or traditional gyros, vegetarian plates, or an entree salad..have tried their entrees and they are just OK..so I stick to the tried and true....if I am hankering for a gyro I think of Saba's", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 3, "date": "2010-02-02", "type": "review"}
