{"votes": {"funny": 1, "useful": 6, "cool": 4}, "user_id": "EODtZCvSn13sLsPIAmvJ7g", "review_id": "jY2X2XmPPSuw6ffqYqNvJg", "text": "Since moving to the east side I have started to go here almost every Saturday morning to pick up a couple of donuts and a coffee. I had absolutely no idea that it existed until a cabbie friend of mine told me it was one of his favorite places to stop between fares.\n\n(Can I just say that cabbies are amazing? They know where everything is, and they know about all the cool hidden spots that most of us pass up every day. If you know a cabbie, pick their brain sometime. You will probably discover at least one awesome place because of them.)\n\nSo, back to People's. The donuts are really top notch. Chewy, moist, iced just enough, and they have a ton of options. I really think that their plain glazed and their boston cream donuts are the best. Their glazed donuts have this bit of crispiness to them that is amazing. The fritters aren't as good as Greenbush, but still tasty. There are also some specialty desserts that I am unsure of, but will have to try some day. \n\nAs far as the food goes - the gyros are among the best I have had in town (right up there with Gyro House) but that is all I have tried there so far.\n\nSo, to sum it all up: good gyros, great donuts, fair prices, and great (but sort of slow) service. This place is definitely worth checking out.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2011-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "WMelGD7uD_ajakRR9s3N4Q", "review_id": "WAEX8BMWQq0KsUX2uk8zXA", "text": "Great Donut & drink selection, and the food is cooked right in front of you.\n\nThe place is a little out of the way, the only thing that youll see is a neon 'Gyros' sign in the window, but its worth stopping by. The people are very friendly, and the value is the best for the immediate area( and this is from a UW student who frequents the nearby TacoBell trying to slim budget...).\nThe only thing I can think of against the place are the hours- I really wish they stayed open longer! I cant count how many times ive been returning from groceries or whaterver and passed by the place, closed, and realized my dinner options were slim to none. One can hope for the futre though, and if youre ever around stop in, the donuts(hard to come by since I moved to Madison- just imagining maybe) alone are worth a trip.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2011-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7czwEqK4WPmg--oEfeH3Ng", "review_id": "X6_cyzch0ttAqElZoRk0Pg", "text": "Food is excellent and reasonably inexpensive! Had to wait a little bit because he made everything fresh. I'll definitely wait for freshly made food!", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2012-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "4_6Q7K5Dm0rEj7ksOnYUbw", "review_id": "Cd9o_91wYXO0fznt67TitQ", "text": "Now this is what I'm talking about!!  Total hole in the wall on East Wash in a strip mall behind some Mexican buffet, with the name People's Bakery, you'd never guess this place would have the best Middle Eastern food in Madison.  \n\nStart with the wife of the wife and husband team, who greets you warmly as you come in.  The menu is on the wall, but there are hard copies for those who need an explanation of the nicely blended mix of Lebanese, Armenian and Syrian dishes.  No matter your experience with food of the Middle East or Mediterranean, you'll find dishes you recognize, perhaps by different names.\n\nThis was my first visit, I'm sitting here eating my takeout order as I type this because it's that good.  I ordered the lentil soup, and several appetizer portions including hummus, moohamara, sarma, and falafel.    \n\nQuick review:\n- lentil soup.  Awesome, just awesome.  Beautiful saffron color from the cooked down red lentils, just the right mix of cumin and lemon, and a back end of heat, I'm guessing from Aleppo pepper.  This is some thick soup, and filling, and for 2.50, you get a pint\n\n- Moohamara.  I wasn't going to get this.  I like roasted red bell pepper, and I've had dips and purees made of them, but I've never sought it out.  Mary, one of the owners, told me it was her favorite, best on the menu.  And holy COW was she right.  A smack of roasted red pepper is quickly deepened by a sweet hit of pomegranate and walnuts, ubelievably complex and wonderful.\n\n- Falafel.  Huge portion, perfectly deep-fried, with a really nice, light texture.  Love the falafel, but I prefer tahini sauce, and these come with a yogurt mint sauce.  Don't get me wrong, this is clearly their regional interpretation, Im all about the authentic experience, and this was good sauce.  But, I confess that for my leftovers I'm making some tahini sauce.\n\n- Hummus.  You know, hummus is always a crap shoot for me.  I make my own, from dried chick peas, and I've been working on this recipe for 25 years (along with my Bloody Mary recipe and about a hundred others). This is another of those regional interpretation issues, this was my least favorite today.  I'll try it again, because my own hummus has on and off days.  This was just more on the bland side than I expected,  No one distinct flavor dominated so I felt like it was left with an almost indescribable flavor.  Not bad, totally edible, just oddly unflavored.  I added some lemon and salt, which helped some.  \n\nSarma - if you're expecting dolmathes this will be familiar in flavor, but it texture.  These are served cold with a yogurt dipping sauce.  I'm okay with the temperature, but I just like a little lemon on mine.  These are veg, the rice filling is cooked down to a coarse 'risotto-y' consistency.  I dig them, but those who prefer the snap of dolmathes will find these softer, but just as flavorful\n\nAll in all, outstanding.  Next time, shish tahouk and baba ganouj.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2012-12-08", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "xkqafIkLWnfSMeCKyVIiuw", "review_id": "uc-0RFeopmhEL1EAqNTCOg", "text": "After moving from Chicago to Madison, I thought that I would be safely tucking my Lebanese palate into the furthest recesses of my tongue, saving it only for the occasional trips back to Kedzie Avenue.  That was, until my wife and I discovered People's bakery.  \n\nUpon walking in, I was thrown back into the likes of such wonderful restaurants as Salam and Semiramis...but with Donuts!  We were genuinely welcomed in and I knew People's Bakery was gonna be one of my new spots, having not even tried a single thing in the store.  \n\nWe ordered a lunch \"to-go.\"  I got a Shish Taouk (commonly known as a Chicken Shawarma) and my wife got a falafel sandwich and we split a side of Hummus.  Well, my Shish Tauok was plump with heavily marinated, tender chicken slices, tomatoes, tahina, and lettuce.  In short, it was outstanding.  Aggressive herbal flavors perfectly matched with a spike of lemony acidity.  My wife LOVED her falafel sandwich...which is really saying something, as she's somewhat of connoisseur.  The hummus was really good, and the spike of sumac was a nice touch, although it was tad bit to lemony for me.  \n\nNonetheless, this is an AWESOME Madtown ethnic eats spot...and oh yeah...how can  completely dismiss the incredible homemade donut selection?  They looked stunningly good, but we both left that for another day.  Lebanese food and donuts....a winning combination, in my book.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2012-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 3}, "user_id": "-ZSPer3Fb79GxWLUIq7Dfw", "review_id": "cS319Kj78omD-vakbiT1yQ", "text": "Who says donuts and Lebanese food don't go together?!  People's Bakery has made me a believer of this magical combination! This place is great for some affordable, delicious Lebanese food, and some of the best donuts in town. The outside (and inside) is unassuming, but the food is authentic (as far as I know) and yummy. \n\nPros\n- VERY affordable\n- friendly and helpful staff\n- Did I mention it is scrumptious?\n\nCons\n- service is a little slow\n- inconsistent drink options\n\nI highly recommend trying their falafel with a fritter for dessert.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2013-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "w1aPVM0yLHuEyejvaReXEg", "review_id": "HIQ5QKnoIwNkIEdGl0rMPw", "text": "great donuts. great gyros.\nand the most adorable owners ever.\njust make sure you aren't in any rush, if you think about ordering food here. still worth visiting.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2013-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "DLmoYnzCUz1Z0EnJT1NPqQ", "review_id": "CCp08jVmw5E2QyzmS2GKCw", "text": "In addition to sweet treats like donuts and bear claws, they also have lunch and dinner options for cheap. Falafel is not the best in town, but try the gyro, which comes as a sandwich or entree sized plate. They have other standard Mediterranean options such as hummus and kebobs. Seating is limited and would not be good for large groups. Definitely more of a take-out place. I would definitely go back to explore their menu.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2014-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "ven1YSjx6rp1RD3CCqygSw", "review_id": "PjeB-BShZxkhRdbw8kv3Zg", "text": "I like the food and donuts, but and more importantly, I really like the people who run this place and the people who hang out there.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2014-12-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yDf8WDsTh3Wcc3VaVx1mEg", "review_id": "Z5Xiaiji3VpSseKUojI1gQ", "text": "Great Greek food. Delicious and huge assortment of donuts! Worth stopping in for a treat.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2014-12-31", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "dd5ffMsCUhTgwGBBhllaqQ", "review_id": "wLsatTjFJVHUJF6Ou_ealg", "text": "Want donuts in Madison?  This is where you ought to be.  The people's bakery is a small donut shop on Madison's east side and the place represents this town perfectly.  They also serve food like Gyros, which are delicious, but probably not Madison best gyro.  \n\nA husband and wife team run this place and they do an outstanding job.  Super nice too.  If you want an outstanding box of donuts, like top-notch stuff, this place is worth your time.  And if you want to buy local and support an outstanding company than THIS IS IT!", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2015-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "afAbHYz7Ka2UaFQ5SX7BAA", "review_id": "Rt9Doj33p_0fprbiKhbBbA", "text": "This is my favorite restaurant in Squirrel Hill, maybe the city.  Its hidden down some stairs on Forbes, you have to look for the little neon sign in the window - but its definitely worth the trip.\n\nThe restaurant has excellent, but pricey ($15-20) full dinners of skewers of chicken, beef, etc. that come with rice and a salad with delicious dressing, and it also has a ton of cheaper options for lunch or dinner.  There are pita sandwiches and you can get things a la carte.  I love to mix and match different a la cartes every time I go.\n\nI personally love the spinach lentil and red lentil soups, the vegetarian grape leaves (you get like 8 or so, its a good amount), and the hummus.  The large salad with grilled chicken is also another well-priced and delicious meal.  Portions are generous.\n\nAlso, the place is family-owned and the service is very friendly.", "business_id": "atG_rkb3fONGcw4fupbY9g", "stars": 5, "date": "2010-12-21", "type": "review"}
