{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "l_szjd-ken3ma6oHDkTYXg", "review_id": "CFiLh7WvH7dM3qVZvNiacQ", "text": "After waiting for almost 30 minutes to trade in an old phone part of the buy back program, our customer service rep incorrectly processed the transaction. This led to us waiting another 30 minutes for him to correct it. Don't visit this store if you want pleasant or good service.", "business_id": "HZdLhv6COCleJMo7nPl-RA", "stars": 2, "date": "2013-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GbjAbpNfxOC9E4sMiToDGA", "review_id": "-K4-yZTlXxDrRDFmxycksw", "text": "Very bad purchase experience. I bought a shirt with a hole covered in the rolled up sleeves, but they denied my request to return it. I am so angery at this and will never shop their chothes anymore.", "business_id": "qfL7ZFkxqDZOPIaVVfT3Aw", "stars": 1, "date": "2014-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RSExP0-Boucr4QyIEzZi0A", "review_id": "9d7qU0M1WVTmQ0OHgRsJAQ", "text": "I've always enjoyed this branch for my home repair needs.  It's quite close and never too busy.  The staff have always been nice and helpful.  One complaint I have is that the key maker/machine here seems a bit off.  Of the three times I've come to make copies of keys, I had to go back again because the first copies wouldn't fit very well.", "business_id": "qA1PXTv0snTO1gpNPm-Jfw", "stars": 4, "date": "2015-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jaDTgMqh4DzoLJrMrW3JcA", "review_id": "K02pVvIZ-gPIqjTWbtZPPw", "text": "Not a bad place to pick up supplies for Mixology class! In fact, quite coincidentally, several of us ran into each other doing just that.\n\nBasic bar supplies, glasses, bottles, just about whatever you need, but just the basic stuff...but what else would you expect? For the cool stuff, there are plenty of online places to get your fancy on.\n\nWhere they shine is in restaurant supplies! Check it out....fun place to forage!", "business_id": "Jj7EE1vPUaKHykA7WzlIew", "stars": 3, "date": "2012-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "fpfKrbnDfKA14S39I7n_uA", "review_id": "FaBQI_9K1r7E-mNQuQlrtg", "text": "shopped  at  pittsburgh  rugs yesterday    for 2 oriental rugs  for the  hall. walked  in  and  was  greeted  by  name  by  the  owner who  recalled  that  i'd  purchased  2  rugs there  4  years  ago. he quickly   found  exactly  what  i  wanted . their   prices  are  excellent  and  their   quality  is  top  notch. this company    has the  finest  selection of  orientals  i  have  seen   in  pittsburgh....and  is   a pleasure  to  deal  with.  they'll  be  installing  their  new  rug  cleaning  machinery  soon  and  that's  where  we'll  be  taking  the  rugs  to  be cleaned....", "business_id": "utEUlyjd2DjV3T23I8I1wg", "stars": 5, "date": "2011-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9EbjGq1C-Kon1jpN0_2OUA", "review_id": "Q7MXxoDh_ehUVhaagpE0Rw", "text": "As a passport carrying Italian I was excited to learn about this shop after first visiting her sister's grocery store just 12 places down the street. I walked in to fresh baking cookies in the air and noticed many things that i normally can't get at the regular grocer. Happily I went to the back to say hello and ask about what was in the oven. I was greeted by a women who was not the least bit friendly and told me that what I was smelling could be anything. She kept asking people, can I help you? Soon I realized that maybe the back of the store was off limites? There is a cookie counter with window back there, so it looks like it is just part of the store, but by her unfriendly insistance about what I wanted, I got the sense that I was not to be there. I asked to buy one of the peanut butter cookies that that had been making... thinking that I could eat it while browsing in the store... and she quickly responded,  \"We only sell them by the half or full dozen.\" By this time, I didn't feel very welcome or even that she was interested in selling me anything. I left, and don't intend to return.", "business_id": "_y7PECWjxr_E-hhmDVdEjw", "stars": 2, "date": "2015-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1h5T9mNgReCiykYCxvI55A", "review_id": "CGM9MhHKBIusByY5b0slQw", "text": "If it weren't so all-fired expensive, I'd go to Rollier's all the time. Their staff is friendly and knowledgeable, they have enough extra fun stuff (candy, Papyrus greeting cards, candles) to almost feel like a variety store, and a parking lot on Washington is definitely a luxury!\n\nThe main drawback is that their prices are high. I support them as much as I can, with the purchases where I can afford to spend a little extra.", "business_id": "jLgIlhi_A78JG-43C8e63Q", "stars": 4, "date": "2012-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-BsgZN8Q-4igS6NlVypMFQ", "review_id": "mEoQg331OoO1ko6BmdLdPw", "text": "Mostly 1960s-1980s stuff. A few pieces from the 1940s and 1950s and nothing earlier (clothes-wise anyway, they did have mesh purses from the 1920s). Lots of menswear; suits and dress shirts. The store is about half men's stuff and half women's stuff. The clothes seem to be fairly high quality (ie. not stained or ripped) but you pay for it. They did have some cute outfits, but it was priced too high for me.", "business_id": "bbfdJ1dkwWNww1m_SfyDnQ", "stars": 3, "date": "2014-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pDdnFAV9eMzxYdcuZuOMvA", "review_id": "nCRKH1coX79Vu2ElxAXdDQ", "text": "This place is great! I stumbled in here while trying to kill time before a cooking demo down the street. I was blown away by the amount of stuff they were able to fit into this little hole in the wall. The cards are hilarious, and certainly unique. With quips about pop culture and just general hilarity. I could spend hours just reading them. They have a lot of novelty items as well, and some beautiful books that I have never heard of before. They have pop culture jewelry, quoting everything from Dr Horrible's Sing Along Blog to The Wizard of Oz. If your in the area this place is an absolute must.", "business_id": "jwxhi--674LLCnvqJL7SRQ", "stars": 5, "date": "2015-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "07d78aw2t8XCzWyphrA7lA", "review_id": "S9ZYrqTTzHKuAQbQlMrOgQ", "text": "I usually enjoy shopping at the Gap, but I recently had a really bad experience.  I went in to exchange a shirt and when I asked the orange face goblin manager if they had any more he was incredibly rude.  First, he wouldn't even look at me when I asked him a if there were any more of the shirt I wanted to exchange, and him immediately told me they did not have any of these.  Since I was in a hurry I just decided to return the shirt, then on my way out of the store I saw a whole table display of the shirt in several different colors.  The costumer service really ruined my experience.", "business_id": "n1dklY6GFnpVLKwQE6kxGw", "stars": 1, "date": "2011-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-DCSpG7OP7ATeQ6VrPGARw", "review_id": "VAshRAyPFx5YJnsJ4AaahA", "text": "This place is pretty good.  The staff is pretty knowledgeable and helpful depending on who is working.  \n\nThey are priced competitively with online resources, but the product is readily available.\n\nWhat I do not like is that everything comes prepackaged.  My old HBS in Boston allowed us to measure out our grains and hops to meet the needs of the recipe.\n\nAs I get to know the place better I am sure I will give some better reviews.", "business_id": "5z1TluGqhwVYrN7ZZPDW6g", "stars": 3, "date": "2013-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bcnt8MHozobqcZbJtrLNQQ", "review_id": "2BDfI_BWNr2ud_Xp-BoJpg", "text": "\"Salesperson was very knowledgeable and helpful, as was her manager. Delivery team was prompt, professional and friendly.\"", "business_id": "fqFWad8GW178xzzC4A4ZEA", "stars": 5, "date": "2015-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y7I5YVlZ2V15MTkZY5CMiA", "review_id": "ykNlo2FIy8PeeiThUvf5Bw", "text": "I was quoted a price for a new pair of glasses and lenses that were in the 50% area. Came back the next day excited to buy the glasses and was told the glasses were not on sale for 50% and that the quote someone gave me the day before was wrong. The new quote was DOUBLE what I was quoted the day before! Not only was I disappointed about the price, but the sale associate was rude and didn't care about what had happened. I will never shop at Lens Crafters ever again. What a horrible experience! I also came in many times before and the employees never helped me. They were just sitting down doing nothing. I honestly don't know how they are able to stay in business if they don't help customers or at least ask.", "business_id": "5BCW9vDG1YRFqb55XfaNow", "stars": 1, "date": "2011-12-17", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 0}, "user_id": "LrgQbdg3V7uqLllQEbsKRg", "review_id": "pFR8Bd6V5cKCnsxOs2lKpg", "text": "I would not recommend going to this Best Buy location. I recently purchased a big screen tv there and had the worst experience a consumer could have. I originally found a tv at their Rivergate location and they did not have any in stock so I went to Pinevill. When I arrived I was one of maybe four people in the store and no one would assist me. After waiting for twenty minutes I went to customer service where I waited another five minutes. Then customer service wouldnt help me. I knew the tv, model number and every other information and they still would not help. So they said they had to page  someone. After waiting another five to ten minutes someone finally came. Lets put it this way..... he treated me like I cut his break short or whatever he was doing out back. He barely said only one word to me, put the tv in the computer, rang me up and thats it. The only time he was slightly pleasant was when he tried to upsell me and I politely said no thank you. Then he went back to his original way. He handed me a receipt and said go up front to the guy in the blue shirt, and walked away. No thank you or thanks for you patience. So i went up front and waited for another few minutes for help. The guy from up front arrived, gave him my receipt and then waited another 20 minutes for the tv. Guess who brought it out.... the original guy. He put the tv in my truck turned around and walked away. Again, no thank you, have a nice day, nothing..... My question is if he walked away from me as soon as I purchased it and went to the back, why did it take 20 minutes to get the tv. He knew the guy in the front would be calling it in. I also am baffled  in this economy a consumer who is buying an expensive product at a store is not even mildly appreciated. I am the last one to usually complain about service because we all have our bad days but this store in whole must of had a bad day. I really have to blame it on management. I seriously had to bite my tongue on this one. The Rivergate location was wonderful however, they just unfortunately did not have the tv I wanted in stock.", "business_id": "NRS-Snzp3Izblw2OmmlsuQ", "stars": 1, "date": "2011-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2KLg9BGxebym4neLPd9dNg", "review_id": "4JDwhWQeZmuw2Ih1oXFXUg", "text": "Like Julia, I am still sad that Borders is out of business.  I was their guy through and through, but oh well.  Now Barnes and Noble is my preferred option when I get the big bookstore bug. (Yes, Charlotte has good little bookstores, but I argue that the two experiences are quite different.)\n\nOf the two Barnes and Noble's in my usual territory, I must admit that I prefer the South Park location.  This one seems like it might be a little bigger with more books, but it's also older (which isn't necessarily a bad thing) and tends to be overrun with teenages when school's out (which definitely can be a bad thing).  Also, the coffee shop is right smack dab in the middle of the store, which is a bit exposed for my taste.  I know that's a personal issue, but I imagine there are at least a few other people who don't like being set on a pedastal in the middle of a huge store when drinking coffee.\n\nThat being said, I do visit this store, and I usually get good service, and that makes it solidly A-OK.", "business_id": "fHovFhbYJcy6y4oosMhM_A", "stars": 3, "date": "2012-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7MqfHvZai2ef89PjWIRwnw", "review_id": "K8QdC8fHZ8aEwclDdkRShg", "text": "Sometimes, it's just nice to get out of town for a while and still go to a familiar place. Old Navy was my spot today, riding around the Carolinas. The store was HUGE and organized...it's hard to find both these days. Everything was organized, on the right size hangers, and there was plenty of helpful staff to assist me if I needed a different size. The biggest thing I loved about this Old Navy was their dressing room procedure. They have a small marker board on each dressing room door and they write on it the number of items you take in to try on as well as your name in case someone comes looking for you. The staff was very helpful and upbeat, but not in the annoying way, in a genuinely helpful way. I would recommend this Old Navy to anyone. They definitely had something for everyone!", "business_id": "f8DYp9K4WGkWJYebxIABfA", "stars": 5, "date": "2010-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k4pO_xpfniiofEc_-IHamA", "review_id": "kVEjmH1w4102RY1ToEf9Pg", "text": "Visart video is great. They have an amazing selection of things you can't always find elsewhere. \n\nIf something is currently rented out, they give you a call as soon as it comes back in. \n\nI've definitely called 10 minutes before close and asked to place things on hold because I'm on my way in and they've been more than cooperative. \n\nThey are really great at recommending movies if you're not quite sure what you're in the mood for. \n\nI love Visart!", "business_id": "STcLx0y_X89TsC0m2gVgHw", "stars": 5, "date": "2015-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4G68oLRY3aHE5XUt_MUUcA", "review_id": "1WtsVHC6MLEmbuFIBJkn3A", "text": "Traveling has progressively gotten harder between security and everything else...  I'm usually not a fan of spending $$ at the airport, but at least they have stores and restaurants with their \"captured\" market.  But that's the thing, since you are pretty much stuck at the airport the prices go sky high.  \n\nUsually I bring in an empty Nalgene and fill at the water fountain, but this particular trip, I was packing light and wanted water and went here.  BAM $3 for a 16oz bottle of water.  On top of the water, the cashier tried to get me to buy some snacks too... my selection was candy or more candy.  But she was being nice...\n\nIt also doesn't help that airlines stopped serving the free snacks so you are limited to whatever you bring or you are again at the mercy of convenient stores like this one but I don't even want to get into how much you pay for small snacks here.", "business_id": "-GW-xB_EJd3KGEzAxrgEng", "stars": 3, "date": "2013-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YIiYbRLtlBG8Pik0i5dTrw", "review_id": "vr64LXl26YKzPJ407MIPag", "text": "This place is the best! I don't normally write reviews but for whatever reason my conscious wouldn't let me rest without given the credit due here.   The folks at Sumpters are fast, professional and friendly.   I sold some designer jewelry here twice and both times I was given a reasonable offer.   It's refreshing to know there are honest, fair and respectful places like in the jewelry businesses.", "business_id": "9Tz4w2tmLmcf2gZnqjMxxw", "stars": 5, "date": "2015-12-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "RYkCobCYYZ2HqL6TdEqoqQ", "review_id": "Ig9kKwAU_gcC9WzTzL2ACQ", "text": "Premium quality outdoor gear and apparel. Trout angler's heaven. Pricey.", "business_id": "TvHtup0F_Ilkc9Nunc7TNw", "stars": 4, "date": "2013-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "s9I4KMcrHKki44g_eTrYqQ", "review_id": "dasSrKsZP8r3JJCFY4CxIA", "text": "When my daughter was in middle school and her first year of high school, this was one of the shops that she and her friends liked to frequent.   Wallerbears is tucked away in the McMullen Creek Shopping Center (on Hwy 51).  They have a good selection of Rainbows & Reef flips and they also stock a pretty good selection of surfer apparel including shirts, shorts and swimsuits from Roxy, Billabong, Hurley, etc for the summer.  For the winter, they stock all sorts of ski & snowboard gear.  In addition to clothes & shoes, they also have a good selection of gear including snowboards, skateboards, surfboards, etc.", "business_id": "d8gwlc_K5AlS378wuJekKw", "stars": 3, "date": "2012-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wGWFzdgnSEe7C6UjoW8Q3g", "review_id": "0j7XjVh6iFFdD0gGa6DIVA", "text": "Kind of a dingy version of the Walgreen's chain of drug stores.  I'm not sure how long it's been there but it seems like it has not aged well no matter how long it's been.\n\nGetting to the place is a challenge in this strip mall at the corner of Harris and Tryon but at least once you're there, the parking lot situation is not too bad given the decent number of reserved for Walgreen's spaces that exist.\n\nFinally, being open 24/7 is a plus at least.", "business_id": "KTy6UinwPHCU3j_GpE_pGg", "stars": 2, "date": "2013-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mTKWYLN9PmqF7UflA7tnPQ", "review_id": "e1hoazRTUHGCbqYexGXvqQ", "text": "Came here with a friend to grab a couple of items. Neat, clean, and friendly. We were in and out within about 15 minutes. Had no problem finding things here, as everything is what Harris Teeter organized. I'm not really a shopper here, but from the amount of people that were here, this is the neighborhood grocery.", "business_id": "MVYPF0XfAkpykDLfTa4cqQ", "stars": 3, "date": "2012-02-23", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 3}, "user_id": "sdk6OOrj9nZ8z6Ob0jcpDw", "review_id": "BYt_R50AfAi55xK8WEdsZA", "text": "My favorite Madison clothing store by far.  I coveted a pair of gold shoes they had over Christmas ($135!)  and managed to save enough to buy them....totally worth it!!  They are italian leather and SO beautiful.  Everything else in the store is the same way....it makes me wish I had unlimited funds and could get one of everything.  The guys clothing is fantastic too, although getting your boyfriend to shell out that kind of money to look \"metrosexual\" is sometimes a challenge. Something nice to keep in mind as well is that they have free alterations on non-sale clothing....I had a pair of jeans done and they actually put the detailing around the bottom back on....AMAZING!  5 stars.", "business_id": "xm1RtU63jxjYsm-7dzGaZA", "stars": 5, "date": "2006-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mUthuPTsJgTdmvwYm0aGyA", "review_id": "SGDl0PuO4AKziL6w9zN_KA", "text": "I love Bongo.  Staff is very knowledgeable and always helpful.  Movies are cheap, especially if you go with the bongo bundle or the prepaid card (I forget the details, but I think it's something like 10 movies for $24 or so).  I prefer Bongo to Netflix because I feel I end up getting movies that I'm in the mood to watch.", "business_id": "NxxplxNZnrNEYXHTgv9h8g", "stars": 5, "date": "2010-12-16", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 3}, "user_id": "MtJX6PYWnC2QPA8o9YDP2Q", "review_id": "7fSvR-Jww5Rdu9CNRjM2-Q", "text": "East Towne was where my mall rat days were played out from about 12 to 14 years of age.  It has changed so much over time. I remember the sunken seating areas where kids would sit and hang out, I remember the movie theater, Yonkers, the cookie shop where I had my first love affair with chocolate cream cheese brownies, and the security guards who hung out with us like they were part of the group... Yea... I remember my bike being stolen and a week later being found stashed behind the bushes at East Towne Mall...  \n\nIt has been about 6 years since I have been back inside that mall, and I was expecting a run down, empty shell of a mall like some haunts I know in Milwaukee..  \n\nI'd heard stories of people getting attacked in the parking lot... that the place has really degraded... \n\nPssshhh, WHATEVER Madison!!  This mall is decent.  They have a new Express store opened, the food court and carpeting has been redone, nice decorating and a comfy feel as one walks through the hallways, a Hollister, Boston Store, a nice Victoria's Secret....  \n\nSeriously, I was pleasantly impressed that the mall of my mall rat days is still doing just fine.  \n\nIs it Mayfair Mall in Milwaukee?  Heck no!  But it sure as hell is A-OK.  East Towne is a staple for east siders like myself, and we're not givin' it up!", "business_id": "CRKM5F4MHGHvEGgI3LXy8A", "stars": 3, "date": "2012-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oYMdbcnivzpci2x25vU0cg", "review_id": "D7DB5Yv-wF7iLMVZZFjaCw", "text": "Best customer service!   Will do returns with a smile.", "business_id": "XRSKxJ_qmo_fmbnTrjOKAg", "stars": 5, "date": "2012-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6cgBa4piz_LQx69yHADNdw", "review_id": "7ojyrq9wBktVgqqlE80-3A", "text": "I love this place! Even when I decided to go with Copps since it was cheaper, I always missed my Metcalfe's. The produce selection is infinitely better when compared with Copps and the service is much better as well. I love to go to all their promotions: Salsa tasting, Tuesday Night Run, Chocolate tasting and more. It is a bit more pricey then other stores, but the service is up there.", "business_id": "OxR3b_qcMJlzwzGPU5fmdA", "stars": 5, "date": "2015-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BQ-2i_EZ3EzYjuUrZkq4fQ", "review_id": "EtG0LG0IB2VnwtoT76N1NA", "text": "I have a sweet spot for Gameday. Half of the obnoxious orange stuff I own comes from here, and they always have a good selection of...well, orange stuff. I gravitate towards the basketball section - this year's Nike warm-ups, jerseys, t-shirts, etc, etc. I don't know if it's my imagination or what, but sometimes I think Gameday is a little more expensive than some other places, although on a recent trip, I don't think that was the case.\n\nI think they do custom stuff - maybe silk screen your name on a blank jersey, that sort of thing, and they have a wide range of other random Illinois chotchke, but this is what I have to go every time I'm in Champaign, just to make sure there's nothing I can't do without.", "business_id": "J8-yMQ6sQJEWxEwczBW_Rg", "stars": 3, "date": "2011-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SAYctHkm2-FYS7ZVciPmmA", "review_id": "OvWl6FOBpG5K_2zKWnbjTA", "text": "This place is really cool, but it's also really overwhelming. I give it five stars for the awesome stuff they have in there. It was kind of like walking through a museum. I give it one star for the organization/quality of some of the things they were selling. At some point, my friend and I observed an old nail kit that was obviously well used and pretty gross. Things like that should just be thrown away... \n\nThat comes out to about three stars right?\n\nSo if you like looking at/buying old interesting possessions, this is a place for you - unless you get overwhelmed by small spaces and clutter easily. If that is the case, stay away from here.", "business_id": "OeuVJI9-JSjGLDBxtntsdw", "stars": 3, "date": "2011-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3qFI4GeLEDUtWNRpLBY68Q", "review_id": "HvdgupLQqxw2dTjJ6Q9pIA", "text": "Compared to the malls in Springfield and Decatur, this one is the better of the three. There are no empty stores and it does get busy at the mall. \nThey have a great steak and potato company which closed in Springfield years ago. \nI like all the speciality stores that are here. They have a kitchen store, tons of kids stores, a gamestop, department stores, pet store, etc.", "business_id": "WwWJLkVOb_ZGdEeY5gtaqA", "stars": 4, "date": "2011-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KXTC-4RgPZhu-a90ZmKJEA", "review_id": "RKipwbaH77Gx5efYw_3fZA", "text": "Circles is the best place in town to get beautiful, unique investment pieces that you'll have for life. Not overly trendy but beautifully designed, the clothes will last you for MANY MANY seasons. Danelle TRULY cares about the quality of what she puts on her shelves and hangers, so you can be sure that anything you purchase there is the absolute best. The jewelry is incredible and the staff is helpful and honest when you need an opinion on something you are purchasing. LOVE it there!", "business_id": "d-H7FdvcpIE7pQ-Z2Yl_wA", "stars": 5, "date": "2011-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "bd1R4VHPC0bogE2kNXZmPw", "review_id": "PzL3xlbycik_g-RwjDaPXA", "text": "My husband found this little place near his office a few years ago.  What a gem.  The owner Jaime, is honest, fast and very good.  He knows what he's doing.  Not the biggest of places, but he has a nice selection of jewelry.  He's designed some custom pieces for us, working on one for me right now and we couldn't be happier.", "business_id": "cBH0kCvvUjQ9DBaAMUDSMw", "stars": 5, "date": "2013-01-10", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "4Wk7U-hSSSzG7om-Hnn7SA", "review_id": "H05PA_Fe0PeIdEjNKy7evg", "text": "There is no doubting that I am an Aveda girl. Being in Phoenix and having plenty of Aveda salons around you would think I'd be beauty-heaven. But when I left Cleveland I was very hesitant to leave my hairdresser so I scheduled my hair appointments around when I'd be flying home. \n\nWell, as one could image, that become very expensive, so I finally decided to take a chance with Perry Monage downtown. I'm so glad I did! From the moment I walked in to the stylist, they were spot-on with customer service and they did an amazing job with my cut and color, too! There was a little up-selling me with products which I wasn't use to and I must admit, I did cave but I mean, Aveda, hello? Can we say amazing!\n\nI'm still in love with Aveda and I'm now in love with Perry Monage.", "business_id": "Og03_vbBCVAFNHXgdflRLw", "stars": 5, "date": "2011-02-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "CAlxnkAuqNetlUmWtCQ_eQ", "review_id": "ltxZhKx7k0XKLjPHxMA_Kw", "text": "A great little place to see shows, very small, very intimate, a great setting for seeing a band. If a band you want to see is playing here, be sure to go, it doesn't get anymore up close and personal than this.\nThere is no seating or alcohol, so if you don't mind standing and being sober, it is well worth it.\nThe art here is some of First Friday's best, as far as I am concerned, leagues above all the other galleries. Be sure to stop and see the art here if you are out then.", "business_id": "YRJKTPc7Tkz1cbjGHmOHuw", "stars": 5, "date": "2008-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 3}, "user_id": "e4TQFVfepzHf--hnBsjntg", "review_id": "xa_4ickhej5UNimoHeck-w", "text": "I am a huge fan of MCM, so it's no surprise that I am now a big fan of Red Modern Furniture.  The space is lovely and large.  And it is filled with beautifully maintained vintage pieces.  I was charmed when the sales person (owner?) walked up to me and said \"May I help you find something?  Each piece has a story.\"  Indeed.  In my mind I purchased a desk (circa 1930), a walnut platform bed (danish, circa 1960), 2 oversized lamps, and a coffee table that wouldn't fit anywhere in my house.  As I sadly walked to the door, I noticed a take-out box stamped \"Lola Tapas\" next to the register.  \"Oh, is Lola good? I've been meaning to check it out.\"  \"Well, I'm a little biased.  My brother owns Lola.  He also opened a coffee shop called Lux.  And he is opening a cafe next to Lola soon.\"  That opened the door.  We proceeded to discuss the various independent restaurants of the Phoenix-metro for the next several minutes.  Kindred spirits, for sure.  \n\n(Side note:  The store also carries art and a small selection of vintage clothing and accessories.)", "business_id": "xWcTt1L4vQC_QkPfPBVlCw", "stars": 5, "date": "2007-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1m8rFe-BCr6qHSMoV5KkUw", "review_id": "YH3J2COG_TonRxxRKfDN2w", "text": "OK: call me 'weird' here: but; I liked the funky (very) Old School ambiance of MacAlpines when my fiance and I went there this past Sunday for the Studebaker and friends car show.\n\nAdmittedly; I was there once before ca. 1999 and was NOT impressed but things have def improved IMHO.\n\nI had a Club sandwich and it was one of the best ones I've ever had, at least in recent years. Would eat one again. The chocolate milk shake was OK but could have used a tad more syrup but, I'd have one again.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 5, "date": "2011-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "5KSeilYNnXzeREki6-hZ2w", "review_id": "Hb8gl9n9rH0H8sM1LQXdgQ", "text": "Wow!!  We found this little hole-in-the-wall place and decided to try it just for fun. It is now my new go-to place. \n\nFirst, the service is second to none. These girls go above and beyond. Anything you need they are on it (of course it was a bit slow that day but still...). \n\nSecond, they serve hot and cold sandwiches and salads. We ordered a sloppy joe (yum) and a club sandwich to share. As clubs go this was delicious. The bacon cooked to perfection. Good fresh meats and cheeses. Prob best club Sammy ever. \n\nThird, ice cream soda fountain!!! I ordered the Bettie Page (cheesecake soda w/strawberry ice cream). Beautiful!!! They have about 20 flavors to try. Also thrifty ice cream (a whole bunch of flavors). All in all you should definitely try this place.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 5, "date": "2015-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "NLrBhZojW5ink7eN1GrcGg", "review_id": "oM7sFYqgP-P7Zq1YFYI8GA", "text": "This company is phenomenal.  If I could give them more than 5 stars I would.  I highly recommend that if your phone is giving you trouble, see them first.  They may be able to save you money, keeping you from having to pay the insurance deductible with your cell carrier.  That's what they did for me.\n\nTheir work is fast and good.  The power button was stuck/almost broken on my phone and they fixed it at a very fair price and in less than half an hour.  Had I used my cell carrier's insurance to get a replacement phone, it would have cost me $150!  \n\nI came in a week later with my husband and Galaxy S5 to have his malfunctioning audio jack repaired.  They found lint in the port, cleaned it out in about 30 seconds and didn't even charge us for it.  \n\nIt's the nice, little things a business does that get me, like what they did with my husband's phone.  That small, kind gesture will keep me coming back from now on.  I will also be telling my friends about how honest and fair these folks are.\n\n5++ stars for Sun Cellular!", "business_id": "4anyLAWqWVZh5BFpol9czQ", "stars": 5, "date": "2015-02-19", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 2}, "user_id": "2KNPtV5E44vAiEr5BvMkUA", "review_id": "jN2PspA87e1GDTkZ1_EfIA", "text": "This is a magical place. I adore it. It makes me happy. And I'm not just saying that because of the samples. For those that don't know me, I have a bit of a grocery shopping curse. I'm afflicted by the inability to go into a grocery store without spending exactly 6X what I intended to spend. Yes. 6X. On the dot.  But because of Costco, I can shop LESS often and get stocked up on the staples (TP, toothpaste, frozen shenanigans, widgets and wibbles)...and then some (because I also have a weakness for those Brookside Acai chocolates). Buying in bulk is a blessing, even in my small household.", "business_id": "XLqnjlLYt0_q_NG7l_BpMA", "stars": 4, "date": "2013-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_qd8rVhhni3n3BoUC03-9A", "review_id": "G9QjhXyMQkQwhDjMqtpzNA", "text": "All 5 stars to Leslie (I hope I'm spelling her name correctly)! I placed an order online for my boss because he and his family will be in AZ this weekend and I thought it nice to send flowers to the Mrs. for lover's day! Something happened during transmission of my order that messed up info. I called Cactus Flower and received Leslie who took care of everything! She was perfect! And she laughed at my joke! \nI can't speak for the flowers, however; if they are reflective of the service received today, they are bound to be superb! Thank you Leslie! Great customer care still exists!", "business_id": "72INqF4dYTHdCoUoePIuSw", "stars": 5, "date": "2015-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_uL7OiQSfNsCd60DrAf7qQ", "review_id": "oF9l_JtablkvUamcZ6RWGA", "text": "Walgreen's stores are all about the same. However the improvements they have given to this one are pretty awesome. \n\nYou can see a nurse, get your Rx, buy some yummy soup, snag a toy or two, pick up some toilet paper you have needed to get for a few days, gawk at the candy and swoop up a slushy all at the same location and in no time at all. \n\nWalgreen's as been a life saver at 3 in the morning on several occasions.", "business_id": "HfWkdqxegjiGEXzI8j7Wwg", "stars": 4, "date": "2013-01-23", "type": "review"}
{"votes": {"funny": 9, "useful": 5, "cool": 3}, "user_id": "Yk37VAp452K7FwHWd1rrQw", "review_id": "U54DIuMq5dZH7O6MWBT68w", "text": "I can't stand Castle Boutique.\n\nJust rename it \"TRASH\" and it would fit it just right.\n\nThis type of place totally makes experimenting with sex look extremely bad and I can't stand that.\n\nI should NEVER walk into a \"fantasy toy\" store and feel like a pervert. NEVER.\n\nAnd every time I have walked into this one (which is like twice), I have and ended up not buying a thing because you feel so weird.  The bright flourescent lights, the absolute lack of decor... it's just this huge warehouse of sex toys and books.  I can't stand going into grocery stores without decor, much less a place to get a toy to be turned on by.\n\nI don't know if this specific location is like that... I've been to the one on I-17 and Deer Valley... yeah, the one with all the controversy.  It's TERRIBLE.", "business_id": "POBB4VfC5yRIfK7Ou0UnAg", "stars": 1, "date": "2009-01-02", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "GkWuTgewni9bzPM4HUCO-g", "review_id": "SEo27gJ1JB2EZGw3psnJfA", "text": "I would like to respond to Jetta's description below. I like AABC for all the reasons he doesn't like them.  Yes, they may only sell comics and toys but they do that better than anyone else. It's about quality not quantity.  He asked how they stay in business when there are so many comic stores in the valley.  The truth is the other stores are garbage. Read on\n\n(1)  They don't pilfer through the comics before putting them on the shelves. The owner even unloads the comics from the boxes right in front of you and lays them out on a glass table. So if you are guy who is trying to acquire that CGI 10.0, you will have a chance at this store. At Atomic Comics and the other stores, they go through the comics before the store opens and selectively remove the comics in the very best condition for their employees.\n\n(2) They leave the comics on the shelves longer. They are not greedy. They don't pull a comic off a shelf and mark it up a $1-$2 a week to two weeks later. They only do this if a comic is ridiculously hot which is rare. It's nice to know that you can find a comic a month after it arrived on the market selling at cover price. There is not another comic store in Phoenix that does this. Take my word for it. I've been to everyone and they pull them off the shelves quickly\n\n(3) They don't stuff their shelves and the comics are in great condition. I have been to every comics store in the valley and AABC is the only store in which the comics are consistently in great conditions on the shelves. You will not see bent corners. You won't see shelves being overly stuffed so that the first few issues and the last few issues in a stack are damaged. \n\n(4) Inventory- If its not at AABC, I go to the internet because it's not going to be at any other store in the valley.  I have too many stories of walking into other comic stores and requesting an issue and they are out or don't have it only to find 2 or 3 copies at AABC.\n\n(5) Sales: there is not another store in the valley that gives you 25% of everything in the store on Jan 1st and July 4th every year.  That includes the high priced collectors items like Incredible Hulk 181. They also have a graphic novel punch card much like a Subways sandwhich card. \n\n(6) Service: It has a mom and pop feel so you get to know the actual owners of the store. The employees actually work and are helpful if you ask questions. They are not just standing around chatting with each other like you find at Atomic Comics.  They are also humble and are not condescending. This is a great place for collectors and readers of all experience. They are also not pushy. They don't push any comics on people. I love how you can stare at comics for 45 min  in peace without someone hassling you or making you feel guilty.  They will help if you need it but they will leave you alone. \n\n(7) Ambience: I feel like I'm walking into a Comic store not a Nine Inch Nails museum.  It's colorful, clean, organized and easy to navigate. it doesn't look like some cheap strip mall store like Heroes or god forbid Stalking Moon in which it seems like some Geek bough a collection on Ebay and decided to pay rent next to some Chinese buffet and open a comics store.\n\n(8) JUST COMICS: This is exactly why I come here.  I was at Atomic Comics in Chandler and I couldn't even check out some comics because the shelf was being blocked by a card table.\n\n(9) Clientele:  Look, I'm not a typical comic collectors. I don't wear tight black shirts,  I have no facial hair or piercings, I'm not up to date on all the independent \"alternative\" comics, I love Marvel and DC. I can't stand \"Goth.\" Yeah,  I'm a regular guy who also happens to like comics. If you are one of these people, you will feel comfortable here.  If you haven't read comics in ages and just wanna check out the scene,  this is your place  \n\n(10) KNOWLEDGE: The employees are educated about comics but are not pretentious. Phil is a comics' genius but he isn't intimidating. Eddie is very up-to-date on all the latest indie stuff but he will tell you honestly what he thinks about an issue and if a series is worth collecting. No pushy sales people\n\nTo show that I'm not the owner and to be fair, I do think their prices can be steep and I don't always think their older items are accurately described. I also think they can charge too much for variant issues when they first arrive. Their toy prices are pretty fair and you can get steals in this", "business_id": "y9cQ0DBC0qFNgkpTXHzokA", "stars": 5, "date": "2009-01-13", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 3}, "user_id": "Ap5atWJUGnJ6B-XCzbZjWA", "review_id": "WFbbevZexNYjPdNngQ8Idg", "text": "Normally this store is pretty dam good... but tonight... WTF? \n\nNormally the staff fall over eachother to assist and they know what they're talking about.  Good stuff.!!\n\nNormally... but ..tonght while buying caulk.. I asked the wrong person for assistance.  I'm not sure if I caught her off guard with my stupid question \" Could you please help me with some flexible spackle or caulking\" or if it was just a bad night for her... WOW... lady... get out of customer service.. SOON! \n\n I'll still go back here as normally they have most everything here... and its not a big ordeal like the homedepot thing, and 99% of the time the staff is really really great!", "business_id": "-PisznY2s13FyX3tASY4aA", "stars": 3, "date": "2009-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 4}, "user_id": "NYzUTIPzT-lsmhb4npRmVg", "review_id": "FTv_r5Z5iaX_q9mG70qvJg", "text": "Wonderful smelling incense is sold at this place but that's not the only thing they sell.  I can still smell the essence of the incense at home even days after I burned it.   When you walk into Fantasia  you're greeted right away and everyone is very helpful and friendly.", "business_id": "SI3pSSDeGcuY2PyJ0BII5A", "stars": 5, "date": "2011-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "PzeWNJ_hrhDzs8NdcBA06A", "review_id": "rvk19MjBzilDgN76-wQN9g", "text": "Through the process I encountered four individuals. ALL were very friendly and helpful. I was seen within 5 minutes of walking in the door. The Dr was very thorough and took time to intricately explain the health of my eyes with the images they had taken. My eyes are very healthy so I appreciated and specifically noticed this attention to detail because I didn't really \"need\" an explanation. Normally this would be passed off as, there aren't any problems, moving on.\n \nPicking out my glasses was a bit frustrating for me because i couldn't make up my mind. I never felt rushed. He gave me my space and observed the things that I liked and didn't and would make suggestions. \n\nI drive in from the west side, in Goodyear and it is well worth the excellent service!", "business_id": "gztTQsgq6FJwIoV4P4RNIw", "stars": 5, "date": "2014-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pVDAcUrUBTz9RGselQfofg", "review_id": "Lj4HfPwhlGW6WfjRCjgw8A", "text": "Went here today to sell lots of winter 2T clothes, an excersaucer, a pack and play, as well as some mis.toys.  All gently used.  Very pleased with pleasant greeting and help.  Fun to trade old for old/new.  Very well organized.  Highly recommended over all other buy/sell baby shops in Phoenix.", "business_id": "jcWWytqmzMK7gu5zOmxkYg", "stars": 5, "date": "2012-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4dnDsoHuxUtzhaumxbpR5w", "review_id": "icuE2CjT14zoHb8YNOAYOw", "text": "One of my double jogger stroller tires went flat a few months ago so naturally I just avoided the situation and stopped using it altogether. Because that's the sensible thing to do, right? Child, desperate for some outside time, a healthy dose of Vitamin D, and a little neighborhood exploration: \"Mom, let's go for a really long walk today! Let's find some treasures! It's so nice out!\" Me, worst mom ever: \"We can't! The stroller's broken! I don't know what to do!\" Finally, I'd had enough with my laziness. The perfect weather, my children's cries of despair were getting the best of me. That fucking stroller tire wasn't going to ruin my life! I broke down. I put on my best mom-face  and pulled that beast of a stroller out of storage, awkwardly heaved it's huge, heavy ass into the tiny trunk of my car, and desperately rolled it into Sun Cyclery. \"Please help me!\" I begged. \"My children are being deprived the beautiful outdoors, this Arizona sunshine, endless treasure hunting... their childhoods!\" The wonderful gentlemen at Sun Cyclery assured me all would be well and gingerly wheeled my jerk of a stroller to their back room for repair. Five minutes passes, ten minutes, then fifteen...as we're coming up on twenty I start biting my nails, pacing the showroom, worrying, \"what if they can't fix it? What will this mean for my children? My children, who are perfectly capable of walking on their own but can't walk more than a few blocks at a time? What will this do to their adventurous spirits, always longing for more? Further, Mom! Furtherrrrr!!!\" I CAN'T EVEN HANDLE. \n\nTurns out, that little sucker of a tire was loads more difficult to remove than the professionals of Sun Cyclery ever imagined. More difficult than some of their bikes, they say! And to think, I originally thought my only two options were a) never use that bastard again or b) make your husband do it and probably ruin your marriage over what would've been the Biggest Pain in the Ass Tire Repair of All Time. And you know what the repair cost at Sun Cyclery? A mere $25. TWENTY. FIVE. DOLLARS. Worth every freaking penny, I tell you. Twenty-five dollars and I was basically buying back my kids' childhoods.\n\nSo, in conclusion, I'd first like to thank that tiny part of my sleep-deprived brain that refused to believe options A and B were even options at all. Bravo, brain! Thanks for pushing through. Secondly, and most importantly, I'd like to thank the heroes at Sun Cyclery for saving my sanity. My children's juvenescence. And probably my marriage. You know, basically my life.", "business_id": "jYyfLGMURG2pQ6k80R4eZA", "stars": 5, "date": "2015-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "8n4SarsuI9Km6lEtydiE0w", "review_id": "0SK9ESvxPiBj-tLvwvAFgg", "text": "I like perusing Buffalo Exchange, but, whenever I bring some clothes in for store credit, I end up disappointed. They seem to give you very little credit for good items, and they are very picky. So I clean out my closet, take it to Buffalo Exchange, and come back with 3/4ths of the stuff. Discouraged, I set it on my floor and it sits there making my room dirty for months.\n\nI would suggest going in to trade during an off time (not a weekend) when there will be less people trading. They may spend more time looking at your items. They also prefer the items to be in season, so don't clean out your sundresses until May-ish if you don't want to have to bring them back home.", "business_id": "JmEp4DxBEIrFD-rgbL8bvQ", "stars": 3, "date": "2012-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pQ6ij6cOBRB3yJGHbVZHUQ", "review_id": "H-ilATjboItI8YOM3AaQxQ", "text": "Average location. Staff is OK but nothing to brag on. They usually don't speak to you unless you speak to them first which is kind of a turn off customer service wise. Again, just average, nothing special here.", "business_id": "pbnkhsw2kw60Qk9_Ms5WUA", "stars": 3, "date": "2014-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jXp0eFDh_LNO8JfcGlV3pw", "review_id": "4jptxaywo2ZJPhIINQYUOQ", "text": "Cost Plus World Market has been a favorite since I was a child shopping with my mother. Come here for great food, wine, art, accessories and home furnishings and other fabulous tchotchkes. There is always something and new to discover for a great price. If you join their loyalty program you will get emails of special deals and discounts, also $10 to spend for your birthday, The staff at this location is always helpful and gracious. If you need a price look up they have pricing guns at the ready to scan items for you. The clearance section always gets me since those treasures are deeply discounted but you have to get there when the fresh stuff is put out or it's slim pickings. This location is right off of  HWY 51 so getting off at Highland while going North and driving through the little Mall area is my short cut to get here. I love World Market because you can spend all day here and never see everything; but you always find just what you need.", "business_id": "u8bQvtkVa5lW-SNwRLH6Vg", "stars": 5, "date": "2014-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "XxA5k_iyzf9HdvPMp_J27w", "review_id": "st8g9TsNlxTPmnscSJjl5Q", "text": "I've never been very impressed with this store.  The clothing selection is ok but not great. The customer service definitely leaves much to be desired. I don't think I've ever had any ask to help me or smile when assisting.  Despite all this I still enjoy looking here from time to time because they do have awesome deals on everything from designer label clothes, shoes, housewares, to toys for kids. I've even seen luggage sets here.", "business_id": "5A_vuyESZFU9eCArpVfJCw", "stars": 3, "date": "2013-12-28", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "JS6fc5FyOBC54kUb4b6lYA", "review_id": "sIGpy6CF-oZDdXEooS1jag", "text": "This is one of those places that the door greater says something nice, but looks the other way, as if to say, \"ha ha, thought I was talking to you, huh?\" LAME!\n\nI usually find what I'm looking for, but anymore, this cheap imported crap we're accepting as merchandise has got to stop. I'm now assured that at least 50% of electronics that I purchase will be returned. So what are my options? Usually to buy something more expensive...I guess so, and Best Buy usually has the upgrade available, and is why Best Buy doesn't get the dreaded 1 star.", "business_id": "kEqcAtMaC6hcY8Wbi1nxtA", "stars": 2, "date": "2015-02-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "2KyJLMY3jmASmwtnmlBuvw", "review_id": "CTbogDVEKAnsRVE9Q76biw", "text": "Well, Squid, I gotta tell yuh... this CVS must have really changed a lot after you were there!\n\nI too got upset with Walgreen's.  That's why I came here.  I'd prefer to do business with a local pharmacy, but I want a Pharmacist available 24/7 (it's just a Psycho-Ceramic thing (for the uninitiated Psycho-Ceramic means I'm a Crack Pot)).\n\nThis store isn't as nice as doing business with a local, but the people are friendly, and there's merchandise on the shelves, and the folks here know where it is every time I ask.\n\nSo, all-in-all, for a national chain, it's quite good.", "business_id": "h-Ospc-uiMH8TLquTeAr3A", "stars": 4, "date": "2008-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7iwFdxqqTYYnnesxA6iy5A", "review_id": "MdU9YW8dz5vdp5Gn5C5E5g", "text": "LOVE this place!!  I used to hate running.  I would get such bad chin splints.  A friend of mine convinced me to do the Rock n' Roll marathon 2010 and I figured I'd give it a try.  I did a lot of research on having custom fit soles made, but that was super expensive.  I'd read some great reviews about this place and decided to give it a try. \n\nThe right shoe has made a work of difference!  I've become a regular runner and completed the 1/2 Marathon twice!\n\nThe customer service is great.  They really take the time to evaluate your stride, your goals, your fitness level and find the right shoe.  Great customer service also means waiting a for your turn, which can be long, but it's definitely worth the wait.  \n\nI've noticed a lot of people saying the prices are high, but I just looked up the shoe I bought on the Nike website and it's exactly what I paid in the store.  Even if it was marked up I think I'd still go to the Runner's Den just because I know I'd be getting the right shoe.", "business_id": "P6H-p8fXbPq8VjO4kLTz4A", "stars": 5, "date": "2011-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XBHJCDzNh--mBhJkzyM_iA", "review_id": "9eVinYekH0flbrJGbl7vXQ", "text": "I have not written a review lately for Burland, as I have returned on many occasion since 2007.  Burland continues to offer the personal service you deserve.  The selection is different, not the run of the mill jewelry, they have choices that are so spectacular that you had no idea THAT is exactly what you want and you won't expect to see it on others the next day.  And you can expect to pay a fair price. \n\nIf you like the no pressure, relaxed shopping experience, then I recommend you stop by Burland.  You will be glad you did.  You can even make a wish list!  So should your better half stop by, there is some reference if needed :) \n\nI can't say enough good things about Burland.", "business_id": "xaWje-dMVpAEQQMKv9556Q", "stars": 5, "date": "2012-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ksl9YHk3punl6hUHQGukNA", "review_id": "XjmQcwSv5l9rZW184R8caw", "text": "I've been a customer of Data Doctors for years, ever since first hearing Ken and company on their KTAR Saturday show. And, I have never been disappointed w/ their service, their user friendly explanations, and the level of their tech expertise. The guys at the store know their stuff and I always come away knowing more. Thanks Data Doctors!", "business_id": "MTaaIqX7GJXdTPDDx4L90A", "stars": 5, "date": "2011-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z0_C4HRVvkLkyEsVGGMnkg", "review_id": "PVvMJYRZHKfsDQZhzDtP0w", "text": "It works.  I found some picture frames at a cheap price.  Yes they were dusty, but it was a bargain.", "business_id": "P3DbF086gy6yMYIgTdR9yg", "stars": 3, "date": "2015-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EDyJnySlK3Zq1jJjUoRWJQ", "review_id": "m7SH9CSV9p_h86_R8OokFA", "text": "Scott is AMAZING. We have done a ton of home renovations and he has helped us so much. They are so helpful and know where everything is. I would shop here over any big store any day.", "business_id": "ZDlA4SPGz-fs_mjE6wVWnQ", "stars": 5, "date": "2015-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "fH9OSIlijo9Obp8ZDq8rBg", "review_id": "egZLEv71ULlVK6c0vf386g", "text": "I dig this place and let me tell you why...\n\nThey have awesome selection of skis, clothing and everything between.\n\nThe manager does a good job of steering you towards the more expensive jackets, so keep that in mind. The staff is generally pretty good here and helpful.\n\nThey have a better selection of Spyder gear than any other place I know of outside of CO.\n\nRental gear is sucks... maybe that is part of the plan...give you crap to ski with so you want to buy your own good stuff!\n\nOne of the best things is that you can buy your lift ticket for Snowbowl and a host of other mountains right in the store! Hey if it's the same price as on the mountain and saves you time not having to wait in a lift ticket line...count me in!\n\nSo get your rental gear here and your lift ticket and save the time and hassle on Snowbowl.\n\nLookin forward to a great 2011 ski season!", "business_id": "zzucnDH33KlmbkI4rLyQTA", "stars": 4, "date": "2009-12-16", "type": "review"}
{"votes": {"funny": 10, "useful": 9, "cool": 8}, "user_id": "pv82zTlB5Txsu2Pusu__FA", "review_id": "PMF8IvUdoXsyhQwy9fIjxA", "text": "unlike Amy D. I have not had every carrier you can think of, ONLY Cricket, and now, a two year binding indentured servant contract thru TMobile.\nLet's start off with the store: was it built on top of an indian burial ground? is there a sewer main that has broken? Is their septic tank backed up? do their employees shower in sulfur springs?\nwhat is up with that stank in this place!? I've been here twice now and each time it reeked of rotten eggs. It was so bad that the first time I came here, my friends waited for me outside!\nT-Mobile for me, is synonomous with shoddy service, I can never get a signal! Whether it's in my own bathroom, the 4th floor of the office building I work in, or sitting in class. \nMy calls are constantly dropped as well. I will be mid sentence before I realize there isnt anyone on the other end and I've been talking to dead air. \nPrittaay. Prittaay. Frustrating.\n[rickety] Cricket gets a lot of [roberta] Flak for their ghetto-ish-ness (see what I did there?) but I will take them anyday, I remember the good ol' days when I'd ride my bike down to mill and sit at the Cricket store amongst the other lost souls, as I waited to pay my $40 bill, It was a hairs breadth away from waiting in line at DES or the DMV, crying babies, rapidly spoken spanish chattering from all corners, an apathetic and overweight security guard by the door, dirty chairs, stained carpet, a snoozy black dude falling asleep next to me practically on my shoulder Ahhh the good ol days of Cricket.\nnot anymore\nNow T-mobile and the unintelligible phillipine call centers rule my cell phone usage, with their expensive payments, my crappy phone, their shoddy service, it's enough to push a man into becoming like Michael Douglas's character in \"Falling Down\"\n... and to add insult to injury they dont even have Catherine Zeta-Jones as their spokeswoman anymore: ummm WTF just because she was in Entrapment? c'mon it wasnt Sean Connery's best but it wasnt her worst! dont hold Entrapment against her! bring back Catherine ZJ you morose motherfuckers!\ncannot wait 'till that 2 year contract is up!", "business_id": "YXfe8-7uKfl0gTNS-OKLPg", "stars": 2, "date": "2011-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "YoBgKOdfpGH48LpIDSfoQQ", "review_id": "CqoQ7LsWS1nOqAQt-Xfg2g", "text": "As my husband has been re-doing landscaping and building our courtyard, we've been here several times and are 0 for 4. Today's example: we looked at several samples of stone and went inside to see how much a bag of one type was. The response was that they don't carry bags, only 5 ton minimums plus a $95 delivery charge. Then, we asked about smallish boulders, like those we saw near the stone samples. They replied, \"Yes, we have those, they are 10 cents a pound, but they are really heavy.\" So we asked about how much the small boulders (as in 2.5 feet or smaller) weighed or about how much they cost....and they had no idea. In fact it was almost like they didn't want us to buy anything. weird. It would have not been so bad, except this was our 4th trip there and they have nothing we needed or asked for, and didn't seem to be upset by that at all. We also went to another local place before resorting to Home Depot. sad :(", "business_id": "7IRQXpt5fB6sFEpbWfU7zQ", "stars": 2, "date": "2009-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GlTmxGZGMrBAcw0iwy3NdQ", "review_id": "RLPyuOWQoHfyS7PFAfpYmQ", "text": "I went here to get a print mounted.\nAlan helped me out, I was in and out in 10 minutes and it was very affordable. Alan was nice and very helpful and enthusiastic about what he does.\n\nI will definitely be back and recommending Framin' Works to friends.", "business_id": "rlApP8IHKEW8eERHhZpdOg", "stars": 5, "date": "2014-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NK4X7VNZIX8RpGmFnDHM7A", "review_id": "y5II5od8uHeOiRle_EnwXQ", "text": "These guys are the best of the best.  Their custom work is truly amazing.  They installed the latest Pioneer 5100 NEX in my 2003 Mercedes SL500.  There were no acceptable installation kits available so they had to hand make the mounting hardware and bezel plate for my car.  I had some initial concerns about how it would turn out because I'm very particular and the stereo \"head unit\" is the centerpiece of the dashboard.  When I went to pick up the car, I was blown away by how good it looked and what a great job they did.  It looks like a factory installation.  \nMy car now has the most modern technology available in stereo equipment including satellite radio, DVD, CD, Blue Tooth, Apple Car Play, touch screen, Navigation and best of all, sending and receiving texts by voice.... hands free.  \nI am 100% satisfied with the installation, the way I was treated, and the quality of the equipment and service that Sun Valley provided.  The same people have worked there for many years and they are very very good at what they do.  I would never even consider going anywhere else.", "business_id": "xI_iG7X6BcdLtj57bkUOqQ", "stars": 5, "date": "2015-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "pVc_37K7H9QUJUP6wFL0Zg", "review_id": "pG3mchwVCi0WQv6NHb6eYA", "text": "The staff was extremely helpful when I had troubles with my iPhone. The store is crazy-busy and they made sure my time mattered. I felt like my business was important to them.", "business_id": "l5vzFaqSjvxZiRn0MJeKkg", "stars": 5, "date": "2008-12-26", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "XxA5k_iyzf9HdvPMp_J27w", "review_id": "rGznEsCzEIJGpd82rq0Zsw", "text": "They say an apple a day...\n\nThis store is organized chaos at its best! You walk in and someone is always willing to greet and help you find just what you need. Everything is done digitally so there is no resting we to have to wait at and no paper receipt to clutter up your purse.  An added bonus for the iPhone users is the ability to walk in find what you need and purchase your items right from your phone with the apple store app. \nThis store also has a tech support service station. I recommend making an appointment on line as walk ins will have to wait for the first available slot which can sometimes be hours away.", "business_id": "l5vzFaqSjvxZiRn0MJeKkg", "stars": 5, "date": "2013-12-28", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "8-VLDMz0nAV7dm4tFBSGTA", "review_id": "H4T92ng3G606RCsVauW3TQ", "text": "ok...went back to see if bathroom vanity tops of corion with integrated sinks would be more cost effective than quartz...went to find a \"design\" specialist...of course you have to bring your measurements etc and pick out what you want...no problem I had that in hand...one guy ran off , the lady took me to another person who said no she could not do that \"everyone was in a meeting\"  I threw a true fit..EVERYONE IS IN A MEEETING??? so no one to help the customer right?  how can I give my business to homedepot if you have no one to help with the specialty orders...suddenly some guy appears...now he cannot use the computer, cannot log in , cannot find the right \"books\" cannot get my address right after someone logs him in...This took an hour and half which should have taken  maybe 20 minutes...AND GUESS WHAT...with all the costs...same cost as quartz the real thing.....they add on sq feet, charge excessive for sinks etc...really not worth the trouble...go to a real tile and flooring store..not \nhome depot....again another disappointment", "business_id": "DC77ROlgfnpxQNFKQbbpnw", "stars": 1, "date": "2015-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "yUZc4PQdOVw5sQyjqgWpNQ", "review_id": "H98alNfidGJWGQLPa14HEw", "text": "Stopped in here for the first time this week looking for a particular quilting  notion. They didn't have it but were very helpful offering to order it or call other shops to find it for me. Nice selection of fabrics and books & project ideas. I will return another day!", "business_id": "iYj4QlA3Of2WHTtyYGTodw", "stars": 4, "date": "2012-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Kme42H8ZdhHTUG0F1DTR-w", "review_id": "ZMxT6LWQq7gqlPY1IiGDSA", "text": "Called and specifically asked if they could guarantee delivery between specific times on Valentines Day, once assured I placed my order.  15hrs later I get a voicemail asking if I could move the delivery to today and if so they would throw in a box of chocolates free of charge.  After being put on hold for a total of 30min and hung up on twice they finally found my order and assured me that everything would be delivered today.  Well the flowers were delivered today but no chocolates along with misspelled  and misquoted words on the card.  When you charge $15 for delivery I'd expect some level of professionalism. I will NEVER order from here again.  STAY AWAY and order from 1-800-FLOWERS.  I had wanted to support a local business but in this instance I will stick with a national competitor.", "business_id": "ZdmGDAT2VwXZZKQ-xHVORQ", "stars": 1, "date": "2013-02-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "eCtkMHrbM8j0R5yabfrRzg", "review_id": "le2xeEN49FyWxfc1O6ijTA", "text": "I just moved to this area about 7 months ago from Tempe, of course being spoiled by the un-present dangers of college life I was shocked that the first person to greet me here was a police officer.  Surprisingly not shocked by that I proceeded with my shopping business.\n300 ft in I was greeted by an associate working the 99cent area.  \"Nope, just looking thanks!\" I was just wasting a little time and hoping to pick up some mascara before my night out.  3 mins later \"can I help you find anything?\"  \"Nope just looking\" yet again another associate not 5 mins later asked again \"Do you need any help finding anything?\"  I was baffled.  I got more attention here than in Neiman Marcus! I have to say the staff here is a lot nicer than Tempe...college town where manners aren't exactly in the qualifications for hire.  The staff here on 44th were so nice and genuinely too.  It's been about a few months since the last review here and I have to at least clear it's reputation. The food area was not all that bad, and the Starbuck's (Being a corporate employee) was actually up to license standards. *smiles* I have this horrible habit of having to walk the entire store and touch a  magazine or two...which after I grabbed what I was really there for and proceeded to check out.  There must have been 45 in line...all with baskets full.  Seeing that I only had one item, the lady at the customer service counter graciously took me and checked me out pronto! How awesome is that? I like this place, and a good thing I do because I got 6 months left of this lease!  \nP.S. The officer thing is not to scare you, come to find out it's actually a requirement that stores in phoenix have.  Most stores in the area including Fry's and Wal-Mart have at least one at all times.", "business_id": "VxnV1uMZURUQMNUaPdB8QA", "stars": 3, "date": "2009-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gMqKvkTxZNOtsn8WqKx43Q", "review_id": "fN0a_mEweHw1tOZAzQzqIw", "text": "Great selection of plants - really, they have just about everything. Prices are definitely on the high side. The staff can be hit or miss; sometimes they are super knowledgable and helpful while other times they can be really short and impatient.", "business_id": "rlrSUtmUnM84AVb616Qy6Q", "stars": 3, "date": "2015-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "zhVOlwBuEgdGlHjwgVf3Jg", "review_id": "qaDISX_BfGjFaNwkdr_Kug", "text": "They have all their roses in now. We got the Cecille Brunner Climbing Rose bush and the Jean La Joie. They look healthy and are already starting to leaf out. Can't wait to see the show of roses in a year. They have a huge selection available right now but are selling out like crazy. So go fast if you want roses for your garden. Ideal time to get them in the ground is now.", "business_id": "7p0OI2Ld46-EzJkRHGQEJQ", "stars": 5, "date": "2011-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QFo8ELpMl3bspy9Gdamwag", "review_id": "l2iKtDNZpuNLmIF5MtRY6Q", "text": "No customer service! I have spent since September waiting for a replacement part on a sofa where the technician from Pruitt's said \"the leather is bad\". I have been given the run around ever since. They've given me delivery dates of October, then beginning of December, then January. Here it is February and they claim to know nothing. They refused to provide me with the manufacturer phone number, owners number or email address. They claimed they don't have that information! Ha! I looked up the manufacturer myself and called them... Had the answer is 5 minutes that I've been waiting on for over a week. These people are uninterested in helping once they have your money. We've purchased lots of items from them in the last 10 years and their quality has gone way down as has their respect for the people who spend money there. Never again!! Please consider purchasing from another store who will care to treat their long time or any  customers well.", "business_id": "XThGLVVN4oVybmv2gFS1Wg", "stars": 1, "date": "2013-02-05", "type": "review"}
