{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-kep1OMASW13zZxbrRmXag", "review_id": "kmCetnNJ4n9BaL-m3QUnyA", "text": "Papa J's is by far my favorite restaurant in Pittsburgh, my hometown.  I eat there almost every time I visit, and everything I've ever ordered has been fantastic.  Fresh ingredients, simple preparation, reasonable prices.  Also, they make the best pizza in town HANDS DOWN.", "business_id": "P1fJb2WQ1mXoiudj8UE44w", "stars": 5, "date": "2008-01-13", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "l5SH2Wkxl-g8wRSDrJnC2Q", "review_id": "bQ2d_q74TZ0m5wvP_kaLZg", "text": "Six of us went to dinner, six of us had fabulous meals!  My husband said his seafood fra diavlo was the best he ever ate, not a bit fishy--loaded with fresh seafood and a spicy sauce.  My son had the carbonara which he described as fabulous.  My daughter had the roasted veggie platter as her meal (it is a large appetizer), and I also sampled it--the vegetables and olives were marinated and grilled perfectly.  My father had the skirt steak which he loved, and my son had a sausage pizza.  Both said they were delish!  I usually get the eggplant parmesan with their spicy arribiata sauce but this time I had a pasta dish loaded with artichokes and shrimp in a spicy sauce.  It was excellent!  \n\nIt was my father's birthday, and they brought out a Tiramisu for us to share (we didn't even ask for it), and that was luscious as well!  The staff was as nice as can be--we will be back without a doubt!\n\nI love this place!", "business_id": "ZL6DNzyenFm9Kpz6uADlNg", "stars": 5, "date": "2012-01-03", "type": "review"}
{"votes": {"funny": 6, "useful": 5, "cool": 1}, "user_id": "BbfGr5eTdW-I-9KI5KN0ag", "review_id": "eT1LP7q0vz5F8ffPBqPtGw", "text": "Some people train for marathons, other people train for this meal. Before sitting down make sure you get in the proper state of mind and prepare yourself for a long night of indulgence. This being my first dining experience at Alla Famiglia, I was unaware of the challenge that I had undertaken. We had A Party of Five, empty bellies and an optimistic mentality; we couldn't resist the tempting appetizers recited to us and ended up ordering the mega meatball, calamari and shrimp, and sausage over polenta. All were amazing. The meatball was the highlight: twelve ounces of perfectly cooked beef, filled with mozzarella and covered in sauce and provolone (kisses fingers). Big plus for including the tentacles in the calamari. I've noticed these legs less and less while dining out, when did they lose suction as a staple of a calamari appetizer? Also adorning our table were a few clothing options in which to dress the bread, all of them enjoyable on their own or as an ensemble.\n\nOne would think after such a hearty opener all that remained was the main course. How wrong of an assumption that turned out to be. Before we could even think about crushing our dinners, we had to face two formidable courses of salad and pasta. As mentioned by other reviewers, the salad is great. Nice dressing, nice fillers, nice roughage. The pasta that's included with the entree was a fusilli bucati in a vodka sauce served family style. Unable to pass up the promise of a great carbonara with guanciale and fresh egg, we had two pasta opponents to tackle. Both were cooked so perfectly al dente I would have put them on my NHL all-star ballot as a write-in if voting hadn't already closed.\n\nAt this point in the meal, I had completely forgotten that I still hadn't even seen my main course. And I was fine with that. As a table we compiled quite the culinary collection: bistecca fiorentina, veal milanese, veal marsala, mussels in a diavola sauce and the sea bass special for the evening. You know when a meal is so utterly divine that you just stop talking to everyone around you and have a one on one pow wow with the gastro-gods? Yeah, that's what happened. I will say at one point during the meal, my brother had to get up and take a walk around the restaurant for fear he would wake up two days later in the ICU if he didn't fight off the impending food coma that threatened his existence. Instead of napkins they should have given us a white towel and a trainer to throw it on the table for us because we were doing our best impression of Apollo Creed...and our food was Ivan Drago.\n\nOur waiter, who we thought was our friend, then had the nerve to ask if we wanted dessert, some balls on that guy. Of course we wanted dessert. We decided on the tiramisu which I hope had a clean bill of health because it blew our minds. It was so good that I was upset with myself. I did exactly what I hate seeing someone do on any and every food network show. I took a bite, put down my fork, closed my eyes and just said, \"wow!\" I just hope it was as good for the tiramisu.\n\nOther housekeeping items: you can bring your own wine for which they charge a corking fee. All the water is bottled, but I didn't see it on the bill so I figure it's included. The chef/owner is extremely friendly and accessible, as he is cooking basically right next to your table. Parking at the meters next to the building is free after 6pm, despite what it says on the signs; our waiter informed us they have an unspoken agreement with the parking authority.\n\nHeavy on the belly, heavy on the wallet, heavy in our hearts!", "business_id": "qUeBDN0D8SC93KeAHhiL-g", "stars": 5, "date": "2011-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8WQ5lyjIH24F7Tl2M-l7vw", "review_id": "F9G4ntAnaXOonQb3xP0zXg", "text": "Delivery time was 11:30. Called at 12 to check on my order and was told it was just going in the oven and would be another 45 minutes to an hour until it was delivered. Told them to just cancel the order. And they got an attitude with me about it. Not to mention in the past they couldn't even bring me my entire order.", "business_id": "rEKBr81s19Soh3dYj4bcGQ", "stars": 1, "date": "2015-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "3JCJYpQpNDC6lmA7JFFIbw", "review_id": "hcouaLnI4i-CkgTWmsWxeQ", "text": "A great little Italian inspired restaurant right next to AGH. Fresh italian dishes that surprised us with flavor. Small interior and friendly staff make you feel welcome. They offer daily specials. Fantastic desserts and complimentary homemade fudge was offered at the end of our meal. Blackened shrimp pasta was amazing! Mussels and shrimp linguine and spaghetti were also enjoyed during our visit. Just go and enjoy!", "business_id": "q_BKmbdlYfQJroJVHfYMUQ", "stars": 4, "date": "2015-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5wTVzr3SyZzpiu-U_Yim6A", "review_id": "Ng1hbAxT1UCcwGRYBXG0VA", "text": "Monte Cellos is located fairly close to my work, and so I've gone a few times.  Each time, I ask myself, \"Why am I going back?\"\n\nMediocre dish after Mediocre dish, somehow I think it will get better next time.\n\nLast time I had a Grilled Chicken Salad that they're known for --- at least that's what the cashier said.  It was grilled chicken, french fries, a little cheese on chopped lettuce. Can you say B-O-R-I-N-G?\n\nToday I had a steak hoagie.  Enough places in Pittsburgh do these that comparing them is easy.  While the bread is fresh, and the hoagie buns are huge --- it's all downhill from here.  Enter three slices of steak-ums and the contents of the hoagie are just flat. The bread is 90% of the meal. Unmemorable.\n\nI was happy with the pizza I had there, but for salads and hoagies? Not so much.", "business_id": "JcP-IIrZkW_Yyv4a0yLRCw", "stars": 2, "date": "2013-01-03", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "G_BvSxt71MqF_x4jgEyqSA", "review_id": "sy374FQGyy8Gtqa4OVqWAg", "text": "Why anyone would willing go here to eat is beyond me.  I had read prior yelp reviews and I knew what I was getting myself into.  To make a long story short, I went here because I was with several other people that wanted to go here and I really had no choice.  Anyway, I ordered the wild mushroom pasta with chicken. The sauce was really disgusting. I found myself eating only the pieces of chicken breast.  I brought this meal home because my husband isn't as picky as I am, but he took two bites and got mad at me for not warning him how aweful this meal was.  I will not be eating with this group of people again if they choose to go here again.", "business_id": "9mwShpTgZofOujt4JfyGmw", "stars": 2, "date": "2012-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "brhCHBDHo76UUIjHZG2myg", "review_id": "QKtIrwdSHl6V8pYTDKm0Ew", "text": "Food was okay, but was very surprised that they have absolutely no handicapped accessibility. Steps to get in from the street, restrooms up the stairs to 2nd floor. No accessible stalls in restrooms. Surprising in this day.  NOT HANDICAPPED ACCESSIBLE.", "business_id": "SzHTdZR3yY1WBYUxkVxmUQ", "stars": 1, "date": "2011-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L6y73vaWaSvqYUKq6Rsr2w", "review_id": "oLvEBShHm2qldKpZqVBq5w", "text": "I went here on a crowded saturday night with a large party (8 people at our table.) I ordered the spicy calamari. It was not spicy. It was overcooked, like rubber, and served on plain white beans. Yuck. I won't go back. My boyfriend had the seafood dish. Most of his seafood was also overcooked and tasteless.", "business_id": "XmdTkxKyJd7TuDLoiic1kg", "stars": 2, "date": "2011-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L6y73vaWaSvqYUKq6Rsr2w", "review_id": "j-KlV5cNg9U_HzIDihJspw", "text": "We visited for brunch last Sunday. It was amazing. It is $28 a person and includes a prefix menu. You get a morning cocktail, antipasto buffet, choice of entree (endless fresh made pasta trio is an option) and a dessert buffet. \n\nThe serve was impeccable. The sangria and Bloody Mary were delicious. The pasta trio was incredible. The salads at the buffet were so thoughtful and tasty. Would go again! I want to make this place a tradition. \n\nGreat management! Excellent food!", "business_id": "XmdTkxKyJd7TuDLoiic1kg", "stars": 5, "date": "2013-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GG9E4FTwiyZiaWnB4C79yQ", "review_id": "qf8fhwUDGCiBZ0ySBu819w", "text": "I was here with my family for Sunday brunch. Service was outstanding. The food was amazing. My children enjoyed it as much as my wife and I.", "business_id": "XmdTkxKyJd7TuDLoiic1kg", "stars": 5, "date": "2015-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JEvkfVPf_DuhX-ntE5L6bQ", "review_id": "FqIk7V56hNmuKgTwyo5kvQ", "text": "Top of my list for a late lunch today. While  attending the Italian festival in Bloomfield last September I tried the polenta and meatballs, with a meatball sandwhich! I love meatballs and these ones were well seasoned, juicy, and soaked in a great marinara sauce. I occasionally get cravings for these meatballs and today was the day. \n\nA couple of months ago I tried to go on a Sunday and they were closed. It was a cold, snowy Sunday so I thought they were closed because I showed up pretty late plus the bad weather. I attempted to go again today but to my dismay they are always closed on Sundays which I would have seen if I had checked my yelp app. BOOO! \n\nThree stars so far... because of the great meatballs! Points lost for being closed on Sundays. Who is closed on Sundays?? Crucial Lazy Sunday dining revenue is being squandered! They must be busy enough and don't need the extra business day. Wait for an update because I'LL BE BACK!", "business_id": "-Nanlb7SYXObqQ6dZ49UOg", "stars": 3, "date": "2011-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RSExP0-Boucr4QyIEzZi0A", "review_id": "cJuO8iGIgoUPYSbQsuY95A", "text": "In my opinion, this place is a bit overrated and overpriced. I've heard very mixed things about this place, and after going in a couple of times for a happy hour I decided to get dinner one night. I didn't really know what to expect because the menu online listed dishes but no prices (as a side note: I HATE when restaurants do this!). I don't mind paying $15-20 for a good dish of food, but the quality of the pasta and sauces are totally average. I could boil a $1 box of pasta and $2 bottle of general marinara sauce at home and it wouldn't taste much worse than this food. It's definitely nice to go out for meals, particularly at a place like this that has such a well lit inside and a soothing vibe- however, I simply didn't think the quality of the food was good enough for the type of restaurant it strives to be. Furthermore, I found the people who work there to come off as a bit pretentious about the food and drink selections. In general, I would say the food and staff are a bit off putting and I wouldn't recommend this place to friends who have never been here before. However, if you go, definitely try the happy hour, which is one of the better ones in Pittsburgh *half off appetizers and drinks. Plus, wine is half off on Mondays and Wednesdays, which I would assume are their slower nights.", "business_id": "5MChfa-jZfMo3vBpolkSbw", "stars": 3, "date": "2014-02-09", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "dGEAzFX7dZO7pZulTPvIzA", "review_id": "2F-SiGN09SvgmfWxOJ_J1Q", "text": "I really don't understand the hype of this place. To be honest, had the personal recommendations from friends not made this place seem like the biggest deal in the city, then I would have probably rated it a 3 or 4. The pizza was just OK. It was decently greasy and the crust wasn't all that special. They wouldn't deliver (Even though I am literally a few blocks from them) and they don't accept credit / debit card - a huge downfall for me.", "business_id": "r8jeeS3k_diihMDSu9IjlA", "stars": 2, "date": "2012-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "O8D8syvoblnAu_HStkm-lw", "review_id": "QBgRd_MJK7ypyO2SBzecDQ", "text": "I love this pizza. The crust is a thin crust. The sauce is slightly sweet. The servers are always friendly.", "business_id": "r8jeeS3k_diihMDSu9IjlA", "stars": 5, "date": "2015-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LF73iBr-ynbAi-swAQbGCQ", "review_id": "HVu0cOIP7BHtmBnainOJRw", "text": "My local go-to for a great meal with friends. Always delish, fresh and well made meals, great wine, warm atmosphere. I'm lucky to have Il Pizzi a block away.", "business_id": "6-rJjW6ITl5o_FliiNgZRA", "stars": 5, "date": "2011-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WLwOZY9tQHfOk0OUkA2J6A", "review_id": "5T8utJolrNqUL4HXqyyIig", "text": "Have been here multiple times over the past few years. Amazing food...great service and the wine annex is the bomb. Highly recommend and a great date spot or place to entertain people visiting from out of town!", "business_id": "6-rJjW6ITl5o_FliiNgZRA", "stars": 5, "date": "2014-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ItGYwkiEodIICJh3lyoBjw", "review_id": "GuXKol3uTz7BCRaVTvMuBA", "text": "Coming from an Italian family and being a foodie, I really WANT to love Girasole.  Family owned, lively, and a true Italian menu.  The reason for my 4 star rating is that in my many visits to Girasole, I could rate it a 5 on one visit, and a 3 on the next.\n\nBelieve all the reviews about reservations.  Jimmy's friends get seating priority.  He also loses track of who has been waiting longest, so if you take his advice to have a drink next door while you wait, you will be forgotten until you return, and will restart your wait all over again.  \n\nOnce you get a table, the experience turns more positive.  The beans and greens appetizer is always perfectly cooked and seasoned.  The Girasole salad could be great, but they often dress it too heavily.\n\nLast night I had the lamb shank and saffron risotto entree and it was delicious.  I have never had pasta here that wasn't perfect as well.\n\nFinally, if you get manage to save room for one of their wonderful desserts, do so, as they are consistently great.", "business_id": "xgK6AAhJ-cYBUCSaLzgTuw", "stars": 4, "date": "2012-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vhDAD8aOnDjliOgPOUw7hg", "review_id": "r4-xOIk0E_Iktpi5EOAD_w", "text": "A very nice small Italian place!  The salads are very good and the gnocchi with mozzarella cheese is wonderful.  A nice light red sauce that is just right.\nOn Tuesdays they have a singer who walks around .  It's a very nice place to go and gets very crowded since it's a tiny place.    Sitting outside when it's nice out with a glass of wine is the way to go.", "business_id": "xgK6AAhJ-cYBUCSaLzgTuw", "stars": 4, "date": "2015-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hvJP2aqd91M4iFriEWGkIA", "review_id": "ZSiK4N9LHqvLi-060eEMFA", "text": "Had a meatball sub for lunch today.  Very tasty.  But SCREAMING hot.  Burned my mouth on the first bite.  So be careful!  Otherwise a good, solid sandwich at a competitive price.  Freshly made with only a short wait to be served.  Worth a repeat.", "business_id": "sJtGRBWYUj013nkFA4Hrdg", "stars": 3, "date": "2014-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CtJay6Gci8-ptgt6TyzANg", "review_id": "CHByL8f72ihoEF8U7O2k4w", "text": "I went here several years ago and, although I loved the atmosphere, the food was so bad I swore to never go back. When my friends were adamant about meeting here recently though, I grudgingly decided to try it again. The food was greatly improved and the decor was as fascinating as ever. As has been mentioned here before, the acoustics aren't very good so when it's packed, you have to yell to hear one another. But, they do still let you go thru the kitchen and even have a table in there for those who want to eat in it so I gotta give them kudos for that. The only real problem we had this time was that our server was super slow in getting to us and kept forgetting a plate for me because he thought there were 6 of us vs. the actual 7. He took so long one time, I got my own plate from a nearby stack and my friend went up to the bar herself to get her drink. He finally started getting better about making time for us after that though and even brought her out a humungous birthday dessert that we all shared while enjoying their singing. After this new experience, I would definitely go back.", "business_id": "SVKC_-gIQFkHElZ6bFsE6g", "stars": 4, "date": "2015-02-01", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "Ojm_O52D7MZWDjkH1p-46A", "review_id": "pVbtAORlwcceVb5y4WH7cg", "text": "Since I have promised myself that I'm not allowed to move away from Charlotte until I have eaten at every restaurant, I figured that Restaurant Week would be a perfect time to visit Luce, a small Uptown spot that has been on my list for years.  Upon arrival, our table wasn't quiet ready.  No problem there, because the suggestion to \"grab a drink at the bar\" was a given.  Tucked away in the corner, the attentive bar-goddess quickly poured us wine and presented us with nibbles.  Super-crunchy potato chips (which appeared to be made in house), as well as a heaping handful of olives were placed in front of us.  \n\nThese. Olives.  \n\nI wanted to fall asleep in a bowl if these olives.  I don't know what kind of magic the cooks/aka/olive-wizards behind the scenes of the closed kitchen put into them (fresh garlic? fresh rosemary? tears of their first born?), but I'm talking LIFE CHANGING. Like little baby angels.  \n\nThe food was great, service attentive and friendly.\nI'll definitely be back....for the olives.", "business_id": "z24h6ZYnZiWjlDTuLXG9jw", "stars": 4, "date": "2012-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dUkJJyfPg24nIZZUW74wMQ", "review_id": "g6ln46Kk3t-lx6xyc35CQg", "text": "Ate here twice and was very impressed.\nOrdered fish the first time, it was served with an excellent risotto.  Also ordered fried calamari, salad, and a tasty tiramisu.  \n\nOn the second visit, ordered bruschetta and the 'mare' pasta.  The pasta was excellent, and is a must have at this restaurant.  The sauce was well made, a light tomato base with silky texture and the seafood (clams, scallops, mussels, shrimp, 1/2 lobster) tasted very fresh and blended well with the sauce.\nThe ricotta cheesecake was a hit as well.\n\n\nI'll come back for the mare pasta alone.", "business_id": "z24h6ZYnZiWjlDTuLXG9jw", "stars": 4, "date": "2015-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hABpw8W5tu6FgUhmh-tvjQ", "review_id": "gIHoyI0o7wqfNuqFiM6saA", "text": "First night time visit to Mama's..wow this place is a goldmine..packed with people, pretty high noise level, but they were very accomodating when we added 2 extra people to our reservation.  The BREAD, yes it was incredible warm and soft and seasoned..not Italian bread but a lovely soft dinner roll -- very addicting. Our waitress was very nice, fairly fast and concerned about our order. We started out with Calamari...not the right choice ..it was Mrs. Pauls...thick heavy breaded with all the same size rings?? Our friends had the Bruschetta --it looked very good. Our Drinks came and they were not made correctly but the waitress cheerfully took them back to the bar and brought out another version, still not right -- and irritating when we got the check and it was 8.20 for the drink and 2.50 for the bar brand liquor in it. That means we paid 8.20 for club soda and a cherry..hmmmm\nI ordered the Spaghetti all Gricia..it was thin spaghetti and caramelized onions, applewood smoked bacon, and pecorino cheese. Very interesting..not Italian but really good ..but I would rename it Bacon Lo Mein...My Husband ordered the Lasagna, he said it was good but the meat was stringy?? Our friends had the Pollo Romano, which was basically a Chicken Parm, it was a great size portion, and seemed like our friend enjoyed it. Her partner had the Cotoletta ala bolognese, it was a fried chicken cutlet topped with Parmesan cheese and proscuitto, It was also a nice size portion but it was swimming in grease, like the cheese had melted and they used to much oil to fry it..they did replate it for my friend but she could still not eat it and they very nicely took it off the bill. \nThe desert....was the VERY best thing on the menu--NUTELLA PIE..It was a combo of Nutella, peanut butter, marscapone cheese with a graham cracker crust...heavenly, I would have eaten more but I had filled up on the bread!\nAll in all..its a okay dinner place...not authentic Italian at all..Large family style portions, but not my AMORE...Loved our company..not so much the meal..Sorry Mama....", "business_id": "MQnNtW1lHS-eid3QNUoUIw", "stars": 3, "date": "2012-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Na0FKooeWPYuFpaEY_PqUQ", "review_id": "-MsiPMq2f2mx29VL08wgrA", "text": "This place is always amazing. Great staff, great food. They never disappoint. Do yourself a favor and get the goat cheese app and the Nutella pie. You don't even have to order anything else and you will walk out happy b", "business_id": "MQnNtW1lHS-eid3QNUoUIw", "stars": 5, "date": "2015-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bS-U2xaXIYs-RtBSOISGGg", "review_id": "HbFYqmKsdU1BC6snmMFb6g", "text": "Pitiful!!!!!\nService sucked!!!!!  We were in there for lunch and there were two other tables with folks eating. we sat there for 20min. with no interaction with the pizza hut staff.  So we got up and left.  don't think I'll be back to that pizza hut.", "business_id": "xopQn_MCE8bSBOyhsj6pVw", "stars": 1, "date": "2015-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bhdvhGMVIZGw8TRgES2ELg", "review_id": "58oOQclFoAghBrkWoqYNSQ", "text": "We decided come here since it was next to the mall. The place was not even that busy. The food was okay. But the service was bad. We sat there for about 20 mins until our waitress came by our table. After taking our orders she came back with the drinks. By the time we got the food the order was wrong and the waitress was no where to be found. When we ask someone if they can find our waitress another 15 minutes went by. At that time my aunt decided she's going to eat it anyways since it took forever. Then we over heard the table next to us asked her about their food. She told them she forgot to put in their order. Next time we are going else where.", "business_id": "qZ1bDtcercwUw4w7trpVjQ", "stars": 2, "date": "2009-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xt0YzcuQiVZmxGJ690F47g", "review_id": "ELCENPwjNfzh6WZpzNHYzg", "text": "My boyfriend and I decided on this location and restaurant because he'd never been there before and CLAIMS he doesn't like Italian food. Pah! So I picked this place to change his mind. My mom and I had lunch here a month before and it was delicious then. \n\nNot so much this time.\n\nIt was Valentine's day so we expected a wait, we aren't unreasonable. An hour and a half passed and people were seated that came in after us before the hostess noticed we had been there a while. Somehow we were overlooked,  but whatever. I'm starving and happy to be sat!! We were seated in a booth by the bar and didn't have a waitress proper. We had the super busy bartender who had little enough time to make drinks much less remember we needed drinks or silverware or ya know, any attention at all.  Again, can't blame her, it's valentine's day, crazy busy, they likely had callouts or something.\n\n30 minutes later our order gets put in. 30 minutes later our appetizer comes out. Red flag should have been when I heard them 86 the mozzarella app we got. She brought out the appetizer, and just didn't mention how there was no mozz. I guess she figured we were new and didn't know any better. It was just this ricotta ish cheese and no mozz. Okay so the app was meh, main entrees yay! (An hour after putting the order in - dying of hunger lol) \n\nHe ordered a pork dish and I had lobster ravioli. His would've been great BUT it was barely warm and tasted like it died in the window. \n\nMy ravioli (5, don't order this if you're hungry), weren't even turned upright, which yknow whatever but what disappointed me is that it looked like they had dumped it off the tray they microwaved it in. And it tasted SO MICROWAVED. Mine wasn't hot either but I scarfed it down anyway. \n\nDefinitely the worst meal and biggest waste of time I can say I've spent at a restaurant in a long time.", "business_id": "hvhogN-3cMny0Nrqbsjpkg", "stars": 1, "date": "2015-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2gLTrhw0vr3WsFliMhXl_g", "review_id": "OdePko7opby4q12U_Gy1mQ", "text": "The food and service are terrific, worthy of a five star but the atmosphere is more two star. Loved the squash ravioli!", "business_id": "q8fD82us6uuGufvI44NoAg", "stars": 4, "date": "2015-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h4fjgz-44HFE_kGy6p8P-w", "review_id": "Ti0at4okbF4vO5FWyg7uCQ", "text": "Note: I have only ordered delivery, and that I've ordered online.\n\nThat said, the pizza we've gotten from here has been consistently fresh, hot, and tasty. I think there's only been one time that I was disappointed with the consistency of the dough, hence three stars instead of four.", "business_id": "pHBQ-dQRwN3z7Rq7iSog-A", "stars": 3, "date": "2012-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6nCuP3lx1ibS4sBCdzuGHg", "review_id": "uSdghE644of768MvuyJAhQ", "text": "We got there around 3:15 Saturday told 15 min for a table, more like 35.  AFTER we ordered we were told there was at least a 45 min wait for food.  No apology, nothing.  I had soup & Salad the other person had alfredo.  Not complicated to pour some sauce on the noodles!  Had to ask for drink & salad/bread refils.  Over 2 hours for an average meal.  It's always slow when we go, but that was just insane.", "business_id": "H0D2HYqLd9MRCq68rtbTyQ", "stars": 1, "date": "2012-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PD2PYKPH772yu6V9w_eGKA", "review_id": "S61liLPM9QJDj9Fmu9QNDw", "text": "My only complaint was the waitress was a complete moron. \n\nI am very forgiving of servers too, being a former one myself. She had no idea what was good on the menu and just kept saying \"Im a vegetarian.\" With that being said, in Champaign, I haven't had a better meal. I had the veal and it was wonderful. I can't recall much else but in a town without much choices other than the usual college fare, this ranks up there.", "business_id": "h9xdY1NO4GnNijNChTy-8A", "stars": 4, "date": "2010-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QSHeG_S2Jxsvf23EWBzI0g", "review_id": "oDbPXdbhoTnYC4IUt8eF4A", "text": "Meh. The bread was cold, the bean dip it's served with was cold, the mushroom dish that was described as served over risotto was served over cold orzo. Didn't knock my socks off.", "business_id": "h9xdY1NO4GnNijNChTy-8A", "stars": 2, "date": "2014-12-01", "type": "review"}
{"votes": {"funny": 12, "useful": 13, "cool": 13}, "user_id": "MWt24-6bfv_OHLKhwMQ0Tw", "review_id": "jCUajS25ZpeUgBnF8NOxwg", "text": "I had the pleasure of spending my Friendaversary with the lovely Georgie S. this past Sunday at the Opera. Because we saw \"La Boheme\" I felt it only right to get Italian food, so we headed over to The Old Spaghetti Factory in hopes of satisfying our pasta craving.\n\nIt was quite charming when our waiter came over with the bottle of wine that we ordered. It was the second most pricey bottle they sold (coming in at $34) and he told us in the four years he worked there he had never sold a bottle that expensive. Well, that's because you don't have high class broads like us patronizing this establishment, or so it would seem!\n\nThey have a good sized menu with a lot of delicious looking dishes. I was especially excited that they have gluten-free pasta! I was hoping I would be able to eat more than a salad. On that note, I must point out that your meal comes with salad, bread, your entree, and iced tea, AND spumoni for dessert! If you choose not to get the tea and dessert, you get to knock $1.50 off the cost of your meal. \n\nThat means that my large, tasty plate of pasta and the salad cost me $6.50.That's right folks, dinner for $6.50!\n\nThe place itself is pretty charming. They have a trolley car in the middle you can sit in. The one drawback is that this place is very \"family\" oriented; something Miss G and I are not normally very \"fond\" of. But we dealt. \n\nVery solid 4 stars....", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 4, "date": "2010-02-03", "type": "review"}
{"votes": {"funny": 7, "useful": 7, "cool": 7}, "user_id": "fGBQXv5-9eRBjwhm_EL2jQ", "review_id": "ULFKDabJlyaUVhIZzEW8bA", "text": "The Old Spaghetti Factory is a fun chain restaurant where both families and larger, alcohol-fueled gatherings are at home.  I come from an area where \"red Italian\" menu items are commonplace, and mediocrity is the norm.  From this perspective, the cooking here is comforting and old-school; a notch above the ordinary, but nothing to get excited about.  Fortunately, portions are very generous, prices are quite reasonable and The Old Spaghetti Factory scores on that basis.  The lasagna was loaded with meat and just enough ricotta to balance.  Not enough mozzarella was buried under a thick coat of ho-hum tomato sauce.  Several other cheeses were (literally) throw-in's, the dish would improve with their removal or replacement with adequate quantities of garlic, basil, oregeno and/or onion.  Seasoning, in general, appears to be oriented toward their pre-school and geriatric patrons.  My coworker had the crab raviolli; it looked delicious, but a bit light on crab.  She did enjoy it.  While David was a capable and friendly waiter, the kitchen let him (and us) down.  Our appetizers and entrees were brought to the table within a minute of each other; completely unacceptable, and cause for the loss of one star.", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 2, "date": "2012-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W885zdTPLBQzrtL6zgMJ8Q", "review_id": "kDxMFGOAKQD5CUcpyLL5jw", "text": "Unless you have time for a three hour lunch, I would avoid this place like the plague.  People around us were walking out because they got tired of waiting for their food. Then to top it off, when the food finally arrived it was cold. Horrible experience.", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 1, "date": "2014-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 6}, "user_id": "ZrUZtLgLOn15v2NIZl-oKQ", "review_id": "VBP9ceHTaV8yFkUm7s5cLg", "text": "So, for more than a year, I drove by this place on my way to work but never checked it out. I wasn't sure what to make of a place with a walk-up takeout window. Last night, I followed a group of friends there for a late dinner. Didn't try any appetizers. I just split a 14' Italian special pizza--sausage, green olives and fresh garlic. The pizza was pretty good, not spectacular but definitely a couple steps above a place like Mamma Mia's whose pizza has a fast-food quality at times. Red Devil is very generous when it comes to toppings, at least on this one. I am an olive lover but haven't had green olives on pizza before. I enjoyed olives in every bite. But if you think olives are just okay, you might have found it a bit much. The pizza was kind of big for two people and with tax, it was about $18. So, I'd say it's fairly priced. \n\nI have to say that the service, more than the pizza, would draw me back. Servers who think of the little things before you even ask are much appreciated. We had a party of nine and our waiter was super patient. We also brought a birthday cake on the premises, which they allow. Our waiter started clearing all our plates and silverware and before I could ask, he said not to worry, he'd bring us clean plates and forks for the cake. He also saw someone with a camera and asked to take a picture. He just gave off a genuine vibe of being helpful. I would definitely consider it if in the mood for something casual but not carbon-copy fast food.", "business_id": "PEHJjxdw11TGFma9Zhz3ng", "stars": 4, "date": "2009-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Vjaakbsp9eeOLChcrNwl8g", "review_id": "h9WznUJoIagIfdp6jQ8dfQ", "text": "I love this place...best pizza in Phoenix- hands down! Wings are amazing, service is always phenomenal. I simply love this restaurant. I have to admit that I may be a bit biased as this place holds a lot of sentimental value to me. My family and I have eaten here for years and years. At this point- 4 generations worth, that I know for sure, have dined at and loved Red Devil. My husbands favorite is the sausage and artichoke pizza- while mine is the Red Devil combo. We always split an order of medium wings and get bigger then we know we will eat- pizza so we can have some to bring home. \n\nThis restaurant also does well balancing the \"family friendly\" with the \"date night\" crowds. I will say that we live much closer to the Mesa (Tempe?) location and have gone there 4-5 times...completely not the same. Yes, same-ish food, but the other location just simply does not have it like the McDowell one. Dont waste your time at the other one- just go to the McDowell location and enjoy!", "business_id": "PEHJjxdw11TGFma9Zhz3ng", "stars": 5, "date": "2014-01-06", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "PNS9z4aFDbfhpIsHCfNvNg", "review_id": "awK1MfWXfKhmS3b_zJ_4zQ", "text": "A perfect Sunday night consists of Streets of New York Hawaiian Pizza + My Couch + A Bottle of Red. \n\nNow, I'm drooling and it's only Tuesday. There's something about their pizza that is perfect. The consistency, the thickness/thiness of the crust and the flavors of the ham and pineapple. I love it. Plus, their ranch and peppers for dipping and extra sin are the way to go. \n\nBe sure to look in those cheesy coupon packets that come in the mail - Streets of NY typically has good coupons which help. They're a tad expensive but so worth it. I think the 18\" Hawaiian (don't judge us) is $23.", "business_id": "JN2qXIuDXnV2d8WnSqd28A", "stars": 5, "date": "2011-01-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "tBvrnSCLSpUdCDm5w5GPkg", "review_id": "lmV0msaMwTArTYaBP1WS9g", "text": "Need your Bianco fix but don't want to wait in line for three hours or get in a fight because of a shortcutter? Eat here instead. Take out only and very limited menu but who cares there food is great! Lucky for me I live close by so I can bring it home. There sandwiches are made with all fresh ingredients and their bread is wonderful. Next door is a place called Lux Coffee House. Erick is a hoot. They are very good to their customers and I had the best Vanilla Latte every here. You can sit here with your Bianco sandwich and surf the net with your laptop. A small piece of paradise!!!!!!Be forewarned Bianco's is not cheap!", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2008-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mR1hWOIBRMJorZvZL6ZjkA", "review_id": "TZ-npeLhoAT2o1ZFXkGwJg", "text": "I give this local neighborhood hot spot five stars. Owned by Pizzeria Bianco's Chris Bianco, this sandwich/panini joint bakes fresh bread daily made fresh to go, and although the menu is limited usually to three sandwiches and a foccacia bread, it's well worth it. The Market Sandwich which can change is always my favorite. From fresh mozzarella and tomato to superb meats, they can never go wrong. This is a great in and out spot and there is only outdoor seating next to Lux Coffee bar. They also offer salads, fresh baked bread, fig jam and chocolates. I highly recommend this hot spot!", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2010-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2uz3B-11DieFlELzqUCAlw", "review_id": "mvEp8MjziYbMLhh6bYdOTw", "text": "If you love bread, this is the place for you. Sandwich for lunch and pizza for diner are perfect for me. All ingredients are so fresh out of the farm. I really love to come here and enjoy my food outside (only in the Fall/Spring though, not summer).", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2011-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GvubN02IRi0Yy7h_QRe9OA", "review_id": "a1L1iZGTD5AFjjeRayZleg", "text": "The best mozzarella, tomato, basil sandwich in town. The bread is to die for.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2012-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "LzBRF1sMlbcPBz46tm74cQ", "review_id": "XRO4JIrh_SLvPFYsDikLhw", "text": "One word: LOVE! This place is right next to Lux Cafe. My group and I went here to have lunch after getting our java (and tea) fix next door at Lux. \n\nI ordered the Chicken Salad and it was delicious. They use locally grown tomatoes and you can really taste the difference - fresh and flavorful. I highly recommend it. My cousin got the mozzarella salad since she's a big cheese lover and it's also really good. We also ordered the focaccia appetizer - it was awesome. It reminds me of a high-end pizza bread. \n\nIn summary, it's a cute, slightly hipster place to have brunch or lunch.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2013-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "aEfoNPrSgtqoZqZ78YPAjA", "review_id": "g2OxrfcoWKmVpxlHX97Kzw", "text": "Went here for brunch,  and since it's next to Lux why not get a coffee.  I brought coffees for all my gals and the staff have me an attitude about it... I thought,  rude, but didn't make much of a fuzz about it.  My other friends got good service,  me, it was like i was invisible.  Sorry,  I promise not to bring coffee in next time!  ;) the food is good,  but not worth the cost.  Great bread,  pizza  dough but really not enough to go crazy or recommend others to try.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 3, "date": "2015-01-25", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "jJqOE2vtThzmtwIy6j2sew", "review_id": "L2mmJ7aZgoZB6Cq_ndZEYA", "text": "I was in town on business and was told that if I was going to eat Italian, it had to be from this place.  As I got off work one night I decided to place an order for pick-up.  (Glad I did!  The place was packed and the wait was long!)  \nI ordered the Pesto Penne Bake, sounded good enough. I received my order and the first thing I could smell though the closed bag was the garlic! (thought maybe it was just the garlic bread-ha boy was I wrong!!!)  When I got back to the hotel I opened it up and the smell of garlic was even more overwhelming!  The pasta bowl looked good enough though.\nThis dish has so much garlic in it that it is not edible to the average person!  (I had to open the patio door to the room just to air out the garlic smell!)  \nIf you can get past the overpowering smell and taste of the garlic then it was a good dish.  But I must say the garlic is what ruined it for me.  Don't think I would go there again if I was in town.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 2, "date": "2010-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fJGWSgGsvb6leJzOuE2O3Q", "review_id": "fW_w0vPM0FrYGR3LVQIEiA", "text": "I've always enjoyed Oregano's. Who doesn't like their pizza and pasta dishes or their pazooki (i always share the half and half)?!\n\nBut recently, I found my favorite dish ever and will order it every time I go. After I realized how much I enjoyed it, I found out it's the healthiest thing on the menu! Or at least that's what someone told me. Either way - the Big Beefstro Salad is what I will be ordering from now on. It's filled with shaved rib-eye, jalapenos, sweet onions and a sweet serrano dressing atop the greens.\n\nOh, and sometimes I like to indulge in the Dirty Monkey - it's delicious, but strong.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 4, "date": "2012-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7oPwusOdUeQ8cJl7PN22dA", "review_id": "SSbJYtAXxG4-7Rsu-U616w", "text": "Food is great every time along with excellent customer service. Everyone is so enviting, polite, and prompt. I mainly go there for a one of a kind pizza, the BBQ chicken is a good choice it's my favorite, the spinach artichoke dip is to die for with the garlic bread, and of course the famous cookie pizza with a choice of any cookie.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 4, "date": "2013-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e-GOQDdx_pPSi_dHJ87oKQ", "review_id": "iM9Gphtamc6IFPsO7UoXCA", "text": "Jenny introduced me to Oregano's not long after we started dating. I'm not a big fan of chains or franchises -- even smaller ones -- but I'm also committed to giving any place a chance. Since that rainy day introduction some (three?) years ago, I've never really had a 'bad' Oregano's experience. But, that being said, part of the Oregano's experience is the long dining time which, on a weekend, generates longer waits for a table. So that's Oregano's. \n\nThe Camelback location has been our 'home' Oregano's since we moved to Phoenix. The parking here is a little tight and you'll often find yourself pulling up to the curb on one of the streets behind the restaurant. But the staff is great and there is adequate seating for your pre-meal wait. That all said, my go-to here is the meatball sub or the Big Bambino salad. The BigBam is sooooooo good and I like that the portions are sized to share.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 4, "date": "2015-01-27", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "Ap5atWJUGnJ6B-XCzbZjWA", "review_id": "R1kxoqOw9xX2Tswan-IvDA", "text": "I'm thinking that the normal staff was off yesterday. \n\nI went to Cherry Blossom with very high hopes thanks all the positive yelp reports and was very disappointed. This onetime experience won't stop me from coming back to give the Cafe another chance...as I think I might have been transported to a parallel universe for this meal. \n\nFirst off... cute little place, there is no doubt that this is not a chain. The interior of the restaurant is simple and looks more like your dining at an authentic Asian bistro in Vancouver rather then in a central Phoenix strip mall. Our server was a little slow getting to us, again, this is not a chain, so that was overlooked. \n\nI ordered a Summer Roll (per menu - Shrimp, lettuce, avocado, cucumber and rice noodles) and a Shrimp tempera roll. When the orders arrived the summer roll looked great, but was stuffed with a \"bonus\" of that weird crab lookalike stuff made from fish heads and fins.. YUK! Not a problem, I'll just scoop it out onto the appetizer plate... \n\nso when I counted, the Summer roll with shrimp, did have shrimp.. 2 of them, and I kid you not, 1/2 cup of that crab stuff. \n\nWhen my \"shrimp\" tempura roll arrived, guess what?? its a fake crab tempura roll with one shrimp... lol... The rice...VERY sticky... By the time the meal was over, my app plate was mounded with about a cup of this crab scented stuff... such a waste... \n\nMy friend's pasta ( Marsala Chicken) was great... the chicken was all breast meat, with a really good Marsala sauce...it was impressive! ... So overall... weird experience... will it keep me away??... no, well not unless it happens again...\n\nThe strangest thing about this whole ordeal is the fact  the main ingredient of my appetizer and sushi roll was not even on the menu.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 2, "date": "2009-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "W_QXYA7A0IhMrvbckz7eVg", "review_id": "quj7CuL_qL_8bpxUk0APyA", "text": "This was 4 star food but with 1 star service.  Since I am feeling nice today, they get rounded up instead of down.  It was a little bit later than normal dining time, 9:45, so it was nice to be able to go and have a nice dinner that didn't involve waiting forever to be seated or fast food.  \n\nOnce we were seated we were promptly ignored for quite a while.  Probably about ten minutes.  No one even came around to say they would be back in a couple minutes or that they were just busy at the moment.  Then the table next to us was seated, greeted, and got drinks all before anyone took notice of us.  Finally our grumpy server came by, said two words and then held up a finger, telling us to wait, while she talked to someone else.  Seriously?! WTF.  \n\nI ordered a water to drink and the Chicken Yakisoba.  I downed my water within 10 seconds of getting it and waited until the end of the meal to get it refilled.  Hmph.  The food was really yummy.  The noodles were firm and the sauce was light and kind of sweet.  I really liked the veggies included, but I thought the chicken was kind of unnecessary.  It just didn't add anything to the meal. \n\nI think I will probably get some food from here again, but only in take out.  I'm not sure I could handle service like that again, especially since I can pretty much touch every end of the room when I stretch out my arms.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 3, "date": "2010-01-20", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 3}, "user_id": "ODhV53XhesCBLJVfGsJGNA", "review_id": "KPHQVkcTmOlcZjLufaRj5Q", "text": "Myself and four others sat down for a tearful farewell dinner.  I had recommended coming to this place since everyone wanted to dress up in Japanese street fashion.  So viola~  Back to the good old Cherry Blossom Noodle Cafe!\n\nI had started off with the Calpico Beer.  I don't know why I had such high expectations because it tasted EXACTLY like it sounds.  If you want to add some yogurt drink to your Kirin's, this drink is for you!  Anyways, I had ordered the Unagi rice plate.  I love sitting down to a bento full of succulent grilled eel on top of a bed of brown rice --- that's exactly what I got!  \n\nMinus having cabbage/lettuce in my miso, which I found incredibly odd, I'm docking one star only because service was mediocre on a night when it wasn't too busy!", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 4, "date": "2012-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "aeJ9K9s_jKgUkMtww2GGCA", "review_id": "xpAy5_8f780Yr3LF5LEhag", "text": "I loved this place it seemed very authentic the watress was very friendly and the food is delicious plus the price is great. we had just about everything we could order on the menu and it was great. I expected to pay a big bill at the end but didnt it was well and fair priced so the watress got extra for being extra special. I would say at least try it once.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2013-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K1sFUalwhRW0mhP3pT0ahw", "review_id": "-4SEiKP_ubm76TN9l6x0jg", "text": "I absolutely love this little cafe restaurant.  Everytime I came, I had very friendly service! Also the food is amazing.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2013-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "T70B3fDF7LHWntNWlYwhhA", "review_id": "XHyhQxLflX3VJdvFjH4UVQ", "text": "Been here a few times. It's a strange mix of foods (sushi, ramen, and Italian?!) with the ambiance more like a French cafe, but it somehow works. Their pad thai is tasty and I love the udon. The portions are quite large and they don't skimp on protein. Staff is all very friendly and it doesn't break the bank. I want to come back and try the ramen, the table across from me demolished theirs so it must be good.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 4, "date": "2014-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "y94gkwI3Vn60C5UsgenFYw", "review_id": "SQzEO4QrdZbdWb_LtGCRKg", "text": "Absolutely love this place! It's so cute and the food omg!  the chicken Marcella and chicken parmesan is delicious :-) don't get me started on the green tea! it's absolutely delicious and it's such a nice place to hang w. Some friends or go out on a date; maybe even take your fam. it's beautiful and the service is wonderful; all the employees make you feel comfortable. Very clean and decorated nice. Never disappoints me! definitely my favorite place in the entire world. :-) thank you cherry blossom!", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2015-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x96xHxI7-ZgxJXGGJtaZpw", "review_id": "a8udAS5aADof9YkbnA6IrA", "text": "Second time here and I just have to write a review! The service was alright, great but they were pretty busy! The food came out fast and it was pretty delicious. I love the Udon noodle soup and the shrimp tempura. It's kind of expensive but the food was really good so it was worth it. The lunch specials was still a little on the expensive side but my friend got a chicken katsu and it looked really good. I would come back again (:", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 4, "date": "2015-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GoymUzKqvET2QOZkIWZi9w", "review_id": "wnpwHigR-Ez-fFXvR5UxWg", "text": "A large group (17) of us came in for NYE and it was fabulous as always. \nWe started off with a bunch of appetizers for the table followed by soup then salad. \nThe soup that evening was some sort of mushroom, artichoke, potato combination that was out of this world and if anyone has the recipe, please send it to me! \nThe salad was the same as always, nothing spectacular but it serves the purpose. \n\nOn to the entrees, they had a prix-fixe menu as they do for all major holidays. There were A LOT of seafood options, but no vegetarian (they were able to accommodate but it wasn't listed) and only one chicken option. I was hoping to see at least 2 chicken options for those of us who don't love breaded chicken. There were also a lot of beef and pork options. \nThe chicken was similar to a Cordon Bleu without the ham, served with gnocchi and some sort of cheese sauce on top. I loved it but others in the party didn't care for it as much as some of the other options you can get when it's not a holiday. \n\nWe then finished with desert. \n\nService was wonderful, the food was great and we will definitely be back.", "business_id": "3CSaqRNvYg7ZdN2zwxwzVw", "stars": 4, "date": "2014-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0VptqMr6enVCnqRjVYs4NQ", "review_id": "SB3HzmP8hkUmBDOr2AB8PA", "text": "I have been wanting to try out Pizza Heaven since I heard about it around 6 months ago. If your Vegan, getting a decent pie is tough, tougher if you are in Phoenix, tougher still if you reside in......mmmm...let's say Mississippi.\n\nWe are planning a move to CenPho and trying to try out our new hood before we actually get there so it's exciting to try some new places, hoping you will find your new favorite \"spot\". Unfortunately on my first pass, Pizza Heaven only gets 3 stars.\n\nWe did take-out and the person taking the order was friendly and nice enough but it took him 3-4 times to get the order correct. We just wanted 3 veggies on one half, a different 3 veggies on the other half. Somehow they couldn't do that or it would have been more(which I really don't understand, yes it's a different vegetable but it's only a half order....anyway) so we only got two and some breadsticks and marinara. \n\nThe place seems cool enough, good location, cozy atmosphere inside - next time we will definitely dine in. We got our pizza promptly and headed home. The large(14\") pizza was $18.50, I'm no whining cheapo but that's certainly not cheap, average maybe, but not cheap. \n\nVegan cheese is a bit tough to master(Daiya is the best and at more pizza places now). I think this is either Teese or Cheezly which are both decent but the problem was it was barely melted at all. The temp needs to be high enough and maybe I just got one that had a bad spot in the oven, we had to throw it in the oven and broil the top for a few minutes before eating which is kind of ridiculous but whatever, no biggie.\n\nThe pizza was good, seemed fresh, nothing extraordinary but decent. The breadsticks and marinara were excellent.\n\nKudos needs to be given for a pizza place in Phoenix that offers a vegan pie, as well as gluten free crust options. Most owners would scoff at the idea so I commend them as they are one of the few.\n\nI will try this place again and dine in next time, maybe they will grab a star back from me.", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 3, "date": "2010-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BoW4OjqbWimHnna47xa1iw", "review_id": "_ecMCIm6myJUGDjuNrtJOg", "text": "So so food but sweet staff and low prices got the 4th star, waitress was a honey", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 4, "date": "2013-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2PeotUk0AFuvebc6p_0-zQ", "review_id": "TJl2tB40U70C_GNVA4cGRQ", "text": "Great for delivery! And being able to order through Yelp makes PH an easy choice for the nights I don't want to cook at home. Have had the Works Pizza, lasagna, meatball sandwich, and jalapeño poppers - all of which are stellar. Reasonable prices for non-chain pizza, Italian dishes, and quick delivery. Pizza Heaven is a weekend staple at my house!", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 5, "date": "2015-01-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "55ecDCpJIXzTWjEzMQ11Vg", "review_id": "hvxkAX7b6L1CFNgtAme2Og", "text": "2 words...Italian Beef\n\nParking sucks. Prices are high. Lines can be long. Coca-Cola only in cans (RC Cola on tap)...but the Italian Beef...\n\nNo where else can you get a sandwich like this...not even Chicago.\n\nOrder it wet (they soak the Vienna roll), get your favorite peppers...add a small order of fries, a can of Coke and that is $10 and you are happy all day.", "business_id": "Tk2dSL0TwQeI_zNJmb442A", "stars": 4, "date": "2009-01-06", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "gvsvXHrojb_cYkGks6cC9A", "review_id": "qLmCUtLLEKF_1PPbiaNcMg", "text": "It's one of my top go-to places for Chicago-style hot dogs. (Remember, kids - there are *seven* condiments, and not a single one of them is ketchup! ^_^; )\n\nA Chicago dog and fries are always a great deal, and it's nice to see a place that has RC Cola and related brands on tap. (Something you don't see every day, but then there's a good distributor in the area, so I hear.)\n\nParking around the place is somewhat limited, but it's all in timing your visits. I've yet to be there when the place is packed. Luck of the draw, I guess.\n\nWhen I hear that folks from Illinois (Whether visiting, or relocated) stop by, then that clinches the deal there. (I'm an ex [or \"exiled\"] Californian, but I have appreciation for a good Chicago-style dog.)", "business_id": "Tk2dSL0TwQeI_zNJmb442A", "stars": 4, "date": "2014-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "yp90PduP1gD7kgCLWuQg4w", "review_id": "orautXpvPon36EMucImxbw", "text": "Just go here and get the Italian Sub.  It's fantastic!  Also they have real deli meats and cheeses, not Boar's Head.  What's not to love?!!", "business_id": "T5HYqRADhAL6VPRAacz74Q", "stars": 5, "date": "2011-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "q0ggzEwTx2QgNiQm4vObrA", "review_id": "y6inq2zOvB1uOc8KpnI0LQ", "text": "Saturday afternoon, approx 2:00, they are sold out of sausage. Note to self: get here earlier. Settled on cannoli and biscotti. Cannoli are filled on the spot, crunchy, light and flaky. Filling is perfect, creamy & sweet. Only wish they had chocolate chip but will def be back for more! Biscotti are some of the best I've had, not too sweet, crunchy and flavorful (I taste anise seed) I had the pecan and will save some for coffee dunking   tomorrow.", "business_id": "T5HYqRADhAL6VPRAacz74Q", "stars": 5, "date": "2015-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "acWdqAbRMYcX8eLCavWBGQ", "review_id": "REpny31iZXCTAwLK63jzFA", "text": "Pizza was ok.. I ordered Vinnies, which is your choice of 5 toppings.  Italian sausage, black olives, onions, garlic and basil.  It wasn't bad - but it wasn't great either.  \n\nThe server was exceptionally friendly and helpful - but the service was the high point of the experience.", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 2, "date": "2013-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CP8qXKvY8inZfrFBLpt6TA", "review_id": "6fDpQlybwIdAg1gISW9Lkg", "text": "It's also smaller place, pizza is good, it used to be better, I use to frequent their chandler location. Make sure to order their large artichoke dip.. I always order their veggie pizza. They can use a little more cheese on the pizza. Service is good, they kept checking on us. I would go there again", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 3, "date": "2015-01-26", "type": "review"}
