{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mXJS_e-zR68eExLhMrxJPA", "review_id": "3YYptDijI9zPMQ40625FLQ", "text": "Great place  . My favorite steak reaturant in Pittsburgh . The bar area could be bigger . The valet's were professional and quick .", "business_id": "90Fqfzd8zD9AuuNBSv9lAg", "stars": 5, "date": "2010-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YIFUwyEnvgMzLhi28XEAGA", "review_id": "h4MSAWrlS-nZhLdG5wqpEw", "text": "Always amazing! My Husband and I frequent Ruth's Chris for almost every special-occasion: birthdays, anniversaries, when we need a great meal; and without fail we leave euphoric. \n\nAfter almost each bite, we close our eyes to shut-out the sense of sight to focus on the taste and aroma of the garlicky, creaminess of the Remoulade on our salads; the richness of the Pesto on our Sea Scallops; the buttery-goodness of our dry-aged steak; and the salty crunch of our French Fries, which Kathy suggested we dip into Honey-mustard for a fantastic salty-sweet combination.\n\nFriday is a good reason to go... Reservations are calling!", "business_id": "0FgwBx7pgmNdUtsd_T8UYQ", "stars": 5, "date": "2012-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 3}, "user_id": "-J9FWRI3Wj2U9eUULJPNFQ", "review_id": "gaFELSYdC0ZIZ1RFB7zNJQ", "text": "I'd been hearing about these burgers for a while, so when I finally got a chance to eat here while visiting pittsburgh for thanksgiving... i got to eat one :D Delicious! So meaty and juicy and omfgherkajhg. very very tasty. Unfortunately I had chips instead of homefries, and now I wish I'd gotten those homefries. They looked a lot tastier than I thought they would. Sigh, someday!\n\nIt's was cold out and there was a line, but we all crammed inside to wait, and everyone was very nice, and we got a good table. I think we waited maybe 20 minutes. Very nice atmosphere inside too, I like the lighting.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 5, "date": "2008-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gX2V0EatGYWkC-8GpeTubg", "review_id": "uwBa2-tRtstzLfaLb3TdyA", "text": "My boyfriend and I went here for burgers because there are so many good reviews and we heard that they're the best in the 'burgh.  I was disappointed.  I had a bacon cheeseburger and it was okay.  Maybe my expectations are too high, but I don't want a burger that's purely a slab of ground beef with no seasoning or other flavoring in it.  I've had more flavorful burgers at chain restaurants.\n\nI did like the home fries, very yummy!  And an interesting side dish.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 2, "date": "2011-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r_96n9O0jNzbNCZDkSB0EQ", "review_id": "haacO7XtTrAk8IhupG3LVQ", "text": "Tessaro's is famous for its burgers and that is why I go there!  This is old Pittsburgh at its finest.  It doesn't try to be hip or trendy - it just is!  Excellent service and great food is what this place offers.  It doesn't disappoint!", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 5, "date": "2013-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MW5ZdU5lAhcoiXXsxHDoow", "review_id": "BxoHfnyNRXMPhREKFks16g", "text": "If authenticity is an ingredient, consider Tessaro's perfectly seasoned. A Bloomfield landmark, the ambiance of this corner spot  is warm and dark. The service is provided by a very competent crew who seems to have been around for quite some time. The food came out in good time and was just delicious. Portions were generous. I especially appreciated the heavy wine pour. Meats were exactly as requested and cooked over an open flame in site. Tessaro's is not cheap but it is highly recommended.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 4, "date": "2015-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "EmpkDgejncKoP9N3HjGptw", "review_id": "sWtWuhARPyrpmmh3Fu_dUA", "text": "after my last visit and review, I was contacted in a very professional way by owner. he handles it exactly as businesses should and I am glad that they take these types of reviews seriously and can actually take note of places to improve upon.\n\nI decided to give them another shot, this time we had a wonderful experience. Our Server, Jacob, was outstanding! never waivered on requests for extra dressing, our glasses did not even get half empty before he politely asked for our glasses to be passed to him (from the inside of table) for a refill.\n\nI tried the garlic and provolone topped sirloin, the garlic was a little over powering for me, raw, and made my mouth burn, easy fix.. I just removed it. There was this nice gravy underneath the steak, which Jacob got us more of since we preferred that to the cheese & garlic topping.\n\nJacob really made this visit pleasant and it was a great experience. We chatted momentarily at the end, I explained I had written a not so pleasant review because of our last server and would be updating the great service & attitude he projected). I had to laugh as he said I was somewhat famous because the review was discussed in a meeting. I am so glad that the company actually made good on their statement that customer service would be addressed and refreshed. Although on last visit there was really only ONE person who really needed a lesson in it. Everyone else was great. This time I was very pleased and will continue to visit this location.\n\nThanks Jacob! and thanks to Jonathon, Alberto and the other staff as well! \nKeep up the great work!", "business_id": "AUDuCSWYzzRP3H2w7TxtuQ", "stars": 5, "date": "2015-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Hl5uZFY91JZWTk3jgZPapg", "review_id": "4LzTWVLJPUUiFPjFyH45ag", "text": "It all started innocently, take the wife out for a nice dinner for her promotion.  Let's go somewhere new, downtown (uptown as they call it in Charlotte), some place fancy.  The capital grille fits this criteria.  From walking into the place with the dark woods, white linen table cloths, well dressed patrons.  It all works.  The waiter approaches our table and we are ready to start the experience.  He recommends a wine from the extensive wine list.  Lets talk about that.  I am a wanna-be when it comes to choosing a wine.  When I see a list as big as this, my first thought is wow, I think I'll get a beer!  Our waiter was an expert.  After a couple more visits we learned that pretty much everyone there had an excellent grasp on choosing wine and familiarity with the wine selection.  Our selection was a white which was absolutley perfect.  Started with the Lettuce wedge, nice giant piece of iceburg lettuce, ice cold, plenty of blue cheese and bacon and perfectly ripe tomotes.  \nThings were looking good.  We went light on the apps the first time since we had a feeling that the meal was going to be huge and we wanted to survive!  Our steaks came, filet au poivre, of course!  Done perfectly, rare, cream sauce was out of this world.  Meat so juicy and tender you don't need the fancy knife they give you.  We had the mashed potatoes and the au gratin potatoes for sides.  These were to die for.  Low fat I'm sure.  For dessert the recommendation was made to order the cheese cake.  Wow, I had no idea.  So rich and creamy we ate the whole thing.  Uncommon considering how much food was consumed this night.  \nSince that first visit we had been back several times.  I highly recommend the Capital Grille, prices are high as you would expect.  But the food and service are well worth it.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2006-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "qso-MUrwGtZGhKdE0gHPJw", "review_id": "8B4VXQSdnPbnw3JALH-SKg", "text": "I would give this place 2 1/2 stars but that wasn't an option so it got 3 instead.  The only reason it got 3 stars was because the desert, proscuitto wrapped mozarella & lobster mac & cheese were very good.\n\nOne thing to note is that the proscuitto wrapped mozarealla is served hot.  I thought it was going to be cold and one of the reasons I ordered it is that I thought it would be a little lighter.  As it turned out, it was very heavy.  Tasted good, though.  It just wasn't what I expected.\n\nSpeaking of something that wasn't what I expected, if I had to rate this place based on the steaks alone, I would have given it a one.  Frankly, I've gotten a better steak from Whole Foods.  Also, the steak came with a pool of steak sauce on the side.  If I'm paying 47 bucks for a steak, I don't want any sauce near it.  My wife's filet actually had some sauce on top of it.  Personally, I would have asked for one without sauce.  The menu doesn't mention anything about sauce, they should really let you know about it in advance.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 3, "date": "2013-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qLK1Na2Ep0qSyQt6qr2N3A", "review_id": "nFLrWxRB4NTOgi2_YD4LtQ", "text": "Oldie but a goodie. Even for a high end chain, this place always pleases. Choose here over any steakhouse in town.  Fleming's sucks.  I've never had anything less than a great experience here.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2015-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "g5fl3cn0SZFX9s7_AN8Afg", "review_id": "q7rC736olbv2KtliHyo0pA", "text": "Prime rib a 4.5, Grouper is outstanding, Steaks are 3.5 sometimes 4 (but always cooked perfectly), good (but overpriced wine list), sides are typical steakhouse...BUT.\n\nService is absolutely outstanding.    Whether it has been a client dinner, my step mothers birthday, or a nice dinner with the kids the service just rocks.", "business_id": "1gKBusJMk66ypwEKF0vOAA", "stars": 4, "date": "2014-01-10", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "uJ1NGgNQvWbHZ7Zxm4EfKA", "review_id": "34uGh-Xp6ZeLIO3-Nb1C_A", "text": "I creepily eat here probably once every two weeks.  What can I say... there cheese fries are fabulous, and their salads are yummy.  \nI also recommend getting the No Rules Pasta with no protein (vegetarian) and sub the normal sauce for the fuego sauce.  The sauce is spicy and absolutely perfect.  \nIf you go in and there is a long wait, it is good to remember that the bar is first come, first serve.  I never wait longer than 5 minutes because I typically get a seat in the bar area.  They also do call ahead seating, a definite plus.  So if you are going on a busy, just give them a buzz as you are leaving the house. \nThe staff here and be hit or miss.  When they are good, they are GOOD and when they are bad.... let's just say I have a few that will not be my server again.", "business_id": "NHIWIA3g7oLZ5gW1tpjf8w", "stars": 4, "date": "2010-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "CBGnrydUZQ2U9NHydP0lIA", "review_id": "vLIGGaPY_lZ1hIvMp8Etuw", "text": "Calamari was superb! Also had the 3 cheese pasta with lobster and shrimp. Service was excellent as well. This is a great lunch spot.", "business_id": "i3HfmM-evIOLpJ2wuTZVKA", "stars": 5, "date": "2014-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ncx_k2YtNxRwaCRtMUWDkw", "review_id": "Puihlo7ax4Sf3wVEE430mQ", "text": "Uh why was I here? Oh that's right. I was meeting up with friends. Long story short, McG's is a local watering hole. Nothing special about it except the bartender who was awesome. I asked for a dirty martini. Bartender says \"how dirty\" I said filthy and it was. Cheap prices and cold beer make for a great time with friends and if you get a little too woozy you can stumble from the watering hole at the bar to one of the dumpy holes next door instead of driving. I wouldn't recommend that though. Staying at the dumpy holes that is.", "business_id": "zgxNUxS8eIyhkrXegDLtjQ", "stars": 3, "date": "2014-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "vLFk6nslFe35NKvlU2Tz9Q", "review_id": "LQs3aXjhBNnd9Budackrjw", "text": "Not a bad idea. At Alexander's Steakhouse, you pick your own steak and cook it at the community grill. \n\nFor starters, the steak's quality here is just okay. It's not the greatest, but I've had worse. And for okay steak, I feel they are overpriced in general and not just for college students. \n\nTheir steak challenge is pretty interesting though. If you can finish a 3 lb (48 oz) along with the side dishes and salad that comes with this challenge, you win a free meal. The rewards of this challenge has changed from time to time (i.e. the steak is free, you get a free steak next time, or you get 50% off next time, etc). I've tried this before. It was pretty fun and I got my picture taken and placed on their wall. \n\nOverall, Alexander's is a good break from the national chain steak restaurants. You'll pay a little more than you want for some decent steak. Oh and as a warning, if you can't grill a steak, then you'll have to pay an additional fee to have the chef cook it.", "business_id": "562AuYjOuZwtTbS1UYhY6Q", "stars": 3, "date": "2012-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "9_JJfVGDaDWnoMrKC7GI1A", "review_id": "E7ApwEyplt92PAuH49hJaA", "text": "Texaz Grill was recomended to me by a friend and I was not dissappointed!  The atmosphere is that of the late 70's and it looks like nothing has been done to it since.  You get the feeling that you're eating in a roadhouse bar.  The steaks are cooked to order and you won't pay more than $20 for one either.  The portions are so generous I wasn't able to finish my meal.", "business_id": "18TUn9oiW0k0yB6lheiOvw", "stars": 4, "date": "2006-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xPyOv6xUcywHaLEPJ4HWQA", "review_id": "C1rncpEKNUF9nA7WcdXJbQ", "text": "I agree with Pauly C. I disagree with his review being GTL. I am also from Texas, the meat beneath the breading in the chicken fried steak was absolutely atrocious, the gravy was decent but not the best I have had. The bread was deplorable, I've had better day old bread from fry's. The bbq sauce tasted worse than krafts original, and this is supposed to be a homeage to Texas BBQ and food. I would never go there again even if I was starving and paid to eat there. For real bbq visit Bobby Qs on 27th ave and northern, I have yet to find a decent chicken fried steak in Phoenix.", "business_id": "18TUn9oiW0k0yB6lheiOvw", "stars": 1, "date": "2010-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "kG8jkVFgOAOq6Ht6RvAjEQ", "review_id": "veM1RO2uZW7qtughbQKpRA", "text": "Fun, friendly, prompt service and tasty food? What's not to like? Portions here are definitely Texas-size so you are not going to go away hungry. They were very accommodating to our large party and our server was excellent. \n\nParking here is HORRIBLE though. The restaurant is on the corner of 16th St. and Bethany Home in a rundown strip mall. The spots themselves are short and it's difficult to get into and out of the lot. Not sure if there is a special trick to parking here but please keep in mind when you come that parking is sucky. \n\nNow, bear in mind when you come here, there are not many \"healthy options\" on the menu. And they are not ashamed of this at all. They embrace the Texas size deep fried, heavily battered foods they offer unabashedly. As someone who is careful about what I eat, I did manage to get a salad and felt good about it. All the dishes came out at the proper temperatures and were freshly made and nicely plated. \n\nLooking forward to going back in the near future!", "business_id": "18TUn9oiW0k0yB6lheiOvw", "stars": 4, "date": "2013-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QmRB1SLdb-zAsE9h4PS_TQ", "review_id": "D5z54Ne46_1g6WHh3Vu9ig", "text": "Love the food. You must save your appetite though because the portions are huge! Chicken fried steak is the bomb! Especially with their jalapeño!", "business_id": "18TUn9oiW0k0yB6lheiOvw", "stars": 4, "date": "2014-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mb08bxWhU3dmA_iKHJ2Uiw", "review_id": "5wnrW7Vre-1x9bR-X4g-Yw", "text": "I wanted to grab something to eat on my way home from work . I stopped by TEXAZ grill . I was slobs so I sat at the bar . I had the rib eye. It was cooked to perfection . The taste was amazing . Very tender and juicy. My mashed potatoes and gravy were yummy !  So creamy and the gravy was thick and had lots of flavor . Tammy at the car is always so nice and attentive .   Can't wait to go back", "business_id": "18TUn9oiW0k0yB6lheiOvw", "stars": 5, "date": "2015-12-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "e3LzMIrC6FtN9QeTvWiGag", "review_id": "vvb9tk6JZxp0t80yjw0XVA", "text": "WOW.  As others have said, I have no idea how they stay in business because the place is completely dead.  I went on a Sunday night around 7pm - granted, not the busiest time for a hotel restaurant, but we ended up being the ONLY party the entire night.  That's 2 cooks, 1 server, 1 busser and 1 bartender (and probably 1 manager somewhere) on the clock for me and my partner.  Yeah, not gonna work unless the hotel heavily subsidizes their operation.  I asked our waitress if it's always like this and she sort of said yes, but with occasional exceptions like when Willie Nelson came in and tipped her $500, which almost paid her entire rent that month.\n\nThe food is outstanding - I have not a single complaint on anything.  We ordered salads, soup, burgers and dessert and everything is SO good.  The price was decent with my restaurant.com coupon, but even without, I would have just skipped the dessert and still come in around $50 for two with tip.  It's well worth it.\n\nAmbiance is nice at night - all tables candle lit and a nice view of the hotel's pool if you sit in one of the booths.  I'd go back in a heartbeat if I lived in Phoenix.  I sincerely hope they beef up the advertising and get people IN here, because it's worth it.  I suspect in a more visible location there'd be a line out the door, but hotel full service restaurants are always tricky.\n\nIf you have a rest.com coupon, use it NOW because they stop accepting them as of 1/1/13.  Oh and by the way, the other pictures users have posted don't do the place justice.  It's much nicer than those look.  Bon appetit!", "business_id": "bewtZL-VV1oeGUdAhHVz6Q", "stars": 5, "date": "2012-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iwLGuUgpEpVh8R7RgSmh-Q", "review_id": "Y1wWyQiO6icuxmgomiPnDA", "text": "Soooooooooooooooo! Good! And the service was awesome as it should be since there is nothing cheap about this place ha! But it it is so worth every penny! My mother and I went for a celebratory lunch for me landing a new ridiculously awesome job with guess who...YELP! ha! \n \nWe both got the lobster roll plate complete with a lobster bisque and french green beans! We were craving lobster good you tell!? Let me tell you they do not skimp out on the lob meat either the roll with out a doubt has what seems to be the whole lobster in it and the bisque is to die for! If you order it make sure you get it with the sherry that they offer with it. \n\nBest place for lobster and steak hands down...besides Ocean Club at Kierland lol", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2012-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Wd1is2Pjwv4fbYhS_snn3A", "review_id": "WLtdncovGGbH0IPAb7Uotw", "text": "I would recommend that you try the lamb chops or Filet Oscar if you've never been here.  The carpaccio is also a must try.  Never had this dish before but it made me love the stuff.  They have a huge selection of wine to choose from and the ambience is very relaxed with dim lighting and jazz music playing in the background.  I always come back because they never disappoint.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2014-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w4ShwIy38e0EjhrjVZ2M2Q", "review_id": "R0zFq74l5tPEji_GT-L5Dg", "text": "Wow just wow!  Dry rub aged porterhouse steak was tender juice and just melted in my mouth.   Desert was unbeatable.   They killed their cheese cake honestly better then cheesecake factort. The only complaint I have was it took forever to get our food.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 4, "date": "2015-12-11", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "VNEqps27mp8-gTqTfzg7yw", "review_id": "OXmGQvOqiULJlLPGgGW0jA", "text": "We make it a tradition to come here whenever family is in town. So I've probably been here atleast 10 times.\n\nLove their steak with buttered plates. We've had it before where the streak wasnt cooked to our satisfaction. But after being there so many times I know how to order it. Sweet potato casserole is excellent. Cesar salad is the best I've ever had. On this occasion the wait staff was very friendly, but I've had it before where they are like buzzing bees. I usually like to have tea after dinner which is always nice. \n\nThe atmosphere is good. It is nicer to sit in the main dining area near the windows instead of the side room.\n\nAlso people if you are going to spend hundred dollars on dinner, don't cheap out on a babysitter. Nobody wants to listen to your whinnying little brat kids who can't sit still. Ruth Chris should have an age requirement!\n\nI've been to Mortons twice. Once in Chicago and once in Phoenix and both times it wasn't as good as Ruth Chris.", "business_id": "iDoigI3605ixHl_qHly3Tg", "stars": 5, "date": "2011-01-01", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "IXves_c7LYInXbYIc1mNdw", "review_id": "QQWCqY81PnCktMFDU-ByFg", "text": "Came in at 1:25pm.. On a Friday afternoon , there was a handful of people at the bar and only 2 groups of 4 .. I came alone and say next to the 2 groups of four , I got completely ignored for 10 mins and said something to the host about did she let anyone know I was here... She apologized and I said I'd sit at the bar ... I ordered what I wanted and the manager came over and stated that he was sorry I had waited and said my lunch was on the house .. The bartender was extremely prompt With a greeting , getting.a  Drink for me and handing me a menu . Megan is the bartenders name... Since she didn't ignore me .. What it costs for the lunch ( about 30$ all told) will be her tip", "business_id": "4mZ__NR8jLD1k0rYpSbplA", "stars": 3, "date": "2013-12-10", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 4}, "user_id": "FbdB9KXyuvT8rC_zmqRSuQ", "review_id": "J7hTZkJMotk48h505ibc-Q", "text": "It was real treat finding a local restaurant with so much history and tradition. The Stockyard is a landmark and I'm so glad I dined here!\n\nOur waiter was really informative since he's a native of Phoenix and knew the history behind this establishment. Check out the the beautiful hand carved Mahogany bar in the saloon. It's pretty amazing that this sits on what use to be the largest cattle auction stockyard in North America. This stockyard would pass 40,000 cattle through here per daily during cattle auctions.  Enough history on with the food.\n\nI made reservations for 7:00 pm and we were seated at a plush leather booth. I really enjoyed the decor here from the stain glass to the large ceiling lamps which contained hanging branding irons. \n\nWe were greeted with a relish dish, baking soda biscuits and corn poblano muffins. \nThe raw veggies were fresh served with ranch dressing and the biscuits and muffins were warm and incredibly delish.\n\nFor my main entree I chose the 12 oz prime rib which actually seemed larger and was a thick cut. The entree included soup or salad and a side which is a rarity now a days with all the absurd priced Ala ca rte steak houses. The house salad was solid and the blue cheese dressing delicious. My prime rib was cooked to perfection - medium rare with hot Au Jus and the potato gratin was also delish.\n\nCurrently The Stockyard was offering the centennial dinner which was a bargain at $40.00 it included a incredible tasting pear salad, campfire sirloin steak with whiskey peppercorn sauce, grits, cowboy chili made with Chorizo and roasted corn. The dinner included dessert and we went with the warm pecan pie with bourbon flavored whip cream - OMG it was the BOMB!\n\nOverall a great dinning experience with excellent service and quality. I would definitely return here again.", "business_id": "7U8TYNW4Mvx6m3zexsO0sg", "stars": 5, "date": "2011-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "uh3CGDPo8SxcWPwN4Y_Geg", "review_id": "thmLvONoE1X7mpda36saXQ", "text": "Excellent food, pricey, great waitress, empty the night we went. It was well worth the money once.", "business_id": "7U8TYNW4Mvx6m3zexsO0sg", "stars": 4, "date": "2015-01-01", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "pIm17SVRo8IdhGoBD4qbnA", "review_id": "94TxZLKW-VEFEJ_Je_3AIQ", "text": "We ended up visiting this restaurant one day, after our barista at Starbucks mentioned how the patrons at her 'other job' weren't tipping well, forcing her to hold an alternate vocation at the coffee giant.\n\nSo we show up later that evening.  Anyways, the decor is rustic but outdated.  The menu is limited, and you have no options.\n\n\"What do you mean by no options\", you ask?\n\nWhat type of salad dressing would you like?  Ranch?  Not a fan of Ranch?  Are you sure?  Because that's all they have to serve with their cheap iceburg salad mix.  And to spice things up a bit, they throw in a few whole cherry tomatoes.\n\nAnd do you like corn on the cob, and diced sweet potatoes sauteed in butter and brown sugar?  I hope so, because that's all you gonna get.  Sound appetizing?  Sweet and buttery concoctions making their way across the plate toward  your meaty centerpiece.\n\nMy wife ordered the 'Deputy' Prime Rib, which was the most un-flavorful piece of meat she recalls having, and the au-jus being just warmed beef broth, void of flavor.\n\nI ordered the 'Trail Hand' T-Bone, because I like T-Bones.  You should just call me 'T-Bone'.  Anyways, I asked them to serve it rare, because I had a hankering for a juicy cut of steak.  It was incredibly bland, and destitute of the juice I craved.  It wasn't dry.  More like a raw piece of steak.\n\nWanting to salvage the evening, I scanned the dessert menu for a hidden gem.  Strike three.  The apple pie we chose was unanimously nominated for the worst ever.  The dough was either overkneaded, or cooked in a microwave.  Kind of stretchy.  A few bites into this, and we knew... prognosis negative.\n\nThis review gets 2 stars, with one of those stars coming from the entertainment.  Yes, the one bright spot was the live music.  The band sounded great.\n\nThis trip turned out to be a complete WASTE of money that would have been better served back at the Seattle Conglomerate.", "business_id": "wZwZcte4lcbu51NOzCjWbQ", "stars": 2, "date": "2009-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vW8aeiByI-cAiamhenoSYA", "review_id": "pXV2in7fvxXSJeoI7_6jcQ", "text": "Meh meh meh....not much more to say. Would not go for the food however if you go for drinks and an awesome view of the city you will enjoy.", "business_id": "wZwZcte4lcbu51NOzCjWbQ", "stars": 2, "date": "2012-01-17", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "S9Ll5ARdvPp53H5gv4GYCA", "review_id": "UtDyrSJWf8M6T3wsasRpKg", "text": "I will NEVER come back here! Amber, the server, was rude and disrespectful from the moment we sat down. I could receive better customer service from a drive thru window. Our order got messed up and rather than finding a solution, she continued to spit out excuses. We received dirty dishes and never got drink refills. If I had not been sitting next to a water container, we would have been thirsty all night. She gave dirty looks after we approached the manager regarding our issues. As we were leaving, she starred our party down while walking out. The food was not the greatest. I would have enjoyed it more if I at least received satisfactory customer service.", "business_id": "wZwZcte4lcbu51NOzCjWbQ", "stars": 1, "date": "2013-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3seVqyQ8L9y99pw0PLNxqA", "review_id": "AvB-vpjz1YFHesMYsm47nw", "text": "I went here with a large group of people and was easily accommodated. The service was great and the atmosphere was outstanding. Unfortunately the food just wasn't that great. My steak was very dry and the vegetables were mushy. Maybe the cook had an off night I don't know. If you specialize in steak you really need to cook the steak right. Would I go back, sure I would. The atmosphere and service warrant a second trip to give the food another try.", "business_id": "wZwZcte4lcbu51NOzCjWbQ", "stars": 3, "date": "2014-02-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "uHCqQLhR5RwPBIbSQ1cVNg", "review_id": "iDxrUdGs6lL96mUYuMWS1A", "text": "Absolutely terrible. Terrible food, terrible service. \nWe went to the Rooste last September when we were staying at the Grand for my husband's birthday and were disappointed from the moment we walked in. We went to the hostess stand and stood there for 3 minutes (I timed it) before one of the four hostesses even looked up to acknowledge us. The girl that helped us acted like she was doing us a favor by allowing us to eat there. It was a busy saturday night, so we had to wait a bit for a table. No problem, because we could grab a drink at the bar and then let our kids go down the slide a few hundred times. \nWe get to the table, order from a very nice but stressed out waitress. After much more endless sitting and waiting, and joking with the table next to us about the ridiculous wait, our food gets dropped off by a food runner. Not dropped off to our table, mind you, but the runner puts the tray of food on a stand nearby, and tells us that our waitress will be by to serve us momentarily. After more waiting, we served ourselves, ate, and put our dirty dishes back on the serving tray before our waitress came around to see us again. Glad we didn't wait to be served. The food was airline-quality. We both ordered the steak and enchiladas (a weird combo to offer but it sounded good at the time). I could have easily made something better at home. Maybe the point of having you wait for so long for your food is to make you starving enough to choke it down. \nWe were so over the whole experience by that point that we asked for the manager. What a mistake. Most managers in a customer service setting are cordial to the customers and care about their business. Not this guy. He stormed over to our table and practically yelled that they were very busy that night, and we should be more patient. We hadn't even explained our issue by that point. As my husband tried to explain the numerous issues that we had encountered from the rude hostesses down to the nonexistent waitress, the manager seemed to get angry with us and again told us to be more patient. To which my husband replied \"Are you f***ing kidding me?\" Well, that didn't sit well with the manager, who said he wouldn't even speak to us further if we were going to cuss at him. I took over and asked us how he would feel if he were in our shoes. How he expects to be treated at a restaurant, and what kind of service he expects when he dines out. He simply said that they were just too busy that night and there was nothing he could do to help us. We weren't asking for anything, we were just trying to make him aware of all of the issues that we had encountered so he and his staff could try to improve. \nI've had poor service at other restaurants, but I've never had a restaurant manager act like such a jerk. It's no wonder that place has such bad reviews. It's terribly run, and the food is terrible. The only thing it has going for it is the slide and the view. \nDon't waste your money.", "business_id": "wZwZcte4lcbu51NOzCjWbQ", "stars": 1, "date": "2015-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZLenbJsbMXJxX4qSd3MzsA", "review_id": "dIxU3b2D0uD9BtuhXLOHKg", "text": "I have been eating here for over 10 years and love it every time I go. From the nuts to the steak, I'm happy! I usually order the same things all the time, I have tried most everything on the menu and haven't found anything I'll spit out! It always crowded so get there between 4-5 p.m. or have a seat after that and chew on some peanuts while you wait for a table. It's a good place for the picky eaters and kids, or if you like your salads they have those too. If you don't like noise and have an issue with stepping on peanut shells STAY HOME! \n\nFeel free to make sure they cook your steak perfectly I have had it happen to me a few times....*new cook*  equals raw steak YUCK! No mooing steaks for me please. Send it back til they get it right or don't pay for it! \nAnyways, enjoy have a good time and be relaxed when you go and you'll be fine!", "business_id": "Mm8x_jzeLrWlvDEnqhuCBQ", "stars": 5, "date": "2009-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "gvbkgFyu7o1WpPA70_ec-Q", "review_id": "1MtuAY6rZljJ0ACMDVSnUw", "text": "A great place for a meal. They have a great bone in ribeye for a steak cooked in a restaurant. Me being a grill master when it comes to steak means I always have to compare to mine when giving a review. It is a good steak. You will have to add more salt and pepper to your own taste and that's ok since they are trying to please all palates, but that makes them lose a star. A meal purchased at a restaurant should always be seasoned properly.", "business_id": "Mm8x_jzeLrWlvDEnqhuCBQ", "stars": 3, "date": "2013-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mDiyWrjgnDO7IE70cAI3OQ", "review_id": "_q67NyLbZjEtG3ezizeoGg", "text": "If you sit in the bar area, you shouldn't have a problem.  One night we got stuck at a table outside the bar because every seat was filled and had the worst experience ever. Waited 15 minutes for water, after waiting 10 minutes to be acknowledged..... Yeah, ..so just -1 star for that experience. But if you go sit at the bar with AJ or Kaleigh and you will be in good hands.", "business_id": "bNGR0iQTx8hXRmQv4hV5gw", "stars": 4, "date": "2015-02-27", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "TgYtiwVVa9O-mRC1FgFtlw", "review_id": "A5kdcWiIvzgsdTXEh0LHGw", "text": "Good place and we will go back.  The croissants are to die for, but everything else we had was good. The atmosphere is very loud and it is a bit like a sports bar.  Our server was a little stressed, which caused her to be a little short at the beginning, but she settled in and was fine.\n\nBiggest disappointment was the lack of choices on the menu.  Couple of steaks, couple of salads, some chicken options but that was it.  No real seafood options, no pasta.  I liked what I had, but wanted more variety.", "business_id": "Rus-ewyqLj2D1RlqK-je4w", "stars": 3, "date": "2014-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "hMJBbBUjxWk3qwdoMMyYKg", "review_id": "EI8-du7nZguggz6Oy0n3lA", "text": "Steak was under cooked, staff was slow, and to top it off, we hear the manager arguing loudly with the elderly couple across from us about how they didn't know what medium was. So what you're telling me is we ordered two steaks cooked the same way and we're complaining about the wrong one? The one we think is good is actually over cooked?....", "business_id": "0VyvlA1mZsDoYd3kkRjevA", "stars": 2, "date": "2014-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cV2gtPPGzATl7VxCU6IXaw", "review_id": "oYCl_swZ43EW0hL8777BbA", "text": "What a joke. First we had a reservartion for 5 but they all but insisted we sit at 2 different tables. The service was horrible. My fiancée had a coupon for a free birthday steak. It was so thin you could see through it. For the first time in 48 years I had to salt my $31 lobster tail. Seriously I had to season a $31 meal?.  My future in law ordered hers medium well and it was all but rare. Texas Roadhouse here we come cuz we have no reason to ever go back.", "business_id": "OreqUicD2AP5QW2HblqRoQ", "stars": 1, "date": "2014-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AHzdtfdMvq7hWvie41DVQA", "review_id": "rze3lb9BWMhmwd0JDwrNfA", "text": "Great food! Steak was perfectly done! And Awesome Service! I will be coming back for sure", "business_id": "r6zT-YqmOtHg8BJT3LLzfg", "stars": 5, "date": "2014-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wD2cLd5Yk6rn6o6L1lz6hg", "review_id": "4Sb5ZLRQnj_Wkf1KpAW1VQ", "text": "My friend & I celebrated my birthday tonight at Black Angus on Chandler Blvd.\n\nThe potato soup and shrimp cocktail were so yummy...\n\nBrandon - our server- made my birthday special with his super service,\nfriendly personality and his strawberry shortcake surprise with a candle.\n\nVery pleasant dinner", "business_id": "OjNTZTZ6HYQghJN-3jmwnA", "stars": 5, "date": "2015-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "cBJqlNzyoJFak3_XRe2bvw", "review_id": "Lgd3zRYwl2XaFiDEViRGJw", "text": "After signing up for their e-mail list, I was pleasantly surprised to find a $25 coupon sitting in my e-mail for my birthday. I had only been to the Keg once before (a very long time ago) so I was very excited to try again and take my boyfriend, who had never been. We did go on a weeknight (coupon stipulation for weekends) but liked the fact that it wasn't as hectic and busy as on a weekend night. Since it was my birthday dinner, my boyfriend I got all dressed up and went out for a nice dinner.\n\nWe were seated immediately at a spacious booth next to a large fireplace. The ambience reminded me of an upscale lodge. Our server was very attentive and charismatic. He made our experience fun but not overwhelming us with unnecessary visits to our table. We were given a loaf of wonderful bread to start. Our server made awesome dinner selections, including my boyfriend's filet oscar entree. I went with the 10 oz filet mignon and a side of steamed veggies. We ordered our steaks cooked medium and medium rare. Both were cooked very well. Everything we ate was top notch!\n\nThe best part comes with dessert! The GM came over to our table and not only wished me a Happy Birthday with his adorable baby boy in his arms but gave us a free Miner Pie. OMG it was incredible!! I think the idea of giving us that kind of service was better than the actual pie for dessert.\n\nFor the food and service we received, the prices were on point. The Keg is not a cheap place but is very delicious and service was great. I will definitely return and my boyfriend even said he would return for his birthday dinner in the summertime :)", "business_id": "xMK01ZbVUYLLoyqoeWAIVw", "stars": 5, "date": "2013-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "undo3etIGzALcxoV8UHIPQ", "review_id": "nHZYz7ycb8HSo7traM9aGQ", "text": "I was not blown away with my meal. I ordered a NY Strip and it came with a side. I ordered it medium rare and I received a well done steak. I sent the steak back and I got a new one when most everyone at my table was finished. A little disappointing, expected a place that charges 32 per steak would want to get it right the first time. The service was good, but she disappeared shortly after we got our plates. I was comped a free drink for the hassle. I will not go out of my way to come back.", "business_id": "xMK01ZbVUYLLoyqoeWAIVw", "stars": 3, "date": "2015-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rL3dPeKDTybG_ct9OCXGAA", "review_id": "Yrb-4wel0PzjtxJE6mxosQ", "text": "This a review highlighting Flemings Event hosting skills-\n\nI had a luncheon/seminar here on yesterday and was thoroughly impressed with both the outstanding quality of food and excellent service. Flemings was closed to the public during this event because they open at dinner hours. Although the restaurant was not officially opened all of the employees still kept the same level of service as if it was; as a matter of fact I was graciously greeted by a hostess upon arrival. The actual meeting room was sectioned off in the rear of the restaurant, this would make a great place for any after wedding rehearsal dinner, seminar/luncheon, or even possibly an upscale bridal shower. The wait staff was very friendly moved stealthily to each table during the seminar which is very important (nobody wants to hear a bunch of plates clinking when you're trying to listen to a presentation). On to the food! The salad was pre-chosen by the host which was Fresh Mozzarella & Sweet Cherry Tomato- one word to describe it would be \"AMAZING\"! The tomatoes were perfectly sweet and paired so well with the creamy FRESH mozzarella, I literally thought about this dish when I was on my way to sleep for the night. For dinner attendees at the seminar had the choice of chicken, salmon and of course steak. My co-workers and I all decided to try something different so we could compare. I had the Chicken and was impressed by juiciness and the mushroom chutney it was served with. The Salmon looked delectable and received high praise as well as the Petite Filet Mignon. All the entrees came with fresh Sautéed Green Beans and Fleming's Potatoes (think of the best scallops you've ever eaten, now times that greatness by 10 and you'll have Fleming's Potatoes).  The seminar concluded with a Cheesecake that was sent straight from the Cheesecake gods (it was a huge piece and I was already full but I somehow made room for it!). The Cheesecake was rich, creamy and lightly topped with blueberries (I can't believe I had to go back to work after that feast!). This was my first time at Fleming's I will be sure to come back during normal operating hours so I can try even more of the amazing menu. Bravo Chef and Staff!", "business_id": "0ONypOKIhttBz9IJzBE8jg", "stars": 5, "date": "2012-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yciiu1N6gqG65dSRyFyE9A", "review_id": "5F5RI18YHr4CSMQYnjE6kQ", "text": "Note that I went here for happy hour\n\nI ordered their $6 happy hour burger and at my server's commendation the happy hour carpaccio.\n\nNot sure if it was because of happy hour or not, but the burger I received was sort of small for one with a normal retail of $13.95. Lets break it down into parts.\n\nThe bun- fairly dense and hearty bun that soaked up the juices and didn't fall apart on you when eating it. Not really the most flavorful, but a good base for the burger.\n\nThe patty- smaller than the bun (not a good sign), seemed to be a coarsely ground and actually really juicy. Just the way I like it, except for one major flaw. I asked for the burger to be cooked to medium, and the burger I received was well done. Not sure I like that an expensive steakhouse overcooked it's beef. The patty was a little too salty too. \n\nToppings- 2 small pieces of bacon that probably would have made 1 regular sized strip. The lettuce and tomato were cheap though and there was no onion to go with the burger. (reviewing my photo there was onion,  it was just so small and thin that I couldn't taste it). This level of veggies I would expect in a fast food place. Cheese was nicely melted but wish it had a stronger flavor.\n\nSides- the fries were decent, but the portion once again small.\n\nThe carpaccio wasn't that good to me. I liked the toasted Parmesan bread they served with it, but the beef itself didn't seem that fresh to me with a pale color that was starting to turn grey around the edges. Maybe the beef was perfectly fine, but it just didn't look that fresh to me. Of course maybe I just didn't eat it fast enough either. I felt like I liked the carpaccio at Va Bene down the street a bit more. \n\nSo why did I give this place a 3 star review although I didn't really think the place was that good? Because I think the price I paid was worth the meal I got, no more no less. Not a value buy like I was expecting, but decent overall.", "business_id": "0ONypOKIhttBz9IJzBE8jg", "stars": 3, "date": "2014-01-21", "type": "review"}
