{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M7aa16-iEQbrUVZ98crgRg", "review_id": "QS6FBZqCw4ox3xVgEsE6YA", "text": "They gladly have you come in for a \"consultation\"/ cleaning just to tell you they work on children, but when you try to get actual work done on your child they all the sudden refer you to children's. Good scam to get that cleaning visit from patients but don't do any work. I will be looking for a dentist for all 3 of my boys that actually works.", "business_id": "L0YSY79uzz_FIInvKmvyIw", "stars": 1, "date": "2015-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XiG_IXaXxBKA1yiMX3yTzg", "review_id": "U8ORZ_b9rdaktbY75p-CSw", "text": "I have gone to this Doctor for years, he was recommended to me by my girlfriend.  The office is a bit dated and could use a fresh clean update. The main doctor Petraglia has a straight to the point bedside manner which I like.  What is most important to me is that he is a good dentist, I'm not going there to make friends.  Once I had an emergency dental problem out of town and the dentist that I saw took one look into my mouth and actually inquired about and complimented the work that I had done by Dr. Petraglia.  His staff is diverse and welcoming and my wait is usually reasonable, I normally put a dollar in the meter which is good for an hour.  I would recommend him for sure.", "business_id": "G0lLt7xjXUBhWSoQtexoXg", "stars": 4, "date": "2015-01-14", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "_ZAxaCTK-cquJH00dhfccA", "review_id": "OxxCvKuJEMtAY0syAd9Eqg", "text": "I went here after a car accident that was not my fault. The person I was with was hurt and  I was under the impression that I was being taken with him to see if he was ok.When I get there they forced me to go to a room and be seen after I asked not to be. So even when I met them look at me which they really didn't they said I needed a shot of something to make me sleep and I said no please do not give me that because I had to work the next morning. The doctor that looked like someone from Jersey Shore and grabbed me and stuck a needle in my arm. And I felt like total crap the whole next day at work. I get that ER docs have are numb but they should still have a sense of caring for human, And I should have a right to refuse treatment\nUnethical treatment.", "business_id": "oU38GVk3Kmw7_LOVLSqqwA", "stars": 1, "date": "2015-02-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "3IOQbdQ2z7TKWOnBjAnkew", "review_id": "pfVcFLGqmVDQ8DDf0ydFcw", "text": "Dowd wooed me with its beautiful facilities, spacious women's health club, large pool, bank after bank of treadmills and ellipticals, and lovely views.  I've been a member for a month now, and although the excitement has worn off a little bit, I still get a thrill every time I breeze into the health club area.\n\nI've really enjoyed the steam rooms/sauna/jacuzzi, and the cold lap pool has always had room for me.  I'm still trying to determine the best times to swim, but even when I've had to share lanes, everyone has been accommodating.  \n\nI really love that it's an adult-only facility, and even though it's packed most times that I'm able to go, at least I don't have to navigate screaming kids and parents.\n\nOne point off for the meh-ness of the yoga studio area.  For a gym as busy as Dowd, I would expect the yoga studio to be larger, or for there to be more than one studio.  I've learned to come early in order to guarantee a space on the floor.  In addition, although the classes I've attended have been high impact, they've been low atmo - lights ablazing, music non-existent, less emphasis on form than WorkOut.  I was hoping to be able to get by on YMCA yoga, but it looks like I'm going to have to supplement with real studio visits...\n\nDespite this, Dowd is still the nicest gym I've attended.", "business_id": "b3u-GK6_xj2fJkinzLk_jQ", "stars": 4, "date": "2011-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hc0uqZHsWO7qO8z4vdxQ6g", "review_id": "gCTsj5nSHXjIBcLBwVQhUw", "text": "This is my favorite center city YMCA. It's extremely convenient, being that I work in 2 Wells Fargo. But even when I'm not in the office I try going to this YMCA. I typically go to Body Pump on Saturday mornings, which is a great class, and I frequently swim here as well. While I enjoy the pool at Johnston more (it's a warm pool) the pool at Childress-Klein works just fine, and the aquatics director, who is usually onsite, is very friendly and gives me tips while swimming. It's not nearly the size of Dowd, but it doesn't get quite as crowded and has a more welcoming vibe, in my opinion. I especially like how it has different rooms where you can go stretch after a workout, and not feel like you are in the way. If you can deal with the hassle of parking (they validate within a very limited window of time) it's worth checking out.", "business_id": "M89_KGMzLmdevtAlC_Ufsg", "stars": 5, "date": "2015-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zsx-UQ45_Tn8zyvXKnAAXw", "review_id": "L_tLm8eS6wOMyByhXVzYGQ", "text": "Don't go here!!! Horrible front desk service!! Bad etiquette from what is suppose to be a \"professional\" My husband missed only 2 appointments, due to his career demands. Well, Dr. Almquist decided to not see my husband anymore because of that. No letter, nothing! I had to call to make an appointment and found out that my husband is no longer allowed to see any doctor at that practice, because of 2 missed appointments!! \nWe have NEVER been treated this way, especially from a so called, \"professional\" I am sorry, but that is bad business. What kind of doctor does that?? Not to mention, every time you call, you are greeted by a, \"hold please\"\nDon't waste your time at this office.", "business_id": "siixOX00BhEkUlKg3n06tA", "stars": 1, "date": "2015-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "txFiQcsDnXxV-0IhR8Ymww", "review_id": "jbi7ApYfjpjscYGFqkEXJw", "text": "I had a fraxel treatment done here to remove some hyperpigmentation.  Along with the $1000 treatment (and this was 5 years ago), I also had to purchase the Obagi Nu Derm system.  I was told that the treatment felt \"tingly\" and that I would experience some \"bronzing\" afterwards- like a mild sunburn, but that I would be just fine by Monday (treatment was on a Friday).  \n\nFirst of all, the treatment felt like they were rolling a rolling pin covered in hot needles all over my face.  Anyways, I went home, washed my face with the appropriate product, put on some ice, and slept with my head elevated per their instructions.  \n\nThe next morning my face felt like orange peel and was so swollen I couldn't even open one eye.  I was completely unrecognizable.  Over the next few days my skin started massively peeling and crusting.  It was excrutiating to smile, chew, talk, etc.  I wiped away built up scabbing with sterile water and used antiobiotic ointment on the open wounds, but other than that I could not/would not touch my face- the exfoliating and bleaching obagi system was out of the question.  Eventually my face healed, but I couldn't go out in public for almost a week.\n\nThe kicker? After all that, the treatment didnt work at all.  The hyperpigmentation came back worse than ever.  Of course, when I complained I was informed that this was actually my fault for not following their recommended skin care regimen.  6 months later I went to a dermatologist who prescribed triluma.  1/10th the cost, very little irritation, and it actually worked.", "business_id": "1IxCNVVW9aKbK3BfQpI7eg", "stars": 1, "date": "2014-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RQ2c-aCWvf3yhhm6wURMBQ", "review_id": "8ByB7RojH2xmZ5P8IKjiEA", "text": "I bought some nice plastic frames up in Chicago and needed to have them adjusted in town. I've heard horror stories about places breaking plastic frames while adjusting them so I was a bit hesitant to go anywhere but my optometrist. This place was really nice and professional and they sat me down, did all the measurements and used the proper tools to heat up my frames and bend them as needed. They didn't charge for any of this either. I can't comment on their other services but for . adjustments, I was extremely satisfied.\n\nTheir location is a bit elusive - you have to get in from outside the mall between Bergner's and the food court.", "business_id": "R7oNZOg09xgqLzbqzVQxvg", "stars": 5, "date": "2011-02-19", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "nifQuBZYwHNnGLUU105EZQ", "review_id": "YHQxoj_3Ocqd_0MSodgHUA", "text": "My 13 mo. old had to have surgery. Dr. Gleason was his surgeon, Mary was his nurse and a hand full of other smiling faces help us on our big day. They took such great care of my baby, gave him wagon rides, toys, bubble and hugs and tickles. Not a single complaint.  I hope I never have to go there again,  but I'll be glad if I do.", "business_id": "CAD0tKIttOTTgT7TMJa-lQ", "stars": 5, "date": "2009-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "QnCW-2GEOc7jfY_GCbMgug", "review_id": "-c5Wyn5mj2opzYqOTgz6bw", "text": "I have a tendency to be clumsy and forgetful at times, and yet despite that I have never lost my phone (it stays glued to me at all times). However, I had a 4:40am pick-up for a 6:47am flight and upon arriving at the airport (after a very smooth ride I might add) I left my phone on the seat as I was exiting and didn't realise until just before I was about to go through security. Getting back to where I was dropped off I managed to tell a super shuttle employee about my plight and I was soon directed to wait exactly where I was for van #582. Seeing as my van was already in North Phoenix, they were able to organise a handoff to a different van that was traveling to Sky Harbor in order to return my phone to me. This all took between 20-30 minutes which still left me with enough time to get to my gate for boarding. Best service I have ever had and I am so grateful. Thank you Super Shuttle!", "business_id": "JYMlJkfOShT1PEcFyGPpbg", "stars": 5, "date": "2014-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1gKJ6A2c5r8Ni6g6IhESpw", "review_id": "8lVuOmf0ueosNpBC4v_uvQ", "text": "I haven't had any problems with the office staff or the docs. They've all been quite prompt which is hard for a lot of docs to accomplish. I see Dr.Spieker and have seen a NP Kim a few times and they've been fine. I go for pregnancy care. I've always thought the office looked nice. \nThey are often pretty terrible at keeping the bathroom stocked with urine cups, those cleaning wipes, and TP... Annoying for a place that makes you give them a urine sample every time!\nI have friends who have seen the other 2 docs and they liked them and recommended all 3. (They're all women docs.)\nYes it is on ~12th St & Osborn; I'm not sure if the map on yelp is for another location or an old location but be careful! \nThe building is not well-marked from the Osborn side so go a bit early the 1st time.", "business_id": "eovEq5kDSdf0WF_P_bD2Uw", "stars": 5, "date": "2014-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aOma3hOCEes6PqLJb6kc6g", "review_id": "s_HG35pEMDGxWbwcecQT8Q", "text": "I rarely write reviews so when I do, I put strong consideration into my recommendation. I have been a patient of Phoenix Skin on and off for the around 12 or 13 years. It is the best care and service I have ever received from a doctor's office. Over the years I have seen both Dr. Laris and Michael Richards and they are exceptional. I have developed a lot of faith in their judgement and I can tell they genuinely enjoy helping people. Their two offices are on the opposite side of the valley for me but I still travel over an hour to see them because I feel well cared for. \n\nIn the interest of full disclosure, I should add that in over 10 years, Dr. Laris and Mike Richards don't seem to have aged. To whereas, I seem to have aged exponentially. Probably from having two beautiful children that siphon my life force. Current estimates predict that I will look like a more weathered version of Death Wish franchise actor Charles Bronson within 18-24 months. But for some reason Dr. Laris and MIke are somehow unaffected by the normal aging process. There are two plausible explanations for this. A) They are a member of some tribe of vampire/lycanthrope hybrids that leapfrog through time and remain young, or B) They now a thing or two about healthy and attractive skin. Whether it is the former or latter, they are both great people and are outstanding medical professionals in a specialty field. I really enjoy their office and would refer any loved one to Phoenix Skin and know that they are in very capable and caring hands.", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2015-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "lXMX5mZ6LzNkXiE4ozBIqg", "review_id": "xI9-lXUwT3QZgJ-e9YrMqA", "text": "Great facility! They are professional, extremely thorough and do a great job. I travel from Gilbert and they are well worth it!", "business_id": "gztTQsgq6FJwIoV4P4RNIw", "stars": 5, "date": "2014-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NS0UUK830qCS0SLk8-XqwQ", "review_id": "f3nP9fwbm540az8rr00Uhw", "text": "Friendly and professional staff. I would absolutely recommend them for your next procedure.", "business_id": "IPW-CwmnZaNsG5GnW2EqOg", "stars": 5, "date": "2015-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Cvo43DagW35WI12ohiHTog", "review_id": "HC0oEbgZFksQ44wKZ8YICA", "text": "Last week   was  my first  visit  to  Arcadia Family Clinic .I just went  on Medicare and I picked  this office because  a friend recommended the doctors there. I needed a  new new  PCP .I could  not have been more  impressed  with the  office staff and  Dr.  Shealey .I was seen as soon as  I finished  my  paper work.  Dr Shealey  was  attentive ,listened  to  my  concerns and  ordered  all the  tests  she thought  I needed. There is a  lab  in the  office so blood work was done there , and BTW probably the  first time  I haven't gotten a  huge bruise  in my  life!  I saw the  negative reviews  on Yelp but  I am going  to  give  them 5 stars and could not be more pleased with my new  doctor. I tend to only write reviews  if  I really like a. business. The  negative  reviews on this clinic could  have made  me choose another doctor  so  I am going to  highly recommend this office.", "business_id": "c_PhRjEIA2jRAvWDWsn4Vg", "stars": 5, "date": "2013-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "GKBSHjC6jPKkDGEfj9_MIA", "review_id": "-AMXt87QWM4qrjoCE4hOJQ", "text": "Be Wary of the Lasik Vision Institute,advertises $299-per-eye and $499-per-eye rates for Lasik surgery. But this is intended to lure patients into consultations at which much higher prices are quoted. \n\nwe were there today, my prescription is -3.0 and final cost is  $2499 per eye and after promotion, it is 2000 per eye and 4000 for both, \n\nShame on you Lasik Vision Institute\n\nplus, see this link\n\nhttp://www.quackwatch.com/04ConsumerEducation/News/ew.html", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 1, "date": "2013-12-27", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "keGU21E2CaNMbTiJe6eGQQ", "review_id": "bAvpyvz3tF6u5BV8hXJe5Q", "text": "I saw Dr. Romine's office for a few years for acne maintenance. Eventually I decided to see one of her aestheticians for a light chemical peel.  This light peel ended up scabbing over most of my face mainly on the sides near my cheeks. I went back to  them after it started to get more severe and was told by Dr. Romine that I was actually lucky because I was getting the result of a more aggressive, more expensive peel. What I wasn't given was the proper instruction and/or topical treatment for this type of peel which has subsequently left me with the darkening and scarring of my face. I went back 6 or so months later with these same concerns and was told that I have a skin condition and that it was not caused by the peel. However, I know that it was.  Seeing as this is a dermatology office, I felt confident getting this type of procedure.  I understand that sometimes things don't go as planned, but not taking accountability for these things is a different story.  Maybe I could have taken some sort of legal action, which I did not,  but would like others to be aware before deciding to get a treatment like this from them.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 1, "date": "2013-12-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "wHKz3EjADr9pvyeZ5lPm7g", "review_id": "Vzhuw9Zk0LeBqX5-1sfLag", "text": "I have been going to Dr House for over 5 years and absolutely love her and her office staff.  All my friends and family now go to Dr House also and everyone raves about her.  She is professional, thorough and gentle.  We are very happy patients!\nNote: her office moved to 32nd & Camelback...  make sure not to go to the old office on 44th Street.", "business_id": "XggHmNafIhsrmYQsDMFWfg", "stars": 5, "date": "2013-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Aaafbip-U2aeTXbvinBLiA", "review_id": "IPYAzciXaZorJt-F9EkvVA", "text": "My grandfather stayed at this hospital this past fall.  The staff and doctors were so nice and helpful.  He didn't complain about the food, so I guess it was ok.  I did eat in their cafe which is by the main entrance.  Pretty good for hospital food and cheap! His room was huge, very clean and newly remodeled.  Thank you to the doctors and nurses that took care of him!", "business_id": "Z9ogOCIkHasuKVELa8mQ_w", "stars": 5, "date": "2012-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p2I7Pm_tJ_Y4D8To0q3ekw", "review_id": "xE7DEGn3UWoeQG1ApO2Phw", "text": "The doctor is very experienced and was recommended by my MD for terrible lower back pain I was experiencing. I never went to a chiropractor before.  He did Acupunture for 15 mins and made two quick chiropractic adjustments to my back.  Within one day I was feeling much better, and by the second day all the pain was gone. He is a caring and calm professional, and I am grateful for his help.", "business_id": "7NkGi9bri766Pf2RaTAQow", "stars": 5, "date": "2015-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IyketgiuwVoFry2bbqapew", "review_id": "mUBkSm5RzTdsKZ14n6EYhg", "text": "I have been a patient of Dr. A. Katz for over 15 years.  He is kind, caring, and thoughtful.  I have such trust in him, that I moved my kids from their pediatrician to him while they were in middle school.  His PA is just as wonderful.  They have take great care of my family.", "business_id": "0-KOpYSe9aQTAfM38f47HQ", "stars": 5, "date": "2014-02-01", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "Pk5T0OFCbl8mIKkKYyglWQ", "review_id": "me5iMadB77b-E3PEdNez9g", "text": "I needed just a quick eye exam for my contact prescription and this place satisfied that need.  The least expensive of what I could find in a 10 mile radius as I wasn't willing to spend a ton.  The staff was disorganized but friendly.  Overall, for my basic needs they were great.  They seemed to have a huge selection of glasses but I didn't browse.", "business_id": "066DMYkFeK3ccv_94ijzfw", "stars": 3, "date": "2012-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ry48Bta6spNowOkiMNC_xg", "review_id": "cha86YV-KqXuuje_-HwhyQ", "text": "Never admitted, so I can't give five stars, I watched a friend receive excellent, merciful health care. Christy, one of the nurses was patient, informative and kind.  One of the better nurses I've been around.  I have been around a lot of nurses the past five years in lots of clinical settings.", "business_id": "TZzFRsVLKyiVwhLCCcZZSQ", "stars": 3, "date": "2014-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lLnBArluikBGDqrGmotJ-w", "review_id": "d_8LBW21E09_v6iGWpgyuA", "text": "My experience at Baseline Dental Care was a mixed bag.  In short, I found Dr. Payne lacking in bedside manner and some of the staff were helpful and some were snippy.  I had problems getting my prostetic fitted and both the dentist and some of the staff seemed impatient with me and I had some communication problems with them.  Some of the staff were quite nice though.\n\nI am used to better care and better communication from a dentist and their staff, so I may be spoiled but I can safely say, I have had better!\n\n***LONG VERSION OF STORY***\n\nI chose Baseline Dental Care because they are a part of Dental Works and my old dentist was a part of that group. Sadly the the root of my tooth was broken and infected which meant it had to be pulled.  The way this was handled upset me.  I was in the chair when Dr. Payne came in.  I had never met him before.  The first words he said were \"I saw your xrays\" and he sounded upset which was scary for me.  \n\nWhen I got the news, then I worked with the front office to do the cost information.  It was right before Christmas and I was in pain. Unfortunately, the tooth could not be pulled right away or I would have to go without my prostetic (henceforth called a flipper) and would have to go to work toothless.  Plus I had been searching for a new job and going toothless to interviews and Christmas festivities did not appeal.\n\nI was told that the antibiotics might help with the pain or they might not.  Dr Payne told me that the pain could be unpredicable and I might be in as much pain as I was right at that moment for the whole two weeks.\n\nThen I had made my choices and I was going to pay for the flipper ($700) and try to make it through the holiday as best I could.  I tried to ask the assistant whether I could pay by check or bankcard  but she didn't know.  She went away and I had to wait and wait for someone to come back. I needed to get back to work so I went up front, but the receptionist was busy.  So I went back and suddenly, overwhelmed by the expense and the pain, I started crying.  The front lady finally came back and she was very nice and soothing at that point.\n\nWe talked about the plans and I was told that I would pick up the flipper before I got the tooth pulled and maybe the oral surgeon could fit it in.  If it didn't fit, I would come to the dental office right after the tooth pulling and get it fixed.\n\n(Luckily the antibiotic did help with the pain and I had a nice Christmas.)\n\nI set the tooth pulling for the afternoon Jan 3 the soonest I could, but then I had to re-schedule it one more week after due to work conflicts.  The flipper was supposed to be in that week, but Dr. Payne's office never called me about it. I called them and spoke to them Friday the 4th to make sure it was there, and at that time I let them know I was getting my tooth pulled on the afternoon of Jan 8. We arranged when I could pick up the flipper, on Monday.\n\nOn Monday I came on my lunch hour and picked up the flipper and spoke *again* to a staff member and let them know I was getting my tooth pulled the following afternoon and would come in AFTER the tooth was pulled to fit the flipper if needed.  They said okay.\n\nThen Tuesday I got my tooth pulled.  However, the flipper didn't fit into my mouth so my friend was driving me to get it fitted.  I called them on the way to let them know.  I knew their office closed at 4 p.m. and it was 3 so I wanted to give them a heads up (be polite).\n\nThe staff who answered the phone informed me the dentist wasn't there.  I was very upset and she was very snippy with me and told me I had to come in at 10:30 the next a.m. (which would cost me money as I wouldn't be able to work until after.)\n\nSo upset, I called my old dentist office and begged them to fit the flipper and told them I would pay them money to do it.  They refused but they were pretty mad at Baseline too and called them.  They suggested I go into Baseline the next day to get it fitted and that Baseline would give me a partial refund for my trouble.\n\nI went the next day to Baseline and they did not offer me a refund.  The flipper DID NOT FIT, so they did make me a temporary temporary flipper and sent it back to get fitted, so I figured they were having extra expense so I didn't press the matter.  However, the remaining times I dealt with them the dentist ranged from overly familar (hitting me on the arm and calling me \"woman\") to very unpleasant (lecturing me on how the flipper was the \"cheapest choice\" so that's why I couldn't eat with it).  I found him difficult to work with and I do not think he and I are compatible as patient and dentist.\n\nOne dentist assistant who was pleasant and gentle with me was Michelle.  I liked her a lot.\n\nI think the communication and the bedside manner of the staff and dentist could be much improved.  I am going to get an implant for my tooth and if I need a temporary cap or need the flipper to be modified during that process, I intend to go to another dentist.", "business_id": "yB2wVIEhWnzM1N3B88wJew", "stars": 2, "date": "2013-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "yGNhVELlG1qaBHpZnQ4k-w", "review_id": "Cz787p1rD3Lkv0OTUkgNVg", "text": "this would be my first visit as a new patient. The experience was very good. Well, not the cleaning part as apparently I need to floss more. the dental hygienist was very pleasant, patient, and thorough. Dr. Woodland was friendly, even though it turned out that I wouldn't be helping with Christmas.", "business_id": "BNhnxtafzFg5D3aVBxz7jA", "stars": 4, "date": "2010-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t5KE-rKIpyX6qMHaG_Ileg", "review_id": "O-VvS2Tfpgiqm0mBwIs2gA", "text": "I was referred to Dr. Pratt by my pediatrician for my 3 year old son, who would close one eye when pointing at a distance.  I was so pleased with the referral.   He was great with my son and I felt we got a very comprehensive eye examination.   I would highly recommend him, especially for working with kids.  He has 3 girls of his own so I am sure that helped", "business_id": "MchacUpF1VWbYImddeLsWw", "stars": 5, "date": "2015-12-24", "type": "review"}
