{"votes": {"funny": 0, "useful": 5, "cool": 1}, "user_id": "jykemU4-CaDr-8Lnei-_ZA", "review_id": "QT3MCOoLoT7VUZ38Dd5wMA", "text": "For the price I ended up paying, this place was fine. There was a full kitchen, king bed and TV. I was just surprised at the lack of amenities at the hotel. While I have stayed at other extended stay hotels, I was surprised to find a sign in the room at this one stating that you only got your room cleaned once per week...if you wanted it more often than that you would have to pay for it. If you needed fresh towels, you'd have to go to the main desk to get them. They also only provided a small bar of soap in the room...not the typical soap, shampoo, lotion, etc. This didn't bother me too much as I was only staying a couple days but again I found it surprising not to have these basic things. \n\nThe hotel in general was easy to get to and very easy to get back onto to freeway from. The hotel was clean and the people who worked there were very nice.", "business_id": "zgy27FSnvwdINfk5cXBIyQ", "stars": 3, "date": "2011-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KV8fCgrHqePeJ6OXeYwdAg", "review_id": "K81ugfonGkrYyKCHNmZqcg", "text": "Our stay here was nice.  The staff was friendly, they have coffee and pastry sitting out in the lobby, a FREE shuttle downtown, free parking, free local paper, and the rooms were clean.  We rented two rooms at $120ea. after tax, which I felt was a bit high, but not the end of the world.  The area is safe for a bigger city with an easy drive downtown and to avoid congestion when leaving Pitt.", "business_id": "AJiwOb0s5zpYu0NW7Jvrpg", "stars": 4, "date": "2012-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "TckShYnQa0eD3WQxdoE3GQ", "review_id": "CcpGDgrXxdpxecZDJLvtag", "text": "The reason for this update is the service.  The hotel itself is still beautiful and the food is above average.  All solid four stars.  I was a bit disappointed initially with some of the pre-arrangements.  In the past I was able to have a complimentary room and the fee waived for the coat check girl.  Friday night because the party was a bit smaller than the last they only discounted the room and charged full fee for coat check/ carving station/ etc.  Now, with that being said the service was over the top 5+++ stars from start to finish.  I get there and am running a bit late. I ask the bellboy Eric how long for a shoe shine, he states its pretty much an overnight service.  I tell him I'm in a rush.  He runs downstairs and shines them himself, done in 30 minutes.  While I'm waiting my contact for the night Ryan Hunt sends up a cheese dish with a bottle of above average wine.  The party goes off without a hitch, great staff, good food, some discounted wines and good premium open bar.  After the hotel party we are walking outside and run into Eric (bellboy) again ask for directions to other club, instead of giving them to us he walks us to the club.  One of the girls wanted cigarettes and instead of directing her to the store.  He ran down and bought them for her and brought them back.  Btw, did I mention he was done working for the night and just did this off the clock.  The next morning I get a ring around 11 am in the hotel room and its the bellboy bringing up aspirin and bottled water from a long night prior.  Everything about this place is three to four stars.  My main pet peeves are the valet cost ($17 and $25 overnight).  There lack of flexibility in food/bev minimums, but the service is over the top great or at least my contacts were over the top great with service.  You can't go wrong in Pittsburgh for an event at this spot.", "business_id": "A38wziZJdYoijhC5S6uWCQ", "stars": 4, "date": "2008-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-DwdZHEdm7AGauwF5f3LHw", "review_id": "Cih_Iemx4F4OIZnSFcViUw", "text": "We stayed here for ... (drumroll...) a CONVENTION! They had everything we needed and basic operations were quite smooth. \n\nOne problem, our room didn't have plugs next to the bedside for charging cell phones, and wi-fi is free only for your first 24 hours of stay. Printing in the business office was pricey - they imposed an access fee, plus .99 per page. I suggest walking to the nearby Office Depot for your printing services. \n\nOther than the hotel being technologically behind, it was clean, spacious, and pretty much identical to other Westins where we've lodged. Convenient to the convention center, and a small handful of restaurants. We recommend Sushi Kim, if you're 'bent-o that way'.\n\nFor a short weekend convention stay, the Westin did the job.", "business_id": "bWWrrsPWuoHuAGUCgH8Tyg", "stars": 3, "date": "2012-02-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "VQhwqw106Cyl6Kl-w2n96A", "review_id": "5HhZTliCV-9P1YcJcgh7_w", "text": "Pittsburgh has a Four Seasons!\n\nFrom Paris to Shanghai, London to Bangkok, the care with which this little B&B operation is run in Pittsburgh exceeds the best that I have experienced in any of these cities.\n\nIt may not have the conference facilities of a larger hotel, the business center, or in-house spa, but as a B&B, this is about as good as it gets. \n\nThe structure in which the whole thing is held (do we call it a 'house'?) is old (perhaps we could say it generically to be 'victorian') with decor to match. These are far from our tastes, but they compensate (in our eyes) by taking good care of what they have. The TVs aren't even old flat screens, but they do stock the rooms thoroughly with l'occitane.\n\nWhere this place really shines is in the staff and the food. I actually find this aspect to be _better_ or even _much_ better than many celebrated big-city five-star properties. When was the last time that the night staff pulled some food from the refrigerator (gratis) after a midnight arrival caused by flight delays?\n\nThey make everything in-house and it is all extraordinary. On this last visit, I indulged in their traditional french toast with a side of eggs. I forgot that this all includes an additional course in advance with fruit (not just big grocery store chucks of melon) and house-made cookies and muffins. On each visit, they mix these up. For this December visit, they did gingerbread cookies (of course). The Chef (Jackie), from NYC, could be gainfully employed high up the hierarchy of any top big-city restaurant.\n\nThere is no elevator, so either pack light if you want a room on the 3rd floor or choose a 1st or 2nd floor room. The 1st floor room has double doors so I didn't find it any noisier than the others. You are in a city and on a reasonably busy street, so don't expect the charming home to be continued into a surrounding yard (although they do have an attractive new deck out back).", "business_id": "rUQfZOengMpXFkLvJrNJ3g", "stars": 5, "date": "2011-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZmAhti4tpEv8NHKjQmEtyg", "review_id": "z465XaDbFQdBhS1nDA3ceA", "text": "Nice hotel but inconsistent staff night crew is great morning/day crew  not so great and shuttle is inconsistent sometimes they leave early sometimes on the dot and sometimes late... :/", "business_id": "mAdtkJLHIVjbDnZlc5aQYg", "stars": 3, "date": "2015-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "O7Tv1yixpIslmrE1WnhO6Q", "review_id": "HjbatucsBMmbyqHpkytGew", "text": "Great bar, nice atmosphere", "business_id": "zwwmnQXk8jhFs4wwU8I4Ow", "stars": 5, "date": "2010-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DQ3OenYLjeVBbI6Rc8sxDg", "review_id": "T0lfXOfKBEb0hS6k6KVI0A", "text": "This Marriott is in a great location if you have business in downtown Charlotte and they have done a good job of keeping it up to date and providing value for the money. Parking is not the greatest, but this is downtown in a major city.", "business_id": "fJ72j9pRjLcRzBA_EhB4-g", "stars": 5, "date": "2013-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z4A8tDKtmTtidWGzSba-GQ", "review_id": "l3UP2DzjCatYGeDFMV6kaQ", "text": "Like this Westin better than any I've stayed in. Lobby area is a large open space that gives me a travler-friendly feeling. Staff was over the top helpful and always friendly. Breakfast buffet was really nice each morning and bar area in the lobby was very modern and a nice place to relax. I found the rooms to a nice size, very clean and comfortable. This hotels proximity to the convention center was a tremendous plus. Only down side was the driveway and parking costs. Certainly goes on my lists of \"go to\" hotels when in the area.", "business_id": "4nFqPL-glgDm9v7bZptskQ", "stars": 4, "date": "2011-02-27", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 4}, "user_id": "35JyhZ4RQrXsAqbMnlRQIg", "review_id": "g1n2ufxBdXEWDaVAZVAKug", "text": "When I wrote my original review, I forwarded it to the branch manager of Holiday Inn North American and his office acted promptly on it.\n\nThey have given me their sincere apologies, and offered me 8k hotel points, which translates into 8 Southwest Rapid Rewards Credits, which is about have of a frequent flier ticket.  This is in addition to the half price my part was charged for our overall stay.\n\nThey explained that the Charlotte Holiday Inn is a franchise and independently owned and operated, however they are working with relevant mangers to resolve the issue I experienced.\n\nThus I am happy with their response and compensation, even though it was a harrowing experience, I think we can all look back and say we are better people and hotels for having endured it.\n\nHowever, please read my original review for helpful advice when checking into hotels....i.e. use a credit card rather than a debit card in order to protect your funds.", "business_id": "Fi5sQxROyTLp5qDuYKz6bQ", "stars": 3, "date": "2009-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "TZXYC9Vcw-X__YFS27ooyw", "review_id": "q-regko77xxV6pYEfhGJgw", "text": "One of the nicest experiences I've had when traveling. \n\nRoom was clean, large, ready when promised. Rate was much better than local Westin or other Hilton. \n\nStaff were all gracious, helpful, and kind. I was traveling alone and sometimes (in other hotels) not treated as well b/c of that. Had a govt rate suite and was treated like a VIP even though my rate was less. \n\nFree local shuttle was a bonus. Shuttle guy was friendly and prompt. \n\nBreakfast buffet (part of my room pkg) was good and plentiful. Staff there were also solicitous. \n\nYes, I did hear some sirens. Yes, the gym was very small and the indoor pool postage stamp sized. \n\nI also had an in-room jacuzzi and so I was relaxed and didn't even care!\n\nForgot a piece of jewelry. Housekeeping staff found it and front staff person (Elizabeth G) mailed it to me. Nice!!\n\nI recommend it overall and would happily stay if I return to Charlotte.", "business_id": "cBoFcjuNaWDQ2MP7GgeSBA", "stars": 5, "date": "2011-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3-8slIZZHopVZKy1wEi8Ug", "review_id": "BM0BHsQ0WzNJzjmFmtkgoA", "text": "Let me start by saying that I never write reviews about anything, but I had such a terrible experience at this hotel over the last two days that I feel compelled to warn other weary travelers. Here are a few of the details that make this hotel an expensive dump. \n\n-Our toilet was broken and ran the entire time. \n\n-The shower drain was clogged with something so by the end of a shower you were ankle deep in dirty water. \n\n-The cable TV went out every 15 minutes. \n\n-A group of college kids staying across the hall decided to throw a party (slamming doors and loud conversations in the hall) and kept us awake all night. Walked down to front desk and complained but the staff did nothing about the noise.\n\n-The room was just dingy. Nasty carpet that I didn't want to walk on barefoot, outdated and chipped thrift store furniture and the kind of smell you'd expect in a room that rents by the hour. \n\n\nI'll never stay in an Omni again.", "business_id": "QThlnQ7AvzZwXHKD5DjdCw", "stars": 1, "date": "2013-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "5ipOts06ijHa9dBu-6BM4w", "review_id": "Ffo_z4zE4JL9jdVNC2vQlQ", "text": "Are you kidding me? What an awesome airport!\n\nThere's a pretty huge array of dining options, including *gasp* barbeque! For this Southern boy on his way from San Francisco to Mexico, that was a pleasant surprise. \n\nAlso, the terminals are bright and sunny, with high ceilings, and filled with trees. I got some breakfast, sat on a balcony in a rocking chair, and watched the planes come and go for an hour while I read. It was the most pleasant layover I've had in a while.\n\nCharlotte, you're a winner.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 5, "date": "2008-02-06", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "YoVezApCq3ktB7y9rOE-8Q", "review_id": "P6FkFInCbCxiq4sdXLkZLw", "text": "OMG this is the slowest AIRPORT i have been to in the last 12 months.\n\nI have been in to 15 different Airports in the US in the last 12 months.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 1, "date": "2010-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0KNzreuBdpRwM4OqYRfg1w", "review_id": "y2KHgAq5m1hz13BbItvxXg", "text": "It's big, and nice, and easy to fly through. The US Airways Club by concourse C is very spacious & comfortable.\n\nSucks I have to fly clear across the country just to experience this place.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 4, "date": "2011-01-19", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "n0CdiDXPdUsPsveTGYV5nw", "review_id": "SFFwH30sN3LUfBBgKrKIrg", "text": "Rocking chairs, BBQ and free wireless. If it were not for the fact I often get layovers here longer than it would take me to drive home, I would give it a 5.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 4, "date": "2011-12-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Txn97j3iT4kQLFhJczbM6A", "review_id": "EO3zvvAgTsNa2L_ZUt5v7w", "text": "This airport, while only my host for the briefest of layovers, impressed me. As a hub for many airlines, it makes sense that the facility would be huge and expansive, but it is not as hard to navigate as I thought when I first got there. The rocking chairs are epic, as is the spa facility. There is also a pandora store that I stopped in to kill some time, and the staff are always saying hello and wishing you a safe journey. I encountered the bathroom attendants who have everything from mouthwash to perfume, tampons and deodorant on their table, and make sure that the facilities are clean. They also make sure to let you know they are grateful for a tip...the one in my restroom kept saying \"Bless you for the blessing, Ma'am...\"\n\nThey have plenty of dining options, stores and the amount of glass makes it nice and bright on a sunny day....a very modern and thanks to all the walkways, it is passenger friendly..just know if you see me running to my gate to get out of my way!", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 4, "date": "2012-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PM2jXrlVzik1jDwwahLJJQ", "review_id": "7BbYtKu-2MU3-WIkmboEGw", "text": "It's a nice airport. Pretty typical, long lines through security, full body scan and then some shopping while you wait for your plane to take off. \n\nThere are a good selection of restaurants so no matter what you have a taste for there is an option available. The restrooms are clean and well maintained.\n\nI was lucky enough to have an on time arrival and departure. My only complaint was in the baggage terminal While my plane landed on time, and there were plenty of baggage gate open and available, my flight and three others waited for our bags for more than 30 minutes. No warning, no calls, no updates....just waiting. \n\nEventually, my bags made it and overall I don't mind calling Charlotte-Douglas my home airport!", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 4, "date": "2012-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "30UrC7iHvxkIPfCkl1M2vg", "review_id": "W45wlzot48GUWLlshHzhhQ", "text": "First time there. I must admit that the facility does have its priorities in order. Everything I could see was spotless and well maintained. The place had a wide variety of shops in the concourse for travellers passing by to their next destination. First time flying US Airways was and pleased at the experience. It reminded me of the days back before the United Continental merger. Continental always had consistent friendly service and majority of on-time arrivals. Generous portions of drink beverages and inflight snacks", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 4, "date": "2013-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IxkFiVHEdk7YKbw5DsNhmA", "review_id": "soViuxYsESjR4NY7-pDeXw", "text": "This used to be my main airport when I lived in Charlotte. Now I only see it every once in a while. \n\nPros:\nFree internet\nThose rocking chairs!\nMany quick food options\nGoing through security is usually quick\n\nCons:\nIt has really expanded into a very busy airport, it is way more crowded than it was 4 years ago. Too many people for my liking.\nIt is the hub for US Airways and thus flights in and out are frequently delayed, as I have experienced too many times to count on this airline. I have never experienced so many delays as at CLT.\nSit down stay awhile options are limited. It used to be worse but they have added some. My favorite now is Bad Daddy burgers. Yum!", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 4, "date": "2013-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yI15VsYAgcFOoasstMO4UA", "review_id": "dNft7Ysgxh-IyP4WZUxxwA", "text": "This airport now offers free wifi. That's a big plus in an otherwise mediocre airport.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 3, "date": "2014-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t9M15HbevZ6qNapI6YAw6Q", "review_id": "X67SwVqsBYzBDjCanOH5Rw", "text": "シャーロット国際空港\n\n綺麗な空港で色々な方面へのハブとして便利\n\nアメリカの東西の移動はもとより、南北の移動もバッチリ", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 4, "date": "2014-12-03", "type": "review"}
{"votes": {"funny": 2, "useful": 6, "cool": 5}, "user_id": "H8MEKzNi71Wbl2lZGWPYkA", "review_id": "Lqp4FHJ1UyIJx9YUsa634A", "text": "Busy, busy, busy. The city is booming, the airport is packed and life is good, I guess. Expect growing pains.\n\nFood is overpriced - sandwiches run from $8.50 up to $12.50 for prepackaged Starbucks or Wolfgang Puck turkey sandwiches. and water - smallest bottle at $3.00. Thought I was in Paris for a minute. Coffee stores every 50 feet though, so unless you on a line at Starbucks, service is pretty quick.\n\nNone of the higher end stops we see in SF or JFK, but they did have a Tequileria!", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 3, "date": "2015-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qhjb-I4Z-IffZ81cpUFbuw", "review_id": "v5-aN_vVtV11B22vVorEig", "text": "What's Chicago is to American, Charlotte is to US airways. This time while connecting to NYC saw this guy napping with this hoodie  on a Valentines Day morning.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 3, "date": "2015-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bu63CZuS582VydCYns-14A", "review_id": "Sow9TwKyrIN-xo8WpNZ0LA", "text": "I have flown thru this airport several times over the past few years. I can't comment on how it is to arrive here, check in, TSA, or leaving the airport. Always being captive inside the airport waiting on my next flight I have found this airport to be satisfactory. The center part where the main food court is has rocking chairs and sometimes entertainment. Overall the food options are adequate. This facility does not have a tram or rail system so you have to walk wherever you go. There are moving escalators that help but this is still a sprawling airport and be sure to allow enough time to get from one end to the other.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 3, "date": "2015-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gAfKVJCdYoqGZfcL27yE8Q", "review_id": "eqX4hbcxHNgk8pmFWIzrXg", "text": "Not a great Hertz location and they need much better signage and training.  I have been Hertz Gold Presidents Circle for the past 7 years, so I do know a thing about the car rental process, globally.\n  At this location, they did give me keys and directions to car lot, but signage is poor at night, as worse, there was no one to address my NeverLost  being defective, issue.\n\nBasically, they have a shared lot 1/3 mile away from rental counter, with no visible signs directing folks. \n\nCar was ok otherwise.  Yes, I have had FAR better at other Hertz locations.  Yes I have had far better at other car rental companies.", "business_id": "eThu9hCL8NOjOxswQ-cFSg", "stars": 2, "date": "2013-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Te0TQ7dlvoFEMn4YzUA-pg", "review_id": "4WS8RCb3oFgr1PRbXNSgoQ", "text": "The staff was very nice and helpful because I signed up for the Emerald program which made the return of the car so easy.  The rental location is very close to the airport through shuttle.  Recommended.", "business_id": "t8Dz2luOZ-4NhT8DPxFdqQ", "stars": 5, "date": "2014-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XagqSTueMwxeRGOvp1GG1g", "review_id": "Jq9_L8v-FPHf0IjwiUlsog", "text": "This place is a zero-star dive. In particular, do not eat dinner in the depressing restaurant.", "business_id": "g42cM7kIBsP1o3VBkLtHuQ", "stars": 1, "date": "2011-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "8IQwXKx7Aews-DFVdgB63w", "review_id": "Kfbai8yrQr-yWTVwORGZrw", "text": "My boyfriend and I booked a room on the executive floor for new years. We got here right at check out time and we were told it would be another 20 minutes before the room was ready....an hour later, here we are in our room with a bath tub that the paint is chipping off of and the tv doesn't work. We were charged for a movie that we can't even watch. Highly dissapointed. You would think that with a big name like Hilton, the room and service would be superior. Very lackluster.", "business_id": "CN6AB-R4OLsKxFhQ1Kk68g", "stars": 2, "date": "2011-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pO9xcfK_QTSiUJ1kGq1ncg", "review_id": "KxZQ3RkEJ6139M4lUeuJVg", "text": "I give this place 5 stars. My boyfriend and I drive straight through the night to Charlotte and arrived at 9am. We were seeing a concert that night. We explained that we just needed to sleep and would be checking out by midnight. Instead if making us pay for 2 nights (which is what every other place I called wanted) they accommodated us with a smile. :) really means a lot! They even gave us a room on the third floor in the back corner where it was quieter so we could sleep. \n\nConvenient location. The room was clean, the bed was comfy, the price was right and the staff was friendly. If I'm ever back in Charlotte I will for sure stay here.", "business_id": "EazMTR-bLp8DQgMfUqQMoA", "stars": 5, "date": "2015-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LYL5buYajix8zpd_ACfuGQ", "review_id": "DQrXBW5lceftrxsRiRudIg", "text": "Would recommend this hotel. Beds are comfy, rooms are nice and clean, staff is very accommodating and goes above & beyond what's expected. We loved Tomeka at the front desk :)", "business_id": "ckLRf3lYn9DxmNxd-mu2yA", "stars": 5, "date": "2012-12-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "07JTYHBYrNbcqtrNGu-UkA", "review_id": "1EpfLUx30gtMX_knjU8WBA", "text": "My cab was 30 minutes late -  I didn't receive a heads up from dispatch,  and they were reluctant to give me an  estimated arrival time. I almost missed my flight and will not be taking Union cab again.", "business_id": "5TQQy_x_ArR3_5L5L0fFVQ", "stars": 1, "date": "2014-02-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aYhKsAUQaaRGgdgcZC5XAw", "review_id": "r7B-gUsrVjUMn4dKiFmGsA", "text": "We rented a van to move some furniture from Minneapolis to Madison (in one day) on a Sunday, and the only car rental places open on Sunday in the great city of Madison are the ones at the airport. (Uhaul was way too expensive!)  The polite man at the counter helped guide us to the best deal he could find and even let us cross that little old state line without paying a fee. We rented a van so new it only had 500 miles, it was clean, and it got us there and back.", "business_id": "yCbzzYKkPe1kfeMDdGq03Q", "stars": 4, "date": "2007-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4DfyyWp1zmHgKlHjHht7qw", "review_id": "eutEV3Ub8XGgQ8dzqrf45A", "text": "I have stayed here twice now! I must say the service was great. The 2nd time even though it was within a weeks time, the woman at the front desk remembered me and was very pleasant. No complaints here, and I will def be back to stay.", "business_id": "nYb3nMwhVsmc-hQRXRU4Sg", "stars": 5, "date": "2013-12-12", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 1}, "user_id": "eUZI6rWAFh70lF2O_GDEyw", "review_id": "__tdQ3Dj6KwGIL1Gr7-E8Q", "text": "Way too many fucking issues.   Lets start with the customer service when you call for a cab.  Unprofessional, talk in slang.  I called for a cab and then got a call telling me my cab was there, went downstairs never saw the cab.   Called the taxi service number and they kept insisting that i was the idiot n said well the cab is there waiting for you.  Puts me on hold and tells me 5 minutes later to tell them what im wearing.  I said a black shirt and why is that relevant.  Lady says quietly we're going to send another cab.    I said another cab? There wasnt ever a first one.  She insisted yea there was until she finally admits 30 seconds later yea sorry he wasnt there.  How the fuck can u call me to tell me my cab is waiting downstairs when they werent ever there.     \n\nNow my actual can driver.  First thing he asks can u pay cash? I said sorry i only have card, then he goes, \" can we stop by atm?\"   I said no because im already late enough because of your company.  I know its not your fault but i need to get to te tempe campus for a meeting.    Thia fucker still asks to stop at the atm cause its 2 blocks away.   He doesnt fucking understand i dont have time.   Then asks for directions to tempe campus.  Idiot gets lost and asks to borrow my phone as gps. \n\nFucking whack.", "business_id": "yR3U7jOgoD0V0sGovuyt0Q", "stars": 1, "date": "2013-12-26", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "cMmQsFyrYBv6hIE6NffqZQ", "review_id": "vLnAj_GwVTmb2FEAbWEewA", "text": "This is an interesting property that is attempting to be nice in an area that is a mixed bag of new/old/and just plain worn out.  The hotel is attempting to remodel and is doing a fair job at it.  The furniture is new, beds new and bathrooms remodeled.  There is a no smoking policy, but the lobby smells like smoke and the manager who talks about the non-smoking policy smells like a giant cigarette.  \n\nThe part where this goes bad is the management.  The main manager does not deal well with the public and I'm really not sure how this place is still in business with him running it.  \n\nPay the extra $40 (I did) and stay at the Marriott (Springhill Suites) one block west on Van Buren.  Quiet, clean, big rooms, hot tub, friendly staff, big breakfast, store on site so you don't have to cross Van Buren and worry about the sketchy Circle K across the street.  I do not recommend this NOT-SUPER 8 motel.", "business_id": "BSGcS1EWEkGP2LS1nOZGPA", "stars": 1, "date": "2011-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M8Padhotp8mDiFLEGNg9rg", "review_id": "_2k2zvLjysvM0GC-Ko5Bqg", "text": "wonderfully clean hotel. Great view of Camelback Mountain from our room. Stay here and you won't be dissapointed!", "business_id": "_yGo2ubkwQPXcKrdcURSNw", "stars": 5, "date": "2012-01-11", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 1}, "user_id": "T9YQap5vl8r-tuMlIpEqQw", "review_id": "edgbPP5LvTfOb9F3_2qLZQ", "text": "And my streak of staying in quality hotels comes to a screeching halt.\n\nWhen I'm not vacationing and just need a room to crash in, I tend to be a utilitarian when it comes to hotels. I just need a clean place to sleep and shower and I'm pretty much satisfied. You'd think a hotel by the airport from a national brand would be a safe bet. But no.\n\nFor starters, the neighborhood is just disgusting, and I am not easily fazed by such things. Meth labs would count as urban gentrification. I went to check in on Foursquare and the first suggested location that popped up was PROSTITUTES - HOE STROLL.\n\nThe old building had a fresh coat of paint, so I maintained my optimism. We got into the room, which was spacious and mostly clean. Acceptably so, at least. It looked like it had been remodeled sometime recently, although the carpet had more cigarette burns than the arms of a working girl who can't make Daddy's quota.\n\nI was OK with mediocrity for $49 a night until I walked into the bathroom. The door was literally hanging off its hinges. And the window had been shattered. And there was a smear of feces on the wall.\n\nIf walls could talk, right? These would say GET THE POOP OFF ME.\n\nI was thinking two stars at first, but then overnight, I could barely sleep because the paper-thin walls let in every sound from the whole unsavory neighborhood, from the hookers pretending to enjoy their work, from the drug dealers outside, from what sounded like feral cats in heat.\n\nWe got the hell out of there as soon as we woke up and drove around Phoenix randomly all morning rather than spend another minute in the room.\n\nJust awful.", "business_id": "GF95bWp-19I5YbNtr9VluQ", "stars": 1, "date": "2013-01-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "h7v_M_0-YVpSVZ2WD7FpAA", "review_id": "TLxEkPCLuJJxVZRDP-HQdg", "text": "OK, haven't actually stayed over nite, BUT did u know BIstro 24 (swanky, RITZy bar) has the best happy hr?!  Talk about VIP red carpet treament!  Want to impress someone?!  Drive up to circular entrance drive-way, allow valet to rush to open doors, say you're havig dinner, hand over the keys, and step into another world :-)  Talk about a Great date! Hand shaken martinis, (try the presidential - see? even the name envokes special tmnt), the best oysters in AZ, btw.  Pssssst, this was quite a secret spot, until now!", "business_id": "HLQUH1VAw4KbSV-IhxOPEw", "stars": 5, "date": "2008-12-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "7FBFq151YXe1aEnkFqnEKA", "review_id": "6_EO-DNQROplQRC4B3VuxQ", "text": "I was placed here to stay while I was in the area for a training course.\n\nThis place was beautiful.  The lobby area has a beautiful fountain and koi ponds.. and you can't hear the water when you're in your room.. wonderful!\n\nThe rooms were spacious and clean.  I had three sinks.. THREE SINKS!  One in the living area.. one in the bathroom.. and one in the bedroom..  Why I had three sinks?   I don't know but I made sure to use them all.. hahaha!\n\nThey have a free hot breakfast.. an omelet bar.. hash browns.. bacon.. sausage.. french toast.. eggs.. yum! \n\nThey also had the usual breakfast pastries.. and cereal.. and oatmeal.. \n\nThey have an Omaha Jack's Steakhouse.. I didn't get to try it.. but you could have also had room service send up dinners up to the room.  \n\nIn the afternoon.. around 5:30-7:30pm.. they have a complimentary happy hour where the drinks are free. \n\nThey have a fitness area that I didn't get to check out.. but some of my collegues said it was pretty decent.\n\nThe hotel is located next door to a mall.. and many other restaurants.\n\nI only took one star out because the room's heat wasn't work too well.\n\nI would definitely come back and stay here if I find myself in the Phoenix area again.", "business_id": "FQudBiBiz9bGQLF_kK8UCg", "stars": 4, "date": "2009-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Fpp-OmyADfhdKoF9aFE52w", "review_id": "9gKN3MUxPym0hErdErMUQQ", "text": "This Embassy Suites was really only two stars, but they had good pillows which is rare for any hotel, so that earned them an extra star.\n\nThe internet would disconnect every minute or two. \n\nThe ac ran constantly, which caused the air in the room to get too dry. \n\nThe front desk took more than 50 rings to answer the phone. \n\nAt the breakfast me and my family were the only people there. The power trip omelete cook continuously refused to help me unless I first got a tray. After four times ignoring his command he finally started to make my omelete.", "business_id": "-nWigG5EhFLjdSgGZthS3Q", "stars": 3, "date": "2015-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3h_-bLtXxgnOhjPT-sU6Ew", "review_id": "YOt5voiFV1hQAzUmIBx2KQ", "text": "I loved this boutique resort. I went in July so it was so hot but barely anyone there. We had the spa amenities to ourselves. :) The good was great! I didn't get tired of the T. Cooks menu. Would love to go back!", "business_id": "rLAeltELaGdQKh_LYIllEA", "stars": 5, "date": "2013-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 4}, "user_id": "dUZ8aLUiX3_zq83nnlytjQ", "review_id": "engE_sWsXT0TN540BcgbLw", "text": "I recently took the Grand Canyon tour around the Christmas holidays.   The tour guide was excellent.  He was full of fun and interesting facts about AZ.\n\nPeople don't normally think of the desert and think of snow or cold, but North Arizona is quite different than the desert. \n\nWe first took a short stop in Sedona.  Later, we continued north to see snow all around.  We traveled through Navajo country.\n\nWhen I finally got to the Grand Canyon, I took the helicopter ride around the canyon.  The view was magnificent.  It was one of the most breathtaking sites I've seen.\n\nI truly enjoyed my tour!  I will definitely do it again - especially if family comes in from out of town.", "business_id": "TGJaChsRa6M87guv6Q57dQ", "stars": 5, "date": "2008-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NLIyErR75dlSv8ccNw62JA", "review_id": "nEiR-x3CfliYIdOl-VpP-A", "text": "I visited AAA to re-title a vehicle, get a license plate and buy car insurance.  The employees were extremely helpful and friendly.  Latanya in VTR suggested I title the vehicle differently since I was putting it in my trust.  Very helpful.  Rita in insurance saved me more on the premium than I was anticipating.  Very nice waiting area also.  Membership does have it's rewards!!", "business_id": "vBRJWnMaAqUyZ1CbwnJXLQ", "stars": 5, "date": "2015-01-08", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "11ujwHIIEyLNIBcHdj2ypg", "review_id": "O86O3eFBTYAmrYgXsWnK7A", "text": "Stayed here last weekend and overall, I was impressed.\n\n1. the price--paid $50/night on priceline. After taxes, it was $123 for 2 nights\n2. Staff-front desk personnel was very friendly and nice\n3. shuttle-they have a shuttle to the airport directly every 30 minutes\n4. nicely kept room and room service\n\nminus one star--bathroom was too small, but for the price, I shouldn't complain. I had a good view of the pool and a balcony. \n\nWould definitely return again.", "business_id": "KnRRMCqQQqlyMphif6cTaA", "stars": 4, "date": "2012-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "A3jj7qoDEhu295hYNFP_Pg", "review_id": "OdKVQZsldLoasrC2AWWZKA", "text": "I've only had one experience with Discount Cab, and while by no means statistically significant, it was a good one.  \n\nI needed a ride to the airport, so I scheduled a pick-up at quarter till.  The driver showed up a few minutes early so I ran back inside to finish brushing my teeth and hustled into the car. \n\nOn the way to the airport I asked to plug my ipod into the cigarette lighter in the hopes that  it would take enough charge to get me through the 1 hour flight to San Diego.  \n\nWell the cab ride was uneventful and pleasant enough, but when I got through the degrading and dehumanizing (not to mention pointless and ineffective) Soviet-style airport \"security\" checkpoint that we all know and love so much,  because we're so goddamn *FREE* in this country, free to be strip searched, bullied, and threatened with arrest anytime we travel, anyway, I was going somewhere with this... \n\n..oh yeah, I realized that I had FORGOT MY FRIGGIN' IPOD IN THE FRONT OF THE CAB.  Dammit.  So I called the cab company and they told me to call back when the driver turned in the cab.  \n\nA few days later I called the lost and found office and lo and behold, the driver had turned in my ipod.  I mentioned that I was out of town for another week and asked if they could hold it.  \n\nSo a few more weeks go by, and I keep putting off going down to the office to pick it up.  When I finally get my ass down to the mesa location, they could not find it!  \"Great\", I thought to myself certain that somebody in the office had yanked it, \"I'll never see it again\"  \n\nI was about to walk out of the office a defeated man, kicking myself for waiting so long to pick it up, thinking it was all my fault.  In my mind cab companies were just a cut above towing companies on the sleaze-o-meter. \n\nThat's when the lady  behind the counter asked me to hold on just another minute.  I was put in touch with Jeff Lunn, the Operations Supervisor, who invited me to his office, where I sat down and gave him some basic information.  \n\nIt was immediately obvious to me that Jeff _actually cared_ about getting my ipod back.  He explained that the office was a secure area with limited access, there was a strict procedure for dealing with lost customer items, and that he has and will fire someone on the spot for taking something that does not belong to them.  I was stoked, and given new  hope.\n\nWell whaddya know, a few days later my ipod resurfaced.  This was almost one month to the day after losing it.  \n\nSo I can't say that I've ridden Discount Cab enough to confidently rate it as a taxi service.  But on the integrity side, in my personal experience they rock.\n\nBtw they supposedly have the largest fleet of hybrid cars in the country, and I believe they have a deal where they will give you a ride back to your car in the morning for free.", "business_id": "6InaHoU8KNlDeGP48RqzBg", "stars": 4, "date": "2009-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "J05PJ-aXzpb54igvA5gO-Q", "review_id": "9EYBhslFAkSluCIKI1cxeA", "text": "45 minute wait and they still didn't show up. \n\nThey estimated a 5-20 minute wait. \n\nNo apology. Cancelled it and called a black car service instead. \n\nPoor service indeed.", "business_id": "6InaHoU8KNlDeGP48RqzBg", "stars": 1, "date": "2014-02-13", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "nDBly08j5URmrHQ2JCbyiw", "review_id": "YK3IqYVcvZPoJ9hwdv5lbg", "text": "My trips to the airport these days are stress-free. Discount Cab takes me there. The drivers are capable and courteous, and the rates are reasonable. \n\nIf only they could pick me up on the way back.\n\nMy trips FROM the airport are with Yellow Cab, who seem to have some semi-exclusive arrangement with the airport, at least out of terminal 3. Discount is prohibited from picking up at the airport.\n\nSo I am left with Yellow Cab most of the time. Dickish drivers who roll their eyes when you pay by credit card, set your bags on the street and leave without so much as a \"thank you\" are no way to build business.\n\nIf you have an alternative, take it.", "business_id": "3hUw4RmFFdOn7Ix81n5Sag", "stars": 2, "date": "2011-01-29", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "b9pqKXIBFr2R_ZP-qTE6LA", "review_id": "mDPrJwOETv7oi8trL2KHEQ", "text": "I got dropped off here at the car return by a friend who was returning a car since I already had a reservation. I asked the guy at the return lane where I go to pick up my car and he said - upstairs. I went upstairs and approached some woman standing at a podium (amidst what appeared to be a super-busy DMV sized crowd waiting) who told me I had to see the greeter first. I walked back to where this \"greeter\" was - at an unmarked podium but she was busy yacking away with a seated, waiting customer off to the side. \n\nShe told me to go back downstairs and \"get in the right lane.\" I said, \"right lane to where?\" \"She replied, \"you're not listening to me, you have to get in the right lane.\"\n\nI said, I understand - \"right lane,\" but where does this right lane lead to? Finally, she managed to make her brain work and told me - to the booth.\n\nSo I went back downstairs and approached the booth (in the right lane.) I tell the guy I have a car reserved and he tells me - you have to go upstairs. (Yeah.) Then I tell him they already told me to come downstairs. (Ugh.) Then he asks me if I booked online at budget.com or not and I tell him I can't remember. He says he'll take me anyway...\n\nWhatever, dude. \n\nThe other disappointment was that I was expecting (based on the initial online reservation and subsequent confirmation I got) a Ford Focus and got a piece of shit Chevy Cruze instead. I even mentioned to the guy that I wanted one and he had no response. Hey, fuck you too, buddy.", "business_id": "FYCVF_1qYm3x5DYCbmmK1g", "stars": 2, "date": "2015-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WeIUg9lNe3Rd70O0wjoUzw", "review_id": "CBt-Ir9dJoXXQ5jWp9GraQ", "text": "This airport has improved tremendously. I used to loathe it. Now it's become a standard airport.  True, it's still hard to get from terminal to terminal. But if you had been here ten years ago, you would know that it has made major improvements.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2009-01-07", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 3}, "user_id": "r-t7IiTSD0QZdt8lOUCqeQ", "review_id": "_i8xFQsFZ_bIq3Dmrxawxg", "text": "If not one of the ugliest airports in the US certainly one of the most  depressing. In desperate need of some renovations, especially the outcast terminal 2 home to united & continental.  Driving around and out of the terminals can be a bit tricky and you may end up doing a few laps if you miss your exit.  Also, getting a rental car offsite can test your patience.  However, the short and long term parking lots are convenient and fairly inexpensive.\n\nAnd if you are in need of 1,000+ new pieces of luggage or some free stuff swing by the baggage claim and help yourself.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 2, "date": "2010-02-03", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "zwcEsAKrF8ZAYUiuFtrSuA", "review_id": "AjHSwnN0c8N0VKo_3UW_Bg", "text": "Phoenix Sky Harbor is a bipolar little beyotch that just likes to F with you.  One day she is going to do everything in her power to try and keep you from making your flight, and the next day she is all like \"I'm sorry about that time I made you run like an asshole through the airport to your gate.  Let me make it up to you and get you to your gate 2 hours early today\".  \n\nSky Harbor is #3 on my list of most hated airports, behind Newark and Philly.  Nuff said.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 2, "date": "2010-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "ngR1Y009kpsuqWRdlKp7hg", "review_id": "hadjepcRpMQzrXSzz3eLxg", "text": "After going through hell through JFK, I was happy to land here.  Easy to get through all the gates, and the outside of the airport was very pretty with nice paved roads and cacti!! Cabs were available as soon as I left the building.  The escalator to exit the building had some fake flying airplanes and some rocky fake mountains that were pretty also.  \n\nThe car rental service is the best.  I've never seen such an easier way to drop off a rental car.  There were signs to drop off the car like there were to drop off someone at the airport! So convenient and so fast! I thought it would take forever to drop of the car but a guy was outside checking everything.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 5, "date": "2011-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pprq_7lgBT-WDFGPQe1a_w", "review_id": "4FH5DXH7Mdfm3ZaZhf-sug", "text": "It is a nice large airport with many amenities while waiting for your flight or to pick someone up", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2011-12-10", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "AEkUJGjfclWg2JXw9UpuEw", "review_id": "DtcSRxMuPVuhxxKrIJntrA", "text": "Flew here not long ago for the first time and this airport is not too shabby! It's clean, easy to get around, lots of windows, good hub for SouthWest, and I encountered some friendly staff. \n\nIt's great if you are looking to get to Phoenix or Scottsdale, both are very close. There are some good restaurants and shops in at Sky Harbor, worthwhile to check out if you are waiting for your flight. There are also a good amount of outlets are gates if you need to plug in your electronics. Found some super comfy seats to sit in as well while waiting. Best thing about this airport is they offer free wi-fi. That makes me happy, thank you for doing that. \n\nOverall, no complaints here, I like this airport!", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2012-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qABKRj1ggJmtvrL9FMFtuA", "review_id": "SITJSr-RPuAI7NykWeu6aQ", "text": "I've been through better but this one aint bad.  I love the smell of airports too.  It reminds me of going somewhere fun.  At least it does since I don't travel for work anymore.  Sky Harbor has the average food choices, has been decently upgraded, parking is OK.  I really don't have much to complain about.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2012-01-22", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "8vXOnkHwUKV21-zQy8KY4w", "review_id": "yPLM_v0DTOAtMNckWR1dxQ", "text": "As far as airports go, like everything else in life, there is the good...the bad...and everything in between.  And that's where I think PHX falls...in between.\n\nNow, let's start with making connections between terminals, even with airlines who are partners.  There is no tram, so you have to take a bus.  Always make sure you have plenty of time to go between terminals.\n\nAs for the terminals themselves...they definitely are in need of an update.  The carpeting, the doorways, the layouts...a bit dated.  \n\nThis airport just reminders of a smaller scale airport that grew too fast too soon.  And for a major hub, it definitely needs to be looked at.\n\nOn the other hand, the airport personnel (not airline personnel) are very nice.  That's what they have to make up for the facility itself!", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2012-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1IZR6nrmD-fXf1nMZYom6A", "review_id": "awO1qvzeb3a-nWs2FcShQg", "text": "Baggage, security and check-in were a breeze. I flew out at night so crowds were low. When I flew in during the day, it was busy, but not crazy.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2013-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lKoYbwhnzzGEIn1HEk-Kug", "review_id": "F4nT52kCsgCxVZWsVqlMMg", "text": "Thanks YELP users.  We searched rental car agency in Scottsdale before choosing this one. Took the bus over from the terminal, the staff here was fast and friendly, we were in and out in minutes. We haven't rented a car in a very long time, but this was super easy, \n\nWhen driving out of the rental car lot, the oil light came on.  We continued on to our hotel and decided we would check the oil when we got there.  The next day, we called the Enterprise office and told them about the oil light.  The young man checked the records, said it had an oil change two days before.  No worries.  We never did check the oil until we arrived in Flagstaff, 175+ miles since picking it up.  Pulling off the interstate at Flagstaff, the motor began coughing.  We called the Flagstaff office and they brought over another car for us right away.  Were the same kind of friendly easy to work with folks we met in Scottsdale.  \n\nWe turned the second car in at the airport in Las Vegas.  We didn't have the same car as our paperwork, we had no paperwork for the second car.  We were afraid it would either be super easy or super intense once we turned the car in.  The assistant Manager, Nick, greeted us and thanked us, sent us on our way.  The easiest thing ever!", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2013-01-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "VexAJmqOClKzm8KbY7xs5g", "review_id": "JREr7fFGw3nSRR0jYYokQw", "text": "The airport is not a bad airport at all. It's actually better than a lot of airports! I love that the roadways leading in and out of the airport is not too confusing. The only terminal that is confusing is #2 because it's not connected to the main building. \n\nBut it's nice inside. It has all of the usual restaurants and magazine stores and coffee shops. The coolest place is La Grande Orange. I was surprised that there was one in there in terminal 4. Good restaurant for food!\n\nThe place is pretty clean too. It's very well kept. They started upgrading the entire place. Now there's LCD boards giving you information on the roadways, recharge stations inside and a sky train that takes you to the light rail station. For free. To ride the light rail is not free. But you can be dropped off at the airport light rail station and take the sky train directly to the main check-in building. \n\nThe airport only keeps getting better. :)", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2013-12-01", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "XxA5k_iyzf9HdvPMp_J27w", "review_id": "M9wLVFUw9LdCXN8yQO_USg", "text": "I've been flying into and out of this airport since I was a kid. Now that I am old I can say that things have definitely grown and changed for the good.  There are some fun shops and restaurants and it is nice that there are some larger known chain restaurants located in areas where visitors came meet you for a bite before catching their next plane. The security line always seem to be long. \nDriving around to pick up a returning part is not always the easiest. The signs are not as easy to navigate as it would seem.  There are too many places that are trying to merge 3 lames from different directions into 1 lane. I can't tell you how many times I've gotten lost here, at least every time is a new fun experience. :)", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2013-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YdR-kHN82P9hUQ6cd_cPQQ", "review_id": "J6glMeio0HOGDlzUd5Hwuw", "text": "Clean, quick airport to navigate. Lots of places to eat, grab a quick bite before a flight. \n\nClean restrooms and seating was comfortable at the gates.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2014-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tvjWJi07jANJK3mOoNneJA", "review_id": "72M_Bg5jeZaq0PTUhVPW0w", "text": "Skyharbor airport terminal 2 has no restaurants or adult beverages.  Diagreement on rent caused restaurants to leave.  Make shift beer and wine are for sale as of 5 today at a bunch of tables.  Just awful care of travelers by an airport or city that obviously does not care about visitors.  Avoid this airport or terminal if possible.  We will.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 1, "date": "2014-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "ooxpeo27Q6hXmixSZ80mcQ", "review_id": "9N1dOL5U-7Q1K3CWO1WZGQ", "text": "Better than most.  Terminal 2 / United faster to get to for checking in than southwest.  Nice United club,  Gates all close.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2014-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Z_wHHpn-fIaNIciVr2LO-A", "review_id": "CEYEGditOdnXYnfftIwODw", "text": "Most airports are essentially the same.  There are gates, lounges,  coffee shops, souvenir shops, sports bars, and restaurants.  One may need a coffee to get them going after a red eye flight where as another may need a beer to numb the pain of a delayed flight.   Whatever you may need this airport should have it.  I stopped here on a two hour layover and decided to walk around a bit to stretch my legs.  What really stood out is all the windows and nice view of the mountains. There were plenty of sit down restaurants to choose from and all the other shops one may need.  I also liked the amount of places to recharge your portable devices.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 5, "date": "2015-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "apZBQpCEVD8xSJIRR-Tgaw", "review_id": "ijDf7kxpGXvWRgPfLRNBTQ", "text": "On a recent business trip to Phoenix, I had quite the opportunity to experience the airport due to a delayed flight. My rating does not reflect my frustration with the airline, but the lack of food in the Airport. I spent about 8 hours in the terminal, and as it turns out there isn't much in the way of food selection. There was only one sit down restaurant, and a handful of fast food options. I was in terminal 2, and there was no access to the other terminals without leaving security, so I felt like I was trapped on an island.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 2, "date": "2015-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ONZKCMYuktCOCGesIWo_qw", "review_id": "Q5-LFi5f5LlUH3Je821tkg", "text": "Had a connecting flight here and the airport was nice and clean. Not sure how smooth it goes for tsa or anything but no problems or concerns. We weren't here for very long just a hop skip and a jump lay over.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2015-12-09", "type": "review"}
{"votes": {"funny": 4, "useful": 7, "cool": 4}, "user_id": "4ozupHULqGyO42s3zNUzOQ", "review_id": "DQIAGlajC1rXytNLvNSUzA", "text": "I'll start with a fact. Arizona Shuttle is one of the only and most economic options in Arizona for getting from city a to city b if you don't have or don't want to use your car and it does so for a relatively cheap price of $27-$37. Is it the most comfortable and best smelling trip? Nope. \n\nWhile taking a trip to Tucson for Yelp Tucson's very first elite party, I had a ride back but not a ride there so either we would have two cars going back or I could do something like the shuttle. And since I hate driving on the 10 late at night, I opted for the latter. Enter Arizona Shuttle. It just took a couple clicks on the internet to make my reservation and after confirmation, they told me to meet at Sky Harbor Airport at 11:15 and the shuttle would leave at exactly at 11:30. Well, I arrived at 11:15 but did the shuttle leave at 11:30? Nope...more like 11:50. So I rushed to check in at the time they told me, but then I waited around for 40+ minutes before the shuttle left. They offered several different shuttle times too and I chose the 11:30 one because it would get me to Tucson when I need to be there, but since the shuttle was 20 minutes late, it then made me 20 minutes late in arriving to Tucson. When relying on a shuttle service like this, I was hoping they would be on time since I planned my schedule around the shuttle leaving on time. I understand it may take longer to get there with traffic etc, but the shuttle company could have delivered when it came to leaving on time. \n\nThe shuttle ride itself was pretty much what I expected. It's a van full of folks needing a ride. It was a little cramped, a little smelly, the windows didn't open and the drive is long. Weirdly enough, a trailer was hitched to the back and I worried it would detach on the road, but it seemed to work and held our luggage. In addition, as I was exiting the shuttle when I got to Tucson, the girl behind me also exited...with her ferret. Apparently I had been riding the whole way with a ferret behind me. It might have been nice for them to warn the passengers. However, the upside to taking a shuttle to Tucson was that instead of doing the drive myself, I was able to get a lot of work done on my computer (thank you Verizon network card!), so it wasn't a total loss of 2 hours. \n\nSo in summary, taking the Arizona Shuttle would have provided me with the experience I expected, if we didn't get off on the wrong foot when the shuttle was 20 minutes tardy. But, if faced with the situation, I would probably use Arizona Shuttle again and it's a decent option if you need to get to any of the Arizona cities and you'd rather not rent a car and pay much more.", "business_id": "EW-DCLsUbUF-uHA5sm9c8w", "stars": 3, "date": "2010-12-15", "type": "review"}
{"votes": {"funny": 5, "useful": 8, "cool": 7}, "user_id": "xopO03gWwnEe0JNkHBV8Kw", "review_id": "1bHjIU071Id8fAegN_NFAg", "text": "O   k first off the Greyhound Bus is NOT the most classy and convenient way to travel. But it seems to me it can still be a pleasant one if you take a few things into consideration.\nN    othings perfect!!\n \nTHE \n\nB   ecause you may have to sit in line where there are no seats, Bring some kind of but cushion. Your but will thank you!\n            (Ace Ventura comes to mind talking out of his ass LMAO) \n\nU   should Bring your own snacks,meals and drinks if you can because the options are few and far between. I brought a thermos full of hot soup and a bunch of other stuff.\n\nS   o The earlier you arrive the better choice of seating you get. In the older buses the driver get's to decide who if anybody, sits in the four front most seats. First come first served.\n\nBring a camera if you have one. \n\nMost of all TO HAVE AN ENJOYABLE EXPERIENCE YOU MUST BRING A POSITIVE ATTITUDE AND PATIENCE.\n\ni  W A S  going to go on and on about the details of my five star adventure but the aforementioned details are all anyone needs to have at least a three star journey folks. \n\n      Oh and  I want to mention that the new buses have Wifi, power plugs at every seat, more leg room, better reclining and a way better bathroom.", "business_id": "MXFcSmW3m-9IXQEA_7l62g", "stars": 5, "date": "2011-02-05", "type": "review"}
