{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lZpv9uSDKgyUxk1VPwyzDg", "review_id": "QowQo1l5pY_f7E_JD9OPMw", "text": "Get a Southside Shake with hot fudge shake and peanut butter sundae on top - absolutely amazing!", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2013-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yEm1H_5yMwzoO7gbhv26Zg", "review_id": "AiBCCdBWZTGE4Fiab-AK_g", "text": "I'd rate this joint 10 million stars if I could. Best ice cream in PGH!!! They serve sundaes, milkshakes, and the old school cherry dip cones. Cool historic photos adorn the building in the back, showing how the intersection/ area looked about 100 years ago. I love Page Dairy Mart so much I want to marry it.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2013-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-tEbGfPj1aeG0q8-XJLK-w", "review_id": "vCt2zWWJLYpPrZfeexYUrw", "text": "This place was just okay. I had the cookie sundae and my fiance had the brownie sundae. We both kind of watched, horrified, as the girl making our sundaes ran our cookies and brownies through a warmer in one of those cheap plastic containers. I mean I know I'm eating ice cream which is sooo healthy, but a little cancer from warming up plastic with the food you're gonna eat never hurt anyone either...The price for the sundaes seemed a little high to me at first but the more I ate the more I realized we really did get our money's worth. This is definitely better than dairy queen and it has a good ice cream shop atmosphere if you're looking for some good soft serve treats.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 3, "date": "2014-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KFRC_GdFH-bXb6brxd7WvQ", "review_id": "Z0bYSGPaB20UPue0K-fdMQ", "text": "Whoever doesn't give Page a 5 has no soul. It's childhood everyday March-October. I love the pretzel cones, but everything is good.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2015-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AWnLnjXHN56EyGFtQ1P-OA", "review_id": "tmX8_JLavdLmJ9OfBIouyA", "text": "A 'burgh favorite for a reason. The Yinzer is locally sourced and delicious. For a little slice of not-so-well-known Pittsburgh history and taste, Page's is the ice cream shop to visit.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2015-12-01", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "KMKgEPsB8j7RrELtv6u-_A", "review_id": "ytndYFxKFvpWFT-hK5_07w", "text": "I will admit the chipped ham sandwich was good. It was tender and salty and soft on the wheat bread. But this is just a deli. More like a bodega than anything actually. The signage is classic and the neighborhood, especially Ohio Street, is a delight. Isaly's is a Pittsburgh legend, but more sentiment for yesteryear than anything.", "business_id": "I9-Ei8_KYtMjbixNJSCvwA", "stars": 3, "date": "2011-02-22", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "-Gdjho_gZhgTXkYmSPy0qw", "review_id": "-nsIwOHEnHQ1ii0Xa5IJhw", "text": "My friend lives near here so I came to satisfy my deli sandwich craving. The inside is super dingy deli/convenience store, so I was excited for a real, down and dirty deli sandwich. They have a lot of weird items in their grocery section which can be kind of fun to look through.\n\nI got an Italian \"hoagie\" as I feel is the appropriate term for this ultra-Pittsburgh spot. It was bad. Totally skimpy on the meat, and it had American cheese and mayo, which don't go well with Italian meats at all...provolone and oil & vinegar would have made way more sense. The bread was a squishy white bun. I mean, I still ate it, but I didn't really enjoy it. It made me kind of sad. It was just a sad, floppy excuse for a sandwich. At least it was cheap?\n\nMaybe I should have gotten the chipped ham instead, since that's what they are famous for. I also suspect the location in the North Hills has to be at least marginally better...this Isaly's is clearly past its prime.", "business_id": "I9-Ei8_KYtMjbixNJSCvwA", "stars": 2, "date": "2012-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "Qokwd1_akPFKzff7jnBQgw", "review_id": "2bXyKja4ty9HSQC1AXHZqQ", "text": "Whaaaat?! Noone's reviewd Scoops? This place is the ultimate hangout. Young and old alike. The prices are average, the flavors are plentiful, and the staff is always friendly (always a plus on my list.) \n\nIt's a few blocks from my house and I remember on hot summer days grabbing my sisters, yelling upstairs to our parents \"We're going to Scoops!\"  and walking up there. We'd taste the flavors we were trying to decide over (they give you little spoons to do this!) and then we'd pick. There's also an assortment of frozen yogurt, sorbet, milkshakes, toppings, candy, and sodas, too! After paying, we'd take our cones outside and sit on the steps chatting well into dusk. \n\nMany people come here all year round. Everyone in the neighborhood knows each other and you're bound to run into someone you know.\n\nGreat place for ice cream and making memories.", "business_id": "LV_OCiR9rOHVHgdhbpqw2Q", "stars": 5, "date": "2010-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q7MrNVt1FE23rwtWmPYWHg", "review_id": "6XAj5bHN_uGjU-EsDoIcgg", "text": "Peanut Buster Parfaits rule! I'm glad we have one so close. Nuff said!", "business_id": "9aw0t0rlACKkMaxsX0KlKA", "stars": 4, "date": "2013-01-21", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "-Sjhodaq2F0vPXXmQv1FJg", "review_id": "5BIi8M6cCXgkaliqVgnExA", "text": "When I die I hope I come back as an ice cream bowl at Klavon's so I can forever spend my days covered in mint chocolate chip and watching people smile. I don't know...maybe not, but I do love mint chocolate chip and old skool ice cream parlors and Klavon's does both really well. \n\nThis is a list of things at Klavon's that make me feel like vintage stuff isn't only for grandparents and ice cream isn't just for kids: Amaretto flavored whipped cream, swivel stools with red tops, high backed wooden booths, a man behind the counter with a pure white handlebar mustache, a hammered tin ceiling, and large pecan balls.\n\nYou can go with chocolate or vanilla, but when I get the chance to have a pecan ball, I'm no idiot, I take it. A pecan ball, my friend, is ice cream rolled in pecans, covered in hot fudge or caramel and then topped with whipped cream. That's all tasty, nutty, fudgy goodness, but if you wake up feeling like painting the town gold and you want something that tastes like it was made for Cleopatra by Mark Antony's own hands, get a scoop of coffee, a scoop of pecan and top it with Amaretto whipped cream: I'm hoping to get this added to the menu under the name \"Magic Magic Explosion.\" \n\nThey have a picture of Joe Biden posing with the owners; it's taped to the mirror behind the bar and quite adorable. \"He was very nice and left $20 for the next little girl in line to buy her ice cream with,\" the owner told me.  Also, $20 worth of ice cream?! Two scoops only runs five bucks. Joe Biden--excuse me, Mr. Biden--you are a true American hero and I, for one, am happy someone finally realized the importance of children having tons and tons and tons of ice cream. \n\nGood show, sir, good show.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2011-01-22", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 4}, "user_id": "KMKgEPsB8j7RrELtv6u-_A", "review_id": "9U6mf_rgLq_RsZwjZCO6kA", "text": "Worth a visit from across the country. Klavon's recalls about 100 years ago with its true ice cream soda fountain days. It's been in the same family since around the strike of 1900 when it was a drug store and turned into this sometime in the last century. The styling seems to be a better and more true throwback than even Pittsburgh itself. Who would not like this has no soul.\n\nI only sampled the hot chocolate and two types of whipped cream, but I give it 5-stars anyways. I feel like this is an intelligent guess. The whipped cream was my favorite of all time, the amaretto whip didn't even strike me as amaretto, it swooned me lightly.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2011-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_GinkIw8tpdWfxG_1j1CdQ", "review_id": "-cGSAhcbew571uQpO4g7gw", "text": "Klavon's is what I would imagine a soda/ice cream shop would be back in the 50's. There is a decent sized selection of ice cream flavors and concoctions but there isn't anything that's going to figuratively blow your mind. The interior is charming and has a lot of history -- just ask one of the staff and they'll happily tell you about its background as a drugstore. \n\nIt also offers a selection of old fashioned candy such as candy cigarettes, taffy, and marshmallow ice cream cones to mention a few. Klavon's is delightful and definitely isn't a bad place to spend a hot day in the summer.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 3, "date": "2011-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "m-F1KO942lzUKR5OqE7wlg", "review_id": "6XY-S0NRy5xWXbpmMwuepw", "text": "I can't believe I never knew about this place! It was a pharmacy back in the 1920's and now is a soda and ice cream place. The soda counter and everything is original, it's almost like stepping back in time!!! There are even the old phone booths ,and ask about the water line from when it was flooded long long ago! The hubby had a peppermint soda with a scoop of mint chocolate chip ice cream that was really good, and we had a panini and chili that were also tasty. I hope to go back for more food soon!", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2013-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "0P58MD0FRVI6pTVKUpd7YA", "review_id": "wRe-w7Fx2uIfNeECyKtJ8A", "text": "This place is small, quaint, amazing icecream (from PSU creamery), and the staff is great! I was fortunate enough to meet the owner and she was super nice and helpful. She seemed really proud of what she had accomplished, and humble too! I really like this place. They have lunch soup and sandwiches too that were good.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2014-01-25", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "2jkE2AhFum7t3jHSngMZtg", "review_id": "zt80eG0AsNJxgU7yrGUTig", "text": "Born and raised in Pittsburgh this is a treat. Klavon's uses local businesses so whether you eat ice cream,  sandwiches or buy candy you're supporting the Steel City. I had a panini and a sundae. Both were delicious and the amaretto whipped cream was awesome. The setting has a nice balance between an old fashioned ice cream shop and a new aged cafe.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2014-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "DLu1Bum8EXNE62xno-v0VA", "review_id": "jf80-u8cLr_Hd0gIwG3aJA", "text": "I love Klavon's. I love Klavon's so much that I've been known to stop in for a tasty treat here even on the chilliest of Pittsburgh winter nights. And it takes some darn good ice cream to get me to overcome my aversion to the cold during that season, let me tell you!\n\nKlavon's is one of the oldest places I know of in the area that serves food and dessert. It originally opened in 1923, although there was admittedly 20-year period where it was closed. I bring this up since they reopened in 1999 - but aside from restructuring things a bit for basic functionality purposes, they didn't really renovate or modernize the look of the shop. The result is that it really looks, feels and even smells like you've stepped back into an old ice cream parlor. There are wooden booths and tables, an old counter with iconic revolving stools, even old wooden phone-booths (non-functioning now, of course).\n\nBut enough about the shop. Let's talk about the food - like the ice cream, which comes from Penn State Creamery. Really, do I need to say anything else? It's delicious! But it gets better - not only does Klavon's serve plain ol' Penn State Creamery ice cream, they also serve sundaes, ice cream sodas, ice cream floats, and splits. All made with Penn State Creamery ice cream. It's heaven right here in Pittsburgh as far as I'm concerned.\n\nAnd even if you're not in a dessert kind of mood, Klavon's is still worth a trip - they also serve paninis, soup, pepperoni rolls, and a couple small kid snacks. Not to mention, they sell a range of candy - some new, some older classics - that you can purchase singularly or in-bulk and take with you. I know this is something my parents absolutely love, as they're fans of some of the candy options.\n\nAs far as I'm concerned, this place is a historic and tasty Pittsburgh treasure. Definitely be sure to stop in sooner rather than later, cold weather or not!", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2014-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8Bm7Taot0v9o9du8ERKRNA", "review_id": "qfelC4bZn1n7wBy9aYYANA", "text": "Even though I have to pledge loyalty to Pitt, the Penn State Creamery ice cream I had from them is awesome! Great flavors, great decor, super nice people!", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2015-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ApbC_bq8Y3R8OuNl1BaDTw", "review_id": "fw_kznDkRaTUNtlB3UaCZg", "text": "This place is running the coffee game in this city. Good coffee, good music, good lighting, and an easy place to focus. Jitters is fucking shot up.", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 5, "date": "2015-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vsk4P61KGlA9Z6mAInx3gA", "review_id": "q8jFJ5vt-o6YuyeEXx8_Bw", "text": "Jitter's baristas are very friendly and helpful.  The free wifi is a must for coffee shops.  As a Shadyside resident, it is nice to have friendly and caring staff.  I wish they were open later into the evening", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 4, "date": "2015-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "trIrZ1d0aHxlTNe_L8K-7A", "review_id": "OqYoCmRuMfj3GSM0P7M4IA", "text": "Yuck!  I was on my way to Johnny Burritos when I saw their sign of \"specials\".  I stopped in and ordered the cream of potato soup and a grilled cheese sandwich.  Both were awful.  The soup had the consistency of milk, and not much flavor.  It's no where close to \"cream of\" anything.   The cheese on the sandwich was so thin that I pried it open just to ensure myself that they hadn't only given me 2 pieces of plain bread.  I like to support small mom and pop businesses, so I really wanted to like this place.  Maybe I just ordered the wrong thing, but it was so off-putting that I don't plan to ever return.  Next time, I'll keep walking to Johnny Burritos.", "business_id": "HzZ3424aEgmElEP06l0KKA", "stars": 1, "date": "2014-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YJ5_YCrzLX5Laav13qG0qw", "review_id": "zwgq1GOYOn21P8s2W5RpCA", "text": "This place never disappoints. Be sure to ask for a punch card-buy 10 combos, get 1 free. Wednesday is double punch day. They always have yummy specials. The toppings are fresh and you put them on yourselves. Absolutely love Snoop's!", "business_id": "nhPdxY-jbf-XVQ6Hq6qJPw", "stars": 5, "date": "2011-02-03", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 2}, "user_id": "lpZtfD-vCqUER1yGKEvUPw", "review_id": "ucrTyI3wCUn8hgWsVnPR6g", "text": "On a unseasonably warm February evening, hubs and I ventured out for some eats. Since we both had fairly light lunches we were starvin' marvins. After attempting to stop by a handful of places (closed on Monday or an hour long wait) we settled on Snoop's, hopin' for a hot and fresh burger. \n\nInside, Snoop's leaves a lot to be desired. I'm not a dull knife in the drawer, and it took me a little while to figure out the, um, theme of the burger joint. Snoop's...as in detectives...snooping...i saw a Bond poster too. Ok, sure...I didn't really care about the overall ambiance as long as the food was solid. \n\nAnd how about the food? Well, it's pricier than other old school grilles - to the tune of $15+ for two 1/3 lb. burger combos and a corn dog. This wouldn't really bother me much if the food was better. The burger was fine - passable, but very well done (as in quite brown) and essentially flavorless. Onion rings were clunk-ily breaded and with little flavor and fries were \"meh\" overall. I was looking for the salty little slivers of love with some crisp! \n\nService wasn't super inviting and the cash register attendant didn't even hint at a smile when we ordered. As soon as cash was in hand, she went back to her computer - adjacent to the counter. With a sanitation score barely above 90 and the flavorless eats, I have indeed experienced some better burger joints in the QC.", "business_id": "nhPdxY-jbf-XVQ6Hq6qJPw", "stars": 2, "date": "2011-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L7Kx-avK5iy5h1JcykL69w", "review_id": "hn9GmUGk4LmwEDqjXmSw-w", "text": "Nothing special.  Went during winter, and while they still served frozen yogurt, I didn't get a chance to try it.  The rest of the foods were basic concession-stand items.  Burgers, hot dogs, fries, onion rings, etc.  Would probably be nice for a visit in the summer, but not exactly a lunch destination.", "business_id": "nhPdxY-jbf-XVQ6Hq6qJPw", "stars": 3, "date": "2012-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "exvp-M7znsQgyKf43wek-w", "review_id": "Z53J7WjutYBgmGrzI-cSQw", "text": "The other Maggie Moo's locations have closed, but somehow this one hangs on.  I made the mistake of taking some friends in there the other night, though, and it was kinda gross.  The ice cream itself was OK, nothing to write home about but it did the job.  But, if you're an ice cream place that does mix-ins, your marshmallows should not be so stale they're positively chewy.  We sat and ate ice cream in the shop before going our separate ways home, and the place had a definite industrial cleanser stench that was hard to ignore.", "business_id": "IQbEYPh7OKoUmsI6VoLmTw", "stars": 1, "date": "2011-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "g5-0kGSVByDTxmii-XNjiw", "review_id": "cmH99FGd6PYAeo7nwJWXig", "text": "Place is dirty.  Both bathrooms were out of order.  Young lady was very nice.  Will not go back.  Placed smelled like industrial cleaner.", "business_id": "IQbEYPh7OKoUmsI6VoLmTw", "stars": 2, "date": "2014-02-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WycBF7A57CbcET2vUB6r4w", "review_id": "_O31S1qoYKS09dNHGeBjiw", "text": "Do not waste your money!\n\nWe purchased a Groupon for this ice cream, thankfully!!!  It was just terrible.  We had never been before, but love Cold Stone so we thought we'd try it since we were in the area.  The ice cream looked old, and after trying it, tasted like nothing.  :(\n\nIt is also very expensive (4.99 for a small).  Above all, it was incredibly dirty in there!  Both restrooms and the drinking fountain were out of order.  \n\nWe will not be back.  Not even worth a Groupon!!!  :(", "business_id": "IQbEYPh7OKoUmsI6VoLmTw", "stars": 1, "date": "2014-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Ue3hmkbr-pVaiqiCnxInQg", "review_id": "xjyVKwC1azTtDLrShQBthQ", "text": "Californians are all about the In-N-Out, where you can get your burger animal style. And the Midwest is all about Culver's, where the Butter Burger is the thing to order.\n\nC. and I ate lunch here on our way between Milwaukee and Mosinee before going to my folks for Christmas. I got a cheddar burger with fries, and C. got the two-piece chicken dinner with mashed potatoes and green beans.\n\nThat's one of the things I love about Culver's. Yes, it's a fast food restaurant. But they also do family restaurant food well. The chicken was good and the green beans really fresh, C. said. Fast food you can feel good about.\n\nI also got a frozen custard, their flavor of the day: Swiss almond Christmas or something like that. Chocolate custard with slivered almonds. Yummo.", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 5, "date": "2007-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2sklUYBnk7LxzM-11yPUPg", "review_id": "nmX7lMtrsWw_z6i6Nt5ltA", "text": "Next to Chick-Fil-A, Culver's is my fav fast food chain.  Rarely is a snowboarding trip complete without Culver's to top off the day.\n\nThe butter burgers hit the spot (though mine was heavy on the red onions; good thing those are easily removeable), and the fried cheese curds are to die for.  You don't find those floating around just anywhere.  But if there is anything you MUST get, it's a cup of the frozen custard.  Damn, that's good stuff.", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 5, "date": "2008-12-20", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "2sklUYBnk7LxzM-11yPUPg", "review_id": "iEkq9MFkcop1_CVnl-INSA", "text": "Go-to meal: cheddar butter burger, fried cheese curds, and flavor of the day custard.\n\nThe difference between a deluxe burger and cheddar butter burger is that in the deluxe, you'll get American cheese.  And you have to pay 25 cents extra to add lettuce, tomato, etc. to the cheddar butter burger.  File that away in your memory bank.", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 5, "date": "2010-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wTQHOi_-h1a02clSKCntzA", "review_id": "sywSyodHZeCQUJTftQej1w", "text": "Really good stuff!! The custard was great! I loved it and when I am back in the old USA I can only hope I will cross paths with another culvers.\n\nYou know what the thing is with culvers? You actually don't need that much, it's sort of like eating cake batter or cookie dough. You can only have so much before you start getting that sickly feeling and start stirring that plastic spoon around and staring down the custard and wondering why you dont wanna finish. Yeah it's custard and it's heavy especially when you add every kind of peanut butter chocholate bar to the mix.Let me tell you those first five spoonfuls are pure goodness then it goes downhill. Less is more with this stuff let me tell you! Next time I am getting the smallest size, and I will be far more pleased and not guilty I threw out a mega size bucket. Hahaha!", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 4, "date": "2012-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Veue6umxTpA3o1eEydowZg", "review_id": "Tfn4EfjyWInS-4ZtGAFNNw", "text": "Everything was great except for the burgers they are greasy and very charred compared to other stores.", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 3, "date": "2013-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uHTewfAzgsMxlETiqPv7cA", "review_id": "b5Dw5B0OKO3opxadCFkkSw", "text": "Stopped for food on our way home from a weekend in MN. Service was good, food was the norm for Culver's fare. If you stop here (or any Culver's for that matter) do yourself a favor and get the cheese curds. It's a Culver's must!", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 3, "date": "2014-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a7Ph-X9Drffar2tVlEyeAQ", "review_id": "mlz2M1g4f4Qu0w1GtZ872Q", "text": "Stopped here on our way home from the dells for a quick lunch. The staff was friendly and the restaurant  was clean. \nOur kids each had a cheeseburger kids meal which came with fries or applesauce and choice of a drink (we did milk). Also on the kids bag there is a coupon for a free scoop of ice cream with your choice of toppings! Even on this cold day the custard was amazing! My husband had a butter burger and fries. Everything was tasty!!", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 5, "date": "2015-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FXMgW849uWxPPygt_vtryg", "review_id": "Dmt89h6uxGxtz66SDwbk1Q", "text": "Stopped on our way through.  I have never been to a Culvers but noticed they were the local big shot.  That being said, I had heard of a Wisconsin butter burger, so it was time to try it out.\n\nThe out side of the location was very well maintained.  We did go through the drive through so I can not speak to the interior.\n\nWe placed an order with an friendly and helpful voice.  Once we paid we were asked to pull forward, so they not pre-made.  They were brought out to the car.  Only took a couple of minutes.  The burgers were fantastic.  Hot and juicy.  The buns were grilled, soft and melt in your mouth.  If I lived in the area, I would prefer this to 5 guys.", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 4, "date": "2015-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Rua6UHCxgOfgyPa0bW7Y7w", "review_id": "avPr3HW_H17xT9XCo9vjGg", "text": "Stopped here on our way to Dane County Regional Airport.  The free wifi was great to be able to use before getting on a plane.  We had plenty of time to eat our meal without being rushed.  We were there for a late afternoon lunch, so it was pretty quiet in the restaurant even though they had a fair amount of customers coming through (we were not the only ones in the restaurant by far).  The food was excellent and our order came as requested and with a smile!", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 5, "date": "2015-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MkMGeRyTRuwlFpRv4rW8AA", "review_id": "bSCfBd9GgKDH1K7owFjNxA", "text": "This is my go-to Culver's whenever I'm driving between Minneapolis and Chicago. It's conveniently located right off of the interstate about 10 minutes north of all the Madison exits. And when you pull up outside you'll immediately notice that the parking lot is packed with cars. This is the sign of a good place!\n\nAs for the food, there's really nothing special about it. I like the fact that the burgers are smash grilled and that the buns are buttered. They're not healthy by any stretch of the imagination but if I were forced to pick between McDonald's, Burger King, or Culver's I'm going Culver's.\n\nAs for this location, it's clean and well kept and the staff are always friendly. The bathrooms are also clean which is important for the weary traveler.\n\nI can't give this place 5 stars because fast food chains certainly don't warrant that sort of rating but it's quite solid nonetheless. 4 stars.", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 4, "date": "2015-12-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s__z7O5ybdky0KmXkA6MZA", "review_id": "y4UCrfk5uX7KI_TpqCS4WQ", "text": "Agreed with Dave's review about the staff and service being a hit or miss. I normally don't make stops anymore to cold stone restaurants because their ice cream is so expensive. Plus, I don't care for the taste of their ice cream. Maybe it is just me, but I think it's overrated.", "business_id": "AYoLKzRFajucKnjIFxc__A", "stars": 2, "date": "2014-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "03vp3tenQ0aQOr0AE5j8Uw", "review_id": "Q2fljxj6ipU0RXmW5SBfZQ", "text": "Time has not been kind to this Cold Stone Creamery location.  For a while, it was the next great thing - there always were long lines of families anxious to get their butterfat and sugar fix.  The buzz has faded and now those same families flock to the local froyo joints to get their frozen dairy fix.  I stopped by this weekend while shopping at Greenway Station and found the store devoid of patrons.  I know it's been a long, cold winter, but we Wisconsinites love our ice cream and Babcock Hall was standing room only when I visited later that same day.\n\nSo why does my ice-creaming loving family now generally eschew Cold Stone?\n* Texture - I really prefer a firm scoop of ice cream and that's not what you get at Cold Stone.  The texture is far too gooey for my liking.  It's not terrible, but I much prefer the denser texture of the product at Babcock Dairy or The Chocolate Shoppe any day of the week and twice on Sunday.  The other textural problem is that Cold Stone ice cream melts too fast, so bring a gross of handi-wipes when bringing the kiddos here. \n \n* Flavor - The ice cream here is too sweet.  At Cold Stone, it is all about excess, whether it be about the butterfat content, the sugar content or the oversaturated flavorings.  Again, it's not terrible, but it's just not my cup of tea.\n\n* Serving Size - The theme of excess carries over to the over-the-top serving sizes.  While I am not a huge fan of froyo, at least I can control my serving size when I visit the near-by Menchies or Orange Leaf.  In addition, while I'm on the topic of serving sizes, can I just add that I detest the cutesy \"Like It\", \"Love It\" and \"Gotta Have It\" serving size names.\n\n* Service - When the place first opened, the staff was energetic and responsive.  I admit it was hokey, but I kinda liked the dorky songs they sang when you left a tip.  But now, a trip to Cold Stone is more like visiting a gulag.  Leaving a tip rarely triggers a response, much less a chorus of \"Ice cream, baby\" sung to the tune of Ice, Ice Baby.  My other pet peeve is that the tables always seem to be sticky, thanks to the soupiness of the ice cream.  It's really kind of a depressing place to visit now.\n\n* Pro tip: If you have a peanut allergy, have them clean the stone before they mix your ice cream or you risk cross contaminating your treat.  (I learned that the hard way.)", "business_id": "AYoLKzRFajucKnjIFxc__A", "stars": 2, "date": "2014-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-59qOh8zgPmc4qsqZ2XTEg", "review_id": "V38K5bdcGkJtT4jNKwGU3A", "text": "Been coming here for years and this is a great location, although parking can at times be a bit tight.  One time I sat in the dining room and Mr. Craig Culver himself brought my order to my table!  Very cool that a guy with 500+ franchised locations finds time to still \"keep it real\" and deliver food to the customer!", "business_id": "kiAsweI4sOjDzGyz3Y_HsQ", "stars": 5, "date": "2014-12-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Rua6UHCxgOfgyPa0bW7Y7w", "review_id": "JfnnU3NhErmAsfhGBps3JA", "text": "Staff was friendly and helpful.  The food was great as always.  We came here for a late dinner after flying into the airport.  The staff was ready to take our order.  When our meal came to the table, one of the staff members asked us if we needed anything else.  At the end of our meal, the same staff member took our trash for us and wished us a nice evening and that he hoped we would be back soon. All in all, a great experience again.", "business_id": "q83uB6EGF6y2MuR-7VZPRg", "stars": 5, "date": "2015-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "MizkRmWjWS8lYuL6uMmjVw", "review_id": "BILtQsYqwnZlIwb5mIM8eA", "text": "Just had the worst tasting greasy cheesburger I have ever had.  Served with about 5 french fries.", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 2, "date": "2013-02-12", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "VgfxD1RTs9C9kd9HEFNXKw", "review_id": "qzdjU5fr4wgx0qQOtSpdVw", "text": "A freezer full of titles that need to be decoded!\n\nI asked the counter guy the tough questions: \n\n\"What's the difference between bear claw, elephant trax, and badger trax?\"\n\nI can't remember what the difference was other than that elephant trax sounded the best.  I didn't want to risk ending my day with artificial caramel, so chose the chocolate custard with peanut butter cups.\n\nPerhaps a little steep at upwards of $5 per pint, but hey, it's not much more expensive than regular-price Haagen-Dazs or Ben&Jerry's is getting these days, and I think it's at least on par, plus it's freshly made!", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 4, "date": "2013-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1DPy1-FSg9zJbUwarZkt_w", "review_id": "88Ehcyx1hxZuvEhNTivovA", "text": "I have been to this place four or five times.  It's ok for a brazier.  The servers were actually pretty nice; one time they messed up my wife's drink and they gave her a replacement quickly and with no hassle.  I haven't noticed any of the health violations rained down on this place in the other reviews, but I also didn't order the chicken sandwich.", "business_id": "QwUHifLjoc5hoxa74jpwGQ", "stars": 3, "date": "2011-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nmDcdE8LvcJ0vFy9jmctOA", "review_id": "MBu49T5t8Bn-OJ8qZLyjww", "text": "First of all, this is Culvers.  I love the mushroom and swiss burger, delicious, I crave it and I am not a fast food person!   They custards are to die for and I am glad that I do not live by a culvers because I would probably try to eat there every day!  I love their food, service has always been great here!", "business_id": "FiP9q_YD5vgxu_Sflo5oZw", "stars": 5, "date": "2011-01-16", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 0}, "user_id": "e4e-IyxRdWBO0Ak88yyacw", "review_id": "Hl-_EhhwUI_ZMQo5pan-rA", "text": "Every Wisconsin fatty loves a good butterburger, we all know that, but what sets this Culvers apart from the others is the fact that its hands down the best one in Madison, and maybe even Wisconsin. The food is always hot,fresh,well prepared,and served quickly and politely. The other thing is its cleanliness. Its restrooms are always very clean and smell good, and the tables are quickly bussed and wiped down to make room for the next customer. The floors are kept immaculate, and you will never see a mess on the floor or at the condiment station. I think this is because the owner takes great pride in his resteraunt, and is always there. I know this because I live close and eat here 3 times a week, and he's always there. Most of the staff has worked there for a long time as well, and are good at their job. This place is the blueprint of what a Culvers should be,and a shining star among the companys resteraunts.", "business_id": "FiP9q_YD5vgxu_Sflo5oZw", "stars": 5, "date": "2011-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "omOnbJjKaJUkvYi3reIB9w", "review_id": "1KVl3CUOk8MGLJMpu_JLuQ", "text": "It's Culvers, what else can I say. \nI love the place. Best fast food for the price.\n\nThis particular Culver's is getting a review because of how great it is. There is something about this location that stands above the rest and I can not put my finger on it. better tasting food, better frozen yogurt, better specials every day...I just don't know. It is just great.\n\nI have to also add in that this location is always busy. Always busy! Cars coming onto the road busy, so this must mean I'm not the only person that thinks this Culver's location is extremely awesome.", "business_id": "FiP9q_YD5vgxu_Sflo5oZw", "stars": 4, "date": "2013-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NGX1PZwHET_oQOT7vkkxag", "review_id": "G7R4179LFAAJcNy3DQyX3A", "text": "This is a review on just their coffee.\n\nThe coffee is bad. It has been burnt both times I have visited in the early mornings, despite my hope that the first time was an isolated incident. They sell the 'Seattle's Best' brand, which I would imagine is not inherently bad coffee, but something in their process is off, as it is not good coffee in my book: too burned and too bitter for how disappointingly not strong it is. Also, the coffee only comes in small cups. I wanted a 20 oz. jar of rocket fuel, but settled for 12 oz. of undrinkable ash.\n\nService was friendly and fairly fast. I could not bear to give this less than 2 stars based upon only reviewing one menu item, but if this was a coffeehouse serving this hot garbage, it would be a one star.", "business_id": "DWZ1_iy-cTeehK5FTiqH-g", "stars": 2, "date": "2009-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6zoKHExCjxIttyuIp_sXLg", "review_id": "1zl-zeQMwNolviep7qthLA", "text": "This place has wonderful servers who are friendly and ready to take their time helping every customer. Unfortunately, the management has a problem with scheduling enough employees to work. There is always just one trying to serve the whole floor every time I go there. And I've never once seen any of them get a break. Over worked employees.... Its sad. This place needs some serious help.", "business_id": "DWZ1_iy-cTeehK5FTiqH-g", "stars": 2, "date": "2015-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "NtmiVAP4zoM8Kx8_8SNgMg", "review_id": "WsA3hkYcvitjo2R1xeVCVA", "text": "A Champaign institution!  I bring all my out-of-town relatives and friends here when they visit during the spring and summer.  It's one of those things that lets you know that summer really is on its way;  when Custard Cup opens up in the spring, it gives you a sense of hope that winter may, at some point, end.  All the flavors and toppings are delicious.  Summer evenings, it's THE place to be, and there always seems to be plenty of outdoor seating despite the crowds.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2006-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "urDog6OhPoNKPJFUDob7AA", "review_id": "ix1j8l7POsgox55Kis0E-g", "text": "Yummmmmm.\n\nAt Jarlings, you could make a custom creation, but why spend all that energy when they have dozens of pre-made choices for you to choose from that all sound so good? If you're anything like me, you'll probably spend more time deciding whether you want the turtle sundae, the oatmeal cookie, the strawberry cheesecake, the rocky road, etc. custard than actually eating it!\n\nThe first time I went here, I got the strawberry cheesecake flavor which was yum and I suggest getting the junior size - it's actually a lot bigger than you think!  My goal is to have tried every pre-made creation by the end of my college career here at U of I while somehow not ballooning into an elephant... we'll see how that goes...\n\nIt's a shame this place closes for the winter.  Or maybe it's a good thing, as I'd get fat, fat fat! =P  If you ever plan on visiting the Urbana/Champaign area (or even if you're not), then I would definitely suggest you check this place out!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2008-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l_vRCjYILaY9PYWevubPwQ", "review_id": "AtWOCHFRfe4vIVX5_niUPg", "text": "I remember going to Jarlings with my grandparents and getting orange custard when I was 4 years old....\n\nI go back EVERY time I'm in Champaign and the custard is just as I remembered. :D The fruit flavors are still my favorite too.\n\nCASH ONLY", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2009-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hQbfq7XwuSCIAzzVqTGHvA", "review_id": "R_2mFOTxQ8Gk5oT6TVo3Kg", "text": "Cannot believe that I went to U of I (albeit for one year) and never ever went here! Though it's a blessing in a disguise b/c I probably would have put on the legendary \"freshman fifteen\" during the first month of school!\nSo glad my hotel was across the street and that I was here in November - I was able to try the Pumpkin Pie snowstorm which puts the consistency of Dairy Queen's blizzard to shame and makes the frozen custard from Culver's taste like poop in comparison.\nI also tried a small vanilla sundae with their signature cold fudge - wow.\nAlso gotta love the fact that they have a drive-thru! :-)", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2010-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9i-36HhVvgCcjGA2xsCmCw", "review_id": "F3WY8YGlEokR4DHqYwq6eg", "text": "Chambananites,\n\nThank you for introducing me to this place. When I first heard about it, I was a little grossed out by the idea of \"custard cup.\" Mainly I recall my past experience of rock-solid curd that everyone calls custard. However, I now understand that frozen custard is just a better and tastier version of ice cream. The selection of flavors is impressive and their ice cream cakes are tasty and great for parties. The biggest problems I have with the place is that they don't take credit cards and they are closed for winters. Man, I would still come to Jarling's even if it was below zero. It is that good!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2011-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aSyHqB5QIybJb3npJUy78A", "review_id": "w2-Xzyuvmfy_m73BlD3ffw", "text": "This is THE place to get frozen custard.  Forget Culvers, forget Cozie's, and definitely forget DQ -- Jarlings is the place to get frozen custard.  They have a sister-stand out in Danville that's the original Custard Cup and I have yet to go there, but I'll try and make the trek out next time we're at the Beef House.   \n\nThey have their version of a \"blizzard\" called a \"snowstorm\" which is whatever kind of topping you want, mixed into their frozen custard.   I've had a few of them, but the thing that you must get (and frankly, the only thing that I get or at least go back to) is the vanilla custard with COLD fudge.  HEAVEN in a cup.  'Nuff said.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2013-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1eEvrbhS3WutHboPJnYrIw", "review_id": "fkEMt7ND1RKMa6kY_FTTLA", "text": "Great price for fantastic custard!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2014-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EOjgKjLbfCssAqcGuBCm3w", "review_id": "vPNRc3YN10ZeXZa-oYrbnA", "text": "A nice place to hangout and get something sweet on a warm day. A big selection and the custard is creamy and delicious.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2015-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "EZ9Q_Qoz7Olo63Jmnc3EyQ", "review_id": "D1Lwj2YW7tvntNilD3L4Mg", "text": "good selection of paletas, also has ice cream, licuados, mexican snow cones, cockteles de fruta, as well as tortas. I've only had their paletas, which appear to be made on the premises. the pecan one was great!  I only wish there were more people here.  in the right location in the right city, the store would be booming.", "business_id": "9pYBiLe3k5Gi-AJqRklXcQ", "stars": 4, "date": "2012-02-02", "type": "review"}
{"votes": {"funny": 11, "useful": 7, "cool": 9}, "user_id": "C8ZTiwa7qWoPSMIivTeSfw", "review_id": "9Xf5Xs9YGhYEjPixQGcX4A", "text": "Dairy Queen? Or Dirty Queen? And I'm not talking about my femmy neighbor with the Member's Only jacket drenched in Patchouli. Really, it's not working. You're just stinky. But this DQ could use a visit from Mr. Clean and the Brawny paper towel guy. Both of whom I've had huge crushes on. Napkins, papers and spoons on the floor. Behind the counter wasn't a pretty picture either. They weren't busy and should have been cleaning. You know what they say...\"If there's time to lean, there's time to clean.\" However, my simple little vanilla cone really hit the spot. For that...2 stars. Staff was friendly. One more. Total. Three stars", "business_id": "zZmhEpiVpRfFQid87-pcOQ", "stars": 3, "date": "2008-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Br9mpMhkVunsp8Un5GpYWA", "review_id": "XvZr-Wrc3wGXn6MICr65rA", "text": "I am so glad they remodeled this place.  It was getting a bit run down, but is a staple as one of the only dairy queens in the central Phoenix Area.   The service is good and the ice cream always hits the spot.\n\nYesterday we went through the drive-thru and had to wait a bit, but once the window a Hispanic man in his early 20s handed us our amazing shakes and was so friendly.  He was overly kind and made me wish I had gotten his name as we drove away.", "business_id": "zZmhEpiVpRfFQid87-pcOQ", "stars": 4, "date": "2012-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "GubdNFoDAsiwE6bWIr97cQ", "review_id": "V_UoUC047f4uyJJhHmvfcA", "text": "I Iike soft serve and soft serve with a chocolate shell on it .... yum\n\nOh and nice folks and a decent price.", "business_id": "zZmhEpiVpRfFQid87-pcOQ", "stars": 4, "date": "2013-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HPa3ppuiPq7WRBuPVvhj8Q", "review_id": "kPNITmKjkGFFXM3aFCSXQg", "text": "Place was great. Staff was friendly, greeting, and efficient. Even thanked us for our business on our way out. My only compliant was the place was a little too small, gets crowded easily (pretty much all Dairy Queens are). Other than that, Awesome service!", "business_id": "zZmhEpiVpRfFQid87-pcOQ", "stars": 4, "date": "2014-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "v7Ej1VlitSTUXv_8Jy5THQ", "review_id": "ZPWtFt-Liu3VC-Rk7gqmpw", "text": "Was next door waiting for my girlfriends doctor appointment when I got hungry so I walked over to this place. Says doors open at 10:30 so I checked my phone and surprisingly it was exactly 10:30, so I reached for the door and it was locked. I decided to wait 5 minutes in the chair outside and watched an employee walk in and lock the door behind him so I left. Needless to say if your establishment opens at 10:30 then be prepared to open at 10:30. They lost my lunch business for today.", "business_id": "zZmhEpiVpRfFQid87-pcOQ", "stars": 1, "date": "2014-02-27", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "RxfFQxUtSIGYwTKU_rvAeg", "review_id": "yziVJBhgcOv3pdC_7kfxSA", "text": "I feel like I am about to sound spoiled and whiny but I am still throwing a tantrum over my trip last night. You know when you have a craving for something, have to have it, make the drive out to get it and you can't get it? Well, there is my \"Waaaah\" moment from last night. I don't normally eat at Coldstone due my inability to control myself with ice cream, but I decided that what the hell, I was going to treat myself and the family to Coldstone. For me, I NEEDED to have the Mint Mint Chocolate Chocolate Chip. The Like It size because you know, a girl needs to watch her waistline. Yeah right! So, we get there and they are out of brownies. Seriously?????? You can't go to the Fry's across the parking lot to get some? For me, the brownies in that particular \"creation\" is the best part. Unfortunately, my second choice would have needed brownies, too! To be minimally fair, they did offer to replace the brownie with chocolate cake, but that was not a good substitute. I thought I might be able to salvage this by adding chocolate sprinkles, but apparently they don't even carry that. Seriously? Isn't that a requirement at an ice cream shop? To make a long story short, I spent $3.60 on a small mint chocolate ice cream. At that price, I would have enjoyed buying a tub of the same thing for the same price. And the rest of the family got what they wanted except for the one doing the treatng! Grrrrr...", "business_id": "xAVAqgpZOYYvP4BtfUInsA", "stars": 2, "date": "2010-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 3}, "user_id": "wNqwKWaRjClmcKsoJJRFow", "review_id": "5Lsa7NF5t9C4aydih4dQFA", "text": "I get why people dig Cold Stone- it's like Subway, but with ice cream and other goodies. I for one just like me some plain, good creamy vanilla ice cream without all the bells and whistles. What can I say? I'm a cheap date and easy to please for the most part so Cold Stone is not on my regular rotation.\n\nThat being said, I work with some ladies who while lovely have much more discerning taste and that is where Cold Stone comes to my rescue. Their Ice Cream cakes really are good so whenever there is a birthday or special occasion at work, I pop into Cold Stone and pick up a Coffee House Crunch (Coffee Ice Cream, devil's food cake covered in chocolate and topped with Heath bars). It keeps my ladies satisfied every time.", "business_id": "xAVAqgpZOYYvP4BtfUInsA", "stars": 3, "date": "2013-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NNdfPF-UhvLB8FxbsuSC5A", "review_id": "AMRWqQgKoOXbEiKuL72DLw", "text": "Great place to just go for desserts.", "business_id": "PIu2Rocm6_Vyp2M3v6TKdA", "stars": 4, "date": "2014-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "66oDhsKSB_eSrhCKiERDow", "review_id": "F3rkvlMekGxK4jcoBRYhmA", "text": "This place saved my day after a disastrous dinner at Stingray Sushi.  \n\nMint chocolate chip ice cream helped soothe the stress and annoyance away, and the waffle cone had a great crunch.\n\nYes, it's a little pricey, \"but it is the Biltmore\" and you get a generous amount, compared to certain fancy gelato places where you get a tiny little scoop to eat with a tiny little spoon.  It's a substantial dessert.\n\nI'm not sure what to make of the attached \"KC Fine Belgian Chocolates\" shop/case though...", "business_id": "PIu2Rocm6_Vyp2M3v6TKdA", "stars": 4, "date": "2015-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xWSxGbY328cv0oAFgmfkdQ", "review_id": "KPZ4F0IwLuXV5FyPNaDZZA", "text": "Hey parents, the Baskin Robbins on 40th Street and Camelback has a great Tuesday night deal.  Kids scoops for  $1 and adults $1.50!  It is a great neighborhood business, we walk up and enjoy ice cream, and  run into my sons' friends from school, it's like happy hour for the kids!", "business_id": "XTtNevBI5G5x_GjFqSBMpA", "stars": 4, "date": "2010-01-22", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "GU6rcPRADsnXvaMFShimhQ", "review_id": "LUt2iAYnnnjn-hOXN_6Lxg", "text": "Friendly, fast, clean. Beeh here 3 times, kids always friendly and nice.", "business_id": "XTtNevBI5G5x_GjFqSBMpA", "stars": 5, "date": "2012-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gUXfVNgnNF9WU73T-d-FKQ", "review_id": "q-TFyADbsxCqfc9E6VPMAw", "text": "Although I am totally disappointed in this store for maintenance and management, I wanted to give an extra star because the young man who was working there ALONE tonight kept his cool, was kind to the kids and was clearly working his tail off.  Management of this store should realize that they are losing business based on the appearance of the store and how the store appears to be managed.  But thank you to  the staff for grace under pressure.", "business_id": "XTtNevBI5G5x_GjFqSBMpA", "stars": 2, "date": "2013-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "gUXfVNgnNF9WU73T-d-FKQ", "review_id": "OOfHBaMQmqFKO69HDSUv0A", "text": "When kids beg for ice cream, and it sounds good to me too, I am happy to consider Baskin-Robbins as this is what I grew up with.  However, this store is a continuous disappointment.  We went on a Saturday night and there was only 1 young woman working there.  I felt bad for her as she was truly working hard to get orders out to the line.  They've \"updated\" the store but it doesn't seem any better, just different.  And, on the weekend before Christmas, they inexplicably did not have peppermint ice cream.", "business_id": "XTtNevBI5G5x_GjFqSBMpA", "stars": 2, "date": "2013-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "SXzS6BwiG8JnpX59On2DVA", "review_id": "bNo2V4W2WU_-QZYw9QPctA", "text": "Never fails on Friday afternoons, they always have just one worker trying to service all the kids that just got out of school. Good ice cream but takes forever to actually get it.", "business_id": "XTtNevBI5G5x_GjFqSBMpA", "stars": 1, "date": "2015-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QLqQ9kqP0EHah-8im_TOgw", "review_id": "3ScIwbHi_WXL3r7xc_EIdw", "text": "This Dairy Queen would have five stars if it was located closer to home. The cookie dough blizzard will always be a favorite!", "business_id": "pkUj-lZb5ZEzLBw87-pOew", "stars": 4, "date": "2013-02-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "zAWtQH-UoiYXdACqnuoFPA", "review_id": "CmFDPvugbdq9AvEJkxNogQ", "text": "Not in the best shape compared to the Dunkin Donuts next door. The blizzards are superb as always. They have never been out of cookie dough. That bodes well for them in my book.", "business_id": "pkUj-lZb5ZEzLBw87-pOew", "stars": 4, "date": "2014-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LijsZOdgPHQTUeypj8mWJQ", "review_id": "Y2fVpRK-tgC3VNxBlj_YDQ", "text": "Wasn't going to write a review originally, but now I must. Came to this Dairy Queen the other day to get dessert. We got our blizzards, one was fine. The other tasted like there were iron filings in the ice cream. It was absolutely inedible!!! We asked for a new one and it was same. Tried to explain to the staff what was wrong and got the deer in the headlights looks from them. So, we left. \n\nToday we go back for dessert again. Went through the drive thru and they got our orders all wrong. Not even close. We went back through the drive thru to try and correct the order. They STILL got it wrong. I don't know what the issue is at this Dairy Queen but I won't be back.", "business_id": "vB3vEjcw9dfHmgP8ac5ZMQ", "stars": 1, "date": "2015-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s7NrYz-UVyL4Z_po_mBQsg", "review_id": "rYaLvCrGNgtIfHjeK0UGug", "text": "My favorite ice cream shop, though the prices are a little pricey.  They have seating either inside or outside.  I don't go to often anymore but they always have new and great flavors.  \n\nI usually get sweet cream and butterfingers in it.  Very good!", "business_id": "8WPCqC0Y-yszJi7eqfSllA", "stars": 4, "date": "2009-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ngD5RF07pxwlq4euexSluA", "review_id": "VIMl6AHl1gSgThxbLDj9TQ", "text": "I imagine most of you have been to Baskin-Robbins 31 Flavors before.  You are likely familiar with their standard signature ice cream flavors, as well as novelty flavors which rotate monthly.\n\nThis review is based upon the \"Baskin-Robbins 31 Flavors\" experience, not comparing Sweet Republic vs. Gelato Spot vs. Thrifty vs. Baskin-Robbins.  \n\nThis particular location is well run, and provides an overall EXCELLENT Baskin-Robbins experience.  It was remodeled sometime in the last year. In recent memory I can report that it is always clean and hospitable when we go.\n\nWe go to this location about once a week.  The employees are long-term, and the owner is often there.  It appears that effort is made to keep the place clean.  The employees are pleasant and friendly.  If you bring a child that wants to taste-test 10 flavors, they won't reveal any impatience, just friendly cooperation.\n\nYou can sit inside, in the newly remodeled interior, sit outside at the tables provided, or walk around and look in the windows of the local stores.  We like to walk  to Border's after our ice cream treat.\n\n$1.00 kid size scoops every Tuesday.\n\nWhile we do order a variety of flavors, our group is partial to the Jamoca Almond Fudge, Pistachio Almond, Mint Chocolate Chip, Jamoca, Nutty Coconut, and Strawberry Cheesecake.  I haven't seen Chocolate Almond for forever, and it's a little disturbing to think that it may actually be gone!\n\n\nRegrettably, Daiquiri Ice is no longer around, and for that I feel like taking away a star, but it's not this location's fault  that corporate pulled it.  Maybe I should look THEM up and rate them harshly for that omission!  .\n\nI highly recommend this location, for an enjoyable Ice-Cream Out treat.", "business_id": "qeqrsjWXc15KmlK5Z8580Q", "stars": 5, "date": "2011-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KRbef5i2vIfjo8KaFTiIAA", "review_id": "YGUGqnu3q0JAwItBR84dQg", "text": "Good service.  Free sufficient size samples and not just a spoonful.  The regular size is more than enough! When I was there, they were out of a lot of flavors though =(", "business_id": "sAwxt4I4gTiL-08nyarJbg", "stars": 3, "date": "2009-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "KvCkXJ11GbRhZsDf3hHozA", "review_id": "2vZAO_Yyv7ny9Lhs5CD0mw", "text": "With the world of yogurt and yogurt-like joints popping up, It seems that TCBY has been left behind. It's not bad, per se.. just uninteresting. \n\nStaff a this location were sweet.", "business_id": "sAwxt4I4gTiL-08nyarJbg", "stars": 2, "date": "2013-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fx1jNuoZjyn0t5g2KUeksw", "review_id": "UXGKtkXPCOYlrXm9rj0Olw", "text": "Love this location! The staff is always very courteous, friendly, and they make it a fun experience. They have the normal water and ice stuff, but also have a great selection of ice cream, snow cones, and other goodies. Definitely a place that I recommend!", "business_id": "OeMFOkAqCjKmVLPSsUDB-w", "stars": 5, "date": "2014-02-09", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "8cJ-n5BEb1LAR0qFM9zrxg", "review_id": "bEcii4uRpTjB9HgWNHvhuQ", "text": "Everyone's been to a Water & Ice franchise and there's not much to it. Jugs, water, candy, ice cream, shaved ice. Maybe a cart.\n\nWhat makes the place freaking awesome is the Indian couple who run it. I've never seen them there together, but one or the other is always there. The woman is very friendly but not all that chatty. The man, however (I want to say he introduced himself as Max, but I'm terrible with names and since my brain had reserved a space for a more Indian-like name, it rejected Max.) is ultra cool and will converse seemingly indefinitely about any number of topics. He loves to talk about the contrasts between India and America, that much is certain. For example, he corrected my belief that people from disparate areas in India speak only English to each other. Only true in business and academia--else, it's Hindi.\n\nI don't really mind. It turns the normally boring task of \"getting water\", something I'd never imagined when I lived in Michigan, into a potentially enlightening experience.\n\nOh... $3 minimum charge when using a debit card.", "business_id": "w8SrdJXeqTR4PZHieJ7DXA", "stars": 4, "date": "2011-01-11", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "QkYAXlYVm2AtdP9eFP6_Cw", "review_id": "KAqu9CuOW0bKSbmm9h1b2Q", "text": "How can anyone NOT like clean water for 30 cents a gallon?!", "business_id": "w8SrdJXeqTR4PZHieJ7DXA", "stars": 5, "date": "2012-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "NhFnyurAaCCEYmOBsCby7A", "review_id": "3WAaCPM2bMVf0bm4-jxpHQ", "text": "Dropped by today to go get a drink. I've had iffy experiences here before, but I decided to go anyway. \n\nI walked in with a buddy of mine. He got some candy, and I asked how much it was for a can of Coke. The owner yelled at me and said, \"You come here all the time for 3 years and never buy anything!\" The thing is, I would come here about 2 times a week to buy a drink. This man has no right to say that I never buy anything from there. \n\nI was shocked. I never knew someone could ever be so rude running a business. I asked him again, how much was a can of a Coke. He tells me that it was $.75 cents. WHAT? $.75 no big deal, but its thr fact that he LIED to me that got me mad. Every time I came here, they were always $.50, so how come it randomly got marked up to $.75?? \n\nUsually I wouldn't mind paying an extra $.25. But the fact that the owner lied to me and yelled at me really for no reason, I doubt I'll ever be coming back again.\n\nTerrible customer service, so, so rude. Too bad there isn't 0 stars.", "business_id": "w8SrdJXeqTR4PZHieJ7DXA", "stars": 1, "date": "2014-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fx1jNuoZjyn0t5g2KUeksw", "review_id": "_ZtTxIaJL-pVilomrjUmCQ", "text": "I really enjoy this Water and Ice location. The people are always very personable here, are eager to help, and always seem to be in a good mood. \n\nThere is also a good selection of things here. You can get your normal water and ice stuff, but in addition they have great ice cream, shaved ice, and a ton of treats. I take my family there every once in a while just to get a scoop if I've cream and hang out. I definitely recommend them.", "business_id": "w8SrdJXeqTR4PZHieJ7DXA", "stars": 5, "date": "2014-02-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Gf-7bqM-dTaImuvfZGhJ2g", "review_id": "_1dy-Fd2ny5c-njKA3UV8g", "text": "This is a great place for ice cream or just desert in general. I have been here many times, and they are always friendly, the ice cream is always plentiful and delicious, and it's a clean, modern place so you can bring the kids or family or whatever, and feel good about it.\n\nHere is my personal recommendation: Get an Oreo ice cream sandwich. This is Oreo ice cream in between two giant Oreos. It's kind of a mess to eat, but they give you a cup with it so you can catch your crumbs and eat them at the end. It's delicious. I could eat 4 of these things except I'm not a freakin' pig!", "business_id": "rHY8KUStCMQMSZCC2KRMfQ", "stars": 4, "date": "2014-12-30", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "qABKRj1ggJmtvrL9FMFtuA", "review_id": "WdVgUPm-4RV_1cfCitpmvg", "text": "Only $1 for kid sized scoops on Tuesday nights!  Everyone gets ice cream and I'm the best mom ever.", "business_id": "rHY8KUStCMQMSZCC2KRMfQ", "stars": 5, "date": "2015-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "ck-sjY6_f-3VCUAazs6MUQ", "review_id": "rw9R5WyQmSVZDAqLm6OcKA", "text": "Back in 1994, my dad and his friend took me and my sisters to Nielsen's to try frozen custard for the first time.  From what I remember, it's more rich, much creamier than ice cream or frozen yogurt.  Since then, I've never been able to find anything that comes close to that creamy, custard-y frozen goodness.  Apparently it's not that common here on the west coast.\n\nLast I went back, because I had to have that smooth chocolate cone once more.  There was a wait, which wasn't uncommon, being summertime in the AridZone.  There wasn't a nice little old lady helping us; instead there were teenagers running about behind the counter.  The entire place, small as it was, felt kinda...sticky, I suppose.  The napkin counter was gross from melted messes and grinder condiments.  I tried to hide my slowly-growing disappointment until I could taste the frozen custard I once knew long ago.  Unfortunately, the custard itself was just not the same.\n\nIt tasted like plain ol' chocolate ice cream.  There wasn't anything custard-like about it.  :(\n\n**Upon searching for reviews on the Net, I found that the Neiesens had sold the shop to a different owner, which would explain the downfall of  my favorite dessert spot.  However, they've recently gained ownership once again, this of course after my unfortunate visit last year, but I have high hopes!  Although I have few reasons to ever find myself in Arizona again, at least I know there's one thing to look forward to if it happens.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 2, "date": "2007-01-08", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "16GhsZiS_ybqfHO-7Av07g", "review_id": "nT_RfImaSXdj5tz5oiMUkg", "text": "Through all our trips to Arizona, we kept driving by Nielsen's Frozen Custard when we went to and from our hotel to our daughter's home.  Each time, I would say to myself that we had to give it a try.  However, many times we would drive by it when it was closed.  Well...this trip (our final one to visit our daughter who has now moved), we got here!\n\nUpon entering, we were surprised to find that in addition, to frozen custard, they also served meals (burgers, sandwiches, salads, etc.).  We were there strictly for the frozen custard.\n\nWe were greeted by a very friendly young lady who worked behind the counter.  She was patient with us as we perused the massive topping menu---so much choice!  In the end, I chose a small cup of vanilla with sprinkles and my husband had a small cup of unadorned chocolate custard.  After ordering, we were given a number to put on our table then the young lady brought out our order quickly.\n\nWe both agreed that the frozen custard had a nice, creamy consistency.  However, we found that it didn't have much flavor.  Neither the vanilla nor the chocolate had a strong enough flavor---and that was disappointing.  We were expecting much better.\n\nYet, we don't regret giving it a try.  Had we not done so, it would have been one of those things that would have nagged at me.  I would have always wondered if we had missed out on something excellent.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 3, "date": "2011-02-02", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "AeucYo8J-rZjcq09Wuqsjw", "review_id": "2gqik-aR4F4KNgXKyPARDQ", "text": "I was on a savage hunt for some yogurt and was determined to find the perfect spot to satisfy my craving... you know when you're craving something in particular and even though you really want it you become super picky?? yeah that was me.. we must have drove by 5 yogurt spots and i was being a brat and could not make up my mind which place i wanted to go into. When we drove past this place i was intrigued by the design  and decorations. It has a old 50 classic diner feel to it which i thought was cute. Even all  the employees were in their dorky little outfits/hats.\n\nwhat is frozen custard you ask??? It is better than ice cream... it is freakin delicious! toppings are endless.. Everything from sprinkles to cap'n crunch! I got the lemon flavored custard mixed with coconut, graham crackers and butter toffee nuts.. shit was the BOMB! so effin'' good.. better than i could have though.. \n\nYou can get large pint sizes to take home... they also serve hamburgers, sandwiches, strawberry shortcakes, root bear floats, French fries ..you get the idea.\n\nJust did dessert this time.. but i will be back Nielsen's..oh yes i will be back.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 4, "date": "2011-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pqnYZy25nEwGAAjShOpJGg", "review_id": "VvL9tRoahJRUfhgheOuj0w", "text": "The grinders & custard are heavenly, but there's too many kids standing around behind he counter & the food is expensive for what you get.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 4, "date": "2011-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 3}, "user_id": "GrSixRnGIxNUJ1Cn5DNX9A", "review_id": "scQTFw6IEzWjkbaZuWvbPA", "text": "This place is the \"Culvers\" for those of us kids who grew up in Utah.  Classic throw back burgers, frozen custard, and ambiance.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 4, "date": "2012-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "K46kUag6aS0Vd4JjiaqNsQ", "review_id": "lFV-7X8u2G7m-IJvZRUu3A", "text": "This is no where near the same as the Gilbert location.\n\nI ordered a chicken sandwich, because they didn't have the veggie one I get from the other location.\n\nIt came on a fairly dry crusty hoagie roll, with shredded iceburg lettuce, mayo (that I specifically asked not for), chicken, and some horrible pepper sauce. The sauce was not listed in the ingredients on the menu. It was not just hot, but tasted bad. I asked the person at the counter about it, they said they put it on all their sandwiches. Something they might want to mention on the menu.\n\nIt was pretty loud, and smelled greasy. The menu is not the same as the Gilbert location either. I was fairly disgusted by my food, so we didn't even bother with the custard.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 1, "date": "2012-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vghl1AbtojS7VnvFv5JUgA", "review_id": "ZA2UD3TlQ0tcekQ1u06pRg", "text": "Good food but ridiculous wait time! Do not go here if you are jn a hurry! Especially the drive thru! They do not seem too worried about you coming back again.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 3, "date": "2014-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0V4nNYIDKjhnxdxpt6QV9A", "review_id": "DkKd5T6bAWegPRFJL-srTQ", "text": "It was decent. Thought it was a bit over priced. And the building/furnishings seemed petty old and dated, as in breaking down.\nFood was ok. \nI was a bit disappointed, we have one of these in the town I just came from, but that one did \"endless fries\" when you ordered a concrete. This place, does not do that.\nWorkers are nice...just kinda like a bunch of 15 year olds looking like deer in the headlights half the time.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 3, "date": "2015-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "l9GGMi-zf2ZTbHbW8wrkTw", "review_id": "gZtRyb2hbJSQi-5DJ9HEPg", "text": "The burgers are preformed frozen patties, with not a lot of flavor. It's a brioche bun that's kind of hard. Fries tasted like they were frozen, definitely nothing special. To make a \"meh\" meal worse, I only drink iced tea and water (no soda or coffee). The iced tea tasted very old and nasty. I tried to get water from their soda machine but only a quarter of water cup dribbled out. \n\nOn the up side, service was friendly and the fry sauce was good.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 2, "date": "2015-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mUUy72UfqmFj_krWclKELw", "review_id": "8w7M5C2GrNh9DOnLkpPvzQ", "text": "I love this place!! They have different flavors everyday. I like coming Mondays for their Heath soft ice cream. YUMMM!!\n\nI'm going there tomorrow.... AND it's FAT FREE!!\n\nwahooo!!", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 5, "date": "2009-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "UPtysDF6cUDUxq2KY-6Dcg", "review_id": "TWHcWgTz_2f_U1_FXV-OJA", "text": "4 stars because they don't take credit cards. Really? In this day and age?  Yogurt and shakes were good, but not the best I've ever had, but a solid 4 stars.", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 4, "date": "2010-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6Jy9P_ncZgqu86PFlyURQA", "review_id": "9ync-_brp-d0PiUp0iEkXw", "text": "If you're ever in Mesa, you should definitely swing by Mesa FroYo, which is a well-known secret to natives of Mesa.  There's always something great to choose from in their six weekly favorites and the swirls are always fun for variety.  Prices are fantastic and the small is always plenty for someone with an appetite like mine.  I like encouraging local businesses and this is one I've been supporting since I was in high school.\n\nJust make sure to use the bathroom before you go because they don't have one.", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 5, "date": "2011-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "02TxK5mDNIHBccCFetDefw", "review_id": "xc0tbnOVuR16KI2NZy1lVA", "text": "Mesa Frozen Yogurt offers some of the best frozen yogurt I've ever tried.  Honest!   It's creamy and oh so delicious!  The best part is that all of their yogurt is low fat or fat free, and only 80 calories per 4 ounces.  So, eating here often is practically guilt-free!  Dessert treats without the worry.  \n\nAnother great thing is how each and every day there are new flavors to try.  Of course, they have classic chocolate and vanilla always available, but I like to be different and get something new every time I visit.  I go fairly frequently and I still haven't had everything yet!  Prices are very reasonable.  It's only 90 cents (plus tax) for their smallest size (3 ounces).   They have other offerings besides frozen yogurt too.   They have smoothies and a few snack-type foods.  \n\nMy only gripe is that they don't except debit/credit cards, so make sure you have a few dollars in cash on hand.  It can get busy in the evenings as well.", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 5, "date": "2011-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AcErO3j0GFTXbdJHbuD2-Q", "review_id": "DexgwUu5gQjvvEXXIKmETw", "text": "Ever decide to \"pass\" on dinner and just go out and find a good dish of frozen yogurt? This is now where we like to go. Some yogurt places have gotten expensive for what you get... not this place. Agree wholeheartedly with other yelpers about the creaminess of their product. Low in calories, terrific taste and not too expensive. What else could you ask for?\n\nIt would be nice if they took credit cards but they would probably have to charge more for their yogurt to pay \"the system.\"  Of course, it would be nice if they were located at the corner of Elliot and Higly too:)", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 4, "date": "2012-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "fX2HgiA7nyc6nBCL7082Rw", "review_id": "-wzAfVdqK0Bhumt_z1kBiw", "text": "My principal problem with this place is that the high school kids there clearly don't really care about the customers too much. I don't really think that they even care about anything too much. They're lucky that their job doesn't require a massive knowledge of customer service or their product, or that store would be screwed. \n\nOtherwise, it's a fantastic place with cheap yogurt and a well-maintained atmosphere. My personal favorite so far is the mounds bar flavor. I also like their shortcake and yellow cake. Peanut butter is good, too. Any of their weird flavors are truly where it's at. I work at the teaching supply next door, so I know for a fact that the awful nail salon smell is completely outside of their control, so please, if you smell this, please take it into extreme consideration.\n\nI've also had their pretzels and cheese. It's worth getting, but they microwave them, which is a little creepy. \n\nI really don't think much of their choice not to take credit cards, because I spend maybe $2.00 when I go. In all honesty, if people don't carry cash around with them, it means they clearly don't understand how much the credit card industry ruins the fuck out of local business revenue stream. Let them take cash only, if only because you care.\n\nAll in all, worth going.", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 4, "date": "2012-02-04", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "s8fJCSltyub39Q1dqzjb6g", "review_id": "Ggkb5438BpKSa3xvGaS2Rw", "text": "Love this place for a few reasons:\n\n1. They don't skimp on the good stuff. You want a medium? You GET it and then some. \n\n2. Rootbeer floats. By far the best bang for your buck, you get to pick your flavor and then you get to enjoy it with your favorite fizz.\n\n3. Price. Go on Monday nights because they do a 'happy hour' type deal on their toppings. \n\nFYI they are a cash only place, so keep that in mind before you go and it's a small space so if you have a group of more than 4, expect a tight squeeze.", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 4, "date": "2013-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IakyHuGotuFJUtunS2MxNw", "review_id": "uoShH4GC7wyTaTukzCS_1g", "text": "This place is awesome and delicious and way cheap. Bring a friend to argue with at the register. It makes the cashiers uncomfortable. Fun times.\n\nCash only though. Boo.\n\nAlso, don't bother trying to buy the tabletop Pac-Man arcade. They won't sell.", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 5, "date": "2015-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QTzji8HZjcu33VUe-GLrgg", "review_id": "jzxAHsTP1RnudCnRNlWbBA", "text": "Been coming here since I was in my mom's belly and it's still AMAZING!!!", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 5, "date": "2015-02-16", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "A91ijt-AIHDfdvi5zHzemQ", "review_id": "PV5m5WlBNUFLIxZO9eWrdg", "text": "I have been to so many Baskin Robbins stores in my lifetime. The ice cream is always predictably good. But what compelled me to write this review is the service. Every single worker, every single visit makes you feel welcome, gives you their full attention, and treats you great. It is obvious that a manager takes the time to tell their employees that customers matter, so be friendly, efficient and nice. So many places these days forget that you are choosing to come in and spend your hard-earned money with them, so it's nice to feel welcomed and appreciated. Keep up the great work! (I know this review makes me sound like I'm really old, but I'm not! I just am grateful for excellent service.)", "business_id": "_3xR-RAnabwTj4Drsdfjgg", "stars": 5, "date": "2015-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uurj0JCZM7TWW2LjtHZVjA", "review_id": "soztCCWSWAoafWuhji2GSA", "text": "Just got out of the drive thru at Dairy Queen. Sat down to eat a burger and a corn dog. The food was deliciously hot and fresh. Customer service was great. Would recommend any day.", "business_id": "5C4gtiP5qkBKFF3og7Wt3g", "stars": 4, "date": "2014-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F04PZuHKAm_JVFuHpq_TOQ", "review_id": "kxvuQliK7jGOJ-vSdgyOKw", "text": "Ecasketch bad service. Wrong order. Poor chris ..super hereo sosa to rescue! Dipped chocalate cone check. Lol!", "business_id": "kqFQLV63mAYCsY1LSB2OZw", "stars": 2, "date": "2011-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QAbVDdN0PyZKJzvUCA74Zw", "review_id": "ZpQXBPo_dck_rkRkKwZLDw", "text": "Amazing -- I ordered the same sundae I ordered at a Mesa DQ yesterday and was charged $1.04 more for it here.  That ain't sales tax and when I asked about it, I got a lot of lip.  \n\nSo, if you like price-gouging by a staff with an attitude, c'mon down to fashionable Apache Junction!", "business_id": "zvFhC2Lywo6e8UaRTVj7sw", "stars": 1, "date": "2012-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WrMC47lTEQD9PlIYpGbiYw", "review_id": "kmyH9vOR3dOHYMZ96QB_-Q", "text": "Went hiking in the superstitions. Great day, we are driving back to Scottsdale and I see the DQ sign. I haven't had a peanut buster parfait since college in 1980. I hit it pretty hard. You aren't going to live forever you know?", "business_id": "zvFhC2Lywo6e8UaRTVj7sw", "stars": 4, "date": "2013-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "U8nezeDJHBywLTfvNtTgJA", "review_id": "1MJNpN__RNrqoKhSCz9mjA", "text": "I love Dairy Queens and \"have never met one that I didn't like\" but this one comes close. It is dirty. The windows are gross. The landscaping needs lots of attention. They turn off the Pepsi machine so you can't get a refill. This store needs lots of attention.", "business_id": "zvFhC2Lywo6e8UaRTVj7sw", "stars": 2, "date": "2013-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e6WXJpvpm2D7kJlT6Dqicw", "review_id": "7xELqzrqgknLlrAwkczAJg", "text": "I like Dairy Queen but the 2 that are in Casa Grande should be avoided. Not vary clean and not EZ to get in and out of the parking lots. The people at both look like they hate life and feel that you are bugging them to make a order. At my last visit (the one by the high way) I just got a Blizzard and when I got it might as well have been vanilla with a bit of flavoring to it. I remmber when you would get chuncks of stuff in them! Don't go that offten so I may have just gone on a off day. 3 weeks ago I was in Tucson and got a way nicer blizzard!", "business_id": "cG1pHlWhdSc2M9ChWZo-dg", "stars": 2, "date": "2012-02-10", "type": "review"}
{"votes": {"funny": 5, "useful": 3, "cool": 3}, "user_id": "XBHJCDzNh--mBhJkzyM_iA", "review_id": "-d2ym-41cp-Uj5UeWsB58A", "text": "Why isn't there a 6th star for really amazing things like Thrifty Ice Cream?!\n\nHave you had this before?  I have not been to this actual location-- there used to be Thrifty's all over town but now they are all gone and their ice cream is sold in Water Mart Stores.  Anyhow, back in the day, it was like 10 cents a scoop--- they have the most amazing scooper ever, it's like square shaped and perfect.  I would get the mint and chip and chocolate chip and when I would order I would stutter and get nervous that I would mess up saying: \"Mint and Chip and Chocolate Chip\".  The man (probably was a teenager but to me as a child, anyone over 12 was a man) would hand me the ice cream and I would hand him either 2 dimes or 1 dime and 2 nickles, or 4 nickels or.... well you get the point--- THIS STUFF WAS ONLY 20 CENTS BACK THEN.\n\nNow it is about $1.09 a scoop and worth every red penny.  The best ice cream ever. EVER.", "business_id": "fN3RgiXJMoYcZzn9y8JRQw", "stars": 5, "date": "2008-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hNoxBirlv11CbXwRW2KxMw", "review_id": "3Nn-0ki0ac3OyxbzOubcBg", "text": "Ice cream was soft and not creamy like it used to be. Way over priced", "business_id": "KgYvd2BlQIGUw4Aj5qKevQ", "stars": 1, "date": "2012-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "nPjcsnRyX19tJbR3igncxg", "review_id": "uVRI7-C5L83IPU1CSn19Ag", "text": "Nice icecreams with a huge amount of alternatives. Nice place to grab an icecream when in the mall. Had the donought - one. Overall good place", "business_id": "KgYvd2BlQIGUw4Aj5qKevQ", "stars": 3, "date": "2014-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "RhHy4nBLhbIiUo7wzIcsbg", "review_id": "WIuxgTM1gl-Hiaz581nFeg", "text": "If I could no stars I would... We came in 2min before close as 2 other people were being served but we were told that they were the last people they were serving. Horrible business practice will never return there again. I understand you want to go home (I worked in a restaurant for 6 years) but at the end of the day we came in before close you should have served us.", "business_id": "KgYvd2BlQIGUw4Aj5qKevQ", "stars": 1, "date": "2014-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8fv1t-ZIvT0uW2DjjAV18A", "review_id": "BesjaJyHuPX_D_MYn7nW3w", "text": "I love this place, great custard, sandwiches, and soups. I fiftys diner feel inside this small little custard shop has big taste. Dont eat dinner before you come here for desert. There sandwiches are top notch. The freshest bread you can get. Their pepper relish could be the best thing you can add to a great sandwich. Then to follow it with frozen custard which will make you forget about ice cream or frozen yogurt. Must try in my book. Heaven is a hide away on baseline.", "business_id": "RgXWA8zXD83KnckFfWOqJw", "stars": 4, "date": "2011-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K46kUag6aS0Vd4JjiaqNsQ", "review_id": "1g97C8HRntiOGzNNlvP7ug", "text": "I've been going here for more than ten years. Its gone down in time, it used to be amazing, now its just pretty good.\n\nWe live on the west side now, so its always a treat when we end up on this side of town to eat here for lunch. Its generally pretty quiet, to the point that we're usually the only ones there. \n\nI get the vegetarian sandwich, and my girlfriend gets the pastrami. I love mine, sprouts, lettuce, avacado, and cream cheese. She said the pastrami was pretty good, not the best she's ever had, but still better than average. Their custards are still a good selection. The service was OK, the teenagers there were a bit slow, especially the boy working who was completely apathetic and lacked any personality.\n\nI miss that they used to offer a variety of breads to choose from for your sandwich, now its all hoagie rolls. The no longer offer iced tea as a drink option either, which is just strange. This sucks if you don't drink soda.", "business_id": "RgXWA8zXD83KnckFfWOqJw", "stars": 4, "date": "2012-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Sjp6EYsqzdlTvymER6wBfg", "review_id": "F2GpHUr7XTxOEJ0W5OSjGA", "text": "Very good ice cream.  My son loves it too.  Convenient for the area, with adequate parking.", "business_id": "EJzoRTV3IUSxpnxRAzngDw", "stars": 4, "date": "2006-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "ru8p3RTlk8f9LB_3zLXURQ", "review_id": "NWCUKAOmYzDdCr4fH4Lc0Q", "text": "Well, I must first confess that I'm not a big ice cream eater. I didn't grow up eating ice cream and even as an adult, I haven't grown to like it but I know there are plenty of other people who do . . . So to those that love ice cream, Cold Stone is prob worth it. Unfortunately, to me it just seem really expensive for what you get. :(", "business_id": "EJzoRTV3IUSxpnxRAzngDw", "stars": 2, "date": "2013-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AkJFqLqHHAKY3H5R8p7cPQ", "review_id": "phOs3fgWmVUGWny7GDFx6Q", "text": "This is the only Ben and Jerrys that has successfully withheld the recession in AZ.  This means that this is the only one left as well.  Its located in a beautiful plaza called El Pedregal.  They have live music on Sundays.  I found out this information from the friendly owner who told about the history of the store since I asked him if their location was really the only one open in all of AZ.\n\nThe location is very North Scottsdale.  I am not sure how it does for business, it is far from commercial areas.  On my drove over, I mostly noticed many well built homes.  \n\nThis is the only Ben and Jerrys left, and I strongly encourage those who enjoy this ice cream to go out and support their business.", "business_id": "uf4AWTEI6RmRUXx-28MZsg", "stars": 5, "date": "2011-02-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "r3wE-UMb-ooPsn0805v-3w", "review_id": "6J3WwmwBAu0IQOkvS8ju-w", "text": "You can't go wrong with any flavor from Ben & Jerry's. This particular branch is located in a modern plaza with a beautiful courtyard where you can watch performers while you enjoy your ice cream.\n\nThe customer service can't be beat! The staff member, who I think is also the owner, was just so nice. He gave suggestions of what to see and do in the area.\n\nI'd come back again just for the excellent customer service!", "business_id": "uf4AWTEI6RmRUXx-28MZsg", "stars": 5, "date": "2011-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m1Be6yOl8texdFfH337z7Q", "review_id": "BJ7jRYftX_2QQ2BSfDhoGg", "text": "Pretty pricey but worth it! Not everyday you can get a chocolate dipped cone with 3 different scoops of amazing bliss! Workers are always glum but just pay and escape and enjoy!!", "business_id": "uf4AWTEI6RmRUXx-28MZsg", "stars": 4, "date": "2013-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-DRza4wuHHWfQx5HcG6qaw", "review_id": "mMhZZ8bumrm7mIh7BLWLMw", "text": "If you love their ice cream this is the only place you can get a served scoop in a cone in the greater Phoenix area. I made the drive which is a long one from central Scottsdale and extreme from much of the Valley of the Sun. It was nice to enjoy the ice cream. It is a great product and I think it is superior to any other. This is not a full size store. It is in a shopping center that seems to be suffering. I hope it survives. I haven't been for a few months.", "business_id": "uf4AWTEI6RmRUXx-28MZsg", "stars": 4, "date": "2013-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2XAf88R9tAXYplDt3VQc3g", "review_id": "42vUur_OmzvT0KiIgxHEvg", "text": "I have been going to this store since the beginning of the Summer. I found out that they carry Alkaline Water, and at a great price. They carry everything else that I needed and then some. What impresses me the most is the staff. They are extremely honest, and helpful. Robert, was helping a nice older woman today with her heavy water containers out to the car. I had an issue with a container I purchased from them earlier, and Robert made good on it, without any concerns. He was genuinely ready to help. He always is. The entire staff is great, and the prices are good as well.", "business_id": "yna3dHG51ukNanJRee2eEA", "stars": 5, "date": "2014-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tneUYqHFdHBVOXqN_Weovw", "review_id": "VS8G9OCSmvZFoKs7UnBwcg", "text": "This is the only place I will get my alkaline water! Staff is friendly and helpful! Cleaned bottles for me and even put all 5 water jugs in my car for me! Worth the drive for me!", "business_id": "yna3dHG51ukNanJRee2eEA", "stars": 5, "date": "2015-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_fncczCGkKc2wHquzL6iIA", "review_id": "1DdQliTe3EBdContfswWkQ", "text": "We went here on a lunch break one day just to get dessert.  Little did we know that after ordering a malt and a shake, we would wait in the drive through for literally 15 minutes.  About 5 minutes into it, we started looking for escape routes.  Just as I was about to back up a bit and sneak around, another car boxed us in.  Its not like they had a huge line either.  That 15 minutes was spent second in line.  They didn't get anyone through.  I cannot speak to the quality of their particular chocolate desserts since we just peaced out.  We ran out of time waiting for them.  Next time we'll go to smashburger just down the road.", "business_id": "L6Qumi_rEtOAfX2FQXm06Q", "stars": 1, "date": "2011-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "lbkWqrp_PN-qY0iNYU_X1w", "review_id": "VWewKwDWFzZ217OtE9f6jA", "text": "Had a bad experience here. We ordered 2 small dipped cones and one of them was EXTREMELY small. When I told the girl at the window, she just took the cones with an attitude and closed the window. Another girl came to the window and I explained that one of the cones was really small and she said that they \"weigh\" the cones. We were regular customers so we know what small cones are supposed to look like...and this cone was even smaller than a child size cone. They didn't offer to re-do the one cone, so I just offered to pay extra to upgrade to a medium. The original girl came back to the window, charged us for the additional amount for the larger cones and handed us the two cones...and one of them was STILL much smaller! She just handed the cones to us with a pissy look and closed the window. No apology, she didn't say \"thank you\" like most drive thru staff would do....just an attitude. She clearly had no social skills and shouldnt be dealing with customers. As she was closing the window, I told her that she doesn't need to have an attitude. At that point, she opened the window and told me that she doesn't have an attitude. I'm usually very tolerant, but being in customer service myself, I just cant tolerate rudeness.", "business_id": "FBNxmgHqP9ksk-56XLJ1eg", "stars": 1, "date": "2014-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fWgsVZ18ABXZ3hCblnr5tg", "review_id": "_-lCDB71GiBLK-nRavtiyA", "text": "I went in last night to get ice cream with my husband. The particular ice cream mix that I was looking for wasn't on the menu \"Cheesecake Fantasy,\" so I just described it to one of the girls behind the counter.  She knew right away what I was talking about asked for the size and ran off to make it. I was looking forward to getting a waffle cone cup, but I didn't even have the chance to tell her before she was done. She didn't ask either. \n\nPart of the reason why I felt we were a little rushed off during the time spent inside.  Was because three gentlemen had arrived before us and it seemed like they all knew each other.  They all talked during the whole time we were there. \n\nWe won't be coming back to this location again.", "business_id": "v8w1vCDYh6BhXQFzFMUsWg", "stars": 3, "date": "2014-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E_1N6H102rr1YdZAakDLYg", "review_id": "AX4u1XaFo6hXsK4-2YZa7A", "text": "This is the old location. For current reviews, look up Karen's Kreamery Cafe'. Here is what I posted for the new location...please give it a chance. I do not know the owners, I just love supporting a good, local business...\nGreat ice cream, super cute store, extremely CLEAN! The ice cream is good, service is always great, and the location is fun (although a little out of the way). The prices are reasonable. I would rather support a locally owned business and pay more than McDonald's prices and less than Cold Stone prices. If you haven't been, and plan on visiting in the Summer, bring suits for the kids. There is a nice little splash area right next to a big playground. Karen's Kreamery is located in a big park/sports facility. There is also a medium sized skate park. We usually make a fun outing out it. My family loves this place!! Support local businesses!!!", "business_id": "Om3WtcK5qgwEW5-CojPMxw", "stars": 5, "date": "2011-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "3Zi1udoY2iT9s8Q3X6tgZQ", "review_id": "nCbqvpN-CMSM_CkxTrMeZQ", "text": "I guess I just felt like having expensive ice cream for some reason and I stopped in here. The service was okay but it took unusually long to make my order.", "business_id": "AK2oVi1ppr19mWpNkyTs8A", "stars": 3, "date": "2011-02-28", "type": "review"}
{"votes": {"funny": 11, "useful": 8, "cool": 8}, "user_id": "o1HQEND6cg-4SK0Z1ASBMQ", "review_id": "x-p6gqfyHqGyxXnxwTnHBw", "text": "Look, let's face it, Maggie Moo. You never even stood a chance.\n\nYour flavors are pedantic and unimaginative, your service is lackluster and disheartening, and your prices defy logic.\n\nIt's fucking ice cream, and not even good ice cream. I wouldn't know. Maybe if you took better care maintaining your merchandise, it wouldn't taste so terrible.\n\nWhether the flavor's \"too soft\" or \"too hard\" it requires you take the reserve tray out of the freezer and serve some of that to me instead. \n\nSo apparently your display case is just that. Display.\n\nYour mix-ins are lame and stale. M&M's and sprinkles? Gee, don't give yourself a fucking aneurysm with all this creativity. \n\nSo you really didn't have much going for you already by the time your cashier called me \"sir\". TWICE. \n\nThe second time was my fault though. I tried to intervene and correct her.\n\n\"is that all for you, sir?\"\n\"Um...it's ma'am, actually. I'm a girl.\"\n\"Oh. I'm sorry, sir!\"\n\nIf I hadn't said anything I would've only been offended the one time. Mea culpa.\n\nIt's not entirely that girl's fault I'm giving you one star, but it certainly helped convince.\n\nYou'd be well informed to know I'm writing a letter. Not to your manager or anything. \n\nBut to Coldstone Creamery. Begging them back.\n\nI figure why be with a knock-off of a piece of garbage when I can just be with the real deal, you know.\n\nHa ha! Who am I kidding. \n\nThis one event will probably deter me from ice cream all together. \n\nI'll need to set \"Gelato & Frozen Custard\" on the \"Ice Cream Orientation\" box on all my social profiles.", "business_id": "d_B84CIeaUE-UbN41_txdQ", "stars": 1, "date": "2008-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ewnwxqKtpDv8erOIZkCpjA", "review_id": "DNc_kNL5oJFOHPrlvvFFrQ", "text": "Typical Baskin Robbins. Really good ice cream, service was what you'd expect from a couple of high school kids. Had a hot fudge sundae with pralines and cream and peanut butter & chocolate. I would have liked to have quarterback crunch but the sundae was still tasty. The interior is a little run down, could use a little freshening up. Overall, very nice place to have some classic Baskin Robbins ice cream.", "business_id": "Yt0qDtYzioJTUnDgHHTD-A", "stars": 4, "date": "2014-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ha7UXR17m9t6831Y7OVOTg", "review_id": "kLlYODcRE-y9FLbPkhA8Wg", "text": "Great news for the neighborhood, this store has made a complete turn-around!\n\nI am a customer (a local business owner) who stopped in a few months ago when I noticed a Thrifty's Ice Cream sold here sign on the door and decided to stop in.\n\nHaving grown up in Arizona with Thrifty's Ice Cream at our local Thrifty's drug store, I am kind of a Thrifty's addict. The Thrifty name has been gone from AZ for a long time, having sold out to Osco, then Rite-Aid, then gone altogether, so whenever we are in California we try to stop for Thrifty's Ice Cream at whatever Rite-Aid we can find while passing through. We really miss it. \n\nHowever having stopped in for a couple double scoops, and since having returned several times, I must say this store has made a great turn-around under the new ownership. The store is clean, the staff is courteous, professional, helpful, and even fun to talk to. Yes, I just said that about the staff!!!  We will definitely be back. I am so glad we stopped in that first time, and after several visits I must say, I hope they do great here, glad to have them and we have a good business here again! Today the cashier was helping a lady out to her vehicle with a cart full of bottles when we arrived talking cheerfully to one-another and we noticed several bistro type tables inside to sit down. When we were making our decision, we had a nice conversation about the ice-cream, Thrifty's, and the store's changes... Nice to see some changes!\n\nThe best part is, for all of the Thrifty's Ice Cream lovers, they have two huge serving freezers full of all of our favorite flavors like \"Chocolate malted crunch, mint chip, chocolate chip, cherry chip, cotton candy, pistachio\", and all of the great traditional Thrifty's flavors we have come to love. Looks like they also have snow cones or Hawaiian shaved ice too, you can get the ice-cream in a cake, waffle cup or cone. \n\nLet's get the word out that this water and ice store is worth another chance under the new ownership and yay for the ice-cream!\n\nSam (Desert Solutions) Peoria", "business_id": "B-shvo846pGwHGPUIHqwfw", "stars": 5, "date": "2013-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6ZT-UiVFQ93fMDfeoltuQQ", "review_id": "knmkPNAw46NvQy5xsPKXMQ", "text": "Great Family Owned Business. \nMy 11 yo daughter and I were on a road trip across AZ and we decided to stop in Wickenburg before we left for California. Great Ice Cream, great atmosphere - live country music while we were there. Very personable staff. We decided to stay the night and one of the owners recomended some places in town. Found out the owners were transplanted Californians - I think they are on to something.  Worth stopping for when you are in Wickenburg.", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 5, "date": "2010-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "X0TpukOMllmxwClmqEK5rA", "review_id": "V_HRasnq-BZ-MJSjm2OS1Q", "text": "Delicious homemade vanilla ice cream with spicy cocoa topping. Even had live music in the middle of the Saturday afternoon. Very pleasant.", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 5, "date": "2013-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TQlcm6sa-LaIlf8o0LaKaA", "review_id": "vCHZ8qGm0UILCI1HHgAehA", "text": "The worst restaurant experience we have had in a long while. We arrived and ordered lunch. There were maybe 20 people in the restaurant. Apparently the party of 6 that ordered ahead of us completely overwhelmed them. We bussed our own table so we would have somewhere to sit and had to wipe ice cream off of it. We waited for a half hour and then had to walk up and ask for the drinks we had ordered. 10 minutes later lunch came. I had ordered my pizza without cheese. A 40 minute wait for lunch with children and then the food came out wrong. She did refund me for the pizza and try to make it right by giving the kids free ice cream but the owner or manager is doing a terrible job of staffing. If you have a ice cream parlor in a tourist area you should have it fully staffed on a Saturday afternoon,and the guy with the big earring is doing nothing but standing around staring. You could probably do without him.", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 2, "date": "2014-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Pt-5NPLurRVdWlSRi1mEJA", "review_id": "xAXquXxACqZdHF3muulqhg", "text": "We visited here after going to the museum. This is a lunch and ice cream place.\nLive music was playing as we ate our ice cream. I had the special for the week or month, which contained honey roasted cashews. How can you go wrong with that.\nWe recommend", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 5, "date": "2014-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZI1PrgDFvSpYWafvJh9wAg", "review_id": "9TmvnjWd4ku0G1Cjp2DNiw", "text": "We went into this place for lunch, but promptly left for 2 reasons.   1. It smelled like a sewer and 2; there were NO customers at lunch time.  The place across the street was standing room only.  Place was cold temperature - wise as well as decoration-wise.  Too bad.", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 1, "date": "2014-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wnJTH1uVhHNl934o-Gr7cQ", "review_id": "fvsNfe_ihJrlwjVIEHEwVA", "text": "Outstanding. The coffee is excellent and the ice cream is the best in Wickenburg and the breakfasts are really good too. I recommend the milkshakes.", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 5, "date": "2015-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8XAvSE4oURfn9RIbVwOMlA", "review_id": "WOv1Jw-DKwCvlD08eVluqw", "text": "The Best Ice Cream place EVER. We love the place and the staff. Not only do they have Ice cream, they also had various food, coffee, drinks and live music playing Holidays songs and other.", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 5, "date": "2015-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SMXKJnXVI4CJumSzUx2G9w", "review_id": "VY6CvKWZ--s8EpwlmYJROg", "text": "Of course being 75 miles away and having to order an ice cream cake for the next day I was sweating it a bit.\n\nI spoke to Kendall who was very helpful of getting what I needed and made the shopping experience totally enjoyable!\n\nIt's 50 degrees outside so I wasn't too worried about the cake melting and Kendall assured me that that fake was super frozen and not worry.\n\nCan't wait til tomorrow to eat this thing up!", "business_id": "PMpQAV7glwhKhnHfDa30Dg", "stars": 5, "date": "2015-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nCFsfJR8K9gycWauECTgSw", "review_id": "M5TnMNrZspnknHGSDTlZzA", "text": "Great tasting Ice Cream but if you have an opportunity to go to a different location, be sure to do so. This place is always busy due to the delicious flavors however the owners have apparently failed to realize this and under staff on every occasion. Staff is always friendly, greets you & asks genuine questions while waiting for your receipt to print but if you don't have twenty min to wait in line to order in the first place, you'll want to pass on this stop.", "business_id": "t8PQ5iKCeeofy-nXvTNk2A", "stars": 3, "date": "2014-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YH7fGd3TbHwApC91rn5jmw", "review_id": "I9_uTa9s9dEug67yXn-cqA", "text": "Tuesday night at 8pm and only one person working? Ugh, this is taking forever... long wait times for expensive ice cream!", "business_id": "t8PQ5iKCeeofy-nXvTNk2A", "stars": 2, "date": "2014-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d44p2mRF3fc7X7UzLdnP8w", "review_id": "T0HUxKEczTBHErFu9VOYxA", "text": "Usually I really like this place but, on a Monday night with ONLY 1 person making the ice cream and 6 people in line..  Not good customer service Stone Cold..", "business_id": "t8PQ5iKCeeofy-nXvTNk2A", "stars": 1, "date": "2014-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OFWz5NhJNZkxyWk8Zel69Q", "review_id": "6fFjScvPjCMkm6FeYdqPEg", "text": "I've been going here for years. If you want soft fresh Mexican style ice cream this place is the place is the place for it. They have several unique Mexican flavors. While I don't think the mamey is the best it is still pleasant and a more approachable introduction to mamey flavoring which may be a but stronger to some. \n\nThe corn and the other snacks are also very good. I would also recommend the raspados and the aguas as they are very good as well. I'm a bug fan of their Tamarindo agua. Would recommend to someone who wants to try a different, sweeter taste of Mexico.", "business_id": "piVGqwrZVBVUi3QFZsky5A", "stars": 4, "date": "2014-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "Xcbi0M0Jt19gCS75gouvTg", "review_id": "d0oq6uVJWCycmOZCJ1yqmg", "text": "I love La Michoacanas! \n\nThere are more than 1 of their kind. \n\nThe thing with this particular location is that as soon as you walk in their is a slight foul odor. Why? IDK!\n\nI really love their ice cream it doesn't get better any better than this. However I am inclined to write a review based of multiple experiences that I have had. \n\nMy most recent experience was very disappointing, I went in with my small children we ordered our ice cream and then the guy says \"it is $1  to pay with credit or debit.\"\n\nI felt horrible because I wasn't going to take the ice cream from my children mouth. I do go on to ask the owner if there was a sign posted anywhere he said no. \n\nI don't ever carry cash and if there was a sign posted I would've gone to another location. \n\nThe ice cream is great though. Just highly suggest putting up a sign for extra charges.", "business_id": "piVGqwrZVBVUi3QFZsky5A", "stars": 3, "date": "2014-02-26", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "4qaviROg6YclcYkzjq5tMA", "review_id": "SE_CT2GXh_Dplsu97993DA", "text": "I came here for Blizzards for the fam.  When I got home, my hubby asked me what that intoxicating fragrance was, when I was near him.  To which I replied it was Dirty Fryer Oil de Toillette.  Seriously, would it kill them to change out the oil?! Other places that fry stuff do not smell like this.  I had to hang my head out of the window like a dog on the way home to try to get that smell out of my hair.  It just permeates in your clothes and hair the minute you walk in.  If I didn't love my blizzards so much I wouldn't come here at all.", "business_id": "SchSiNdLjuRjjrsXFeggWA", "stars": 2, "date": "2014-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "A_kW4YWs_PNgQDxmmOv-bQ", "review_id": "z_OKoeRhXucXfozXy35lCw", "text": "Terrible! I see why it's B rated. My chicken sandwich had old lettuce on it, the fires were burned and flavorless, and the cheese I paid extra for wasn't the same as the other locations. So disappointed and I'm pregnant!!!", "business_id": "SchSiNdLjuRjjrsXFeggWA", "stars": 1, "date": "2015-12-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "VUzGMSH9u1E3h4QxaIl6cw", "review_id": "tpiLL9Ih5r_gA-nKmDxb8Q", "text": "Nothing beats Baskin Robbins on a hot summer Las Vegas day. Heck... even during the winter you can find me in there ordering. Granted one thing that makes this store unique to other ones, (and by that i mean the ones i have been to), THEY SERVE PINK BUBBLE GUM ICE CREAM!! WOOHOO!!!!\n\nYes ladies and gentleman, I love me some pink bubblegum. LOL And most importantly, the staff here are all awesome and deserve our business.", "business_id": "Ze0mG__i-9ziEjN2gLcHqw", "stars": 4, "date": "2010-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OzUrhOyz1tn8C2Yb_1lCog", "review_id": "CKvLOa9XbHZoOZJVy6z1XQ", "text": "dollar cones on tuesday and wednesday.. can't beat it!", "business_id": "Ze0mG__i-9ziEjN2gLcHqw", "stars": 4, "date": "2013-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9XPgaXr0cq3CGEpY3G3IJQ", "review_id": "ohZ4woADoDxwkkcf3GJBog", "text": "This dairy queen is always clean and they have a good  2 for 1 special every day. Mondays is the Oreo Brownie Earthquake which is yum. I normally get a chocolate cone or blizzard and it is always good. They are really patient with my 5 year old as he likes to order and pay on his own:)", "business_id": "m4_H2hZKSoA2iu5aqrP1nA", "stars": 4, "date": "2013-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "e-t-I6jDb-_HJiaacQFywQ", "review_id": "0Qkvy5lLXW-kDZMAmFoO5A", "text": "SQUEE. I love ice cream. I love Dairy Queen. I love Dairy Queen ice cream.\n\nMainly I visit this for the oh-so-close-to-home Blizzard craving that comes about, but their non-ice cream food is good too.  I always receive stellar service here with nothing less than a smile.  Quick, too.\n\nOreo mint Blizzard = heavenly.  They also have like, 4 sizes now too - I'm so glad they started offering that!  You can have your sweet tooth in a Kids' or Mini size.  As Goldilocks would say, \"Juuuust right.\"", "business_id": "m4_H2hZKSoA2iu5aqrP1nA", "stars": 5, "date": "2013-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Mc0Lz5s4SSpBVT4hH3xb1A", "review_id": "cpaYKJKee4za3c4NH4iSew", "text": "The service here is amazing! Robert the manager is always super nice&makes my cream exactly the way I like it. Nick is super awesome! I highly recommend this DQ!", "business_id": "m4_H2hZKSoA2iu5aqrP1nA", "stars": 5, "date": "2013-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "STQei9SLxrg0ZvrJmu4M_Q", "review_id": "xVVdcx_dOA2WjYfb29XdSg", "text": "For some reason I never knew about this place until recently. Now that I know about it I will definitely return every time. I hadn't had real\nfrozen custard since I was a kid. This is the genuine article. It's \nnothing like soft ice cream,which is already half melted when they\nhand it to you. This stuff melts slowly. It's very dense,unlike soft\nice cream which is mostly water. The flavor becomes more intense\nas you lick it.  Not located in a nice part of town (right next door to a \nstrip club) but worth seeking out. How often do you find REAL custard ? Highly recommended.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2006-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "At4WAM3e3xdhx832o-W-Yw", "review_id": "6RgC4dMS-UZ5Wy5jV6Kimg", "text": "i had read a lot of good reviews about this place so when i was in vegas i decided to try it. i had the chocolate frozen custard, it was good, but there was a sewer stench coming out of the window of the store. the frozen custard was sweet and yummy, but i can still smell the stench that was blowing my way...ewww. i don't know if i would go back for more, but i didn't get sick or anything!?", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 3, "date": "2007-12-17", "type": "review"}
{"votes": {"funny": 42, "useful": 40, "cool": 40}, "user_id": "fRbbPPUdMCmL9o39yshi2g", "review_id": "9wYh1DMw0wTrSA2L6nq_FA", "text": "I HAVE URGES... \n\n\"There is a human urge to clarify, rationalize, justify\", said Leonard Bernstein. \n\nThat sounds like a good description of Yelp, doesn't it, but that's not the urge I have. \n\nThis definition is a better fit: \n\na. An impulse that prompts action or effort. \nb. An involuntary tendency to perform a given activity. \n\nI have an urge to go to Las Vegas pronto. \n\nDo I like to gamble? Yes, sometimes. \n\nDo I like seeing some great shows? Definitely. \n\nDo I like going to the International CES, the world's largest consumer technology trade show? Oh, yeah, so much fun. \n\nDo I like staying in some great sexy hotel room on the Strip? You better believe it. \n\nBut none of these are the reason for my urge. My urge is to go to a little nondescript shack located in a questionable, seedy area away from the Strip. The only strip this place is close to is the Olympic Gardens Strip Club that offers male and female strippers, and where lap dances go for 20 bucks. \n\nI need to go to Vegas because I want me some ice cream from Luv-It Frozen Custard NOW! \n\nFrozen custard is French style ice cream. It's lower in butterfat and calories than ice cream, and is made with eggs, which gives this indulgent concoction a creamier texture. It also has much less air whipped into it, and there are two types of air I don't like: people full of hot air (no, I'm not telling now) and ice cream full of air. \n\nI don't even like Sundaes, but at Luv-It Frozen Custard I am simply hypnotized by everything they have. Western Sundae, their most popular - vanilla custard, caramel, salty pecans and hot fudge? Give it to me now, before I get arrested for yanking it from the hands of some unsuspecting Japanese tourist! Bumble Berry Sundae? What's in it? Wait, I don't care, just pile it on! \n\nEverything is homemade, frozen custard flavors change every few days, so check their website, if you want to know what specific olfactory and oral pleasures to look forward to. Even their website looks hokily homemade, which in this case is just charming and consistent. \n\nSo, if you want some frozen nirvana, if you're tired of seeing same old, same old corporate clones that look identical in LA, Johannesburg, Vegas and Moscow - this is the place for some instant bliss. \n\nWhat happens in Vegas, stays in Vegas...   I wish Luv-It frozen Custard didn't.\n\nhttp://www.yelp.com/biz_photos/-yApKLEFAvvNyifvpNKWCA?select=D9OUbkLMTuL0oldU0hbqNA\n\nhttp://www.yelp.com/biz_photos/-yApKLEFAvvNyifvpNKWCA?select=EyuweXhclT_VyF1Cj9IRDQ\nhttp://www.yelp.com/biz_photos/-yApKLEFAvvNyifvpNKWCA?select=VIwMoaH_lZ70RiCZ-TKfdw\nhttp://www.yelp.com/biz_photos/-yApKLEFAvvNyifvpNKWCA?select=nyMhbDTnwVHCLEknRfSRIQ", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2008-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "PfGjhIHFbScvGfCECieyjw", "review_id": "agf31UPfo5br_x1qvfgJPQ", "text": "Really people?!?!?!?!  After reading so many great reviews, I had to try to this place.  We ordered the Western Special....what a big disappointment  :( \nI guess I had really high expectations...prolly won't return.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 3, "date": "2009-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G3Jg7zR3jMb6jwBxg9-wcg", "review_id": "R3pDC98TXYzK7B85LcUuJQ", "text": "I live in the SF Bay Area, where I wish we had just one good frozen custard place. But I guess it's more important that we have that 5,000th noodle shop. (rolls eyes). \n\nIt's probably not an exaggeration to say this is the closest place for us to satisfy our frozen custard urges. Well, that's not the only reason we come to Vegas, but once I got wind of this place and its reputation I knew what I had to do.\n\nI wasn't disappointed...this is the real thing and is pretty good. I also didn't experience any sketchiness when I rolled in around 2pm on a Tuesday. That doesn't mean you shouldn't be a little careful, but know that you might be lucky and not catch any of the pimp-slapping-his-ho action many of these other reviewers have mentioned.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2009-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "_uBOA1g3cOZ6LrlZjxHVEA", "review_id": "5zQzXgIuMdRKyHIaoUlGPg", "text": "Tucked away in a corner between the Stratosphere Hotel and Olympic Gardens is a treasure. Once discovered, all Love It. Luv-It Frozen Custard is a simple establishment with intricate creations. \nThe creamy consistency of the custard has a stand-alone flavor you could eat it without toppings. However, with an array of combination offered from maraschino cherries to hot fudge why not enjoy delectable dishes with exuberant toppings. \nFor a few dollars less than most other ice cream establishment, you could discover a gem off the beaten path that would satisfy both wallet and palate.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2010-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "N4jUEGt_GqkzBcwvQHe99Q", "review_id": "L_BsZcbZhNk1hG_gUPuAhg", "text": "Awesome custard!!! The best in Las Vegas. Make sure to bring cash. They do not take debt or credit cards.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2010-01-25", "type": "review"}
{"votes": {"funny": 5, "useful": 2, "cool": 2}, "user_id": "b0jSP2vzSCJAvVlg_vxwtQ", "review_id": "kLEG_fpsaFdDx3xGeyMeAw", "text": "Pay no attention to the bums getting paid to buy some kids liquor at the gas station next door.  Really, they're just part of the scenery. Anyway, the bums just sit there and hang out...why not contribute help some kids out...kids who unfortunately have custody of their 5 year old sibling...\n\nNothing can distract hubby and I from the delicious custard at Luv-It.  Okay...almost nothing.  We're always grateful to be in the company of some other out-of-towners who bravely make the trek for the world's greatest frozen custard.  We stand around and compare our choices as unsavory characters occassionally stroll by.\n\nOtherwise, hubby and I grab our desserts and hop back in our car pronto, one of driving with our knees so that our custard doesn't melt before we enjoy it.  \n\nDefinitely worth the drive out to old-school not-so-safe Las Vegas but be smart about it.  Don't let yummy frozen custard get you mugged.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2010-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L15U2cUBBs5wb7qtp3qW5g", "review_id": "qZPK8Au9r0HdPGsS4l1Zaw", "text": "Not my favorite frozen custard in Vegas, but pretty decent.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 3, "date": "2010-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fgYkHiNSY_uyMRoU633aeA", "review_id": "0MS5Z0YKRB0_8vjPRbaGOA", "text": "sorry to say you lose a star and a half luv-it and i spoke so highly of you and your frozen gold,well i was so dissapointed last night i had the mint chip custard  i have been wanting since we found this place and it was all melty i made a mess allover the car with the melted custard that they served me. they must have had there tempature on the freezer wrong or something... so disapointing..", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2010-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WwFACY0RrVxIgiytKafNHg", "review_id": "4lAm2xWDb2jaoj4fBJ4KzQ", "text": "This place is a LV landmark. Everyone should try it. Period.\n\nNow the details...\n\nYes, it is in a shady neighborhood close to the Stratosphere, but SO worth it.\n\nThe have weird hours ( I think they are closed Mon & Tues or something)...and they are CASH ONLY! I never carry cash, so this is a big deal for me.\n\nThe custard? AWESOME. Not alot of flavor selections, but awesome anyway.\n\nI recommend the Western Sundae.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2011-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gsn8-66N69xHvA7ZLV4tgQ", "review_id": "vQr60JVe5e-JtXsGaLVK9w", "text": "I LUV-IT!!!!!!!!!!!!!!!\n\n\n\nFrozen Custard is made of eggs. So... to those who aren't into eggey things..... be careful!\n\nBut because it is made of eggs.... it has a reallllyyyyy riCh taste & texture. It's heavier than ice cream and fro yo, but It doesn't taste like ice cream, or frozen yogurt...it's FROZEN CUSTARD! \n\nMy friends and I went on a weekday probably around 3pm. No one was there, which meant...I get to order really fast! =) the gentleman who was the manager..was very open to sharing with me what LuV-Its was and what flavors they had available that day. They don't serve ALL the flavors in a single day. it varies because they wanna keep the frozen custard fresh. \n\nanyway... I liked it!! \n\n=D", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2011-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "icUByOyDRSWrPoRxqQwgLg", "review_id": "Dp-btjux1xolhBrJyGcjEg", "text": "Luv-It is one of those places that you just have to try when you're visiting Las Vegas.\n\nWhile some locals can't get enough of this place, others really just don't get it.  Here's the scoop.  The menu of flavors by the window (usually 4 flavors) is what they have on any given day.  That's it.  If you want to try any of the other flavors on the really big sign, you'll have to get some that was packed away.  The flavors on the sign by the window is what is fresh and available today.  Two staple flavors on the list are Vanilla and Chocolate but the other two flavors change with the day, season, and position of the stars in the sky.  Flavors you don't want to miss when they have them are the LEMON and the FRESH BANANA NUT.  I'm a big fan and stop by whenever I have the chance.  \n\nI see that some people are saying the frozen custard here is a little pricey but as anyone in Vegas knows, sometimes you need to pay for happiness! :)", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2011-01-18", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "yrdRSIIbpZbayPkP2afLSQ", "review_id": "cL24BjviMWNoH8i4r00Mwg", "text": "GREAT SUCCESS! J and I made it to Luv-It right before they closed. Well, technically they were closed (the closed sign was already in the window) but the girls were nice enough to accommodate my request. They had run out of all the interesting flavors and only had vanilla left, but I wasn't going to complain.\n\nThe texture of the custard was very thick and creamy. More dense than ice cream and not as soft as gelato, it was quite delicious. I wish they had had some of their other flavors available, but I was still happy with what I got. If I ever have a car out in Vegas, I'll make it a point to stop by again.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 3, "date": "2011-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Mdmrp68WoWWdagp4fFstLQ", "review_id": "sPShBLG27PK4cZCWU-h2mw", "text": "Oh my!  I can't say enough about this place.  Its like ice cream went bionic.  The custard is rich, creamy and delicious.  They always have the standard flavors of chocolate and vanilla with daily special flavors.  Some of my favorites are the almond chip with chocolate chips and the champagne cherry.   The perfect storm of flavor combinations is the wild cherry and lemon!  It will blow you away!  The western sundae is amazing, but so is a scoop of vanilla on a sugar cone.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2011-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1ICIjCUl22dLtqFrK7BWKA", "review_id": "om6jvTezYTWMbWFchaMUuA", "text": "My wife & I frequen this place. I live about 25 minutes away from this place but sometimes we are here 3 times a week. Our favorites are the luv-it special, western & banana split. My daughter likes the bumble berry. Sometimes I will order a pint of their frozen custard and usually it takes me longer to finish it than a regular half gallon of ice cream from the supermarket because it's very packed unlike store bought ice cream, which to me now is half air.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2011-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "EDb_7ItzZS7QJqUQqUu1cg", "review_id": "xsxYfuXlCpnxBLDwQeRHbQ", "text": "Leave it to Craig Ferguson to call Luv-It as one of the top places to see in Vegas. He's so right! Although this place is located in a seedy part of town, there is always an evening line of folks from all walks of life (families, foodies, single people with the munchies). I would gladly risk getting shot at for a taste of their delicious frozen custard. The owner makes them fresh every day. The custard selection is limited, although there's a variety of toppings like caramel, chocolate syrup, bananas, and cherries. The menu also changes daily, and they accept only cash. It is perhaps for these reasons that I find this place to have an old-school, endearing feel. It's one of Vegas' hidden local gems - a great place to go for some wonderful sugar high of frozen custard.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2011-02-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "pvuA0stf3Gsj3XfX5Sd8dQ", "review_id": "K47OBNN70g8JkikwHttrwQ", "text": "This place gets me every time.. its so soft and fluffy.. with just the right amount of sweetness.. I always have to make a stop here whenever i'm in Vegas! :) :) :)", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2011-02-08", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 3}, "user_id": "pDFy22XGyiGb667pmCqzQw", "review_id": "j4FrpTjWsoQ6Ywg4o5AdXw", "text": "this place is so old and ghetto yet so good! I'm sure everyone tried frozen yogurt now since it's EVERYWHERE. but this place serves frozen custard! YUM! it's so good. \n\nfrozen yogurt is like the healthier kind of ice cream, but frozen custard i think is the opposite because it's higher in fat. anyways, that's not the point, ice cream wouldn't be good if it's not fattening right? i was looking forward to this place, first time we went, it was closed, they're only opened between 1 pm - 10 pm. so next day, we made a second trip there, thinking for half a day of what i was gonna order, then realizing that they only have limited of flavors each day. On the window, it says \"flavor of the day.\" \n\nThe girl was nice enough to ask if i wanted to try it, so i tried the mint+chip and wild cherry. I never like any other kind of mint+chip besides the one from rite aid (thrifty ice cream), so i didn't expect this place to have the mint+chip that i like anyways. So i tried the wild cherry (i never liked wild cherry flavor) but this one is good! esp good with another scoop of chocolate frozen custard. \n\nthe ice cream is sooo smooth and creamy...soo delicious. and the good thing is that it doesn't melt as fast as regular ice cream does. The only thing is that this is not on the strip, it's more like in downtown LV area that people usually don't go to. But if you're in the area, you gotta try it.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2011-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZzCue3872RI4xBX1LvJikA", "review_id": "Fn7OANOpzXYL_ZnsbISewA", "text": "Nothing more I can say that hasn't been said.  Tasty custard in a bad neighborhood.  The banana split rocks.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2011-02-14", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "A3mpjzazkSDkua4cPSayYA", "review_id": "6OGx0CT3nEmDFDrQaKIwJw", "text": "mmmmm that's good frozen custard. What? It's still the later parts of winter and the beginning of spring hasnt started yet? What? too cold for frozen Custard? meh didnt really matter.\n\nThe Hot Apple and Walnut was pretty good. The apples didnt have too much of a Cinnamon taste but the custard was real nice.\n\nNext time gonna shoot for one of the higher profile specials.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2011-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0LP7IuJXa7I7LbZxd-7wiw", "review_id": "D66TH6DrV6OQv4NozR7P0Q", "text": "Never had frozen custard before but this was damn good go for the crunch topping. For those of you who dont know custard is made with eggs and has a smoother texture than soft serve or yogurt", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2011-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2uujTe8pbAgdhmQIf1R1EA", "review_id": "raL7PfMwAT11DFw_N51dvg", "text": "Another BOGO disappointment from the Las Vegas entertainment book.  Skip this place as the custard has a low milk fat content and thus isn't rich and creamy at all.  Best described as \"grainy\", something like you'd get out of a Chinese food buffet soft serve machine.  \n\nSimply go elsewhere and save yourself from regret.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 1, "date": "2011-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "izSk9U1kt1f0-s3g9Z2r9w", "review_id": "RSoW-TZH5wzL1P92owF3QA", "text": "OMG, DELICIOUS!\nMy husband and I were in Vegas for a friend's graduation and I needed to come here. I'm pretty sure this place was on TV. We actually drove totally out of our way on the way to the actual graduation, and after a big brunch, just to have some custard. \nThey have a variety of custard flavors, which change daily, and a variety of toppings to put on. You can make up your own combo or pick from the board. They also do a standard size unless you tell them you want something else. \nWe ordered the Western Sundae and goggled it up in the car within five minutes. The custard is thick and creamy and the toppings were good. They did skimp on the hot fudge sauce, but I'm not even mad because everything else was so good.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2012-01-03", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "i0IuazUhWsPaCq460bQzZQ", "review_id": "wg30NX23zQ3nHWypqbheSg", "text": "This place is honestly one of the hidden gems in Las Vegas. The variety of frozen custard sundaes they have are all delicious depending on what toppings you prefer. They are all prepared over vanilla frozen custard unless you specify a different flavor. However, they only offer a handful of custard flavors a day as most people seem to prefer the toppings over vanilla. \n\nMy favorite would have to be the Banana Fudge Krumble (hot fudge, sliced bananas, and cookie krumble). The \"krumble\" is probably the finest ground Oreo cookie crumble imaginable--fine enough to choke on upon inhaling it (which I do quite frequently). :O Some sundaes are a bit on the sweet side i.e. the Butter Crunch (butterscotch and crunch). The \"crunch\" is what I believe to be finely cut pieces of butterscotch candy. \n\nNote: They do NOT go easy on the fudge, caramel, or butterscotch, so you might want to request it not being too heavy or you may be eating several spoonfuls of the above mentioned. \n\nLastly, I personally have never been to Luv-it after dark by myself. It is not exactly in the best part of town considering it is walk-up window service and does often have several \"interesting\" passerbys... so bring a friend or two! Or maybe something to protect yourself with! ;) Order at the window, eat in the car, and lock your doors kids! Haha!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2012-02-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "OYCd2s4PkVa2grLOB7xDfQ", "review_id": "n5TDOmcDZqkMtMC6uGTzmg", "text": "Wowzers, had the Western sundae with caramel, hot fudge and nuts...it was awesome.  They close at 10pm so don't go too late!  \n\nThe neighborhood around here isn't the best but it's not unsafe, but I wouldn't blame them if someone tried to rob you of your sundae :P  :)", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2012-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FNYRj_Ych8NA4DWRhBonMg", "review_id": "l01n3AxhNJ_09nbPnT7TVA", "text": "This is really awesome custard! Being from back east, I know custard. Really creamy, lots of flavor. They have set flavors, but also flavor of the day. You get a lot of custard for the money, so be hungry.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2012-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UDxLd2ulMirdteiggnd0NA", "review_id": "DwZ9xs7mFoJrdNuKJHMtvw", "text": "A great Vegas tradition... it helps that I love frozen custard.  Definitely worth a trip for tourists.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2012-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ot6PMbyWmzYMYS8miApFAA", "review_id": "6nasCquXW327YCjwNxNOsA", "text": "Yum, yum and more yum. Finally got around to stopping at Luv-It and guess what... I LUV IT! My first attempt at acquiring some custard failed miserably as I had no cash when I walked up (CASH ONLY FOLKS). Didn't feel like heading to an ATM so went back another time and remembered the dollar bills. I'm a simple guy and enjoy simple things so I ordered a cone with vanilla and chocolate custard.\nMade the awful mistake of trying to drive while eating a two scoop cone and needless to say I got it all over myself. Got to the point where I had to pull over at a Jack in the Box so I could grab napkins and clean my hands that were covered in chocolate. Keeping it classy!\nAnyway, back to the custard. Smooth, cold and delicious. What more could you ask for? I will be back and I will bring more cash. Wish the location was better as it is a pretty sketchy area. Not \"hide yo kids, hide yo wife\" scary but lock your car and don't carry a lot of cash!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2012-12-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xKNEixlfU9jJsJ43CWjv9w", "review_id": "ZE2A6asqbqhu0XBOEHxzSg", "text": "Located in a tiny little hut between Olympic Garden's strip club and a shady mini mart, Luv-Its is an island of paradise.  Approaching their 40th year in business, Luv-Its is a family tradition for lots of Vegas locals.  Often times standing in line or enjoying your custard on the curb,  you'll overhear people's stories of how long they've been coming there.  It's a nostalgic little joint.  The spot doesn't look like much but the deliciousness that comes from here is pretty amazing.  The Western is my go to favorite, but everything I've ever tried is pretty darn tasty!!!\n\nEvery now and then you will catch an off batch, like the egg cracker was a little heavy handed that day, but for the most part, Luv-its is consistently great custard.\n\nOnly thing that would make this place any better would be some outdoor seating, if they weren't cash only and a few more locations :)", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2012-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "GgUGSYZ0PiHrSeWQIM2kuw", "review_id": "HMLW4RGx8WDB2aab7wapkQ", "text": "I only just discovered the glory that is frozen custard a few months ago. Oh, you've never heard of it? Check it-- it's kind of like ice cream, but it's made with more egg yolks. The result is a richer, denser, creamier concoction. \n\nPrior to my visit to Luv-It, I had only tried custard in a pre-packed pint from a hippie grocer, sourced from a local dairy farm.  While Googling fun things to do in Vegas, I almost leaped out of my chair when I saw a frozen custard monger on the top 20 list. Apparently there's some cool history or story to this place, but all I cared about was custard, custard, custard. \n\nI was totally blown away to find that at Luv-It custard is sold soft-serve style, not in scoops. What the WHAT?! Way to take something I already love and somehow make it even more incredible. \n\nThere were so many options, I felt a little overwhelmed-- at least three or four custard flavors, fruit toppings, candy toppings, plus fudge, butterscotch, marshmallow, and every other sundae accompaniment on the planet. Even though more than a few flavors piqued my curiosity, I decided to get a simple original (vanilla) custard, with some fresh strawberries. I figured I'd be back, and wanted to establish a baseline. \n\nIt was howl-at-the-moon kind of good. It was \"holy hell, all ice cream will taste watery from this day forward\" kind of good. Mmmmm. \n\nI SO wish I had made it back more than the once.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2012-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S_M6Y6Tcy5yeOIxVqVTQug", "review_id": "WHJHR8IRjbIXQBvpOp-ucA", "text": "Overrated, overpriced, and smack dab in the ghetto. I came to this place with high expectations and was sorely let down. They have a good variety of flavors but only a few \"flavors of the day.\" I tried the pineapple and was not impressed. I couldn't believe this place was so highly rated. The custard was only okay and definitely not worth the price. I'll pass next time in in Vegas. If you decide to go to this place, bring cash because they don't accept credit cards.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 2, "date": "2012-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J7LZQ-tTmRAOfj4tO7THXA", "review_id": "1aSTYw2NrEuB7vG1jwgaqg", "text": "Good stuff, been coming for years. Glad its getting so much hype they deserve to make some money. Do yourselves a favor and dont expect a religious experience or you will be disappointed. Its simple food made fresh on site and very good.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2013-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nelDB8h7fc1KSCcZ1lbaQg", "review_id": "UOBI1Eff2jgp7_IDsi06mA", "text": "There is nothing more Las Vegas than Luv Its. Anyone who has been around town for 10 or 20 yrs knows this is the bomb has always been and will always be. This isn't something to be trifled with...this is the equivalent to a three day weekend or discovering your next door neighbor is a liquor distributor. Visit the alter-you are not here to judge. Luv-It...like The Dude..abides.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2013-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "edZSkqnGvAUeYB71iampMQ", "review_id": "1DpZs4U_xefHE0L3hOEhEQ", "text": "I saw a television review of Luv-It a couple years back, so when we went to Vegas I HAD to go! I am a Downtown gal, but this time we were stuck on the Strip. So I Nav'd to Luv-It (Hint...get a AAA map and write out directions. LOL) \n\nIt opens at 1 PM. So it was a lunch for us.\n\nAmple parking, as long as the homeless population has not taken all the spaces. Literally...this is the seedy underbelly of one of the richest cities in the nation. \n\nI had the \"Luv-It\" special sundae. Strawberry and pecans over (in my case) vanilla. \n\nFrozen custard is creamier than any soft serve I have ever had, yet softer than ice cream. Very tasty and wonderful flavor. DD had \"western style\" with hot fudge, caramel, and pecans. She was also very impressed. \n\nEasy return from Oakey back to Industrial to Frank Sinatra, to avoid LV Blvd. \n\nWe have a frozen custard place opening here where I live soon...I have a feeling it won't be as good as Luv-It.\n\nI look forward to returning to Luv-It!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2013-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "BroRJjahfi7v96ex-EMmPQ", "review_id": "7cYV54Tm4mSvj7LmaF8dCA", "text": "I love luv-it.  My go to sundae is the western.  Lately I have branched out a bit and tried some of their flavors of the day.  I might just be used to my sundaes but I prefer them over a flavor of the day in a cone.  It is nice they offer different flavors though.  I will still give them a try from time to time.  There is almost always a line, even in the winter but there is plenty of people watching to do to pass the time.  I do wish they were open a little earlier but when I first started going they weren't open 7 days a week like they are now so I will take what I can get.  My fave downtown lunch is Viva Arepeas then dessert at Luv-It.  So good!  Oh yeah and make sure you bring cash, if you forget there is an atm in the mini mart next door.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2013-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TEeExNACTLkGZzoRYFJqmg", "review_id": "e4AMlLFeGi5yK8nNIQLqYQ", "text": "So simple. So perfect.\n\nWe split a Western Sundae: \nVanilla Custard\nHot Fudge\nCaramel\nPecans\nAnd a cherry on top\n\nThe custard was creamy. They were generous with the toppings. For me the lightly salted pecans are what sent it over the top. They are so much tastier than standard peanuts or almonds. \n\nI Luv-It !", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2013-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "lPaYMDmJbAnv_3pmZH_inw", "review_id": "MU3REn7n7ba_vm3au7FTLw", "text": "With our mouths still on fire from an amazing meal at Lotus of Siam, Luv-It has become our goto spot for cooling our ravaged tongues. \n\nThis is window ordering at its finest. There are no seats but there is a really large parking lot where you can stand and eat your custard. Each day features new flavors though chocolate and vanilla are always on the board. The list of available flavors is to the left of the ordering window. \n\nIf you've never been I highly recommend a small cup of vanilla so you can enjoy the texture and try to pick out the differences between frozen custard and standard ice cream. After that order yourself a Western Special, your choice of available flavored custard topped with warm caramel and toasted nuts. Ive also tried the Banana Split which is pretty much what you'd expect, textural delights. \n\nYou can also create your own custom sundae with all the available flavors and toppings. This is great for the person who knows what they like and knows how to get it. \n\nLuv-It oh how I love your creamy goodness.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2013-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lVSeU3MrkREmjZiKbf2EYQ", "review_id": "A0vG6MIN0vEQdLUNdAiErQ", "text": "Awesome!\n\nGreat experience, tasty treats!\n\nBring cash.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2013-02-15", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "Cw3UMmYeqqx1u4HIWaWw3w", "review_id": "ssQIl-nNmXLfsG-Vz6iyew", "text": "Luv-it Custard is awesome! My favorite thing is the Rootbeer Whip and I always get it. I have tried some other items and they are always yummy. Who needs ice cream when you can get fabulous frozen custard?!?!?", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2013-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Xk9zKQmK5XS88Bn5A3fetQ", "review_id": "vRxxR4cRdzIOfzmb0nyY1A", "text": "I've been going to this custard shop for about 15 years. The food is great and that's why I come back, but one incident happened tonight that completely changed my perception about this place. I had just finished eating dinner with a special someone and asked if they wanted to go to luv it for dessert. I did know that they were to close at 10pm, but since it was 945, I knew I would be able to make it before they closed. Just in case, I called and let them know I was on my way and that I was coming from across town, but I was already over halfway there. They said as long as I'm there before 10pm, they would still serve me. \n\nAs I was about to pull in, I called again. They said that they were closing in 2 min. I literarily had just parked when the lady hung up on me. Once I went up to the window, it was still 9:58pm , and they had the closed sign out and the drapes over the windows. I knocked on the window and no one was answering as I saw them just waiting in the building.\n\nI can't believe they not only hung up as I pulled in, but they closed early, refused service to the same person that called twice and that they said would serve if I was there before 10pm.\n\nCompletely disrespectful service and a waste of gas. It's sad to say, but I don't feel like going back. I'm disgusted with this new service they have. A few years back, this place was all about their customers now they take the lazy way out and could care less if you drive across town to get custard.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 2, "date": "2013-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "yQs0y3CGH8Xp8jJXGu1SNA", "review_id": "mjud3bKLBS55AFAsEIDb7A", "text": "Chocolate pretzel frozen custard is amazing!!! The menu is confusing as hell. Basically, there's about 5 flavors per day that you can choose from for the frozen custard. All the other flavors that are listed on the menu are NOT served. Luckily, I went on a day where they had chocolate pretzel as an option and it was decadent. The chocolate pretzel flavor was just the perfect amount of sweet and salty. The pretzel was crunchy and balanced perfectly with the chocolate. There's no place to sit and eat the custard, so it's more of an \"order to go\" type of joint. It's basically a shack in a parking lot. I was confused because I was hoping that there would be an original custard flavor, but there isn't!! The closest thing is the \"Vanilla\" but it just tastes like vanilla ice cream.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2013-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1R3se10YO4i-3cf56XrA5A", "review_id": "bkqJnP8_O-2A64i-LJ_1jw", "text": "The custard wasn't bad but not good enough to want the hostile unfriendly attitude from the Asian woman who served us. She was too unhappy to be serving frozen delights to anyone. Eating dessert - that's a happy event - not sour gummie style! Meh.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 1, "date": "2013-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4yZANOn1vMBzlEqxcB5xXw", "review_id": "efLTvi1cIphlDoDO6w7q_w", "text": "There aren't many frozen custard places and it's the only one I found in lv thanks to yelp. The reviews are true and this place is as good as it gets! Our cashier was really nice and suggested the western special. I ordered a large for 3 of us and it was more than enough. I ended up eating at least half of it myself. The custard is not too sweet, just perfect! \n\nOne thing I would suggest is layering the toppings in between the 3 scoops instead of just on top. All in all, I will be back!!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2013-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a3DxW1V2fl83vCXdNuyLNg", "review_id": "2ysbtWhBw9mhvqBTqiiTRA", "text": "Very sweet I love the texture, it's like the creamy stuff you get when u stir your ice cream fast! Yumm!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2013-12-13", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 0}, "user_id": "Lh6CL9jY5Yusmltp9jeyyg", "review_id": "lqWr_cPyx1VJ6g9neJbdvw", "text": "Legally, it may be able to be called custard, but if you serve it from a regular soft serve machine, it will have just as much air whipped into it as regular ice cream.... Then, what's the point? \n\nIf you know HOW frozen custard should feel, then you will be disappointed with Luv It. \n\nToo cheap to invest in a Ross or Stoetling = too cheap to get any of my money.\n\nAdditional info after owner replied...\n\nThe owner replied about the FDA, etc. Yes, I am VERY aware of the legal requirements to call it \"frozen custard\" thanks to Andy's Frozen Custard's incredible advertising (10% milkfat, 1.4% egg yolk solids) however, overrun (the amount of air mixed into the product during the freezing process) is not regulated, as far as I know. The machines that Andy's used when they opened were Ross freezers and (as anyone from southwest Missouri who has ever heard \"Hi! I'm Andy\" on the radio knows) \"making machines that don't whip in extra air is no problem, they just cost an extra $20,000\".\n\nThe first question I ask when visiting an unfamiliar establishment is \"What brand of machine are you using?\" (in fact, the owner of Sheridan's immediately said \"Where are you from in Missouri?\" when I asked him the same question before they had opened. This was right around the time that Stoetling bought out Ross, IIRC.)\n\nIf it's a Ross, Stoetling, or a custom machine built by them, then the owners know frozen custard. Those machines produce a very sllllooooowwww output of product that usually slides down a chute into a freezer.\n\nIt is impossible to fill a cone \"soft serve style\" because a true frozen custard machine produces a \"log\" four or so inches wide and about 2 inches thick. It then enters a bucket in an external freezer and requires hand scooping. \n\nFrozen Custard from a place like Andy's, Sheridan's, Ted Drewe's, or Freddy's has a VASTLY different mouth feel\n\nWhen we visited Luv-It after we first moved out here in 1999, I believe they were using the standard Electro-Freeze machines. It was EXTREMELY disappointing to get frozen custard that felt like standard regular soft serve. The flavor was fine, but it was no better than other soft serve.\n\nAs I stated, legally, I have no doubt this product qualifies as \"frozen custard\". It would be foolhardy to advertise it as such and not be able to prove it. That is not my issue with Luv-It.\n\nPerhaps they replaced all of their machines in the ensuing years. (It appears from Yelp photos that they may have.) The rudeness of the \"dude\" running the window and the disappointing product caused us never to return.\n\nI may give them another shot.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 1, "date": "2013-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nQlVAsx3OT38pn6feoQGIg", "review_id": "bCMS7ByMpAJ-7OgSl9GYzA", "text": "The lemon is my favorite when they have it.  This is a true old school Vegas Gem", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2013-12-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wOWztTvjFaLiw-1cfa7cnw", "review_id": "jZIUT3Eqnu2nV1E7SUIQ9w", "text": "Talk about Vegas hidden jems! This place has been open for ages and they make their custard fresh!\n\nI always get a sundae here and top it with pecans.  \n\nJust a warning that parking is a complete beatch and it's in a super sketchy part of Vegas. Night time prowling is not highly recommended", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2013-12-27", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 4}, "user_id": "vI7wZxTprpMl2fj_IHU3iQ", "review_id": "BdHaMVw8tsy7XssmMTmq0A", "text": "We came here on a Tuesday evening and ordered their Luv-it special for $6.22\n\n- Nice gem in a shady area! \n- Fresh custard strawberry and salted scans and a maraschino cherry. \n- Quick service. We were the only ones there, but made it a bit scary, being that it was night. We got our dessert in 2 minutes\n- Most of the topping are on the top, so once that is done, it's very plain. Poor distribution. \n- Since this is pretty close to the strip, this is a short destination trip to show non-locals a cool spot that is unique in LV.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2013-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h9Ct5ErUfUJJx7ycsDllEA", "review_id": "ARo_vGOM3mpVsktzyCTm1Q", "text": "This place has the best custard ice cream in Vegas!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2014-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t8CtwPLCi78Wi8yZFj4qcw", "review_id": "zkz2EwpOYbe77H5Mwsmgqw", "text": "I got one of the banana sundaes. It was pretty good, not amazing though. I'm not that into ice cream though. They messed up my sister in laws order though.. Twice kinda. Pretty good though, I'll go back with the fam.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 3, "date": "2014-01-17", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "04Vn_yTfjddj3pBW6yF4qA", "review_id": "LIsM9ayFg-DOX29YrHIFkA", "text": "These guys have been here for 3 generations....and that is how long my family has been going there. Best custard in town hands down. I like how they have different flavors every day and post them online so I know when to plan a trip there. Thank you guys and keep up the good work.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2014-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qONW73Yyfn8VhiPiJ1RcKA", "review_id": "rOqU9gSMJEM7blWteaOL7A", "text": "Meh... I thought it was very ok... And the girls working there were rude and seemed very bothered by us. I wouldn't go back", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 2, "date": "2014-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6Xvc0f_WIqELnKFCpLR50A", "review_id": "zjJGED2sXfYW2SmDOjpxoA", "text": "It pains me to write this as my first ever review on Yelp, but it has to be done.  I can understand the challenges of running a business but to degrade your product to cope with those challenges is unacceptable.  I whole-heartedly agree with Mike H.'s recent review that Luv-It Frozen Custard has changed for the worse.  It is not the same as it used to be, which was a solid five stars.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 1, "date": "2014-02-05", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "5lq4LkrviYgQ4LJNsBYHcA", "review_id": "bpF6C7TRjihXjcNQhpJqCQ", "text": "Twice thwarted in my prior attempts to experience Luv It, once as a result of arriving two-hours prior to the 1pm opening hour and once due to staff vacation, the third time would finally prove a charm in visiting what a friend and former pastry chef deems \"the best frozen custard in the country\" - a sentiment ironically echoed by former and current mayors, Oscar and Carolyn Goodman, who arrived moments after me and spoke fondly of myriad visits to Greg Tiedemann's stand over the years as we waited in line.  Generally underwhelmed by custards as compared to artisan ice creams or gelatos in the past I'd hardly realized that the small window had such an extensive menu of flavors until I approached, but with standards of chocolate and vanilla plus seasonal cheesecake, cherry pie, blue moon, and countless toppings, sauces, and mix-ins I was glad to have some time to think - eventually settling on a $4.25 cash-only \"Butter Crunch\" over vanilla custard plus a large spooned sample of cherry pie.  Traditional in texture, full bodied with flavor, unmistakably custard given a light egginess to the vanilla, and with substantially more heft than the versions popularized at iconic Ted Drewes' or franchised Rita's it took a few rich spoonfuls to truly appreciate the velvety texture of the custard itself as I worked through toppings acting more as a distraction than a compliment but once down to creamy base it can only be said that this is indeed some excellent custard and for fans of the style it is a 'must visit,' though for my dining dollars the presence of Art of Flavors only a few blocks away will make a return unlikely anytime soon as even the \"best\" custard can't hold a candle to truly superlative gelato.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 3, "date": "2014-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "h2NRtwICFsgdnIPfzFu0pQ", "review_id": "r0x3dGFWp_5dt-rA2qjmUA", "text": "Boyfriend and I were craving a banana split and we decided to check this place out. Id have to say the best banana split I've had. The custard was so delicious! I agree that some of their \"creations\" seem a little too crazy (I like simply delicious) so I think I'll create my own next time ! But that banana split was so good! \n\nI think my only complaint would be service we stood in like for about 20-25 minutes with only a few people in front of us. Maybe because there was only one employee? Thankfully we got there when we did because there was a line of over ten people behind us. The lady working wasn't very friendly either. But I didn't really care, I was there for the custard", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2014-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZoiKCnVfSQOAGvRIg_Ykaw", "review_id": "eeHK_2oxVsCOAs6ay4gFQQ", "text": "So good to be back here!  The luv-it special was awesome!  Custard with salted pecans, strawberry and cherry.  Yum!  Lots of other custard dishes and flavors.  My go to cool off spot in LV.  They don't open until 1PM though...", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2014-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "B_bceWnDctdoZUvLQHWflw", "review_id": "PxjCUewJhYqnlWaHLobHTQ", "text": "Visiting Vegas?  Love ice cream?  Better yet, custard?  Come!  Come!!!  Don't regret missing out on this place!\n\nEvery time I visit Vegas, I try my best to go there at least once!\n\nThe flavors are all amazing!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2014-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u94f2UjMV96MckVGSHup0w", "review_id": "1wkbmt3mum8io5gRjgQGDA", "text": "I love this place for their lemon frozen custard. Their service is not the best. They are not very knowledgable. My little sister has food allergies and I couldn't seem to get a straight answer from someone. Nutrition facts and ingredients were no where to be found. The employees seemed so lost and bent out of shape when I ask for ingredients list. But the custard is soooo yummy.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2014-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fh5ZnViLt2sWGJsZd3iQkg", "review_id": "T697RD-tXmk13sJFFhhhpQ", "text": "1st time here and i love their frozen custard. I just wish they can open a little bit earlier. :D", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2014-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YVfkc26L9_y9hg2b30aE9A", "review_id": "5iryO-lyJuQG_TYsMtjlEg", "text": "I heard this place was a Vegas favorite and wanted to try it years ago but I guess it closed down for some time.  I was pleasantly surprised to see it on Yelp recently to find that it was back.  My family loved it.  The custard is wonderfully creamy and delicious.  Everyone loved what they ordered.  We all ordered some type of sundae so we didn't try anything other than their standard vanilla custard so I look forward to trying some of their other flavors on our next trip to Vegas.\nBefore dessert, do yourself a favor and visit the taco truck next door for dinner.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2015-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZmoCGV_MRKjEnb3ZFakToA", "review_id": "scdXyYSLAt2-LIRg2KcP7A", "text": "I've been coming here since 2012. Their custard is delicious and the workers there are always pleasant.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2015-01-13", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 5}, "user_id": "9A2-wSoBUxlMd3LwmlGrrQ", "review_id": "nk9RgMpUW5g1okNdiuB4qA", "text": "I put off going here for the longest time because I'm the biggest glutton for classic frozen desserts: the Western is basically my childhood in a cup, with a cherry. Then again, most of middle America can probably say that as the combination of flavors are basically every great sundae you've ever had.\n\nMenu is a variety of sundaes (Western and Sprinkles varieties are faves), cones or cups with their current flavors (they never seem to have Blue Moon!), and various beverages- I will say that most sundaes have some sort of nut on them, so be clear to order accordingly if you have an allergy! And give me your extras. ;)\n\nService is polite but somewhat less than stellar- if theres' a line 12-deep and 3 people in the building, perhaps they should have more than one person making each order one at a time. Just a thought.\n\nPrices are a slight bit higher than I expected: the regular sundaes come to just over $6 with tax, but it's a size you can share. Those saying this is in a seedy area need to get a grip, it's  literally one building off the actual LV Blvd. Keep your wits about you.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 3, "date": "2015-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3SvEIK1w8gwM_HiKgz0Qjw", "review_id": "cda-_rtCyH4-al3rtkng7w", "text": "Delicious as always, the Luv It Special is soo good w the strawberries and pecans. An old Vegas gem for years! Overall a great date spot, however, you may or may not be approached by a homeless person.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2015-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "H9lbH6Kl8R-4Ea9iGX1p6Q", "review_id": "P4LS-JSXCN5aXCAezII2Xw", "text": "I remember going to Luv-it's as a kid growing up in Vegas. Worth the drive across town then and more worth it now. Western is the best! Love you Luv-it's!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2015-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JdBUUmY9706CCiQG34bTPQ", "review_id": "tw0XUPQ0phMiNilYEMYuCw", "text": "Yummy, this looks so delicious because it is... We have been coming back for more, I told all my family and friends about this spot...", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2015-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BrMXLN1b3bbQocujo49NZA", "review_id": "hOEE0VB5CQkVxN5-yV-a3A", "text": "Been a customer of this Vegas classic since I was a kid. Stop through probably about 5-6 times a year since the mid 80s. This review based on my first visit of 2015. \n\nThis trip had a junior size Scotch Jimmie Treat (custard topped with hot butterscotch, slice banana, chocolate jimmies aka sprinkles and a cherry). For my custard choice I went with fresh banana nut which had nice large chunks of walnuts. Very delicious.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2015-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "znvkffhbfLKlsCRjMWjjEw", "review_id": "eLcggaGoB6egZVrM194UOQ", "text": "This is a Las Vegas treasure. Tony Hsieh would have been wise to offer them a location downtown. It's a dive in a less than desirable neighborhood with the best frozen custard in town. It is indulgent and decadent. The Western sundae remains my favorite.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2015-02-25", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 4}, "user_id": "sLxyYIYCorS-pTtUU4VLuw", "review_id": "oYqIl7bBeGuNrEWRT7bQLA", "text": "I'm obsessed. Best Frozen custard in town. \n\nThis hidden shack on a side street of busy Las Vegas Blvd. Located between the strip and Down Town Las Vegas. Unless you knew about it from obsessed locals I have no idea how this place markets. Being the only location in town, business is booming. \n\nI am not a dessert person and ice cream being at the bottom of my list of sweets I'd actually eat. So you can imagine I was throwing a fit the first time my friends suggested we grab frozen custard after dinner. They offer your traditional flavors of vanilla, chocolate, strawberry and a wild card special. Could be pistachio or my friends favorite blue moon etc. I ordered vanilla and wow I was hooked. So hooked I came back the next day after my afternoon class. Keep in mind odd hours. 1:00pm - 11:00pm. Okay maybe odd for me, I mean who has ice cream for breakfast? I WASN'T THE ONLY ONE circling the shack around 12:00pm looking to score some delicious custard. I came back an hour later and not even 5 minutes of being open. They had a line.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2015-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z8LtAuLZJMkohLT-hzYtGw", "review_id": "Lqdn3hGyQiDPdX9Y1MJW-g", "text": "I started coming here because of my wonderful co-workers who can't stop talking about ice cream every week. Lol! I usually go for the sherberts but the other day tried a smoothy with a scoop of ice cream recommend by the one of the worker. Omg.. and I loved it!", "business_id": "gmwFYTT5a1Q0GIG0DwldBQ", "stars": 4, "date": "2013-02-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "-oTBPHzif6mUpj6KggLi9A", "review_id": "oynYDqK9jZDcY91kM3NNjQ", "text": "Came here on a random thursday night with a friend for some post sushi sweets and was taken back to my childhood of ice cream dreams! I never stop in baskin robbins so I was surprised at how busy it was. Apparently this is a pretty popular location ! \nIt was nice... good ice cream... nice servers and a sweet spot to sit and eat ice cream on a cold night.. good job Baskin Robbins!!", "business_id": "gmwFYTT5a1Q0GIG0DwldBQ", "stars": 4, "date": "2013-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mzOcI330IJLiHj_AquvZqg", "review_id": "KHsVSwMmJAsgdIXxRgLlcQ", "text": "Got a Oreo soft serve and it wasn't anything special. It was ordinary soft serve ice cream. Next time I'll be sure to try their actual ice cream. \n\nI must say, ice always been a fan of their ice cream cakes!", "business_id": "gmwFYTT5a1Q0GIG0DwldBQ", "stars": 3, "date": "2014-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5SLDX3bXcRP52QlStIcYLg", "review_id": "2LXq7MJ_p45FWYtOpZTREw", "text": "If Americans' weren't so addicted to sugar this place would cease to exist.  I was first exposed to Edward Marc a few years ago in New York, and quite frankly, I was shocked to see this location in Pittsburgh.  Their chocolates are fantastic.  BIG UPS to the sugarless vanilla salted caramel.  You'd never know in a million years it is sugarless.  And the peanut butter sandwich cookie is delicious.  Decor is like a modern, sleek soda fountain.  The ice cream and milkshakes are what bring people in (and customers conveniently have to walk past the chocolate case because the ice cream and milkshakes are in the back of the store...)  Beautifully designed space, amazing quality chocolate, and open until 10pm Monday through Sunday.  A winner.", "business_id": "pFkEafZFTRE-qgB3NYC48Q", "stars": 5, "date": "2011-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0oDLLHE2CrXnGI4hGjPFGw", "review_id": "P7YtQAGBLTvmSyCBiSvINg", "text": "Atop a hill overlooking Downtown Pittsburgh, this Ice cream shop is exactly what you need when you are looking to get fatter while you to take in the views! I experienced the Cinnamon crumb cake scoop on a sugar cone, it was a very cold day and I wasn't hungry. Talk about a great decision! It was very good and added to the experience! Well done Difore's, well done!", "business_id": "UgBIcnR-WMAH4pezas0_yw", "stars": 4, "date": "2011-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uPw2MAYOA9WkTnvhrjpSKw", "review_id": "RoVWEGxoVhWoNXLfvAPn4w", "text": "The ice-cream was OK, very little selection. The service was awful, the guy was on his cellphone the whole time shouting; we ordered a rootbeer float 3 times and still did not receive it. The prices were a bit steep. The only positive was the location. Pass it by and find a Dairy Queen.", "business_id": "UgBIcnR-WMAH4pezas0_yw", "stars": 2, "date": "2011-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z-ojsxQ1HdnBjGY-VoxmaA", "review_id": "55zoijQ5jxK0JihJ70bFPw", "text": "We didn't read any reviews before visiting last Saturday to get hot chocolate after a ride up the incline with our boys.  We wanted to ride the incline at night so it was probably 7:00.  When we got to the door the owner was just locking up and heading out but when the boys were disappointed, he said - come in and I will serve you so he opened the store back up to make us to \"Amazing\" hot chocolates (according to my 13 and 10 year old) and two carmel mocha's that were pretty good.  It topped off our trip to Pittsburgh for the day.  The owner couldn't have been any nicer.  We will return next time we ride the incline.", "business_id": "UgBIcnR-WMAH4pezas0_yw", "stars": 5, "date": "2015-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "LhgQq1x4n9ardg1PFo8vgg", "review_id": "gnS3GLKUKZ__zgL_eAtAHw", "text": "There's a USA Today article, an old one, posted on the wall here.  It lists the Top Ten Ice Cream Shops In America.  Many years ago, being bored and young, I said what the heck, and visited every shop listed above Dave & Andy's on that list.  \n\nTom's Ice Cream Bowl in Zanesville, Ohio, was the strongest competition for \"best\", but only won if you counted the food; Dave & Andy's, hands down, was the best ice cream we got to try within a drive from Boston to Florida.\n\nThe waffle cones are to die for, and the ice cream is fresh, delicious, and perfect in almost every way.  Really, best of the best.", "business_id": "oN552ZjtfJWV7CMtftGrfA", "stars": 5, "date": "2008-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CAeAEF6mtQngTC1dzW5BpA", "review_id": "B9mQTF7sUetEaiazAyMHdw", "text": "SOOO good ice cream with fresh made waffle cones. Fav standard flavor is their birthday cake, but there are so many to choose from (including special ones like oatmeal raisin, or blueberry cheesecake).\n\ni really think this is my favorite, even against graeter's in cinci.", "business_id": "oN552ZjtfJWV7CMtftGrfA", "stars": 5, "date": "2010-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_vS9qNQvx8wVUOIkj4qfAg", "review_id": "DlkG06UXFvQhXtVJhOdAAg", "text": "Yum! What tastes better on a sweltering summer day? Nothing!\n\nWarm freshly made waffle cones and a couple scoops of home made ice cream. Mmmmmmm. Its the best.", "business_id": "oN552ZjtfJWV7CMtftGrfA", "stars": 5, "date": "2010-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f0lpBRTjYz08xhklvIb7iA", "review_id": "-9WMuIkPIctYpH_-RZo0ww", "text": "My favorite homemade ice cream joint. Whenever I'm down in Oakland I never fail to stop by and get myself a good waffle cone of whatever I'm quite feeling.\nThe ice cream here is something special. You can literally taste the home made goodness of it! The vanilla is just one of my all time favorites here, simple yet just so rich! And their birthday cake is a rather unique (yet awesome!) flavor!\n\nAnd let's not forget about that surprise M&M at the bottom of your waffle cone :)", "business_id": "oN552ZjtfJWV7CMtftGrfA", "stars": 5, "date": "2011-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Zff7xm0J-C7hV1z3j-JipQ", "review_id": "lem07JwrxNUUFw6r1p0xCg", "text": "Favorite homemade ice cream place in America. \n\nMy favorite flavor is Cookies & Cream. Dave & Andy's makes one of my favorites, Blue Bell makes the other. Both are not readily available to me in my hometown of NYC. \n\nWoe is me.", "business_id": "oN552ZjtfJWV7CMtftGrfA", "stars": 5, "date": "2011-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4B4A94goRjDSr38ttvPKWw", "review_id": "eSmY0_jr6632YGbVbtzDnA", "text": "Simply amazing. The best cone you'll get anywhere... warm and yummy with a secret M&M at the bottom (also functional as it clogs the cone, preventing drip).  They make the cones and roll them up in front of you... it's a nice display as you're waiting on line.  The smells coming from this place are so good!!!\n\nThe ice cream itself, homemade, is special too.  My fave is the pumpkin pie.  Anything you order will be awesome... can't go wrong.", "business_id": "oN552ZjtfJWV7CMtftGrfA", "stars": 5, "date": "2011-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "UwCXQtx-jAS3zhARCCwhzQ", "review_id": "lTZeBDVoZAWI-AQ-5eNVQQ", "text": "I was super excited to try Dave & Andy's, especially bc I loove waffle cones and was excited about the surprise at the bottom!\n\nThe waffle cone itself is very crunchy and fresh, and definitely tastes homemade. The only thing that annoyed me was that it was almost TOO brittle (or maybe I'm too strong?) bc parts of the cone kept breaking apart while I was holding it.\n\nThe ice cream itself is good. Not super creamy like I like but the flavors are there. Birthday cake is a little overrated but then again, I'm much more of a chocolate fan...\n\nI'd go back! :)", "business_id": "oN552ZjtfJWV7CMtftGrfA", "stars": 4, "date": "2011-02-26", "type": "review"}
