{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SJPV0BQq_ycnNTxBfiQ-oA", "review_id": "B8gMELXZsJWWNjEvahJbEg", "text": "Every neighborhood in Pittsburgh probably has a non-chain donut spot that is considered one of their best kept secrets and local treasure. Well this is easily that for the greater West End area of Pittsburgh. And I'm pretty sure that they would rank up there against any other neighborhood's best donut effort as well.\n\nSpeaking of which, if someone would like to organize some sort of tournament to decide the the dominant donut producers in the Three Rivers area, I would gladly volunteer my expertise as a judge and set aside my love for Better-Maid in order to conduct myself with the impartiality and professional one would expect from a regional donut judge. For serious.\n\nThe donuts themselves are the more traditional style cake donuts, with a moist and crumbly inside, slight crunchy outside. They are amazing and need to be experienced.\n\nThe only knock on this place is that if you don't get there early, they tend to sell out occaisonally. Also, they are closed on Mondays and Tuesdays. But when the worst thing you can say about a place is that it's products are too in demand and not available as often as you like, you're clearly dealing with something pretty great. \n\nI've brought their donuts to over 20 offices and, other than dieters threatening to kill me, nearly every person has woven a tapestry of superlatives explaining how much they love them. If you find yourself having to buy popularity with donuts, picking up some Better-Maid is a surefire way to win over anyone who enjoys deliciousness in the morning.", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2011-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mXJS_e-zR68eExLhMrxJPA", "review_id": "2odWXQYiicQ8bA2eymkf-Q", "text": "One of the best donut places is the area. I love the fact that they only make soo many donuts every day and when they sell out they just CLOSE. Awesome. get there early !!! Homemade donuts are fantastic and worth it", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 4, "date": "2011-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "evUMtR6nxFMy5AnaJEgLVA", "review_id": "q6N3W_PWFdGWBlfgtXS5Aw", "text": "HOLY MOTHER OF DONUTS! This place is amazing. My daughter and I stop every Friday morning, and honestly, it's the highlight of my whole week. Donut holes are to die for, but everything here is good. Like other reviewers said, get here early because they go fast!", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2012-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_SRuFa3jMq10L6jQhLacyQ", "review_id": "JBEPscuE5LSVw8LrKx4FnA", "text": "By far the best cake donuts in Pittsburgh.  I will never again go to Dunkin Donuts after trying Better-Maid.  Since Ken sells out every day (and in an hour or so), you are assured of always getting baked goods that are only hours old.  In fact, if you show up when he opens at 6 (7 on weekends) some of the donuts are still warm!!", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2015-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Sv7eiVpVlSGGGFqMKh-SBQ", "review_id": "osubTeh9U3D-6hmO8TbV3A", "text": "First one in the store on a snowy and cold Saturday morning. Twelve people behind me. The donuts are so good that it made up for his late opening at 7:15 AM. Folks were friendly and cheerful and clearly take pride in the donuts (and the trippy experience) this little shack of a store offers you.", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2015-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bbm6c5CHf5IJG5ju0ozXZQ", "review_id": "hHV7X-q65iV8rBBP_ZI_LA", "text": "5 stars for food and service. The atmosphere and decor could use some help -- the interior is clean and neat, but dated. The outside/exterior can't be helping business -- if you can get past the stark white exterior walls, the green roof line, and the nondescript sign, you'll be treated to a good, \"from scratch\" meal that tastes homemade, with excellent/friendly service. This is a great place for breakfast.", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 5, "date": "2010-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5pDMwnpRw5Xz_ZN5MEmvxw", "review_id": "wxXPgLgpsm9vJ0MCJAy46Q", "text": "I have breakfast at C's Bakery often because I live within walking distance.\n\nI sometimes get the pecan waffle but most often get Biscuits & Gravy or the Eggs Benedict.\n\nI was in there last week and had Eggs Benedict and an order of Holly Browns, which are hash browns with cheese, onions and topped with hollandaise sauce. That was a really good combination for a frigid February morning. \n\nService is always polite and attentive and prompt, even when they're busy.", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 5, "date": "2014-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VauuOm5DdfExwIjgDIsUjg", "review_id": "f-O0aWppUuQ3eGoRdD05Tg", "text": "The breakfast food here is amazing! The staff and service are great! They always have fresh products. Love it!", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 5, "date": "2015-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "fFmLNPsvu-mT0ewk-sG37w", "review_id": "GVJo3JBBGr9jZS6MAx5E8A", "text": "I've tried:\nChunky Cinnamon bread\nSpicy Cheese bread\n\nI first came across Oakhouse Bakery at the Dane County Famers' Market, but I've since seen their products at multiple stores in the Madison area. I know Regent Market Co-Op carries some of their breads.\n\nTheir Cinnamon bread is decidedly cinnamony, but much too dense and dry for my liking. \n\nThe Spicy Cheese bread was good, but I found that it falls short of Stella's version of this specialty. \n\nDespite the less-than-spectacular nature of what I've tried, I certainly plan on giving Oakhouse another shot. I'm hoping to dig into some of their donuts next time, of course :)", "business_id": "IvOeqnZZrGKjUxj6fW2P7Q", "stars": 3, "date": "2014-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2niwhUC9pAeHH_W29cl9Cg", "review_id": "CubrhqffVpKJBssv2abBbw", "text": "I have made a couple visits over the years (I don't live in Champaign). Located along a major thoroughfare for the city and near campustown. The donuts are pretty good. Quick service. However, not all the donuts are in stock at a given time. I was just there and didn't even see glazed yeast donuts (the classic).- just glazed cake and the glazed minis. I appreciate having someplace to grab a snack with early morning Black Friday shopping.", "business_id": "xky2rWT8kpsdyJ4YgZB3Jw", "stars": 3, "date": "2013-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "N-D-d1Z4UybdlkK1HxlNPA", "review_id": "w7xAd60EtdzCvSGVC5OGnQ", "text": "My husband is a huge donut fan, so when I noticed this place driving down McDowell, I suggested we go. One drawback is that they only accept cash, so we had to go to the Circle K ATM first. The donuts were fresh, and the cake varieties have become our favorites: crispy on the outside, soft on the inside, dipped in chocolate or vanilla glaze. I had a custard-filled raised donut once, and the custard was clearly out of a can- and maybe an old one at that. The coffee is quite good, and you can fix it your way with sugar and non-dairy liquid creamer. The place itself is a bit of a dive- old and shabby, but clean.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2007-02-25", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "q1ILiFfzpaf_UapvlFDn3w", "review_id": "gjuZQYdY9nFnFKU7wxyLMg", "text": "I've not tried any of the Boba drinks, so I cannot comment on them.  What I can say is that the donuts are very very good.  They are extremely fresh if you get them in the morning right before work and go great with coffee.  I am very disappointed that they don't have creme-filled Long Johns.  I asked the woman behind the counter if she could make some and she said they don't sell well.  I disagree.   I've never sat in the building and ate, just ran in and got served right away and off to work.\n\nYou should bring cash unless you want to pay a small charge for running a credit card.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2009-01-27", "type": "review"}
{"votes": {"funny": 3, "useful": 6, "cool": 2}, "user_id": "wFweIWhv2fREZV_dYkz_1g", "review_id": "dP0ZVh2K8Jm7Szpdthx2iQ", "text": "It took me a while to bring myself to stop by this place.  From the outside it looks questionable.  I finally went for a splurge on my bday this year and dove into their huge apple fritter.  I go into a sugar coma afterwards but I don't care, it's way too good - so soft and crunchy and appley all at the same time.  I stop by every once in a while when I'm feeling naughty.  The only other thing I've tried was the croissant ham & egg bfast sandwich... it makes a great hangover bfast.\n\nI'd recommend bringing cash though, they charge for using cc.  About $10 bucks covers everything the hubs and I want including drinks.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2009-12-09", "type": "review"}
{"votes": {"funny": 5, "useful": 2, "cool": 2}, "user_id": "WJkmgkrSPMHTfDTD3VgqqA", "review_id": "3Nyh24Af50t_7OYr2JV27Q", "text": "I'm almost 200 lbs... it didn't take me long to try this place out. =)\n\nOnce I knew a bunch of Asian people owned this joint, I knew the donuts had to be good. I'm from San Diego and when we want good donuts, we drive right past the Krispy Kremes, Dunkins and Yum Yums and hit up a mom and pop shop in the hood.\n\nThis is exactly that. This place opens early at 5 am and there is always a stream of cars until about 9 am. I have to get there early or else my ham and cheese croissants are ALWAYS gone.\n\nGreat price on a dozen donuts and they are amazingly fresh! Melts in your mouth and is an awesome way to be the office hero. The boston cremes are also a favorite of mine.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2009-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DwU7KVfebA70AlVtX0iOWw", "review_id": "v11cKlFw0-TM37AtjdHing", "text": "Yes it is an Asian Donut shop, but they know donuts. The Coconut Flake, and Coconut Toasted were super fresh, moist, and totally delicious. The Chocolate Cake with Chocolate Icing & Nuts was good, bordering on the dry side. Still good mind you (what donuts aren't) but not as tasty as the fresh glazed base of the Coconut. Yes the outside looks shady, but when you walk in...Donuts! Rainbow is a great find.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2011-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "UHyDQ-laihWMGa8MtIToOg", "review_id": "Us37zW5QMUSoJmNgkyhyHg", "text": "Just came from here with a dozen box of Donuts, and a large Cappuccino Boba.  I didn't know Bobo and donuts went so well together!  The donuts are very good, but I think I will be coming back for the Cappuccino Boba.  Delicious!", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2011-02-20", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 5}, "user_id": "usQTOj7LQ9v0Fl98gRa3Iw", "review_id": "gUwEcIH__JfoB48xKdZNSA", "text": "Having zoomed past numerous times and even thinking of stopping in a few times before, my craving for Boba finally made me stop.\n\nThe service is 5 star the lady working the counter was friendly and offered some great suggestions based on the flavors they had for Boba.  What they had were tubs or powdered mix.  Some of my favorite Boba places in the Valley have more fresh fruit and real taro. I was slightly put off but was needing my \"fix\".\n\nDeciding on a Mango Smoothie with Boba, I decided on a small and decided to try one of their donuts as well (glazed twist).  \nThe boba was just ok and the donut was very good, light fluffy inside tender yet slightly crisp exterior with a light glaze. \nTheir crosissants looked amazing and they had an average variety of raised and cake donuts. \n\nI had my donut fix for a few months at least. If I had to pick up some for work I would come here. \nFor boba...I'd go back if in the area and not willing to drive to my other favorite spots for a fix.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 3, "date": "2011-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "thdVzCfKx-DV0zYWqId3pw", "review_id": "Zept3JK82r3Os4oDiX2ghw", "text": "Rainbow Donuts is the survivor of a dying breed.  Donuts, coffee and a few other breakfast items.  So simple, so good, and so hard to find.  The only thing this place seems to be missing is a drive through.  But then again, if you're picking up donuts, you can probably use that 10 foot walk from your car to the store.\n\nThe donuts are soft, sweet and light. Not too greasy and oily, and not too caky or spongy.  I can eat three or four of Rainbow's Donuts and not get that sick \"why did I have so many\" feeling.  The donuts are also a little smaller than most places, but they're also cheaper.  The selection is pretty big, and it would be pretty hard to not to find something worth trying.  It's kind of weird that there's quite a few different prices for the types of donuts, but that may save you a few cents in the long run, so I guess it works out.\n\nRainbow is open everyday from 4am to 7pm.  If you're looking for a treat on your way downtown, it's the perfect place to stop for a few minutes.  The parking lot is very small, but parking isn't very difficult.  Most people don't hang around very long.  It's very quick in and out service.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2011-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w4dgIzMwwZvKsHaC47Ox3A", "review_id": "1zZ9bKNuQKLQroe52pp6GA", "text": "No No No, not the Sprinkles...\nI am ALL About the Maple Long John!!!\n\nMade the stop this morning for a little Christmas Eve Eve dozen for My Battle Buddies in \"The Cubes\"! Haha. They are so warm and moist this early in the morning. I do recommend that you try to make the short drive on over to The the Rainbow for a tasty treat. Have an Amazing Day Arizona!", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2011-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HFzJb1EnBsB6fD5s-9fXUA", "review_id": "mC5yDsdlJa9LuuzMC-44qQ", "text": "Sometimes you wake up in the morning with an insatiable need to have a doughnut....last weekend was one of those mornings.\n\nThe doughnuts here are pretty good. I come from Boston where even D&D has delicious doughnuts so it's hard to please me when it comes to the beautiful circles of soft sweetness. However, these do the trick I guess.\n\nMy favorite are the honey glazed of course.  If you go early they are still pretty warm!\n\nI'd recommend them.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2012-02-15", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "wNqwKWaRjClmcKsoJJRFow", "review_id": "ivPaAyhhIIB8HcRjaxV8kA", "text": "God these guys are GREAT!!!!! It really makes me sad that I am off sugar (and alcohol and tobacco-my liver and lungs are on an extended vacation) because their donuts are so damn good.\n\nI admittedly got caught up in that whole Krispy Kreme kick years back and perhaps I suffered a sugar overload that made me forget how much I loved a good, old school donut. Richard R. is right when he says they are the survivor of a dying breed.\n\nThey do their cake donuts just right and the glazed are a perfect balance of airy and doughy. The chocolate filled are the winners in my office as they have the unanimous thumbs up from everyone.\n\nThe folks that run the shop are super sweet and always cheerful (which is more than I can say for myself if it's morning and I'm on my way to work!) and their goodies always put a smile on my face.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2013-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mqueHx5CFC9IsZxLQb3H9g", "review_id": "VJ1r-D9ucLIW2xUS-AuhAw", "text": "This place has the best old fashion donuts!! EVER!  Yes they are sweet, that is why I must like them ;)  I have tried many of their donuts and love them all.  Their buttermilk donuts are also very good, however they are very heavy.  Literally heavy and fried goodness, ha ha.  So if you like more the traditional lighter donuts go for the non-cake ones.\n\nIf you don't go here because you think the place looks \"sketchy\" that is too bad for you. . . .because you are probably missing out on a bunch of great places in Phoenix that aren't the \"Kierland Commons\" or  a chain.  BOO!    \n\nGrab a dozen and bring them to the office and watch your coworkers scarf them down.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2013-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "QRrjh29Y9KzVgmRhVZjs_Q", "review_id": "6_P65mwWok0kDKAwN3ILAg", "text": "Best donuts in the valley...hands down.\n\nLet me start by saying that I have had a 30 year long obsession with donuts that has taken me around this country in search of the best donuts wherever I happen to be. \n\nHome is Phoenix and I drive 25 minutes out of the way to visit THIS Rainbow Donut shop.  The other is down the street... Good. Not the same. \n\nWhether you are into the perfectly fluffy raised and glazed or the old school cake donuts, you will not be disappointed. \n\nCroissants and other pastries are also fantastic and deserve a try. \n\nBut the real masterpiece at Rainbow is their enormous (and standard priced) Buttermilk donut. It will fill you up like eating three regular donuts as I'm pretty sure they use a yeast based dough to make this little gift-from-donut-heaven. \n\nThey claim to be the best donuts in the state, I can't validate that. But, I can tell you they are top 3 out of dozens of shops I've been to in a handful of states, dozens of cities.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2013-02-19", "type": "review"}
{"votes": {"funny": 7, "useful": 2, "cool": 2}, "user_id": "9UtNYyrWnpMbpshMrZSRGQ", "review_id": "UviavANXo1dpHeHXb_THzA", "text": "Donuts are the source of more smiles than both rainbows and unicorns.  Combined.  I read that somewhere on the ol' interweb... and dangit, I believe it.  Especially if those donuts are from Rainbow.\n\nMaple bacon, whipped cream filled, toasted coconut, chocolate cake with coconut shavings.  Those are just a few of the magical flavors that the wizards at Rainbow have concocted with their wizardry.    \n\nEveryone, put your hands up in the air and say it with me now... RAINBOW DONUTS, WOO HOO!", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2014-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d0wJVf7Gv7v1B-HHYhxZtQ", "review_id": "SvaKkRwjlLyZABoJ48LMYQ", "text": "So at the time I was very impressed because that apple fritter really was the best I've ever had.  But it was a tiny bit raw in the middle...  Had to be reflected.\n\nThe cake donut was ok, I've never been a huge fan of these and no its not special here.\n\nThe boston creme donut - my favorite donut - was fluffy and soft so good in that way.  However, the filling was only in half the donut and it tasted chalky..  :'(\n\nThe apple fritters like I said were wonderful.  By far the best thing I tried here.  It's almost like they fried a puddle of krispy kreme dough with some apples mixed in.  Very soft and fluffy.  Slightly too much glaze and a tiny bit raw in the middle.. but it will still haunt my dreams.  \n\nI would definitely stick to plain glazed with or without chocolate and fritters.  Yum!", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 3, "date": "2014-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Jf9vBT3qYamjlllkoSFW3A", "review_id": "E9wH_hafQXr_kef1-sEjzA", "text": "Came here for a kolachi but only the northern location has them. Oh well. But still enjoyed the maple bacon donut and the sprinkle donut. Not good for the diet but good for the soul. The lady behind counter was super sweet and nice. Really liked the friendly atmosphere.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2014-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Phj1jHdpcPPBE1hNg9-Tqw", "review_id": "WbEKGvor1gu2RjB9L7fd0w", "text": "Stumbled in one morning (about 4 AM)  looking for something to get me started and asked the \"Baker\" what the best Donut was. He responded that \"glazed is our best.\"\nIn the case I saw a Whipped Cream filled Glazed Donut. Combine two of my favorite food groups and I am a sucker.\n\nAbout six or seven trips later (I have lost track!) I am still absolutely in love with this combination. The Baker swears it is real whipped cream, I doubt it but I could care less it is so good!\n\nDon't miss it!", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2014-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 5}, "user_id": "gx3ZRjh43OOuavKl_rXvrA", "review_id": "BiKMWW_Od4ZwtoadCVHFcg", "text": "I don't think I've ever come across a donut I didn't like ... \n\nRainbow Donut is conveniently located near Banner Good Sam and is on the main road so it's easy to get to. Walked in at 5 AM to an empty shop and a solo diner having his coffee and donut.\n\nAfter looking through the case, the Maple Bacon donut caught my eye as well as the Raspberry filled donut. They both came out to be less than $3.\n\nMaple Bacon donut was so fluffy and airy- love. The maple flavor was there, not too sweet and more like a semi-solid glaze. It came topped with cut pieces of bacon which I found to be a bit too tough and salty, but was okay since there was more donut than bacon to balance it out.\n\nRaspberry Filled donut was also similar in texture as the donut was fluffy and soft, however I wasn't a fan of the Raspberry filling. Too much thickening agent to it, very gelatinous and artificially Raspberry.\n\nService was fast since I was the only customer there at the time. I'lll probably try out their classic/raised donuts instead next time!", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 3, "date": "2015-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QT-7jpsEuCR-pFro59KBtQ", "review_id": "FE8-FtPb-7BSLLKLhTdvhw", "text": "We have been there a few times for coffee. The coffee is very good. The customer service is good. The price is great compared to Starbuck's and the drive through is quick and easy. One night we stopped by for decaf. After staying awake until 2 am, I realized that the coffee was caffeinated. That was not so good. \n\nThe donuts are terrible. They don't taste like what I remember as a kid. There was no depth to the cake donut and it was super light and spongy. Not what I think of when it comes to a cake donut. On top of it, the donut tasted like chemicals. I'm not sure if it was the frosting. It certainly did not have that homemade taste. Wishell's on McDowell is much better.", "business_id": "T-AAN0CizEBOTtHinTuvrQ", "stars": 3, "date": "2010-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J2YM0tXQKmOF6RtVIzH8-A", "review_id": "FHdOLOHi9mahVCCZivc97w", "text": "Not the Dunkin Donuts that everyone remembers.\n\nTwo tiny shelves of stale donuts...I guess when the grocer is selling your way overpriced coffee like gangbusters, you can forget what got you there in the first place.", "business_id": "T-AAN0CizEBOTtHinTuvrQ", "stars": 1, "date": "2011-12-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IqrtFpXjwUhJNd28LUOOeg", "review_id": "jvVIr4d8vIJqgTF2cS0RTQ", "text": "Have you been dunkin lately? If not make sure to check this one out.  Prices are cheaper then Starbucks and coffee tastes better. What's not to like about that? \nThere is a set of standards to be expected these days when it comes to coffee. What about service? At this DD the service is fast. From drive tru window to walking in, your coffee will be ready in 1 minute or less. It's a rather simple relationship between any customer and any retailer. You provide the coin, they provide the service. And this DD work very good from that perspective.", "business_id": "T-AAN0CizEBOTtHinTuvrQ", "stars": 5, "date": "2013-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "DghMl81bONCh5ELnrgn4Fw", "review_id": "9HhoDATqFsZL_hiPPDfcWA", "text": "I wake up with a smile knowing I'll soon have a cup of their delicious coffee.", "business_id": "T-AAN0CizEBOTtHinTuvrQ", "stars": 4, "date": "2013-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Lz6QTp7y5J74Rr96DcU2Lw", "review_id": "0alSZlhtp1wVOYgyf-nqVw", "text": "So I went to this place a few times.  \n\nThe donuts are Ok, they are donuts nothing special.  \nIn reality I would rather go pick up donuts from QT gas station (with coffee, read below).  \n\nAnother thing that killed this place for me, is they don't know how to make ICED COFFEE.  I prefer iced coffee when the weather is hot/warm which in Arizona is frequent.  So I will order ice coffee with cream and sugar.  Ok anyone who likes iced coffee know if you use a granulated sugar product you add that into HOT coffee. \nApparently the people who made my iced coffee drinks didn't know that.  I got iced coffee with a thick layer of sugar at the bottom of my cup.    \n\nNot just once, or twice, but THREE TIMES.\nThe first time I said ok just a mistake, give a try one more time.  Second time I figured they didn't know how to make iced coffee so I was done.     \n\nI got a coupon for a free coffee, so I used it got an iced coffee (the free made me forget that it's horrible even when free).  Took one sip and ended up throwing it away in the trash can right outside the door.\n\nMcDonalds has better coffee.\nQT gas stations have better coffee.\n\nAlso selection on both donuts and bagels are very limited no matter what time you go in.  \n\nPeople are nice, but their iced coffee making skills are horrible.  \n\nDrive a few more blocks and go to Bosa Donuts on Indian School around 36th Street.\nBetter products, and it does not take for ever to turn out of the parking lot.", "business_id": "T-AAN0CizEBOTtHinTuvrQ", "stars": 1, "date": "2015-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r4mNCiXIfuMdrzwQcIKUJA", "review_id": "lYmZOxqu9WlWRI_ax8vLfA", "text": "First of all, I am BEYOND sad that I do not live minutes from this DD anymore.  I first started drinkin DD when I lived in Boston and cannot get enough!  It's like liquid crack!\n\nThis location is so unique and reminds me of the staff I would meet at Boston locations--remembering your order, saying hi, asking how work was, etc.  They treat you like a friend!  \n\nThe iced coconut coffee is my fav and they ran out a few days in a row once.  The staff was really patient with me while I figured out my alternative and they even suggested a couple new flavors that I tried that were pretty good!\n\nOverall, this is my favorite AZ DD location!", "business_id": "T-AAN0CizEBOTtHinTuvrQ", "stars": 5, "date": "2015-02-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "55ecDCpJIXzTWjEzMQ11Vg", "review_id": "83wq6XJk-oNq2k4qxT_bXw", "text": "this is after all a donut shop...and one that has been there for years with many changes in ownership.\n\nCurrent ownership is very good, quality is excellent, they try hard to keep it clean but it's a very old building.\n\nDonuts are better than Dunkins, women that work there are adorable, coffee is quite good and it's a can't miss.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 3, "date": "2009-01-14", "type": "review"}
{"votes": {"funny": 7, "useful": 3, "cool": 2}, "user_id": "55ecDCpJIXzTWjEzMQ11Vg", "review_id": "gkGAhaLuhmu8ZIvf-oZgMg", "text": "Note to self - do not write anything but 5 star reviews to a place that you frequent because your picture is attached to profile...\n\nMy original review, 3 stars thinking that the 'A-OK' 3-star designation was an affirmation.\n\nOf course I wander in this morning and I am firmly rebuffed...evidently being called adorable isn't good enough nor are all the other positives I mentioned - it's the 3 stars.\n\nSo, ignoring the fact that there aren't any outside tables...ignoring the fact that within an hour of direct sunlight, the place heats up unbearably...Ignoring the fact that I sometimes get pan-handled outside...ignoring the fact that I sometimes have to hunt them down for a refill on my coffee...ignoring the infrequent times I've gone there to find them closed because the baker pulled a no-show the night before (less frequent these days)...\n\nThe donuts are always good, the coffee is quite good and the women are indeed adorable...a 5 star update.\n\nNow Linda, please, can I get refills?  ;-)", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2009-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2OLdiDZNdrPkdjp1WmW0-w", "review_id": "JV05YEc7AVq3aw2Y_nc97A", "text": "Great donuts.  I think they are just a slight step below BoSa, but they are very good.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 4, "date": "2010-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yGhTkVx3O6uZNEQkx5x_Qw", "review_id": "TG8UE6SzH7HJisHd9AbpvA", "text": "Love these donuts! I can never buy just one donut because they all look Sooooo good! Needs a shop in the East valley.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2011-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "8U6I0GuBasZa9rapy2H-8A", "review_id": "SF35xhZ9GKyEz6FqkLsKkQ", "text": "5 stars for the kolaches and the customer service! Sam the co-owner chatted it up with my boyfriend and I while we ate our kolaches at the counter.\n\nMy boyfriend is from Texas and knows his Kolaches. We've noticed the sign on the sidewalk and finally made it in. They claim it is the ONLY place dishing out the Texas Kolaches (I'll stand by that claim --we've been looking for Kolaches for awhile now). They serve up spicy sausage, regular, and spicy ham & jalapeno - all served with cheese, yes please. If you have never had a kolache it is similar to a pig-in-a-blanket amped up on yumminess.\n\nThey have an espresso machine and many donuts choices. I will be saving that experience for next time. Oh, and I also read someone's review on breakfast burritos - looking forward to that too.\n\nIt's an older place that reflects its age. With a little sprucing up it could the cutest and best donut/kolache shop in town!", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2012-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WgX4RZT2nbqXcJclDWHWYg", "review_id": "5Yj3cNOWMVlfC27jlutSWw", "text": "Two words: Texas Kalaches. Haha! We also tried the Maple Bacon Donut and it was surprisingly good (I couldn't eat a whole one, but its good!). I wish it wasn't so far away, though!", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2012-02-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "TeR1SIGaqN1c8SdEivi5vw", "review_id": "K4vatfdVC2PswEt2LnB4NQ", "text": "The maple bacon doughnut was tasty, but the cherry fritter blew. my. mind. My iced coffee was decent as well. I anticipate returning to rainbow doughnuts!", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2012-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r-PylGexyY2_Trzd8fdAjg", "review_id": "3g_B5cqY2hFhDaN89MNcLw", "text": "I think it's so cool that they have a door that opens and closes! Cool place. Can't wait to try you guys out again !", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 3, "date": "2015-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "66oDhsKSB_eSrhCKiERDow", "review_id": "Jet0XOmSgH0MlGv7WWKF-Q", "text": "The place is a little run down but very clean.  The friendly Asian man and woman (owners?) and were friendly.  They didn't have a very wide variety at 11 on a Sunday, but I bought a ham and cheese croissant, glazed donut holes, and a frozen hot chocolate.\n\nHam and cheese croissant: It was okay.  The woman behind the counter \"heated it up\" but it was in a microwave, not a high speed oven or toaster that would have made it less squishy and more flakey.  Sliced ham and cheese were grocery store quality.\n\nDonut holes: Tasted a tiny bit stale, but still good.  I prefer BoSa's in Chandler though.  I imagine these are fantastic when warm.  I'm going to save some and try pop them in the microwave later.\n\nFrozen hot chocolate: Very heavy on the cocoa powder, and served without whipped cream.  Could've used some more  sweetness and a creamy vanilla flavor in it.  Added a couple pumps of sugar free peppermint syrup at home to wake it up and balance the bitterness of the cocoa.  I've yet to find a FHC that can beat Dairy Queen's, sadly.\n\nRainbow has a very convenient location with easy parking, though their hours are somewhat limited.  I'd rather support them than a chain, and they're a step above my other local choice of Bashas', so I would be back if I need (or want) any donuts.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 3, "date": "2015-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7LoqWXrhfd65bVre6S5FgA", "review_id": "OCJUFGd76tym6sEcAFolkg", "text": "Really good fluffy doughnuts. Tried the honey dipped doughnut holes last time I visited because they sounded interesting.... They're a little different tasting but addictive.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 4, "date": "2015-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "WgiIfVz5te12AcwnfTRWVQ", "review_id": "Q4DBfTvv9pK9EFS8uJSAew", "text": "I became such a regular here  that once, upon ordering at the drive-thru window and discovering I had forgotten my wallet, the woman who works the window told me to just pay her the next time I came there (we visited every Saturday). Yes, the people who run the place are really that nice.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2008-12-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zPqUBpy-7Bc6LdlfO2amRA", "review_id": "YEAiOkX1EvVB-2DkY5FEog", "text": "My darling husband was happy to go out in the cold on Sunday morning for a box of these tasty treats. When you think old fashion donuts (or sin on a plate) - Rainbow Donuts kicks dough-dough!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2008-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "hFG1Lira7tL_PElq6bdAAw", "review_id": "cjyNBHD8Q1li_XDTsim_Ww", "text": "After tasting these donuts, I realized that not all Rainbow Donuts are created equal.\nThese are the best I've had in the Valley.  Worth braving those early Sunday mornings to get my fix.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 4, "date": "2009-01-05", "type": "review"}
{"votes": {"funny": 9, "useful": 10, "cool": 7}, "user_id": "OAWop7e3tUzl-kt3-OwPIQ", "review_id": "mAI4_ZTI0PE9NeOLGWTTlw", "text": "I have read the reviews on this place a few times and driven by a few times. Unfortunately the diet/lifestyle i follow really limits as to when/what/where I can eat. Their hours don't really work with my weekly planned cheat meals and I refuse to get takeout and put it in my fridge and possible ruin a perfect *insert random food here.*\n\nWell Christmas morning I decided that today was the day that I was going to allow myself some room to grow ;)\n\nI woke up and hiked squaw peak.. drooling and thinking about the donut I was going to get afterward. I was smart enough to ensure they would be open. They were open Christmas day from 4am-2pm which is worthy of an extra star right there.\n\nI walked in and knew right away I had entered a happy place. The display cases were filled with amazing looking treats. I was literally SLAPPED in the face with that fresh baked donut smell.\n\nI picked out the following:\nglazed blueberry buttermilk\nglazed buttermilk old fashion\nmaple bar that had been sliced down the middle and filled with some of the richest whipped cream I have ever had.\n\nI cut them all into 3's and sadly had to discard the extra. There is a line between treating yourself and killing yourself.\n\nTHEY WERE STILL WARM! they were amazing.. they, unlike most things that I drool over for months then finally get, lived up to what my brain expected.\n\nThe girl behind the counter was so very nice. She put up with me asking what everything was and being very indecisive. After finding out that anything left over is trashed at the end of the day I had to ask what time they get there to make them fresh. I guess they have a bigger selection on weekends and the crew comes in at 10pm to open at 4am to give us these amazing treats. On the weekdays they get in at midnight.\n\nNext time you feel like treating yourself to a sugar rush this place is worth the visit. Always support the local guys when you can!\n\nI should have taken pictures and noted prices but I was so excited I couldn't help myself. I'll try and do better on my next review :)\n\nPS.. Please start making a blueberry buttermilk bar :)", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2009-12-30", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "h5Igg3CnzAhVwf2aSxNEBQ", "review_id": "NuDXpQzFOlN1wGIDeqCe0g", "text": "No really - if this place goes anywhere Phoenix;  AZ for that matter will have lost something monumental.  I am not over exagerrating when I say, at the top of my voice.....THESE ARE THE BEST DAMN DONUTS YOU WILL EVERY EAT.  They are light and big, the long john with the cream down the middle is unlike anything you've tasted.  The cream isn't super disgusting sweet so it goes so well with the chocolate or maple frosting.  It is owned and operated daily by the same people.  You won't see anyone different every time you go there.  I have one drug.  Coffee.  Second drug every 2 months.  Rainbow Donuts on Cave Creek and Greenway, not all the same this is the best in the west.  Bar none.  Try it you'll see why.  \n\nTry not to cry when you go there.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2010-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "ofQg505JkGomCSeo1U2Gug", "review_id": "iDmxEpVgSV-70wYPOI0eCg", "text": "The place is clean and the donuts are very fresh. I am a fan of their muffins. They use plenty of walnuts on the banana nut muffins! I bought a batch for the offcie and I was the hero of the day... just that day (Lol). From my observation though, they are pretty busy so you better get there early if you want to have a good selection. Nice staff too!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2011-01-04", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "bswV-wIGU9Bw4mbxSPdykg", "review_id": "5E7A3qSb0n99Va63LQKMpg", "text": "A classic American donut shop.\n\nTheir glazed donuts are a sublime expression of the baker's art.   \n\nEvery now and then I  buy two dozen and take them to work.   I have always heard expressions from my coworkers on how truly good Rainbow donuts products are.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2011-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9ElhYTROAJy7lUQ-ZtPQmw", "review_id": "UtviG0ATIcig1rp8vSCQuA", "text": "Tom: I've heard great things about this place and it is always busy when I drive by so I decided to surprise some co-workers and grab some donuts for them for breakfast.  The donuts were pretty stale.  Although they looked like they make their own donuts the display box for the donuts were running low so I could tell that I wasn't getting fresh ones which was disappointing.  I saw a sandwich called a Egg/Ham/Cheese/Bacon and had a choice of bagel or croisant and I got the croisant.  Wow.  This was just a mushy soaked thing.  Don't really know how to call it.  Just awful.  Also, what kind of soda choices are these?  RC Cola?  REALLY?  I had to get a Sunkist Orange which is ok but come on.  Pepsi or Coke.  Won't go back...", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 2, "date": "2012-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_aMz2TsaWs7yCPY2P5Ti8w", "review_id": "R6vNfvEy5hajQ6q1iqbadQ", "text": "Setting:  We either go before or after church.  If we get there early, there is definitely more of a selection, although we have hit the gem going in the afternoon before they close on Sundays.\n\nAmbiance:  I would like to say I am somewhat of a donut connoisseur.  These deep fried goodness is definitely my weakness.  Once you enter, you are filled with the smell of..yup, you guessed it, donuts.  They have a great selection, a little bar to sit at, seating outside, and tables inside as well.\n\nFood/Menu:  The maple bars are my favorite.  They are soft, topped off with the right amount of maple, and fluffy donuts.  They also have small apple fritters that are deep fried on the outside that makes the crunch even more delicious.  These are definitely my two favorite donuts, but the rest I have tried have great quality and taste.\n\nService:  This place is family owned with friendly service.  I have not had any problems with service.\n\nOverall:  Well organized and clean compared to other donut places.  I am about to drop some knowledge on you Arizonians: the donuts are fresh and they are THE BEST DONUT PLACE I have had in the Phoenix area.  If they had healthy donuts, I would be here every day.  However, I will stick to the occasion of 1 or 2 times a month before or after church.  We will see you again Rainbow Donut goodness!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2013-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "KQnq1p-PlWUo-qPEtWtmMw", "review_id": "vRbpQ9RXacfqKjXZoeN-hQ", "text": "Oh donut, how I love thee.\n\nRainbow donuts has the best donuts (I've had thus far). I really like how they offer the classic donuts, but they also have new flavors all the time.\n\nMy favorite is the cherry fritter, and they are very generous on the size! \n\nTheir prices are good also, not too pricey, but more expensive than the grocery store. However, quality counts here!\n\nI would recommend this place to anyone who loves donuts or whoever wants to try a new place.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 4, "date": "2013-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fxglTLwS2HqcmWiuKwUT4A", "review_id": "kPCr9yr6dP1rnn2nrpk6ng", "text": "Generous, fresh and well balanced donuts!  Love this place.  The creme filled do not have overly sweet creme--delicious.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2014-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "PA7iyQYEtzvzqeqIOjxPKw", "review_id": "PHtXpm7cN1JJeWf-71Vb-Q", "text": "After pulling an all-nighter from studying for finals I decided to reward myself with a raisin bran muffin. Thank the heavens they were open very early :)", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2014-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pfIthpLdjmllaHfP0ZJAYA", "review_id": "iQEwdvan6t9-E8oGxgUJ-w", "text": "Best donuts in town, the only problem is they run out early!!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 4, "date": "2015-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mqELWLgzXtcQDCxY60Xkyg", "review_id": "nTUGOd9RAy6IlbgGgOHJjg", "text": "Donuts are always a simple treat to put smiles on faces. Whether it is dropping them off to an office, treat for a friend or to help crave the sugar craving in your appetite. Rainbow donuts is the perfect place to stop in to dig in. \n\nThere are donuts for every craving person's taste bud's desire. I found a sprinkled donut with fruit loops on it. Or even the Oreo Cookie topped chocolate donuts. To the plain twisted glazed donuts I promise you will be in love.\n\nI won't stop there besides buy a dozen or two of your favorite treats grab a refreshing drink to wash it down. From coffee to juice and much more.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2015-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dY5Yph5HcC4dsFRC_2ngyA", "review_id": "UekpBRfSlGffQvpDKEzt9w", "text": "There is no better place to go for fresh delicious donuts. If you get there early, the selection is amazing. I've been late in the day where there is not much left but went ahead and tried what they had left and that was still amazing.  You will never get donuts anywhere else if you go here. They are definitely worth it.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2015-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MUHoBFzwRoXpCpgYSN8KRA", "review_id": "8_c25HW0J6SqYda3rsmAsA", "text": "Dunkin Donuts inside Cobblestone carwash on the south side of Bell at the 51.  Same really good brewed coffee, good service despite the inside-a-convenience-store-that's-also-part-of-a-carwash location.  I am always worried when I go in here that I might just as well pick out something pre-made from the fridge and buy it from the convenience store, but they make that coffee quick and it tastes good, so I'll keep coming.  Cheap, too.", "business_id": "AhXcP_o5YAmCePKl0jxBXw", "stars": 4, "date": "2008-12-23", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "vGxEuRrX_UmW5MhOAEpCvQ", "review_id": "o7EsGDZIlX7urEAIlMLG1w", "text": "I'm writing this regarding their post-redesign. I'm not sure they kept the same staff from before, but with this economy, I'm sure they can get better workers. I went in one Sunday morning to grab a quick breakfast for my husband and me. The line wasn't long, but it was SLOW! They had about 8 people working behind a small counter which only created chaos. When I did finally get to order my food, I ordered 2 vanilla coffees. I got my 2 sandwiches and 1 coffee. As the guy handed me my coffee, he announced to the world that he was \"going on break now\" and set my other coffee cup down and walked away. As he was about to cross the counter I asked what he did with my other coffee. His reply was \"uh, I don't know, its my break time\". Seriously? I polietly said it wasn't breaktime until I got my coffee. \n\nMy husband and inlaws went in not too long afterwards and got about the same service. They were sitting inside at a table and one of the workers came in with his motorcycle gear on and sat his helmet down on THEIR table and then proceeded to change into his DD shirt. They said it was a mess. Even worse , the franchise owner was there that same day and let all this happen. \n\nThe coffee is good, but I'm also paying for the service.", "business_id": "AhXcP_o5YAmCePKl0jxBXw", "stars": 1, "date": "2008-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mlL6MuK5zU6tGTbV3X0nhA", "review_id": "6yWmEHVn1JVG_N2bN7BFUQ", "text": "I was very impressed with this Dunkin Donuts and the renovations that were made. I never cared for the Baskin Robbins so Im glad to see this was jsut a Dunkin Donuts. The place looked really good and the new menu items are delicious. I always get my large coffee and am now hooked on the Veggie Eggwhite on wholewheat flatbread! Its supe good and super cheap! The service was great and the employees were very nice and friendly. I definately recommend this location!", "business_id": "AhXcP_o5YAmCePKl0jxBXw", "stars": 5, "date": "2009-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mlL6MuK5zU6tGTbV3X0nhA", "review_id": "D188yXq0A9IF1uk07dIOrw", "text": "I stopped in to get my car washed at the Cobblestone Auto Spa on Bell Rd near Rte 51 and noticed that there was a full Dunkin Donuts inside the building! I thought this was a great idea as people have to wait to get thier car washed so they can enjoy a nice coffee and have a bit to eat. I got an iced lattee and had a banana nut muffin. Both items were very good and the service was very fast. I wondered why they didnt have a big sign out by the road but someone said the store is new and it will be coming soon. This store isnt far from the one on the corner of Tatum & Bell.", "business_id": "AhXcP_o5YAmCePKl0jxBXw", "stars": 5, "date": "2009-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sBItSikDv_kKiyubJecJ4w", "review_id": "gITcX9bewmj254_MKo6Fww", "text": "I love me some Dunkin coffee and doughnuts in the morning. It's nice to see smiling faces when you walk through the doors as well.", "business_id": "AhXcP_o5YAmCePKl0jxBXw", "stars": 5, "date": "2014-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VD4rjZ7FhQ18k_qAxwaPXA", "review_id": "HjMAtj0YFQu4C4TwDVbdXQ", "text": "What doughnut store has no doughnuts? Dunkin Donuts, that's who... Four times I've visited this particular store and each time - usually after 3pm - nearly all their donuts were sold out. I get that they get lots of business early in the day, but they are also a doughnut store and shouldn't matter what time of day I visit. This would be like going to Dairy Queen for ice cream only to discover they had none. \nWhat Dunkin always seems to have is their piss-water flavored coffee, problem with that is they are not a coffee shop, if they want to be a coffee shop then they should change their name to Dunkin Coffee. \nI've complained several times to their corporate webpage, only to be completely ignored. So, we are done with Dunkin - there is a Krispy Kreme just up the street and they have a better selection of doughnuts, at a better price, any time of the day which are actually made fresh, not shipped to the store frozen.", "business_id": "YDeM8-M4GwxyymCoV7Y-Tg", "stars": 1, "date": "2014-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d3wyUjCowsC3QJy5hen1tQ", "review_id": "SXaprjecCg_cttq3Y6MbRQ", "text": "I have a horrible addiction! The iced vanilla coffee! I stop at this location almost every single morning on my way to work. They have never messed up on my order. They are always so kind and nice. Wait forgive me they messed up one time I asked for two donuts with my coffee and they gave me one I didn't ask for so I told them and they gave me an extra one! Not that I needed it! :-) They have great customer service and I'll keep returning here everyday to feed my addiction! :-( LOL", "business_id": "YDeM8-M4GwxyymCoV7Y-Tg", "stars": 5, "date": "2015-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QAbVDdN0PyZKJzvUCA74Zw", "review_id": "ZpQXBPo_dck_rkRkKwZLDw", "text": "Amazing -- I ordered the same sundae I ordered at a Mesa DQ yesterday and was charged $1.04 more for it here.  That ain't sales tax and when I asked about it, I got a lot of lip.  \n\nSo, if you like price-gouging by a staff with an attitude, c'mon down to fashionable Apache Junction!", "business_id": "zvFhC2Lywo6e8UaRTVj7sw", "stars": 1, "date": "2012-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WrMC47lTEQD9PlIYpGbiYw", "review_id": "kmyH9vOR3dOHYMZ96QB_-Q", "text": "Went hiking in the superstitions. Great day, we are driving back to Scottsdale and I see the DQ sign. I haven't had a peanut buster parfait since college in 1980. I hit it pretty hard. You aren't going to live forever you know?", "business_id": "zvFhC2Lywo6e8UaRTVj7sw", "stars": 4, "date": "2013-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "U8nezeDJHBywLTfvNtTgJA", "review_id": "1MJNpN__RNrqoKhSCz9mjA", "text": "I love Dairy Queens and \"have never met one that I didn't like\" but this one comes close. It is dirty. The windows are gross. The landscaping needs lots of attention. They turn off the Pepsi machine so you can't get a refill. This store needs lots of attention.", "business_id": "zvFhC2Lywo6e8UaRTVj7sw", "stars": 2, "date": "2013-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "JL_cervg7k-NB199arXIdQ", "review_id": "IBFAqqUiG0tyMqYrEaww-Q", "text": "I'm not going to turn down a donut if it looks somewhat fresh. But I must tell you, I am not a big fan of the dunkinkreme chains, and store bought doughnuts are just as disappointing. I was happy to stumble upon a local owned small business in Vantastic Donuts - they make doughnuts fresh, the way I remember them from when I was a kid. Getting doughnuts was such a treat, and the local Marie's Donuts in North Highlands, CA (google yelp them!) can not be beat.  But Vantastic is reminiscent. At 8 AM on a Sunday morning they had a wide spread of fresh fried delicacies, including a chocolate cream filled which was my personal favorite. The old fashioned doughnuts were fluffy and iced just right. This is my new doughnut shop, and by the modest crowd in the dining room, I'd venture to say it's been a local favorite for decades.", "business_id": "3wkH1sL4tojmaveP1jNiIA", "stars": 4, "date": "2009-12-08", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "xdWsnbaTEfBMVHttqZDHxg", "review_id": "YIYDNTcbE9XJl66H7-rVhg", "text": "I just want to park myself in this orange and brown blob of a place and stay and forget the world outside.  And not knowing what it is to experience doughnut nirvana before, it is here.  It is here with the plain sugar doughnut.  Very very friendly counter service.  And they have vanilla creamer if you ask.\n\nI've seen this place for 20 years and only started stopping here in the past few months.  Amazing that I will go to little dives off Roadfood dot com everywhere else in the country, and it took me this long to go to the one right in my old hood.", "business_id": "3wkH1sL4tojmaveP1jNiIA", "stars": 5, "date": "2011-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "jU8WrrgXggGX2xHglsPjxA", "review_id": "N1R4BBL2ZQpNxmPyXWP_pQ", "text": "Came in to check them out as recommended by a friend.  I ordered an egg muffin sandwich and apple fritter.  The sandwich was huge.  Too bad I didn't think of getting a picture until after I had eaten it.  It was better than I expected from a donut shop.  Service was friendly and it got very busy right after we ordered.  It seemed that a lot of people ordered the sandwich as well.  As I bit into the sandwich my mouth can feel the crunch of the english muffin filed with egg, sausage, strips of bacon, with melted cheese.  Apple fritter was good, but the sandwich was more memorable.  Service was excellent.  The only thing that could have made this a 5 star was the decor, but if you can see beyond the run down, out dated pictures, the food and service well make up for it.", "business_id": "3wkH1sL4tojmaveP1jNiIA", "stars": 4, "date": "2011-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3xFmGwxQMFOo_xPuq2z1cw", "review_id": "BVlUK8fHjcgOZBhq_S8nhQ", "text": "This place is a gem. The Butter Bars are the best ever, not too rich so it makes your stomach ill, but perfect taste and 10 miles after i left wished i would have gotten more. Chocolate filled was best ever too.", "business_id": "3wkH1sL4tojmaveP1jNiIA", "stars": 5, "date": "2012-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2ck7-c7MhrHFVWUAv4fntw", "review_id": "pzN9Nm6FLMSP_L1LyMNtlw", "text": "I've been eating here since it was Kathy's back in the 80's. It Is Always Dynamite!!!  Way better than any chain.  Maple long John filled with Boston Creme!!!", "business_id": "3wkH1sL4tojmaveP1jNiIA", "stars": 5, "date": "2012-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "a5ujkLe8Tx1Ak68-1Pj9fg", "review_id": "mCVFCaQpGXUC0ctgNwSgpQ", "text": "Dunkin who?\n\nThese are the best donuts I have ever had. I am not exaggerating, seriously the best. They are so soft and fresh. They have a big selection of specialty donuts, My personal favorite is the blueberry donut...not blueberry filled, the dough is blueberry. If you like fillers, they have just about every flavor. Enjoy.", "business_id": "3wkH1sL4tojmaveP1jNiIA", "stars": 5, "date": "2013-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CoyPRLqiqyiBrmzLJN6BRg", "review_id": "ogIhzG2UKdxDKJRig2y0xw", "text": "I found this place on yelp, and went there at 3 in the morning for a cup of coffee and a donut. I also got the pastrami torta since it was lunchtime for my night shift. I couldn't wait to eat the donut until I got home, so I had it in the car... And it took all I had to not turn around and go get another. I'm glad I didn't because this pastrami is melting my face off. It's a bit of a hole in the wall... But who cares!? The lady that helped me was nice, and its good food at a good price! Ill be back! :)", "business_id": "bZPEg3lCFSbJn_PczJyRBQ", "stars": 5, "date": "2013-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zDwRwE-dIa5CYbDNAWVKDA", "review_id": "ZEtRJL9tRzNzAjsaYdC4SQ", "text": "Krispy Kreme Donuts!!!!  My kids fell in love with Krispy Kreme donuts when we were back in California since it was first introduced.  My kids' favorite is the glazed donuts.  Mine is the sour cream donuts.... I know, it's VERY sweet, but with my sweet teeth, what can I say.  This place is close to home and the service is decent.  The reason why I took a star off is somehow I feel the donuts size shrinked over the years.  It's pricy for a donut that only takes a few bites to finish.  Other than that, we love Krispy Kreme!", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 4, "date": "2012-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "N3CPWyDUPLh60cpIT7FbWQ", "review_id": "qmUHyasb_IvAknr6ze_OQA", "text": "Donuts are great but the crew needs a cleaning class because  the smoothie taste like mildew and made our stomachs hurt. When asked how often the machine was clean we were given sarcasm from the cashier and manager of course was not available.", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 2, "date": "2013-02-11", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "Vi77s0AS-cIzPoBq5AbEaQ", "review_id": "Gu8kchvvLBXirrpCW-cC7A", "text": "Call me weird, but I don't recall ever seen a place where you can experience the art of making doughnuts! They have glass windows around the store where you can see the machine mixing the dough, forming small circles, frying them and then..... the best part!!!  getting showered with icing. Oh.. This was just awesome... I'm sure your kids will enjoy it as much as I did .. you are right, you can call me weird...  wait, but this is not all, one of the coolest part is that you get a free sample doughnut!", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 4, "date": "2013-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0XLmZEBb8dF1oF14RZEhmw", "review_id": "PDgOj_pDxQPkZNAMlNK5Hg", "text": "Dam Hot Now Light!  I swear there is a Krispy Kreme low jack device in my truck!!  Everytime that light is glowing there goes my truck!  I fight it but no use.  Customer Service is hit or miss.  Mostly a hit.", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 4, "date": "2014-02-06", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "7_XwjOebd1temr3CaqGwpg", "review_id": "zN2IVuBFI_N6OqjDZavtKQ", "text": "K Kreme really has a nice layout. You get to bring your kids and show them how doughnuts are made. Little ones get to savor the taste of a hot, sweet treat!!! \n\nI mean, I also have to say that this location has some of the sweetest, nicest staff around. You'd have to come see for yourself to know what I mean! \n\nAs for taste, I'm not a big fan of KK. It's sooooo sweet. I'm not too sure it really goes with coffee. Tea, maybe, but not coffee! One single bite is a sugar high and I really have to down a lot of water because its just overly sweet. So taste is so-so. I'd pass on KK because there are better doughnuts nearby, trust me. Especially if you loooooveeee coffee!!!!! \n\nSo if your teeth are made for chomping on sugar, go for it! But these doughnuts are so sweet, I can only handle original with a bottle of water!", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 3, "date": "2014-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "YeZEDhbgq3WGExJQ3L-iSw", "review_id": "ir1mTFgYKSKom2rxnN_leA", "text": "Love their donuts but the customer service seems to be lacking. I rarely feel welcome in this place and feel as if I am interrupting them in some way by making a purchase.", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 3, "date": "2014-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "D7Rcn62BswzZFCVPbVvatQ", "review_id": "wB5cNu2F2NHFlibN9meVIg", "text": "Friendly staff and great hot doughnuts. Crullers were not as fresh as they could have been, hence only four stars...", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 4, "date": "2015-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "p3Bodrv_cqLpH04OqPxoew", "review_id": "25NVrSqsuFieFXiG7DLxIQ", "text": "I've been here 3 times now. order is never messed up and doughnuts are quality. Just wish I didn't get so much attitude from the girls on drive through. They get so frustrated  so quickly and do not attempt to hide it. After being in the customer service industry for a couple years now I find it strange that you could get mad over something so simple and disregard the fact that your making your customers uncomfortable. I didn't start an argument but just took the aggressive comments as they came and got the heck out of there.  I won't come back if this happens again. I thought it was hard to get into this company because the application process is so long, but they must hire anyone.", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 2, "date": "2015-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "WznjWvfOr6cBf-y7dyXnnQ", "review_id": "QiZCEEUAXyUTLNE-y6xZ-A", "text": "This is by far the worst customer service EVER. I will never return to the store. I went the first time and was helped by Stephanie, when I asked for 2 seperate boxes it was nothing but attitude, like I just asked her to do the impossible. Then when I wrote to corporate, a guy named Ken responded and was very nice. He claimed to be the owner of this location and said that for the inconvenience he would put my name down for a free dozen donuts. When I went to claim that donuts, Erick (the manager) again gave me nothing but attitude and said he didn't know who the owner was and that my name wasn't in the book. I will NEVER return to this store, not even for free donuts.", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 1, "date": "2015-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "bmaFnnAxLo7ePibCMmU_WA", "review_id": "3v7GiKxguQw5V2k5NM0hdg", "text": "This Krispy Kreme is so dirty. I took my little sister to the restroom and cockroach came out of now where. When I confronted them about it, they told they came from outside but the WHOLE store was filthy. All the tables were dirty and so was the floor. I wish I could give them NO STARS. The staff wasn't very friendly either. I will not be returning to this establishment ever again.", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 1, "date": "2015-02-01", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 4}, "user_id": "JQKcyWiXK8F36zRGdBvdXA", "review_id": "yEswuE4jQEiydXC5VpDN5Q", "text": "We went through the drive thru at 6:08 am to get some donuts to take home to Reno with us.  When I go to Krispy Kreme's I only get one thing, the original glazed donut.  We ordered 2 dozen and 2 to eat right then.  The boxes of donuts were warm they were so fresh - seriously does it get any better than that - sure does not!  I took a bite out of my donut and it literally melted in my mouth.  Pure, sweet, sugar heaven!!", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 5, "date": "2015-02-02", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 5}, "user_id": "-DgPgVWE-pzo2i5mujSBhA", "review_id": "2WdP7owMeKjmkOGqaxAdQg", "text": "February 1, 2015 Sunday - 6:08 AM snack\n2 adults\n\nAtmosphere - N/A stars\nFood -5 stars\nService - 5 stars\n\nBackground - Heading on our way home from a great weekend for the Super Bowl.  We are bringing the Krispy Kreme doughnuts as Reno does not have them.\n\nAtmosphere - Drive thru so nothing really to judge for the atmosphere.\n\nFood\n  Drink - Order a large mocha latte.  I have a long drive back to Reno.  It was not over hot like must places do.  I was able to drink the coffee right away.  Thank you as it is really early.\n\n  Snack - Two classic glazed donuts plus two more.  The two extras was divided between us, one for me and the other for my wife.  That is all I need, one sugar glazed perfection.  They just opened at 6 am and they were piping hot.  I probably over use this expression but they literally melted in your mouth.\n\nService - In and out that is what you want from the drive and they delivered.\n\nFuture - Yes, because my wife loves the place.", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 5, "date": "2015-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f5ZT_BofOeSym6DIkkZPjA", "review_id": "NQbSWnKzKpeDoPxUsyBlFQ", "text": "The donuts we received were cold even though the \"HOT\" light was on. I asked why the donuts were cold if the hot light was in. He replied, we usually leave the light on. I was amazed because everybody knows what the hot light means. After several more attempts to get hot donuts when the light is on, we gave up. Save your gas and go to another location. Oh yeah, did I mention poor service. On one visit, the counter person said \"I'll be right back\" and started helping load their truck. I had to honk several times. Then someone else came to the window 5 minutes later and apologized. \nThanks Krispy Kreme.", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 1, "date": "2015-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mM_CHwfDMj8SAD99VhmGuA", "review_id": "u_9tZ_7w0yW7YDkDPkooQw", "text": "Best donuts in town & the Solares family and crew are awesome. Worth standing in line for!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2012-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "h76Rcr8V2eBAgh10X5jBxA", "review_id": "E_k75FQ2TM1gfRI6hgPxVw", "text": "I love, love , love donuts!! Just call me Homer! \nCake donut with chocolate frosting is my favorite! As I walked into the store there is the best smell ever, that fresh baked donut smell! The place was very clean and the donuts were displayed nice. I had a chat with the guy behind the counter asking him questions for a catering company I do some work for.  He answered every question I had about his donuts. Then the moment of truth, select a donut, well of course I went for my favorite. he bagged it and out to the car I went. This donut was so fresh and soft, the recipe for the cake portion was just the way i like it, made with vanilla, not lemon or spice, vanilla just the way it was intended to be. I am thinking this place gets my vote for the best donut in Vegas! If you in that area of town stop by!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2012-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6dhx-yQmS5u3W4OmaByhyw", "review_id": "V46FNdeLiF4VNMj8vCxvYQ", "text": "My favorite donut shops in Las Vegas. Cant go wrong with Real Donuts. They have the best ice cream!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2012-02-20", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 1}, "user_id": "pfrGhASSk9MW1KogIZMqrQ", "review_id": "r1gWfSFwUCug3VDWbMLP3A", "text": "Sitting at my desk, I overheard one co-worker trying to convince another to eat some of the donuts. Knowing that customers, vendors and co-workers drop off dozens of donuts from the huge chain, manufactured donut companies often, I was anxious for some sugar spiking in my blood.\n\nWalking to their desks I was shaken to my core (which happened to be a ravenously angry and empty stomach) - when he was merely offering up mini donuts from the vending machine.\n\nThis simply would not do. Do you hear me? It. Would. Not. Do.\n\nI explained my desire for fresh donuts, not that packaged trash. They asked if I wanted to make a donut run. I said yes! They started asking for me to go to one of the chain places, I said Nay! If I was making a donut run, I was getting Real Donuts. \n\nOf course, they started naming off a different chain every time I would say, \"No, real Donuts.\" Finally, I had to explain that was the name of the place that was going to satisfy my sugar craving.\n\nFinding their location, I walked in to a pretty busy donut shop. Good sign! \n\nWhen it got to my turn, the helpful girl behind the counter started grabbing everything I needed. When i got to the ham & cheese croissant part of the order, she gave me the option of hot or cold. Figure if we're going to go for it, go the whole 9 and went hot. \n\nReturning to work, I handed out everybody their treat and sat down at my desk to dive into mine.\n\nThe raised cake donut was about 2x the thickness of one of those \"other\" places' donuts. I took a bite and my taste buds nearly fainted at the flavor. It was an instant throw back to jr. high and getting donuts after school at a local bakery, only better! I finished the donut and tackled the holes I picked up. \n\nBite sized doses of glazed sugary goodness were devoured in mere seconds.\n\nThis is definitely a place I will be returning to, as often as my pancreas can handle.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2012-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "YCW92r_ubnb2KpY23VSxIA", "review_id": "Sjp5KqKVnIrjSceLjWE5eA", "text": "The love they put into their donuts shines through.  I have had the best Apple Fritter ever here.  They don't skimp on size or flavor.  The Jelly Donuts are oozing with Jelly from the top of the donut.  We get them for our office bi-weekly making my tastebuds happy but killing my diet.  This is what donuts are meant to be.  Keep up the great work!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2012-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kPn2nq3iudiSvOFmQj-dIg", "review_id": "9Jmjexdm-B0jOvmGn_eGkw", "text": "i normally wouldn't waste my time reviewing a donut shop but real donut has the best donuts in vegas by a long, long way.  well worth a drive across town.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 4, "date": "2013-01-11", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "7tmH3hQ7rQVQ-tTzyP5byQ", "review_id": "OLlDMHrPJxs2C9XhxU39tA", "text": "Clean and simple, close to UMC.  A friendly place to get good donuts. Other donut shops their donuts are super super sweet. You get tired after two bites. But this place \" Perfect\" love at first bite.  I only got half a dozen because I was afraid that my family wouldn't be able to finish them all.  I was surprised to come home to find them all gobbled up . To sum it up, this will be the place for me to get fresh donuts.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 4, "date": "2013-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "u-A3B1hwjVz6pd6wsTTFeA", "review_id": "-4oz5Kp7fLqu_JmQWuHCsQ", "text": "I've been going to this place with my friends before school and we absolutely love it! It's a small, family owned business that's a little far away from my school, but the donuts are high quality and for good prices. My friends always get the donut holes, which are really cheap. I also really like their giant donuts and their croissants!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2013-12-05", "type": "review"}
{"votes": {"funny": 1, "useful": 6, "cool": 2}, "user_id": "5lq4LkrviYgQ4LJNsBYHcA", "review_id": "LsHlj7aSsgzE3bCMbojt1Q", "text": "Items selected:  Bavarian, Blueberry Cake, Blueberry Fritter, Sourcream, Buttermilk Bar, Raised Glazed, Reverse Cinnamon Roll, Chocolate Cake, Crumb Cake, Apple Fritter\n\nHaving arranged various \"foodcrawls\" in the past it was with admitted enthusiasm that I entered Real Donuts to gather provisions for Las Vegas' first (known) donut crawl and with several glistening varieties fresh from the fryer only two challenges arose, the first limiting my order to a dozen and the second delivering the fried dough to the party without sneaking a bite.  A small, clean shop with excellent service and a dozen donuts only $10 after tax and a tip it was up against three other doughnutteries that Real would find itself matched and although the occasional contender from Sunrise Too, Master Donuts, or Donut Hut shined it was Real Donuts that proved most consistent across the board.  Featuring crispy fritters rife with fruit and low in oil, a textbook old-fashioned sourcream that literally melts on the tongue, and both yeasted and cake options on par with the city's best it would truly be hard to name a bad one in the bunch - a task I'll simply discard and suggest futile as I think back on the Blueberry Fritter, a 95 cent daily special I'd suggest worthy of 'destination' status.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 4, "date": "2014-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ROeny8Ej5mOKJ-Q8qA7y0Q", "review_id": "m13wPpT8UqScj6lk6Xjojg", "text": "Working across the street from this jewel of a donut shop is a plus. Whenever I get the craving for a tasty chocolate cake donut, I know Real Donuts will always deliver. I have tried other donut shops, including the more commercial shops but I find myself always comparing their donuts to the ones I get at this little shop. No one beats them! Friendly staff, great service and good prices. Once you try them once, you will become a repeat customer guaranteed!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 4, "date": "2014-02-05", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "hCJy_SaAW1BPy_YkL747WQ", "review_id": "__bC7-3qjKsiToSpOTkE9Q", "text": "I came in right at opening time on Saturday morning. The donuts looked fresh and so beautifully unreal. I had a maple old fashioned and it was PERFECT. Some O/F donuts are too dry, or too moist almost tasting uncooked. Real Donuts gets it JUST RIGHT! I bought 3dozen assorted for my co-workers and will turn. These donuts are delicious and priced well.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2014-02-09", "type": "review"}
