{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ZnOdDbndR0b5p6eF-014vA", "review_id": "Myjf_P8ykHpLDiqHF3UZoA", "text": "Being a Korean-BBQ lover and snob..I needed to get my Bulgogi/gal-bi fix when I was in Pittsburgh.  My search led me to Sushi-Kim.\n\nOh how I wish it led me astray.  This was probably one of the worst tasting Korean Barbecue places I have ever been to.  The beef was not the right color and was basically bland.  The beef short-ribs were tasty but was way too tough.  I felt like I had to chew each piece 100x or I was going to choke and die.  \n\nI was not a fan of the food at all and would not recommend it to anyone.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 2, "date": "2009-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "C22iEggVVzqT8_3-NMNUqQ", "review_id": "xikNOkvdurB-0reHqlCwrA", "text": "I've been coming here ever since it opened years ago. I'm a big fan of their food, especially their sushi. Since we know the owners (and sushi chef) our sushi comes out to my liking, not a lot of wasabi in the sushi. The service is always prompt and friendly. Only problem is the street parking. \n\nFOOD: We always order the hae mul pa jun (seafood pancake) for starters. I really like this dish since it's full of seafood and chewy in texture. Then I always get the sushi 12 pc. combo, which is an array of salmon, tuna, yellow tail, clam, shrimp, and octopus. I love their sushi rice which is a bit sweet. I usually order their bi bim bap (mixed vegetables with rice) which is always good. I also got their dae goo mah one tang (spicy fish soup) which was full of fish and tofu. The broth was very tasty and not too spicy.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 4, "date": "2009-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pzhiDEp8EFltFmdldP9Oow", "review_id": "-V-74R-v4cvi7NeReLEj5w", "text": "This place was okay.  It wasn't great, but it wasn't awful.  It's someplace that I'd go to again.\n\nEvery July, I find myself in Pittsburgh, and this is one of my favorites there.  The grill is a little weird and their idea of AYCE sushi and Korean BBQ is different from most that I've experienced.\n\nThe sushi itself was not really all that good in my opinion.  I mostly stuck to the Korean BBQ and that was fairly good.  The sauces were fairly flavorful.  The meat selection, while not huge, was adequate.  The two story setup was pretty neat and it was easy enough to find on the street based on the directions that the convention (AC) gave us.\n\nI'd definitely go here again, but I wouldn't go out of my way to do so.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 3, "date": "2010-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y4CkQloA5O27uhhrCJaEAA", "review_id": "1RrVz86lbiW7JaF8qq-jEg", "text": "Yelp didn't exist when I used to go here, back in the CMU days, but it is still my favorite Soon Du Bu (Tofu Stew) place - we just LOVED it.  We never ate sushi here, always the korean food.  The hae mul pah jun is yummy, the dol sol bibimbap is good, but the soon du bu jige is the best.  It's run by Koreans, hello!  \n\nWe were lucky to have this place in Pittsburgh - it's not like there was a lot to choose from.  But even now, I rarely encounter a place (in the Bay Area) that has the same quality of tofu stew - and we have a \"k-town\" here!", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 5, "date": "2010-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WcDdWdsxmOYPxtbRRr1IaA", "review_id": "DK42UEg5jptcpVWRhTgJyQ", "text": "A few friends from out of town wanted to meet at Sushi Kim for dinner, so I agreed. The sushi selections seemed to satisfy their tastes, while their kids liked the miso soup, and edamame beans (which were replenished when asked). \n\nI'm not a fan of Japanese food, so I stuck with the Korean selections, after all I was in a Korean restaurant! I had Mandu Guk, which was a good size bowl of meat filled dumplings, and broth. My daughter had the pork bulgogi which she liked, but we've had better. The pork was really greasy, and not cooked on a fire grill, no char marks, equals less than tasty meat. \n\nSushi Kim alternates between a hit, or a miss. Sometimes you get a few different panchan, (side dishes of pickled or marinated vegetables), and sometimes you only get kimchi, wth? If you judge a place by it's patrons, I've seen few Koreans eat here, so that sums up the authenticity factor. Nice big restaurant, just lacking in overall experience.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 2, "date": "2010-12-10", "type": "review"}
{"votes": {"funny": 3, "useful": 10, "cool": 1}, "user_id": "nEYPahVwXGD2Pjvgkm7QqQ", "review_id": "86pTDVRbqiGF0P-5itgdYQ", "text": "Ew! Ew! Gross! I know that's not the most mature thing to say, but that's what comes to mind when I think about this place! Sad thing is, I've been here a couple times. Every time I kept thinking it would somehow get better, but no, it doesn't! The Miso soup they serve has this weird after taste, and to be honest, doesn't taste like any Miso soup I've EVER had! So on to the sushi, oh yeah, it's gross too! I think I kept going back because the size of the rolls are humongous. The thing is the fish does NOT taste fresh at all! It's always luke warm and....just.not.good. Oh well, I tried. But I'd suggest you not!", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 1, "date": "2011-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_CtkjL-e6O_lMShkN6HuSA", "review_id": "rhXOhgkDpyYTCLbZJ-jCfA", "text": "Seriously over priced, however it was the one of the only Sushi option downtown before Penn Aveune Fish Company opened.  The service general tend to slow.  The Korean food was fairly good, not as good as Korean Garden. But I did hear they have all you can eat Korean BBQ for $20, which is way more expensive than the ones in LA.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 3, "date": "2011-01-11", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "DNOtTEpNbc7LNN10cfb3Mg", "review_id": "V5hEa1Bf2vUYc6ngbrdUAw", "text": "You can not pay me money to eat here again. They cannot even cook edamame, it was undercooked and cold. I had to stop eating their sushi in fear I would be sick for work in the morning. Texture and temperature of the fish scared me. Save yourself pain and throw your money out the window. Only plus side was their friendliness in service.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 2, "date": "2011-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "c1V89fetqGBnDncx6TiQ8Q", "review_id": "HguAW2nfc3WUYKI-lar2lw", "text": "Sushi Kim Restaurant was awesome the food and service were top notch. If you are in Pittsburgh and are looking for great food stop here.  A++++. Try the Korean Short Ribs.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 5, "date": "2011-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XUXMBPMvlzjcCdzTaOmtjg", "review_id": "BRVxqeDjalvfmuxw3vGl4w", "text": "I just went for lunch earlier in the day and HAD to write a review as soon as I got back!\n\nFor starters, this review is only for their sushi, I didn't have any of the Korean food.\n\nIt was super cute in there and the waiters were reserved, but nice. At first I thought that it was a little expensive for the Pittsburgh area, but after I got my rolls, I thought otherwise! It's a realllllyyyy good deal because my sushi pieces were humongous! I got the most fish I have EVER had on a maki roll! While there were 8 pieces per roll, the sizes were so big that at any other place, there would have been at least 12 pieces per roll. The only complaint I'd have is that a few of the pieces fell apart bc they were not rolled tightly enough\n\nIn addition to the awesome portion size, they also brought us (my bf and I) two bowls of free miso soup AND free edamame!\n\nLet's just say that I am super impressed :)", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 4, "date": "2011-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oAZK6L7jm0-HR7EbwVfrog", "review_id": "ZNT79HcqCDk-JxFwKKphmA", "text": "I met a friend here for lunch last Sunday because we wanted sushi and thought it was the only sushi place open in the Strip. Also, we wanted a nice place to sit and talk and this fit the bill. We only had maki rolls, which came with miso soup, and we ordered seaweed salad. The salad was fabulous and the soup was good. The rolls were disappointing, however; while the amount of fish was good, as noted by another reviewer, we both thought that the taste was bland and there were very few veggies in the rolls. As we strolled in the Strip later, we realized that Andy's Sushi at Wholey's was open on Sunday and, based on past experience, I think we would have been much more satisifed with the food there.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 3, "date": "2012-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7SFQK7OhxRqGcd1gLjJmqw", "review_id": "EBxTUzvGTWkz7OWH7yf7gw", "text": "Meh. I would say Korea Garden in Oakland is way better...\n\nI got the spicy tofu pot and although it was spicy- that was all that I could taste! \n\nThe spices were very overwhelming and I couldn't really enjoy the flavors of any of the ingredients inside! \n\nI would rather take the trip to Korea Garden down near Atwood street.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 3, "date": "2012-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cFlvXQs0IRYpU9Kg_v6clQ", "review_id": "GJ2AzwzN8WFKf0dCNPwmdg", "text": "I was surprised to see the volume of avg. to poor reviews here.  I don't write many reviews, but I'm a fan of Sushi Kim and think this place deserves more stars.  It's tough to find good sushi in the Pittsburgh area, and I'm not going to pretend it's the best sushi I've ever had.  However, relative to the quality, portions, and prices of other sushi options in Pgh I think Sushi Kim is among the best.  The service is always excellent and quick.  I'm always surprised (and a bit sad) the place isn't more crowded.  On the bright side though there's never a wait for a table or your meal.  The portions are large and the prices are fair.  My \"go tos\" are the spicy tuna and spicy spider rolls.  My girlfriend and I have been here several times and never been dissapointed.  Highly recommend.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 4, "date": "2012-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "P6L9SkAQ830Xzgn3YDFysw", "review_id": "t49A-eRdd-q0PMlmcvo09w", "text": "I have been going to Sushi Kim for about 15 years. While some of the more harder to find items are not on the menu (abalone, anago, otoro), I have never been disappointed with the food or service there. Really good Korean food and very fresh sushi. Like I said, I have been going for 15 years and Mr and Mrs Kim never disappoint us.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 5, "date": "2012-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-DwdZHEdm7AGauwF5f3LHw", "review_id": "FnL_ze93B-Uf5DqHegiEng", "text": "Overall, this was pretty good Korean style cuisine, and the sushi was fresh, well prepared and reasonably priced.  If we had been in town longer, the Good Doctor and I would have checked out the weekend Korean BBQ bar upstairs. We perused, and it looked pretty good - sort of a Mongolian Beef BBC concept, except Korean style. \n\nThe first night of our conference at the nearby convention center, we were surprised it wasn't more crowded, considering the close proximity. However, by the second day of our conference, our colleagues had caught on and filled up the restaurant.\n\nWe heartily recommend - there's not much else in that neighborhood, and Sushi Kim is filling the gap nicely.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 3, "date": "2012-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kHvcYjMjfNRHVcYIZFTzmw", "review_id": "9pAAALDPnu40VVUPaL5itg", "text": "I'm visiting Pittsburgh and I found this place online with several good reviews. It's a small family owned restaurant and had a very friendly staff. I found that there was a small number of specialty rolls that have a variety of ingredients and sauces, which commonly are much larger rolls. These tend to be my favorite, so I was disappointed. The rolls that were more simple had large pieces of fish and were quite delicious. Overall a great place for sushi.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 4, "date": "2013-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "we8uhGH722QC07wrXNHp0g", "review_id": "ZaWVsxr9XhlEYyUbLSQn0Q", "text": "For sushi, seaweed salad and beef bulgogi this place this place is five stars!!  Some of the best sushi in the Burgh.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 5, "date": "2013-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "RNnGR5tt8TrsI92X5hNtZA", "review_id": "YgdS-eBWOeA_dvRC8Vld6w", "text": "Pittsburgh is not known for its Asian cuisine, but Sushi Kim's might just be the most popular Korean restaurant in the city.  I've been here just a couple times.  The venue is by no means impressive.  The decor is very dated and dark.  Whatever you do, do not drink the water.  My friend claims that it made him sick to his stomach.  Pittsburgh is not well known for its tap water.  I'm going to take a water bottle with me the next time I go.\n\nThe first time, I went a friend and I had the kalbi and the mandu.  It was palpable, but nothing special.  I've heard that the kalbi is one of the better things on the meal, but I personally don't like eating with my hands.\n\nThe second time, another friend of mine introduced me to soondubu.  I got the vegetable only soondubu, while my friend got the regular soondubu.  Soondubu is a spicy tofu based soup.  Traditionally, it is served with vegetables and shellfish.  My friend was kinda disappointed with the regular, because it only had shrimp. For me, the vegetable soondubu hit the spot!  On a cold winter's day, this spicy soup was absolutely perfect!  Craving to go back again!\n\nI've heard the BBQ dinner is very good!", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 3, "date": "2013-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "P0vjhhjqes_KG7xQ4xU1DQ", "review_id": "CrZoqI91Tom-klfQk1RQYg", "text": "One of my favorites in the Burgh for almost 20 years.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 4, "date": "2013-12-12", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "NCd7JMAVS1qf1dEXKsrbaQ", "review_id": "EspFOp6ItxzEaas70RQJTw", "text": "I don't give 2 stars that often but sorry Kim - you were a bitter disappointment. \n\nI was excited to have found a Sushi place in Pittsburgh in walking distance to my apartment. That excitement didn't last for too long when I entered the place on a Monday evening at 7pm, realizing that I was the only one in a rather spacious restaurant.\n\nFine, I had a Sushi craving and couldn't care less. Until the Sushi arrived. I ordered my Spicy Tuna and Salmon rolls, both came within 2 minutes. Strange? Maybe, or just a super fast chef. Sadly, the rolls were falling apart as soon as I looked at them, and the Salmon even tasted... bad. I had to leave it on the plate, which has never happened to me before.\n\nOn the plus side, the miso soup was okay and the service was very attentive, which is not surprising if you're the only one in that place. As there are not too many Korean options in Pittsburgh I encourage you to try the Korean BBQ, especially as the reviews for the Korean food at Kim's on Yelp are not that bad. But for the Sushi - forget it.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 2, "date": "2013-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gktZ0Xf-5JcglgeGbSKkAg", "review_id": "oReiwaOtj7SAvx6xI2F0QA", "text": "Second time I try coming here for Korean BBQ. Apparently it's only offered during weekends after 4:30.\n\nWhen we arrived it was pretty empty for wed night.\n\nVery overpriced. I got a bim bap that was very bland and has to add tons of soy sauce.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 3, "date": "2014-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GMtILOfAHXUMrfMgLPG0gg", "review_id": "sRKYeHMNonxqNGy45eUk-g", "text": "I didn't have the awful experience some had here based on prior reviews, but it was definitely mediocre.  I went on a Wednesday evening and the place was totally dead except maybe one couple sitting by the sushi bar part of the time I was there.  Which is sad because they have such a huge space with 2 levels, lots of seating, and great proximity to both the Strip and downtown.  A lot more could be done with this place.  \n\nThe menu was printed in very poor quality with what could have been nice pictures of food options but they were super fuzzy and hard to see.  It seemed like their Korean menu was pretty varied but I had come for the sushi.  I ordered the Kim's Favorite Roll which was described as \"Tuna, Yellowtail, Broiled Eel, and Salmon\"  but what I wasn't expecting was the salmon to be cooked all the way through.  Maybe I  should have read it as \"broiled eel and salmon\" but that wasn't clear or typical of this sort of roll.  Normally eel is cooked but the other fish are raw unless specified otherwise.  Maybe you'd have a fried roll or something baked or seared on the top, but to cook one type of fish that is normally raw and mix it inside with 2 raw types just seems strange to me.  So it ended up being a really odd combination with the raw tuna and yellowtail next to the cooked sushi which wasn't so great all squished together inside the roll.  The sushi roll was quite large at 16 pieces, but I still felt that 18.95 was really pricey considering the quality of the fish was only mediocre with small portions, and they used a TON of rice. The quality of the fish was again just ok.  Not super fresh but not bad either.  The rolls (and those of my friends) kept falling apart as we tried to eat them.  It seemed they weren't properly wrapped or maybe it was just that they tried to use way too much rice.  One fun thing was that all the rolls came out on little boats, so that was a nice touch.  The roll also came with a miso soup, which was fine but nothing special.  The miso soup didn't have the awful taste some others here reported but it tasted like what I'd make from a powered package rather than made fresh.  I also got the shrimp shumai which were again just ok, and tasted like what I could get from the freezer section of an asian store and microwave myself rather than made fresh.  \n\nOne person at our table got a Korean dish which came with 4 side dishes that were all vegetable except for the fish cakes.  She said her food tasted decent but the beef bul go gi dish she got just didn't look right or have the proper color it should have had.  Just liked kind of dry and plain.  When I went to the restroom I was disturbed to see trays of the Korean side dishes in the hallway just sitting out in the open not covered or anything!  It would be different if the restaurant were bustling but it was totally dead and pretty clear those wouldn't be eaten that evening (so I shudder to think that after hours sitting out uncovered unrefrigerated that they put them out again the next day and hoped someone would eat them...).  If you aren't that busy there is no reason things can't be prepared to order!  That is simply lazy.  Also I overheard part of a conversation between a waiter and a guy at the sushi bar about something being \"expired\" and what to do about that.  Unfortunately I couldn't hear all the details but it was disturbing since this was after we all had gotten our food already.  I mean it's good they are being mindful of expiration dates but it sounded like someone had to be schooled on it based on what I heard.  But granted that I only heard bits and pieces so I can't say for sure.  I don't think I'll go back here again.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 2, "date": "2014-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KFRC_GdFH-bXb6brxd7WvQ", "review_id": "zk8IFZDyneJwlbtHHBN6Hw", "text": "One of the better Korean places in Pittsburgh. The service wasn't good at all, but the food was!", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 4, "date": "2015-01-05", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 0}, "user_id": "pwyRJuJoodUS__gsQMGlMw", "review_id": "M1T-RtKF5HA3ETVNSVfH4g", "text": "\"A-ri-rang\" is the most popular and best-known Korean folk song. A-ri-rang is an ancient native Korean word with no modern meaning. 'Ari' means \"beautiful\"; 'Rang' can mean \"dear\".\n\nThe food here is good, but there is nothing beautiful about the joint and the proprietor is anything but dear.\n\nI have been coming here for years and he has never smiled or said \"thank you\".  Today I ordered bi bim bap and instead of coming in a hot stone bowl as usual, it came in a cold plastic bowl.  At the very least, I wish he would have asked me to clarify my order.\n\nThere are communal tables in the center of the place, which I like but they are merely worn out old folding conference tables.\n\nHe always has the TV blaring on Headline News.\n\nBut the food is good, maybe the best Korean on campus.  This is no small feat in a university town hosting 3500 native Koreans.\n\nSo I added a star for good authentic Korean food, patronized by mostly Korean clientele, but subtracted a star for a surly owner and subtracted another star for crappy interior furnishings.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 3, "date": "2009-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1cbGEJaOoGAwAuFun3PgAw", "review_id": "2vwUzZDEq2TmKW8e3N8DEQ", "text": "When I'm on campus, this is where I like to eat.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 3, "date": "2010-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "awhHgCohqE2hIBqhhApojw", "review_id": "rFC3Mxc7yjl7i04YdCp6Ug", "text": "If you want Korean soup or fried rice, go here.  Best on campus.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 4, "date": "2010-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3niPWX3QKeGWwDVRlSLtwg", "review_id": "oAq8bviMYKz5Kk9LAW0i3w", "text": "Very good soup and fish dishes.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 4, "date": "2012-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cjzWc1WsLKbpeEJ9WSpJlw", "review_id": "nUTSvD6OG-IhYU3kCjNxBw", "text": "I give it 5 stars because of what I get for the price. Every dish here is under $10 before tax and they come with a generous portion too. Every dish comes with at least 2 side dishes of kimchi..\n\nThe quality of the food is as good as it gets for under $10.\n\nTry the Bulgogi dishes and the Budae Jigae. By far best Budae Jigae.\n\nAlso try the Omu Rice. It's their version of omelet fried rice. Fried rice is wrapped in omelet egg.\n\nI'm an easy going customer so the owner being not too friendly is not a big deal to me. In fact, what do you expect at a no-waiter restaurant? You don't have to pay tips already.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 5, "date": "2012-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "vLFk6nslFe35NKvlU2Tz9Q", "review_id": "oEi16kHMBfp4nUm2p2jvbg", "text": "Cheap and hits the spot . I think it's one of the most affordable Korean restaurants on campus. For a college kid, it's a huge win.\n\nA-ri-rang offers most of the staple Korean items on their menus, from the broth-based dishes to the bibimbap to the bulgolgi meals. I think the omu rice here is pretty clutch too.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 3, "date": "2012-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6v-kCPWdLLUDnv0dVs6k7Q", "review_id": "cLA4oNWj2-WD6siVWzkWHQ", "text": "It depends what dish you ordered. I personally recommend soup#18 budae-jigae. And the fried fish is also good. But it just takes a long time for your order if you dine in at the peak time.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 4, "date": "2013-01-05", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "kOyW4HTOFNX1NqIA-eyKyA", "review_id": "0ed7BEFFhVHtfLpEEV6o1Q", "text": "OMG OMG OMG Korean BBQ!\n\nThis is the first place I ever tried any sort of Korean BBQ and it's by far my favorite.  I think based on the fact that everyone else in the restaurant except for my wife and son were speaking Korean that this is a pretty authentic place.\n\nOh, and the menu is mostly in Korean too, and even the parts that are English don't really make much sense and some of the descriptions are horrifying to my uneducated ignorant eyes (you'll know when you see them).  Fortunately there's lots of pictures and I picked the simple Chicken BBQ plate and whooo boy it's super awesome fantastic.\n\nThe serving staff all speak English and are really helpful in telling you what is what, but all you need to know is to order BBQ Chicken, Pork or Beef and you'll be happy.  \n\nAfter ordering the server will bring over 8 or 9 little dishes each filled with some sort of Korean appetizer.  There's lots of Kim Chi which I'm told is excellent, but I'm a coward.  The potatoes, though were excellent as were several other things that I tried.  If you finish any of the little bowls you can ask for more at no charge.  \n\nWhen the meal comes out you're in a for a great treat!  Each plate comes out sizzling like when you get fajitas.  They're piled high (really high) with your choice of seasoned meat and onions.  And they also give you a big bowl of rice.  \n\nEach bite is heaven.  Oh man, just thinking about it right now just before lunch is driving me insane.  I think I'm going to have to drag Lindsay down there tomorrow night.\n\nWe love bringing our friends here.\n\nHodori is tucked away in a strip mall full of other Asian stores and restaurants.  Its decor is blah, but the staff is nice.  If you're not Korean, don't be surprised if you're the only non-Korean there.\n\nI can't wait to go back.  I must go back.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2008-01-17", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "IE_nJq65Qpso5fN4tG9zjQ", "review_id": "d1UikLsNJ5wDk89EUQnWlA", "text": "The food here is a tad pricey, but I forget that most Korean places will bring out their array of side dishes (kimchi, potatoes, anchovy, seaweed?, etc.) Other than that, I'm used to my BBQ having more of a BBQ flavor. Yes, that charred, I'm going to give you cancer eventually carcinogen flavor - don't act like you don't know what I'm talking about! The flavor was still really good but not exactly 5 star quality. , \n\nPluses are that they refilled side dishes! I've never been to any other Korean place that offered. They also refill your drinks, abd the kimchi doesn't make your mouth feel like its going to burn off.  =) All in all, its a very nicely decorated mom and pop run place that makes really quality food.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2008-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_H7YQYiXToV0paIoOeFNng", "review_id": "oIqExfx1ROpIi2H-VarrBw", "text": "For starters:I am an american that grew up in a very korean dense population. My best highs chool girl riend's family ran the best Korean restuarant in town so i am a bit spoiled.  That being said, I hadn't had any korean food in about 5 years, I started having cravings that wouldn't go away. Bulgogi and kimchee are my favorites. I suggested Korean food for a date one night.\n\nAtmosphere: Was fine,very casual nothing to write home about american family resturant style. I had REALLY hoped for table top cooking because I think it is just more fun that way. makes things more festive. I also like a bit more traditional korean decor.\n\nService: I had a Teenage Korean American girl who spoke perfect english and was polite but not very attentive. She looked like she hated her after school job.\n\nFood: It was good but not great. We both ordered Bulgogi Which came in HUGE piles on sizzling plates witha layer of White onion underneath.the flavor was good but it was bit dry. The Side dishes were excllentt, I loved the Kimchee(the white radish and cabbage),potatoes and the sprout salad. Yummy.\n\nWine: First time I had korean wine at all. We chose the rice wine that came in a wooden bown. We both loved this. My date is Indian and they have a regional drink that is identical he was so excited when he realized. It was sweet mild and I really liked it\n\nOverall, I liked the place and would definitely go back.\nWe are trying a new Korean Place tonight so I am interested to see how they match up.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2008-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wsf6MhOr2x7dlJx5lAavOg", "review_id": "uT7YqJ1pmuaTkivYcgbzzA", "text": "I was craving tofu soup one night so I checked this place out based on all the positive reviews.  The tofu was soft and flavorful.  Several other tables ordered their BBQ meats, which also looked/smelled good.  The side dishes were OK but not as many options as other Korean restaurants I have been to.  They have the basics - kimchee, cucumber, radish, sprouts.  Overall, the food was better than I expected for a place in Phoenix.\n\nNow to the bad: the service was absolutely atrocious, if you can call that service at all.  It is a sign of bad service when every table in the restaurant is looking around for someone to help them.  We waited 15 minutes for someone to acknowledge us and take our order.  Another 40 minutes for the food.  The side dishes come with the entrees so don't count on them when you are starving.  The tofu came without rice, which took another 10 minutes.  All this time, you have to flag the waiters multiple times if you want a refill of water or anything else.  Even when they make eye contact, they ignore you.  People actually left their tables to go to the service area and help themselves!  There were no apologies from the waiters for the wait.  They did not even smile.  The very worst part of the meal was paying.  Naturally, we were not able to get our checks at the table, so we lined up at the cashiers table behind another group.  (Keep in mind there is no cashier so we had to wait for a waiter to decide we were worth his time of day.)  When it came our turn to pay, the waiter blew right past us without help us!  Luckily, another waiter finally saw us and got us our check.  I wish we could have given him all the tip.\n\nThis may be the only Korean place in Phoenix, but I will hold out for when I go to LA.  Even if they have unfriendly service, at least they are efficient.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 1, "date": "2009-01-06", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 0}, "user_id": "8EefXq-OSIKSqzyrpDNJMw", "review_id": "B7LBaqZewrZvUgN-S-rqjw", "text": "I would've gone for just under four stars, given the option, because the food was pretty good at best and the service was polite, but slow. I went there on Wednesday, 1/7/09, around 7 p.m., with my BF for his first eat-out Korean dinner. It's in the northwest corner of Dobson and Southern, just north of the gas station, in the same shopping center as Oregano's and Saketini. \n\nMostly, I wanted to try to find tofu soup--crazy-soft tofu pieces in flavorful spicy broth with whatever add-ins you want, from seafood to beef to mushroom to kimchi. YOM. You could smell the spice and sizzle (much of their dishes are served on hot plates, and meat always gives off a certain smell when charred up deliciously like that). Decorations were sparse and the lighting was almost a little too bright, like cafeteria-bright, with the tables and chairs set up diner-style, in neat rows. It wasn't packed (one half of the restaurant, I guess an overflow section, was dark until a couple showed up later), but business was steady. There was a big group of athletic-looking Koreans in the middle of the room having a seriously happy chow-down (everything looked good) and several Korean and mixed families and couples.\n\nThe hostess/waitress waved at us from across the restaurant to ask how many seats we'd need, then waved us to a table. After that, it was a bit of a wait before we got menus. They had an interesting selection, and by that I mean appetizing, choices and decent prices, with entrees starting at $9 and capping in the $20s. They also have a decent selection of lunch specials. It was a somewhat agonizingly long time before anyone came to take a drink order. By the time our polite, attentive waitress came, we were ready to put in our entire order, so we put in for drinks (which came quickly), goon mandu (dumplings) for an appetizer, short ribs, and tofu soup with pork and mushrooms.\n\nThe dumplings came without our getting impatient, and they were pretty tasty--slightly crisped wrappers and plenty of filling. Shortly after we finished, we received our banchan (traditional Korean appetizers on several small plates). I doubt I can remember all of them, but it included kimchi, kak tu gi (radish kimchi), gam-ja (braised potato and carrot), k'ong na mul (bean sprout salad), seaweed salad, and one or two other dishes, which was more than enough for both of us. We thought everything tasted just fine. After we'd enjoyed the banchan for about 5-10 minutes, they brought our little bowls of rice, then our little pile of short ribs on a sizzling plate (with a polite warning not to burn our hands off) served over raw, thickly slivered onions, and after a few moments longer, our tofu soup in a little hot clay pot. They also brought a raw egg in case we wanted one cracked in. \n\nThe ribs were good, but just a little tough--they're supposed to be that way, but if you're expecting something the consistency of all-day braised short ribs, these aren't them. I loved the tofu soup--eat it as soup or over rice, which is ten times better. It was AWESOME, but I\"m biased because it's like comfort food to me. Soft, creamy tofu curds in spicy broth (they ask you how spicy you'd like it, if you want it spicy at all), and just enough pork and mushrooms to still keep it tofu soup. It hit the spot.\n\nThe wait staff was pretty good about keeping my BF's glass of diet coke filled, and that was a feat in itself. It kind of took awhile for someone to bring the check, but when they did, they brought a few tasty coffee candies. We considered desserts, but we couldn't find any in the regular menu or on any special menus.\n\nOverall, the service may have been a little slow, but it wasn't for lack of trying--plating and delivering and clearing the banchan plates alone can be a Herculean task. We really enjoyed the food and plan to go back again. Our overall dinner was a bit pricey because of the short ribs, but it would be easy to get away with a $25 dinner for two if you went for a couple tofu soups and a couple of non-alcoholic drinks.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2009-01-09", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "rLtl8ZkDX5vH5nAx9C3q5Q", "review_id": "fsyAT604Sf1iXywG9z1sMw", "text": "My wife and I went here with another couple last night.  All of us are very white and very non-Korean so I was concerned about the service we would receive after reading a few reviews on Yelp.  I was actually pleasantly surprised with the service.  Our waiter was very friendly and fast and answered any questions with a smile.\n\nIt was about 7pm on a Wednesday night and the place wasn't too crowded.  There were probably 15 other people in the place who were all of Asian decent so you know the place is the real deal.  The ambiance is a bit cafeteria-like but it didn't matter because I was there for a new culinary experience as this was my first time eating Korean food.\n\nNow about the food....\n\nAfter they take your drink and food orders, your table is given 6 or 7 small appetizers.  I don't remember what everything was but I do remember the kimchi.  I've never had it before but I know it is a Korean dining staple so I gave it a shot.  I was not a fan of it and probably won't ever have it again, but it was interesting to say the least.\n\nHere is what we ordered:\n\n* Mushroom Soon Tofu soup with beef - the soup is what this place seems to be known for judging by the Yelp reviews so I had to order it.  The bowl came out boiling hot which was good because we opted for the raw egg to be cracked and put into it right before it was served.  The soft tofu was a bit different to me but the soup had good flavor and a nice kick.  I would order it again but I'd like to try other ingredients such as prawns, etc.\n\n* Short ribs - this is secretly why I wanted to come here.  I was told they were awesome and they were.  The marinate\\sauce was not overpowering and they were very tender.  I will for sure order these again.\n\n* BBQ chicken - not the leanest or best cut of chicken but it was very good and flavorful.  Again, the sauce\\marinade was not too strong.\n\n* Octopus in spicy sauce - this was the \"crazy\" dish for me for the evening.  I enjoy fried calamari and squid/octopus salad, but larger chunks of squid or octopus scare me a little.  I mean they weren't real big chunks but big enough to where you see you are eating a bunch of those little suction cup thingys that octopi have.  Between that and the chewiness of each bite made my stomach turn a bit.  However, the dish had good flavor and a nice kick thanks to the red sauce they bathed it in.  I'm not sure I would order this again.\n\nAnyway, I would definitely come back again.  I enjoyed the service and would like to try other tofu soups and some of the other meat dishes.  I really want to try the bbq ribeye and bbq pork dishes in addition to more of that chicken and those short ribs!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2010-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w-VKC4IpmTDp77xwrQfp4g", "review_id": "0TJCobIKEK9VqRsDCRGdKA", "text": "Love this place.  I stop by for lunch whenever I come up to Phoenix from Tucson.  Their soft tofu soups are so delicious!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2010-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q5nFaw9isjD_01PpVAR7hg", "review_id": "0mXRRVaxLx0mLQo3zv0fpg", "text": "Very good Korean food.  The lunch specials are excellent and they don't mess around with the spices.  The side dishes are all very good.  I'm coming back for dinner with an appetite.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2010-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "vhxFLqRok6r-D_aQz0s-JQ", "review_id": "Kw5XfR68sET8B05Nw7LIsQ", "text": "Not the most generous of Korean places (i.e. their small appetizer plates that start the meal are a bit meager) but other than that complaint, I really like this place.  (Also conveniently located next to a Korean market in the event you get inspried to make your own meals).  The stews are delicious and the bulgulgi isn't too sweet.  I really like their bibimbap.  If you don't mind smelling of garlic for a week, check it out.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2011-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "Sl4navkZ3m4ZntMF3LFEQg", "review_id": "OzmWkqua-XOLTvwM4kdkqg", "text": "So I want to eat some REAL GOOD Authentic Korean Food and moms not cookin...There are Korean restaurants in the Valley and then there is HODORI.  Hodori is the pinnacle of Korean Food in the valley and there is no close second.  The food is consistent and the service is outstanding.  How do you know if a Korean restaurant has good food?  Look around...If there are a lot of Asians eating there and it's always packed, then that's a good sign your at the right place.  Let's start with the banchan (small side dishes)...They are always fresh and plentiful and they have the best kimchi I have had at ANY Korean restaurant (LA and NYC)!  Kalbi and Bulgogi are done perfectly and not too salty or sweet.  Soon Doobu chigaes are perfect.  If your feeling adventurous than try the spicy Squid or Octopus stirfry...again perfect.  The true foodie needs to try some of the hard core dishes like Ah Gu Jim or one of their many different Jungols (Hot Pot).  They do all the basic Korean dishes to perfection and the more traditional ones better than grandma!  I can also say that their quality and freshness is outstanding which sadly is not always synonomous with most Korean Restaurants.  What puts HODORI over the top is the great staff...I didn't think it was humanly possible to smile that much!  Also the owner with the strange spiked hair style is a really nice guy that goes out of his way to make sure your happy even though I found out he's a NY fan (Yankees, Jets and Knicks)...hey, no one is perfect.  All in all there is a reason HODORI is the most well known Korean Restaurant in Phoenix, they've consistantly delivered the real deal with no compromise.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2011-01-27", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 3}, "user_id": "fPHLPrymsyb6WSFFKoMrTQ", "review_id": "t5V1YLgsIRTDxkoo1oHpvQ", "text": "Korean Food + Me = true love.  I adore Korean food.  I'm not kidding. It's probably my favorite cuisine.  If you haven't tried it, you should.  My typical favorites are kimchi jigae (spicy tofu/kimchi/pork soup), Haemul pajeon (seafood pancake), Galbi (short ribs), oh jing oh duk bokki (spicy squid with rice cakes), Bibimbap (rice bowl with veggies and bulgogi), mul mandu (dumplings)... I could go on and on.  \n\nIf it's your first time with Korean food and you're not very adventurous, get the Galbi and JapChae noodles or Bibimbap (but be sure to try the side dishes (called panchan).  If you're in for the adventure and heat... see my list above! :)\n\nHope and dread were the battling in me when I left CA and realized I'd have to find Korean food here in AZ.  Turned out to be a needless battle though as the Phoenix area continues to surprise me with their hidden and limited but delicious, authentic fare...\n\nYum yum Hodori!  This was my first taste of Phx area Korean food and I have to say, I was impressed!  It's much better than I expected it to be.  They have an extensive menu so I ordered Bibimbap, Kimchi jigae, and Galbi.  It was all good.  The panchan was tasty, too.  I still crave LA Korean food sometimes but this was definitely good enough to return to, many time.\n\nSee ya there!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2011-02-05", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "AeucYo8J-rZjcq09Wuqsjw", "review_id": "jHYVb2WpbTbxgLHuDQ7E0Q", "text": "Meh. I've experienced better. menu not big enough for me. pretty blah.\n\nSoju (like Korean vodka) was the best part.. that shit will have you walking around in the streets with yo' pants off.\n\n                                          *you....have.been.warned.*", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 2, "date": "2011-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zlcHQII8dyI8I0LHGj8nOA", "review_id": "TtZmRrtjg9lwrusLK0dssA", "text": "So I found out this isn't the same Hodori in Los Angeles. :( \n\nThis place was pretty good I guess for the choices you have around Arizona.. I did finish my bowl of bulgogi and noodles though. The sides were meh.. I was disappointed they don't refill them here. I like my sides! Can't really comment about service since there was only 2 other tables she had to attend to. She was friendly none the less. I thought the prices were kind of high, only because I've been to several Asian restaurants in LA where food is cheap! Lol But then again like I said there are not much choices around AZ.\n\nI'll be back unless I find a better Korean restaurant closer to me. :)", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2011-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JTFAjb21Y5sbOHLyO_tyrQ", "review_id": "o4cdD0lJi3eLApZbb_aUTA", "text": "I have been here a handful of times now. Although I am not a fan of their Soft Tofu, everything else seems to be well-prepared. They also have good side dishes.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2012-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wwPZ6d9JM62ckIkKdmuYiA", "review_id": "hwizsLMlE5WnszPIXdQLkQ", "text": "SO, let me preface this by saying that I am by no means an expert in Korean food.  When I have had it in the past, it is usually Korean BBQ with the side dishes and maybe some pancake.  But, from what I have had, I can say that this place is bomb.  The tofu soup, seafood pancake (although it is WAY overpriced), bibimbap, and bulgogi are all great.  Good food, decent service, but some things on the menu are a little more expensive than they should be in my opinion.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2012-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "31OZmHva7Q0dTNqpM4TKug", "review_id": "Hie8uwLmolDVFFL_LfhSVQ", "text": "I was in the area and asked a friend if they had good soup, and he replied.. \"the T2\" is good.  I didn't know what a T2 was, but i decided to go anyways.. while i looked over the menu i saw that they had Kimchi Chigae and ordered that.  I was not disappointed, it was really really good.. full of flavor and all the banchan (side dishes) they gave me were fresh and yummy.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2012-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 3}, "user_id": "KTP77-8cmBfdDyzIGVQqiA", "review_id": "iP1tElmLI7Gq4iORRpzMNg", "text": "Have been looking for a good Korean restaurant in Phoenix, and this place definitely measures up! The prices are a little higher than expected, but it's a popular establishment and the staff are friendly!\n\nI'm a huge fan of bibimbap, and I love that their hot pot bibimbap comes with Kalbi! Our table also shared a seafood pancake, and it was really yummy! A lil more shrimp than I would have liked (esp since they were of the frozen baby shrimp variety), but it was crisp and had a good consistency!\n\nDidn't get a chance to try any of their bbq items, but their tofu soup lunch special looked good! Side dishes were okay. Good variety, but I was hoping for some fish cakes or cold noodles.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2012-12-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Vp_H1bWr3idwSafZlwqT1g", "review_id": "hktitJJ37E6VpdoSX77IxQ", "text": "One of the best Koran restaurant in tempe for sure, love their tofu soup, especially winter also the BBQ pork is good too!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2012-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PB5f_4Ojjv6Nf-iGg6JN3Q", "review_id": "knnTqQrkvMzwCmvh2XdjBw", "text": "I love Korean food, so I was excited to try Hodori.  The first time I went, I thought the prices were a little high, but not unreasonable.  The \"kimchi pancake\" was tasty, but my bibimbap was quite bland.  As for the wait staff, they were not very friendly, but brought everything out on time. Overall, I was content with the experience, but certainly wasn't impressed. \n\nHowever, my second experience at Hodori was awful.  We literally waited at our table for an hour to have our order taken--they told us the kitchen was too backed up to receive any new orders. (Meanwhile the two tables around us ordered and received their dinner.) We decided to leave, but they assured us we could order and that we would get our food in twenty minutes.  In reality, it took another hour and ten minutes to get our food.  I tried a kimchi soup this time--it was alright, but not worth the wait or price.  \n\nI NEVER stiff wait staff, having worked in food service myself. But I planned to make an exception this time, as waiting to be served for over two hours after being seated is ridiculous. However, they added a mandatory 18% gratuity to our bill.  Even thought this meant a few dollars per person, we all felt so cheated for being forced to pay for such poor service. They did apologize at the end for the wait and brought out complimentary ice cream. But at that point, we were just ready to get out of there. \n\nI would NOT recommend this restaurant and will certainly not be returning there in the future.\n\nUPDATE: It's one thing to have bad service, but I spent the next day throwing up. On my birthday. I mean, really? And no, it wasn't because I'm not used to the food--I've had actual Korean food in Seoul without any problems at all.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 1, "date": "2013-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8SEU0lolGnsZ0rBCcGS8-w", "review_id": "GS9RWJeZ7rNChWPEPS3EcA", "text": "The food is alright but the service is terrible and slow every time I come here! The waiters need to follow up on the tables for any water or banchan refills instead of just serving the food & moving on to new orders. Takamatsu in chandler has better quality  food & the best service since the manager is on the floor directing the employees.  Chodang is also better in food quality but the service can be slow at times but its not as bad as it is at hodori.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 2, "date": "2013-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WLVuaOJoyCvX3Uo5et-HVA", "review_id": "SQzq-0wruvaAIiz7yAsXgQ", "text": "One of the best soon dubu I have had in a restaurant. And its not in Kali or Korea, but Arizona?!?! \n\nA lot of the soon dubu places in AZ or even Kali don't make it spicy enough. Even when you ask for SPICY. This place listens. I had the pork soon dubu, and the bf had a seafood one. We both were surprised by how good it was. The tofu, broth, and other ingredients were so flavorful. You could taste each individual ingredient, yet it all came together wonderfully. :) The service is pretty fast and efficient. The restaurant was pretty spacious and clean as well. (A lot of other places are really cramped and stuffy).\n\nWhy did I take off one star? Their side dishes are subpar. They don't have much variety, and the ones they did have looked old and dried out. They don't serve their soon dubu w/ a fried fish like many of the other soon dubu places do. :( Plus their rice is served in a plain metal bowl rather than a stone bowl. So you don't get that crispy/burnt rice (that you pour water on) towards the end of you meal. :( Also, we requested bori cha, and I think they charged us for it. ^__^", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2013-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0EgiHCjfGKwIH7tOlLYrzA", "review_id": "EBpt_ijzo8TppZXgrMNqRg", "text": "If you need a Korean fix go to Los Angeles but of you're unable to drive you can hit up this joint for some spicy soft tofu soup.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2013-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LI17PZdJ67frvVdCNJkvYQ", "review_id": "gk-7pbajX_bhddAQoP23bg", "text": "Came here with the family after being spontaneous and not eating at the hong kong diner next door. We ordered the korean beef, two of the tofu soups, and a few other miscellaneous items. Everything was really great and had a lot of flavor, the two soups were also very very good and I would definitley recommend to a first time korean food tryer. The reason why I'm giving this 4 stars is because service was just okay. Nothing special. The waiters didn't really seem to care about the food or anything. Secondly, I realized that I'm not the biggest fan of korean food, but that's just me. And third, the prices were a little high. Around $90 for a family of 4/5 (My grandma eats almost nothing XD). So, we may come back here if we're really craving korean food, but it's not \"too die for\"", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2014-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HiLwegb-ffb7IOC7lAmTfQ", "review_id": "dyUsG3PDr03G5Yh6ThXjrQ", "text": "My friend and I came here and when we walked in,the male waiter appeared pretty nice and told us to choose a table and sit down. He followed us to our table and handed us the menu, so we thought so far so good. Then 5,10 and 15 minutes went by and we were left alone,it appeared both the waiter and entire place forgot that we were there...they totally IGNORED us. I saw the male waiter that had helped us earlier glanced over our table a few times,but NO SERVICE what so ever. The service here was TERRIBLE, most of the employees were pretty RUDE and UNPROFESSIONAL towards us. The funny thing was that the table of 5 koreans that came in way after us had their orders taken down way before us. I will NEVER,EVER come back to this hate-ful and ill-mannered restaurant ever again. Not only was the service HORRIBLE,but the atmosphere and korean waiters were too RUDE and ill-mannered,they didn't deserve our business. So we went to the Hong Kong restaurant right near it,and the Chinese waitress there were 100x nicer and better educated than those korean waiters.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 1, "date": "2014-01-19", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "WESBNCIvswTWh-Ak2uGf4g", "review_id": "n0jsXftsbAphVdgpzYbHZA", "text": "Omg so good! We went for my fiance's birthday, and I used the leftovers to make fried rice for lunch today. It was awesome. We went last night right before 6 thinking we would make it before the dinner rush. Turns out Koreans eat early and we got there DURING the rush! We didn't have to wait very long to be seated but it took forever to order, get our food, pay the bill, etc. They only had three ladies waitressing, running the register, and so on. Our water glasses were never filled. Well at least the food was good. \n\nThe Bulgogi had great flavor and was very tender. The entree was pricey (normal for ribeye to expensive at KBBQ places) but they gave us a huge portion so we ate it last night and today too. The Soon tofu was delicious and packed with tofu, kimchee, tender cubes of beef and seaweed. We asked for medium spicy and it was quite spicy! We can handle spice but for those who can't, I recommend you get it as mild as possible. Definitely loved the soup, I will be back for this one! Lastly the seafood pancake was packed with baby shrimp, octopus, scallion, and mushrooms. It was good but got soggy pretty quickly unfortunately. But when served hot in crispy its yummy dipped into the tangy sauce they serve with it. Banchan was unimpressive and limited, the potato side dish was too sweet (I think they put syrup on it) and the kimchee was just okay. I prefer the seafood pancake and banchan at Cafe Ga Hyang more . Overall we were very satisfied with the meat and soon tofu and will be back if we're in the area!\n\nMinus a star for the lacking banchan and slow service.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2014-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5Zl1HM8XfFjh8bELbcTgrg", "review_id": "Ku79825kOG1vHQpQ12GIvQ", "text": "Just before I was leaving for California after winter break, I decided to bring my family for Korean BBQ because they had never tried it before. I did not realize this was not the type of Korean BBQ with the grill in the center of the table and the marinated meat that we get to cook. Nonetheless, we ordered beef bulgogi, bibimbap, and some soups.\n\nI think I must have ordered incorrectly. I went for the traditional beef bulgogi and wound up being very surprised that was served in a bowl of soup with glass noodles. I thought I was getting a skillet of grilled, marinated meat to share with my family.\n\nThe bibimbap came in a huge bowl (I like to order it hot), and here, I was a little disappointed again, because I thought it would have the black rice because that's how I've had it before. Instead, it was just the regular white rice we typically eat.\n\nSoups were not that great as well. We ordered one with pork ribs, and the meat was not tender. The only vegetables in our soups were green onions, which we are not a big fan of (they're great to give flavor to a dish, but not as vegetables for a meal, I think). We didn't eat very much, and were not happy with the fact that each dish is $10-$13.\n\nThe restaurant is welcoming, but this meal just really wasn't what I expected.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2014-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XSmy2n-PBvH9RuVxuYikSg", "review_id": "y2PT-eMQhi_p8J6ubUvosQ", "text": "While staying in Scottsdale my husband and I invited a couple who had never eaten Korean food to join us for dinner at Hodori.   \n\nWe started off with seafood pancake as an appetizer.  The pancake tasted good; however, it did not have enough seafood in it. The next one we ordered was japche, which had great flavor.   Main dishes were grilled Kalbi and spicy sautéed octopus.  Kalbi tasted great.  \n\nEveryone enjoyed the great flavor of the spicy octopus that was cooked in cabbage and onions.  But I should have ordered squid instead.  Even though the flavor was great the octopus was a little chewy.  Our friends also learned to make a lettuce wrap and enjoyed it very much.  \n\nOverall, good food and good service.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2014-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "wUEp87FqOB9ew27Iz6zk_w", "review_id": "9hWFzZluU2CLe3QNFXWHIA", "text": "Pros\n\n-service is friendly\n-(some) dishes are really tasty; namely the spicy tofu soup with seafood and the seafood pancake appetizer\n-hits the spot when you are craving korean bbq\n\nCons\n\n-not as many side dishes as at other korean restaurants (where's the seaweed??)\n-food takes a loooong time to come out (45+ min)\n-my bulgogi was sweeter than I wanted it to be, and not as spicy as I wanted it to be\n-they forgot to make my entree so it came out 10 min later than everyone else's", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2014-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vfBNbpCqZaaIOji12vqagg", "review_id": "6qvbjM3ChubX0WOXMmMiAQ", "text": "Living in Hawaii it is easy to find authentic Asian food. Not so easy in Phoenix. Thank you Yelp for pointing me to Homodori for a great Korean fix. Kim chee fried rice and Bulgogi hit the spot. Service was quick and friendly. The clientele was gorgeous. Can't wait to go home to Hawaii.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2014-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AW3NXI9fvON40A-I1M961w", "review_id": "Z0Q6U9VmF3olUC8oPinpJA", "text": "This is the BEST Korean restaurant in Tempe-Mesa. Kimchi pancake with pork, and soon tofu hot pot are my favorite two dishes. It is real Korean taste in Hodori. My friends and i come there several times a week. \n\nHowever, the decorations in Hodori need to be more \"Korean\". The soup in casserole is little bit weird.\n\nOverall, Hodori Restaurant is a great place to go!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2014-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ytANTkDWDuKu7ohlN3HgOg", "review_id": "JifcdmZwTNhfE2nNbhzl_A", "text": "Kimchi tofu soup with pork and egg - where have you been all my life!?   I felt like it was \"comfort food\" even though I've never had it before.  it not only tastes amazing, but the texture of the silky tofu feels really good on your tongue. That sounds kinda weird but that's how I feel.  \n\nHusband got bulgogi which was good and I also got the spicy octopus.  Some pieces were cooked perfectly and others were a little chewy.  \n\nIt was pretty expensive, but I think this is a place that's best to come with a big group of people and share the food as the portions are big.  There were several large groups there.  I feel like we could've had 4 people share what we ordered if we got another side and then it would've been a good deal.\n\nI will definitely be back for more soup and to try some of their kimchi pancakes and their bowls with egg on top which look delicious.  This is one of my new favorite places for sure", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2014-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Ki71iAFTxsPPQfX430c99Q", "review_id": "svnRHTfojuDH7IP6JnvTZg", "text": "3.5 stars\n\nRounded down for service.\n\nThey didn't bring the side dishes until the food came out which was disappointing. The seafood pancake was okay for AZ and the side dishes weren't bad. It's probably the best Korean restaurant that we have been to so far, although in the big picture, it's just average.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2014-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FG8rE-zMlI8JUMem54CzzA", "review_id": "ArbuxyDzHCDqLcbf1uzE0A", "text": "Great food, but maybe they didn't have enough staff to accommodate the amount of guests.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 2, "date": "2014-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W4PCtGVMLktTOJhTZM2GiQ", "review_id": "OyA5mrt-FzrNnPmUDKx1xA", "text": "Food is always good. We have never been disappointed when coming here. It's a little pricey, but the portions are always a good size as well. Especially lunch. Like most reviews the service does lack everytime we are here, but the food makes up for it.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2015-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "IACfmyKSOugjN3WqJS-oJA", "review_id": "E6vi1d0V0ES07Cqk2paLTw", "text": "I'm from Seattle and I've been looking everywhere for korean food. This place is by far the better korean restaurants out here. I Recommend Kalbi tang, Soon Dae gook or soondooboo. \n\nThis place is cleaner than most restaurants out here with fresh side dishes. The waitresses are very nice and helpful. Tip them well ;)\n\nIf you're looking for a korean bar, I recommend ROK", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2015-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "6qop_CRlIjUg369C6WRb0Q", "review_id": "5mZpMTUCrZ8knNuWrbkIEA", "text": "Came here at least once a month for several months. Best Korean BBQ in phoenix. Service was slow half the time but not a big deal.  Having worked at a few Asian restaurants, Chinese\\Korean first generation wait staff is generally speaking slower and less attentive than their western counterparts. A few years ago they served you after all the Korean people if you brought black or white friends with you. Sort of funny I guess and not a big deal as they eventually resolved that issue. However, I had to stop going because the older waitresses were consistently rude to my non-Korean guests. We weren't loud, and I tipped 20-25% every time we went there but it got annoying. Anyways, would be five stars but drop to 3 for hiring rude wait staff.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2015-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7ivHxIpD4uEZGdHfJBdozw", "review_id": "spk1PdI58rVY_-RZtuUfFw", "text": "This place is great! Korean BBQ, Bibimbap, and all the rest. Clean and spacious but always full of happy customers.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2015-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IJ5txGsHzBXtgB4StrSQmw", "review_id": "yrtZPWqnLHrd3iBcr7C48g", "text": "Korean food is definitely one of my favorites and I was happy to find a solid place in the valley. \n\nMy go-to usually Kimchi Beef tofu soup, which is perfect on child days, but also enjoyed the bibimbap, and kalbi. Side dishes were good, but portions were a little small (more cucumber Kimchi!). \n\nNo issues with the service.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2015-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a3WPdfgl49mJ76_yIwR5fg", "review_id": "EiZUOGX3AYLQJSdfoCFd0A", "text": "The Korean food in Phoenix! In my former hometown of Mesa, even! This area of town sports a small, but growing \"Korea Town\" along with the food. Go for the bibimbap, stay for the broad selection of well prepared Korean dishes that can be paired with a broad selection of wines, beers and Soju. Try the Pajun and the spicy squid!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2015-12-20", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "mmJzZPMT06-4jRhf5L8laQ", "review_id": "U3rwYhZCCE9oxB4E9SeNKA", "text": "I'm a fan of China Lite. It's take out focused (though has eat in option) and is healthy/semi-healthy Chinese fast food.\n\nOur office is about 100 yards away so we go there often. Pretty much our quick & cheap go to lunch spot. Good food, reasonable, quick and they have a number of healthy options.\n\nFeels at least partly authentic though they do also have several \"American Chinese\" selections (which I can also enjoy). I'm a big fan of the Szechuan green bean with chicken but sometimes need a good Sargent Chang's chicken or a honey crispy chicken.\n\nMy pops is from Canton, China so Chinese food is something we've grown up with. While it is take out/fast food focused, definitely a viable option.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 4, "date": "2009-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "pXhfBa5Vvzoypjo91csclw", "review_id": "MmZu0YS-ZIukLzFdmogJvA", "text": "Every time I come home to Scottsdale, I make sure at some point during my stay to stop in at China Lite and get a Sergeant Chang's Chicken to go. I have a deep love for this dish, it is reminiscent of General Tso's style chicken, but without the fatty, greasiness! There used to be a China Lite up on FLW right by my house, but it closed, so I drive down just to get this dish! I rarely eat in here, the decor is nothing exciting, rather bland in fact, but the food is always ready to take home within 10 minutes, and is super affordable. I also enjoy the Crab Puff appetizer here (Partan Cream Chease), and its been awhile but the Honey Crisp Chicken is also very good. If you come for lunch you can get these for even cheaper! All of the other entrees are made according to China Lite's \"healthy chinese\" practices, without sacrificing flavor. I am friends with the family that owns the chain of these restaurants and am happy to give them my business! Gotta have my Sergeant Chang's! Yum!!", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 4, "date": "2009-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-_GtJEB9B4Ckm7Cd8RIq1A", "review_id": "jAO9HKUUXyAOCj07bF_GvQ", "text": "Good food, tiny portions, pricey for the amount you get.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 2, "date": "2011-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "twZoTvWG92ntMVfEvbCnIg", "review_id": "nAVPgdzEXAQB-cQ76Y356w", "text": "Wonderful choice for lunch or dinner.  Menu boasts healthy cooking alternative to the usual greasy/unhealthy feeling you get after eating at a normal chinese restaurant.  THEY ARE RIGHT.  The food is delicious and fresh and I love almost everything that I've tried so far.  Not only convenient, the food is always ready in 5-10 minutes depending on how busy they are.  If you're in the mood for some delicious chinese, or even curry check this place out.  I would recommend it for take-out.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 4, "date": "2011-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iVqLdVGkZgftmIdfp6zHHA", "review_id": "RMTeTpSRB-RSIuC6KKDdsA", "text": "Truly a weird place.  I don't think this place knows what type of asian restaurant it wants to be.  The menu is all over the place.  It could be chicken teriyaki place, or could be a thai place, or it could be straight on chinese.  I don't really know.  And so, it's sort of the weakness of this place.  I got the Lite chicken off their menu, which should be their specialty, but it was nothing to write home about.  It was cheap at least.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 2, "date": "2013-02-20", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "tJrLCScF54Mi9wphJnHlgg", "review_id": "I7-1Dbq08znZ5SttYitr8A", "text": "No flavor. None. I think they're trying for the no oil and very healthy thing, but it shouldn't lack so much flavor. I has to douse my Dan Dan noodles in sriracha. The whole environment of the restaurant was very old and dirty.\n\nI don't plan on coming back to Arizona, but I def wouldn't recommend this place.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 1, "date": "2013-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "P22L5TcTz7gsxEGK0PkkEg", "review_id": "N73lSwWMNK96C96ovXTfdA", "text": "Tried this place for the first time. Ok menu would have been better with more options. Food was good with a lot of great flavor. Would dine there again but would get it as take out.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 3, "date": "2013-12-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_YlFwUrAd-6Z4Qbxv98xfg", "review_id": "T7qC9-27aNwG0M7X972cXA", "text": "Love this place! My favorite dish is their chicken fried rice! The owner here is super nice and the food here is delish!", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 5, "date": "2014-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t3h1yXU4cho6ZN-PY--g7A", "review_id": "U7pb_pj2U-wm3DYw0eclsw", "text": "Great service and prices. This is the epitome of Mom & Pop as it is run by a husband and wife. It's always prepared fresh and quickly. The spicy chicken dishes have more flavor than the healthy meals, remember it's called China LITE for a reason because the dishes are prepared with healthy oils and sauces. I always feel good and healthy when I leave there. The portions sizes are great too as it's hard to finish, you seem to always get some chinese to take home with you & that's never a bad thing. The lunch combos are a terrific deal, you can't beat the prices and how you feel when you leave. For those wanting to eat healthy and for those looking to lose weight I would add this to your list of places. They just recently remodeled and it now has a more modern vibe and a new TV.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 4, "date": "2015-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "8WQubmP7G0NM3IyzyMnCEA", "review_id": "H5jxUKiFmXLTG-F_jGiiXQ", "text": "Excellent galbi - grilled marinated short ribs.\n\nWe happened to be in the area around dinner time and decided to check it out.  As we parked our car, a whole Korean family walked out of Seoul Jung.  This was a good sign.\n\nWe ordered the \"Dol Sot Bibim-Bob\" $10.90 and the only special to be found on the menu: #13. \"Galbi & your choice of Naeng Myun\" $13.90.\n\nSoon after, the waiter brought over a multitude of banchan, including the standard bean sprouts, spinach and various kim chees.  All were pretty much as expected.  \n\nWe chose the non-spicy Naeng Myun, which is a giant bowl of chewy buckwheat noodles in an iced tangy beef broth with julienned veg and slices of Korean pear (the spicy version comes without soup).  We were first introduced to this dish at Hodori in LA's K-town by a Korean friend and ever since we've been hooked.  It's one of the most refreshing dishes - it cuts right through the heaviness of Galbi.\n\nThe Galbi came to the table sizzling on a hot plate.  The generous pile of short ribs were tender and well-marinated - obviously from a very good cut.  \n\nThe two of us were pretty full when the Bibimbab arrived.  We waited a few minutes for the rice to get crispy along the sides of the hot stone pot (dol sot) before squeezing in the spicy bean paste and mixing up the contents - shredded veg, beef and raw egg.    Despite our level of satiation, we still enjoyed it.\n\nTo cleanse our palates, the server brought us each a complimentary bowl of sikhye (sweet rice soup) as is custom.  Korean food's all about the complimentary stuff - you can get unlimited refills of banchan.\n\nWe probably would have walked out happy with just the special but thought we should at least order a dish each.  Room's a bit dated and the service is friendly.  I think Mr K should give Seoul Jung another try at dinner.", "business_id": "z29_Qhpju0M4fBkhNfdiqg", "stars": 4, "date": "2008-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bWNjCQyTJttofo3dKtTTPQ", "review_id": "aqm1l8YsGeiRGUWTF4bX2Q", "text": "I believe this place has changed names along with owners. It is now called \"HJK\" or something like that. We were the ONLY ones in this large restaurant in a scary shopping center. There might be a \"korean club\" or some sort right next to this place too.\n\nOverall, you can't complain about the portions here because they are HUGE. We opted for some bbq and soon tofu soup (don't order this soup). We ordered beef brisket, pork belly and kalbi which was served with green onion/lettuce salad and around 15 side dishes which were very tasty. The brisket wasn't cut as thinly as I like nor was it well marbled. The kalbi was very good and the pork belly standard. \n\nI'd eat here again, probably during the daylight hours though!", "business_id": "z29_Qhpju0M4fBkhNfdiqg", "stars": 3, "date": "2010-01-24", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "23zYCcnqfru5jdxnTqjgDg", "review_id": "uMqZy2GlwsfjwRsHho86ig", "text": "Yea ok I came in with high expectations other than burnt rice and hot pot of curry. Mmmm and Kim Chee....So it made me poo....Yea I got sick. After 1 bottle of immodium. A roll of tums, and 2 things of pepto. I stopped impersonating a straw for five days. Ask my boss...It was rough...Sick and dehydrated.....There were some good things on the menu. But seriously the kim chee really did look old. It was like they got the water from Korea. I'll stick Korean Barbeques from now on.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2007-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "f-PNqJwmcWkyRNTUpMJ8Aw", "review_id": "aFdi2Fwmd680BH06VZGwCA", "text": "Yes, one would think that a place called Tofu Hut would know something about tofu, but they don't.  They have, listed under their specialties, \"Stir Fried Kimchi with Tofu\", and the waiter acted like he'd never seen this on the menu before.  The end result was that I got kimchi stir fried with spicy sauce, and some scallions (which was actually tasty, but not very exciting) surrounded by uncooked, un-marinated tofu slabs.  Not the right way to prepare tofu.  There wasn't even any extra sauce in the stir fry to put on the tofu.  I can't speak for their meat dishes, but my dinner companion didn't seem impressed.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2008-01-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "Iu3Jo9ROp2IWC9FwtWOaUQ", "review_id": "P4w-pTCZ7w_gA5N1P3aXcg", "text": "7 of us stopped here for lunch today after our hike. 4 of us ordered bolgoki and the other 3 got variations of tofu soup.  We all enjoyed our meals.  It was quite filling and quite good.  There were 9 banchans today.  I was a bit disappointed that their spicy was less spicy than I expected.  Next time, I'll have to order the very spicy version for my tofu soup.\n\nService was good.  It is a small place that I have driven by many times.  The restaurant was very clean.  I will be back, and the other 6 feel the same way.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2008-12-11", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "NTviInlZabLvm7gr_aJu3w", "review_id": "wLS2ltiHtnCum9dFWBi7DA", "text": "Went here last night with my BF despite the bad reviews that were posted over two years ago... and I must say it was a lot better than I expected.  \n\nFirst, we sat down and the waitress served us two bowls of salad, I'm not sure if the salad dressing is store bought or homemade, but it was pretty tasty and the salad was fresh and crisp. \n\nThen came the side dishes/appetizers and we got quite a few, 9 dishes. most were really yummy except for the potato salad (?) it looked like a scoop of ice cream, ha. \n\nFinally our main dishes came, Kimchi Beef Tofu + Bulgogi and the BF and I really enjoyed it, it was perfect for the chilly weather outside. The tofu soup was flavorful and they didn't skimp on the beef, unlike other places. The bulgogi was really well marinated and yummy too. \n\nAlso, the prices are very reasonable. $30.00 for two tofu soups + bulgogi + side dishes and drinks. \n\nWe will definitely be coming back.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2009-01-02", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "W_vpGqQlGVrWN7eMYopPHw", "review_id": "PbzawAtU8-4BFekfYQcogA", "text": "This place is pretty good, a pretty good value of what you get from a joint off of the strip. \n\nSince it is called \"tofu hut\" please note that their specialties is just that. Tofu! Specifically the Korean, \"Soon Tofu\" dishes. Keeping that in mind, I went ahead and ordered the \"kim chee and beef\" soon tofu. The dish itself was not too bad, I think it may have needed a little more salt, but then again the decent ban chan took care of that. \n\nI would go back to try some of their other dishes. Like other Vegas spots, they are open late! \n\nGood Eats.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2009-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "A3mpjzazkSDkua4cPSayYA", "review_id": "QIDybeE2eik1ry29xs-iAg", "text": "Went here with a friend after the library closed to grab a bite to eat. It was a Monday night i believe.\n\nWalk through the door and you're just hit by this sesame seed oil aroma that just says 'welcome to a Korean place' . That was nice. \n\nThe first thing that shocked me is they ran out of Korean beers, no Hite or OB left because of the lunar new year. Then again the place was empty so they must not have restocked since the previous night.\n\nI ordered a kimchi and tofu stew and several times asked for extra vegetables to be added in. extra vegetables weren't added in... overall the stew hit the spot and my friend's spicy chicken was to her tasting and then some.\n\nI did enjoy the food and service here but a few reasons will keep me from coming back:\n\n1) Price - To be honest i'm cheap, money shouldn't be thrown around epically in this piss poor economy we're in. This place has very little of anything other then soups under the ten dollar range\n\n2) Variety - I expected to see more tofu centered dishes instead of seeing a large section dedicated to taking advantage of the table grills for Korean BBQ, instead of 'Tofu Hut' call it 'BBQ Hut'\n\n3) Ignored my request to add extra vegetables - It's not like i'm ordering a cut of premium meat with a side of extra premium meat, sometimes you just want more then tofu and kim chi like say...other greens. Hell i don't care if they charge me extra for it i would have paid a little extra just to enjoy the vegetable enhanced soup.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2009-01-31", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "xY7Ks3sRwyxALGsTQzMAyw", "review_id": "SDsfglEh2qAgGEhWuj_FQQ", "text": "Yep, 'nother vegetarian duped into thinking there would be more veggie options. I ordered one of two non-meat soups, the mushroom one, and it was very good, though.  \n\nWish they would have explained what was what when they brought the extras, as I ended up eating some fishcake thinking it was seitan (silly me for thinking they'd bring us vegetarian stuff after telling them we were vegetarian). Other than that, I barely felt disdain from the service staff.\n\nI got a laugh that they have a Spice level lower than mild (it's called \"white\" - hah!). Kudos for telling it like it is. I had the mild and probably could have had the medium without worry ( I is not good with spice). One of our party got \"Spicy\" and he said it wasn't. \n\nUnlike other yelpers, none of us had a bad return once we got home. :)", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2009-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dkDd7BFxOQA2Lf08eLPidQ", "review_id": "rveW9gC-jNI1ZlX6OsZlww", "text": "Look-I grew up in Seoul- Soon-dubu....aka Spicy Tofu soup is like burgers to me. I eat it weekly or else i am convinced i get a cold!\n\nSO-i just moved TO Las Vegas 3 weeks ago and was on the hunt for a korean restaurant, that WAS NOT run by japanese, and did have at least 4 side dishes included........\n\nFound it!!\n\nI ordered the Veg. Tofu Soup Extra Spicy for a damn cheap $8.00 \n\nWhile, i do agree that the tofu may have been overcooked, i was so thrilled that they had radish kimchi and beansprout kongnamul i forgave them this miss-hap. \n\nBottom line is everyone likes their tofu soup the way their mom or their grandma made it Tofu Hut it pretty damn close and thier pan-chon rock!!\n\nGo and try it!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2009-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l75cI0nE38fagyZlad0y8A", "review_id": "rF9akSIg08b3Zpi8bR29wg", "text": "Came here for late night munchies and ordered some Japchae.  Not only was the food overpriced (more than $10 for asian food!) but my vegetarian Japchae was excessively oily and gross.  I tasted my friend's tofu soup and it wasn't that great either.\n\nThere is probably much better Korean food elsewhere in the Vegas area.  Next time, I'll pass.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2010-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eGsxgdgLyTaURyXCFWhjPA", "review_id": "fvEHB2hXmy3MvOaBDW-tSg", "text": "Thought I wouldn't like this place. But it turns out I did. Didn't opt for the all you can eat since my date and I wasn't that hungry. Next time I got to try the all you can eat!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2010-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "ttjUfq7auCNVkPXAl_0wrw", "review_id": "K2q_rcnOcexRm6B1g0Hl5g", "text": "It seems to me, that I always run into bad service in Chinatown.  Is it the culture, or are they not happy to be there?  \n\nI really, really, really LOVE this place, but the one thing that kills me is the service.  A group of our friends sat down and waited for the waitress to come take our order.  I kept looking at her to come over, but she would always brush it off and go back to whatever she was doing.  It was until she finally decided to refill the other people's table with water, did I get her attention.  \n\nThings to order:\n- Beef Tongue - on a good day, you can get the really thin big ones. Fry it to medium, and it's nice and soft.  MMmm, dip it with the oil they offer you.  It intensifies the flavor!\n\n- Pork belly - I don't know what it is, maybe it's the oil that gives it more flavor but I can't help but keep eating it!\n\n- Beef bugolgi - MMmm....on a good day, you could get it really marinated. Mmmm! and boy it is good!\n\n- Steamed Egg - I don't know what this does, but it goes great when you eat it with the beef tongue.  The flavors just ooze out like crazy!\n\n- Salad - Ohhhhhhh man, I don't know what's in this salad but it's soooo addicting! It's like sweet, salty, and crunchy! My kind of mix!\n\nThey used to offer yogurt at the end of the meal, but they don't anymore.  If you're coming here, do all you can eat.  It's not worth it if you don't.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2010-12-04", "type": "review"}
{"votes": {"funny": 5, "useful": 4, "cool": 2}, "user_id": "TgAz40uH7rSrIp-PZnqrHQ", "review_id": "o95ldAlnrnKEF1FpUV08MA", "text": "I've been here several times. Even when the service may not be the best.. I don't know why we keep coming here. Maybe it's cus they're open really late or I should say early in the morning for that quick fix of KBQQ. They have the option of AYCE or their regular menu. I've never tried their regular menu, cus we always come here for the AYCE.\n\nThey have like serveral types of meat to choose from. Such as; bulgogie, pork belly, marinated chicken, beef.. They even have steamed egg which was different for me. To me, the best thing here.. actually two.. I'd say is the salad and their awesome coffee machine.\n\nIt might be hard to find at first but just look for the building with a green roof. The parking is decent. And we've come here with huge groups since they have a few huge tables to seat us all.\n\nI've been here recently and I think the service might be getting better. BUT that was at 1AM so, I'm not sure about the day time.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2010-12-23", "type": "review"}
{"votes": {"funny": 10, "useful": 13, "cool": 11}, "user_id": "V0if1DQ0MaTY-shWddXCsA", "review_id": "BZdlMITTwUnpZ5fdpy544w", "text": "My GOAL here, is to have you start drooling all-the-way to the front door entrance to this Korean BBQ joint.  \n\nYou'll be crazy not to just go for it all & do the all-you-can-eat menu!\n\nAll-you-can-eat @ $13.99 11pm-5am & $16.99 10am-11pm\n\nThis place is located near China Town on Spring Mountain. \nFrom the outside it looked dull and unattractive for customers just to walk in for the first time. So this place seems like it's making it by word of mouth (yelp!)\n\nHmm.., sit down, get your glass of water, order the type of meats you want to cook on the built-in grill on counter top table, then....\n\n-Get a bowl of some bomb *** Asian salad (simply just shredded lettuce and flavorful Asian infused dressing)\n-Kimchee (just for kicks)\n-Olive oil w/salt & pepper dipping sauce (fancy huh?)\n-Pickled radish mini slices of cucumbers \"daikon\" (sweet taste)\n-Fish bread roti like mini pieces (I don't think it was fish bread, but that's what I remember hearing)\n-Ask for peanut sauce & special hot sauce they can provide... (we asked the server what the peanut sauce was called, & she just handed it to us, smiled, & nod her head yes, lol)\n\nFor 4 people, we ordered:\n1 plate of brisket thin slices, \n1 plate of ribeye thick slices, \n2 slices of thick cut bacon (belly fat), \n& 1 plate of short ribs, \n(we order a bit more after thehehe)\n\nI also recommend the steam eggs, just cause you can mix it up w/ your bowl of rice like the taste of fried rice ;D\n\nNow that's a mouth full!!!\n\nOn the other hand, service needs to improve please... Otherwise I would have given this place a 5 star rating...", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2010-12-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "38JK-SfO9NkAGs1RwlH2Gw", "review_id": "ncYssfb3788Ds-nz6P4B2w", "text": "This small, informal restaurant specializes in Korean barbecue where you cook your own food over a grill.  We chose the shrimp; 24 butterflied shrimp, a bountiful fresh salad with an Asian dressing, unlimited rice and 8-9 banchans (small dishes).  Here is what I believe we consumed:  kimchi, Oi Sobaki (seasoned cucumber), Kongnamul (bean sprouts), Kuromame (Japanese black beans), sliced Age (fried tofu), a broad noodle dish, a second cucumber dish and a potato salad", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2010-12-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XumuDhjpl1oZGxLPQlWvYQ", "review_id": "uMLvcfMaXTPQ_P3EeEMcmg", "text": "Here are my gripes with Tofu Hut: \n\n-The side dishes look and taste as if they were made weeks in advance.\n-The meats have that brown/gooey look to them, as meats tend to do when they're old. \n-The customer service is lacking, although this is expected from an Asian establishment.\n-The restaurant is filthy, which probably indicates the cleanliness of the food you're consuming. \n\nThe positives are that its well priced for a buffet and the selection of meats are diverse. You can order cow tongue if your heart so desires.\n\nOverall, I'd rather pay $5 more to eat at a nicer/cleaner/fresher spot. My friends do enjoy eating here due to the price, so I'm sure I'll be suckered into coming back, but not because I want to. \n\nKorean Garden and DJK are better options, although more expensive.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2010-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_sKocx_OjrQrLnGYNMuacg", "review_id": "NFp3zRRGQAXNfCQQ3DOFqQ", "text": "Club hoppin' in Vegas can sure get you starvin' like Marvin. One of our group was a local, so she suggested we go here. If I can remember correctly, we ordered rib eye, beef tongue, squid, and pork belly. The rib eye and pork belly were my favorite. Had to help out  one of my friends by making sure everything in front of us was cooked. I nearly screamed bloody murder when they dipped a piece of raw meat into their sauce and came extremely close to eating it. That's what happens when you're low on sleep and high on alcohol. *shakes head* Our waiter checked in constantly and was nice enough to change out our grills without us asking. I wish I had the chance to try everything, but drowsiness quickly took over. Definitely a good place to hit up with a group for late night grub.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-01-13", "type": "review"}
{"votes": {"funny": 3, "useful": 7, "cool": 2}, "user_id": "xV1hf20ZFDSoaMZmwLoHNg", "review_id": "llFZzspqYw2lFblBdGO_IQ", "text": "Because many known yelpers liked Mr. Tofu, we try to go there tonight. Sadly, it wad closed. We decided to try out Tofu Hut since we have never had their food before.  Seeing that it has 3.5 stars, I thought it should be ok. \n\nThe furniture was old and raggety looking, especially the torn up cushion on the chairs, but nevertheless, I should try the food.\n\nThe menu needed some wiping done since it was covered with sauce.  Ewww.\n\nAnyways, we decided on the beef seafood sundubu and a plate of kalbi.  When the older lady waitress came back to take our order, she was so impatient and short.  We wanted to understand their spicy level so we asked if the spicy level is Korean spicy, she said it's not that spicy.  So we continue to ask her at what level she would order it and she said she don't know since she doesn't eat spicy.  WTF!?!  Her ill-mannerism and major bad attitude continued and I wanted to leave right there and then but my friend wanted to try out the food at least.  Ahhhhh!!!\n\nWhen we paid the bill, she walked by and hurriedly grab the receipt.  I was pissed that my friend tipped her because truthfully, she did not deserve a penny for the crappy service she gave.\n\nFood was sub-par, nothing special.  I will never ever come back to this crappy place with this crappy ajumma waitress.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2011-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "KKyrhHw5_t_jCeRD8-7cDA", "review_id": "5cIntn5D6Su3H7gWu6HrSA", "text": "Amazing Korean BBQ as well as entrees.  The sides are always nice and are changed/different all the time.  Everything is fresh and prepared nice.  Friendly staff and the customer service is great.  They do have a \"white\" broth for soups which I find funny since I am not Korean.  All and all it is my FAV spot in Chinatown for Korean BBQ.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2011-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "DBjPbmmHD4HG0xLwjtn53w", "review_id": "fhsEuZ2U8mDVCHdNriVTpA", "text": "Had a delicious dinner with my hubby.  I had the kimchee beef tofu & my husband had the tofu bimbimbap (mixed vegetables w/ rice) & tofu soup combo, both medium spicy.   The prices are very reasonable (under $10 for each entree) &  were very satisfied with the food.  No problems with servce here, the staff brought our entrees out real fast, tofu crocks piping hot...just the way we like it.  Everything was yummy.  Love the hours, open til 4am!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "UTZQhyE4d85CgnqB-I9Lxg", "review_id": "nazB8timLzluxvR8Vwh1Mg", "text": "$16.99 All you can eat korean bbq!! Beef tongue, brisket,  short ribs, pork belly, marinated chicken and pork. Dip it in your oil/salt/pepper sauce and eat it with rice....sooo good!! Don't forget to order some garlic to throw on the grill!!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2GTKZdBB-a7XXwf0JpkKXw", "review_id": "-hlcCgHAxlDRU8N5xZ6xcw", "text": "Been going to this place since I moved to Vegas 9 years ago and the quality of food is always consistently above average and never dissapoints no matter what I get.  However, the service gets progressively worse.  Its unreal how disconnected they seem to be with the customers.  There have been times myself or my friends would wave our hand in their face as they troll by zombie like and continue to the protection of their counter.  If you can get past the lack of customer service the food is always good.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2011-12-04", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "7mYn1u65oObJMs2gO8Blew", "review_id": "nM8APmfwmlyiyl0c3ngVsA", "text": "Do not be deceived by their name. They're called Tofu Hut, but have much more than tofu. They are a Korean Barbecue AYCE table-grill place. They have kalbi, short ribs, squid, pork, chicken, and many different side dishes. \n\nWe waited about 20 minutes for a table. That was the first good sign. Their service was a bit disservicing to us and themselves. They need a bit of a better system, but what can I say? I'm in Chinatown. It's just that they kept going back and forth for one thing at a time, so it takes a while for you to get things some times, thus the one-star off. \n\nThey have a really good soup like a Mae Won Ton, that was really yummy. Definitely try every single thing on the item list and bring tons of friends. That's the best way!\n\nI'll be back after I rally some more friends!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "BmOz1pJCrSTYE7ke9xbTkw", "review_id": "hiynjbqbVaUNnBxE42Qkiw", "text": "So delicious! Came here during a lay over at 11pm. Lots of good side dishes. \nI normally dont like meat, but the korean short ribs was so sweet and yummy that I finished the entire plate. \nSeafood tofu was a winner.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AJoyva4SnxZGDon3xK9GZg", "review_id": "2MZrK_JKc2U4HEK8q1iH7w", "text": "Had a random k-bbq craving the other day and decided to try tofu hut. It's been my go to place for Korean food, but my first time w their $16.99 ayce. \n\nStarted out rocky - it was half empty but we stood waiting to be seated for what felt like forever, while the frazzled server and busser both ignored us. There were a few other service issues to follow but sadly, authentic Asian places aren't known for great service. It is what it is. \n\nAnyway, food was great - decent selection of banchan (the sides), a surprisingly delish salad of romaine and cabbage mixed w a light dressing and I think kochujung sauce. We ordered bulgogi, kalbi short ribs, spicy chicken and spicy pork. The meat quality and marinade was really good, but I'm not a fan the marinade on pork and chicken. Both lacked flavor and the pork had really excessive fat and gristle. \n\nAlthough not included in ayce we got an order of the fried mandoo, which seemed to be homemade and a pretty generous portion. Also got the spicy tofu soup, which arrived boiling hot and yummy. Tried the steamed egg, which was incorrectly described as kind of a custard. It was more like a really fluffy omelette - seemed like a scrambled raw egg poured onto a little bit of boiling broth w green onion. Surprisingly good, must try.\n\nService was mediocre with just 1 poor guy running around and the busser girl who spoke no English - she just stared at us although I'm pretty sure coke is still coke in Spanish too. Things got better once one of the cooks came out to help wait tables, he was actually an awesome server. I'd suggest ordering everything at once while you have their attention, and you have to be pretty aggressive about flagging them down. \n\nSounds like a pretty bad experience, but it is probably my fav of the ayce k-bbq places over sura and woo che. Quality seemed better and a good selection of ban chan. The main negative compared to others is that they're not good about changing out the grill as the charred bits get stuck, but they probably would if you ask. And like with all k-bbq places, just be prepared to smell like Korean food the rest of the night.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2011-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yByiNgMZHLqBLqvj00rBaw", "review_id": "q8Upfa4vvYYjqL9eKCgmdg", "text": "Decided to have dinner at Tofu Hut tonight. Overall experience was not bad, but I wouldn't call it great either. \n\nThey were a bit short staffed when we first walked in. I would say it took them over 5 mins to even acknowledge our presence even though they did see us walk in.  I expected a \"Hello, or Welcome\" at the very least.\n\nWe passed on the AYCE tonight & went ala carte. We ordered short ribs & spicy chicken. Both orders were good, but nothing memorable or anything to rave about. I did love their banchan offerings! I liked the fish cake, japchae, spicy cucumber, and I don't recall the others but it was yummy!\n\nI would go back.. but don't think I'll be a regular at this place.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2012-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vieDmOtYYjr5VUNkk8EFUQ", "review_id": "URYWfFKpC_I4KJ0tqKXDhQ", "text": "Horrible. We ate at Tofu Hut on January 14, 2012. I have been to a lot of Korean BBQ restaurants, and I typicaly love the food and experience. but I have never had this poor of an experience. Side dishes were mediocre at best, out of date at worse, meat was rubbery, could hardly get it down. Service was THE WORSE I have EVER experienced at any restaurant, anywhere. Waitress showed up at the beginning and end of the meal to drop of the bill. Kids drop their utensil? Get up and ask for another. Need a napkin or chop-sticks? Get up and ask for it. Want something to drink besides water? Too bad, they didn't even offer- even after asking! Lots of other Korean BBQ in Las Vegas- go to any other- I have been to many- they are all better.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2012-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EZM_n63jjGHE6qPfyG-jiA", "review_id": "zU5MPepWcBaNKSi27_MUHg", "text": "Located across the street from Chinatown Mall, I first found this place cruising for late night asian food. I was delighted in finding a cheap all-you-can-eat Korean BBQ place in Vegas. That was 2 years ago.\n\nI went back to Tofu Hut over the weekend, after walking around all day at CES, I was starving (I refused to buy LV Convention food). I hopped on a bus to Tofu Hut salivating. When I got there, it seemed nothing had changed.\n\nGranted, I was not there on in the middle of the night (the price is cheaper than dinner), but I noticed the price had gone up a bit since I've been there. The cost of food has gone up so this was expected. We ordered the marinated sliced ribeye, the brisket, marinated pork belly, and shortribs.\n\nThe mariniated sliced ribeye was tasty, but lacking in quality. The brisket was super thin so it cooked fast. The marinated pork belly was a little spicy and delicious, but we got over it fairly quickly. Very fatty, but that's what pork belly is all about!\n\nThe short ribs were decent, a bit chewy, although I was quite full from the other meats, sides, and beer. And Soju. How could I forget the Soju? I was full and drunk at that point.\n\nThe sides were not memorable (except the big bowl of salad, which I confiscated for myself), and the service was ok. There seemed to be only one waitress running around the entire place.\n\nI have to say, while this isn't the best or cheapest Korean BBQ, it is a decent place to enjoy a meal with friends a little off the strip.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2012-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f4n24ZEQOnGzKKRbulzNSw", "review_id": "ea-5DYg9ljpM5GOEu1B0LA", "text": "This is one of my my go-to restaurants when I have visitors. Nuff said!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2012-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "0auxKhvcY_-4Uul5eiUWwA", "review_id": "K9vMPTgSpYaEO5fhetLSTg", "text": "I go for the delicious tofu soup.  \n\nI've never had Korean bbq here.  I stick to the late night, soul warming, boiling tofu and dumpling soup.  \n\nIt is cheap and filling and comes with all the fun little side dishes; banchan.\n\nThe broth is  rapidly boiling, chile laden and filled with chunks of silky tofu and beef dumplings.  They crack an egg into the little cauldron and you stir it up and enjoy.  It is also served with a bowl of rice.  The portion is good for 1 1/2 meals. All for around $8.  Every time, I request it spicy, and every time, it is not.  \n\nThey are open late so it is a good joint for late night comfort soup.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2012-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r9WaI1XRjdwJzCe6gGdS-w", "review_id": "zski9hf84XIVTsD4Rkq9Sw", "text": "the all you can eat korean bbq is pretty damn good, just don't get the soup, it's extremely salty.  the egg, however, is awesome!\n\ndidn't order the stuff from the menu, will try next time.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-01-20", "type": "review"}
{"votes": {"funny": 1, "useful": 6, "cool": 2}, "user_id": "aAsxorMmHDNmZfx43h2rEA", "review_id": "eU5hG7Uk4lnk2usANi6DHA", "text": "Yay! I finally found a place to get some vegan Korean tofu soup!  You have to specially request that your sundubu be made with \"just water\" and no egg, but you'll get it.  Order it spicy (4 or 5) and it's plenty flavorful, even with a water base.  \n\nWe also got some japchae (the yam noodles) with veggies, which was a greasy pile of goodness, and some questionable banchan.... never can confirm for sure if the kimchee has fish or not.  Anyway, one of the sides was delish (the pancake), the other vegan ones were just OK.  Love the little salad with a simple dressing, wish we'd gotten a giant bowl of that.  \n\nAll in all, this will be my go-to for tofu soup on a dreary day.  Just beware hidden fish!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JmhOCOQRq8Gwp6sTFMeNYw", "review_id": "oPiAYGoQ3M5VDAEJpTewrA", "text": "I went to this place for the first time and I will definitely be back. \nI lived in Seoul for 3 months and really missed eating the food. I'm not really into Korean BBQ but I hear its great. I Love the traditional daily Korean menu. \n\nThe waiter was awesome, I was torn between tofu soup and Bibimbap, but he pointed out that bibimbap comes with tofu soup and its only like a buck more? it was perfect. With all those little banchan/kimchi dishes that they bring out I was beyond stuffed but it was the good kind of stuffed. \n\nI'll be back for sure. \n\nalso suggestion: kimbap rolls to go would be sweet!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "E0ztmyXb3pcVABNqBmURVQ", "review_id": "ey9u6rA9mSwLEN-FQ79yjA", "text": "I stopped in on Sunday for some Sundubu, so I can't comment on the BBQ. \n\nThe Banchan was good, and the service was quick.  I especially like the egg being cracked into my scalding hot soup by the server, it was dinner and a show. \n\nMy qualm is that I noticed something gritty in my Beef and Kimchi Sundubu.  It tasted fine, but the crunch was an unwelcomed surprise.  \n\nI would come back to try the BBQ, but there's better tofu soup in the area.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2012-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5rOvmCY6FOD23snowl5e5g", "review_id": "spebn_lHinsh-6JlFXyjAw", "text": "I love the steamed egg, beef tongue and short ribs!!! The servers here are really friendly! I  love all the side dishes as well. There are alot to ayce korean places in las vegas to eat at, this is got to be in the top five.....", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2012-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d8ecOIhT0_oD2uG5RrW0yQ", "review_id": "nhW2vxvxOtzQwXTwSNBw-Q", "text": "LOVE this place! Def my #1 place to fix my kbbq cravings. But the only thing is, its hard to flag someone down for water or to order extras when everyone is in the back. Although, everyone is always so nice, so it doesn't bother me so much. And they'll always keep me coming back for more.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uzIrx4Mf1PvQIoRcCWFCvg", "review_id": "OZ2gpuXhhGynwy9d4v-WAw", "text": "Love Tofu Hut and always have. It's so good that I haven't bothered checking out any other jigae places around Spring Mountain. The location is fairly easy to get to (right off of the freeway) and it is close to anything Chinatown that you'd want to go to after - groceries, boba, Karaoke. \n\nI always order the Tofu soup medium and it is delicious. Very flavorful, and filling, too, since it comes with banchan and rice. I've been there with others, however, that order the ayce and it is always great as well (I manage to sneak a few bites when they aren't looking). The best part has to be the cabbage mix salad that comes with the ayce. You're supposed to eat it with the meat and it is SO GOOD!! The ayce servings are big, and they require a minimum of two people ordering to get it, because otherwise, you'd get full off of one serving. It's best to go after 11pm when the prices change to get the best value. \n\nMy only complaint would be the service. I don't know if management changed or what, but my favorite people there weren't working the last few times I've been, and honestly, they were better than who works there now. They also seemed to get rid of \"stone-pot\" rice, which is sad because it was almost better than the jigae itself. \n\nIf you're in the mood for Korean, you definitely have to check this place out. It is my spot -  I try to go at least once a month. It is cheap, satisfying, and authentic. Make sure to come on an empty stomach!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2012-02-15", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "sLxyYIYCorS-pTtUU4VLuw", "review_id": "UfkVTDLFohdyqollGpwdWg", "text": "Service: 0/5 Wasn't the most welcoming that's for sure. When I walked in I stood in the door way/waiting area for like 5 minutes as I waited and stared at each employee of this place idk maybe because I wasn't Korean I wasn't getting the best service at the door. Finally we got seated, I felt rushed by my waitress and trust me after she dropped off our dishes that was the last time I saw her. She never came back to refill our waters or anything. Flagging someone down just to pay the bill was also an issue no one paid attention to us. \n\nKim Chi Beef: 3/5  I liked their Kim Chi beef but it doesn't compare to other places I've tried. A bit mediocre it was very watery and salty. I had huge chunks of Kim Chi which I liked but I had no idea where he \"beef\" was. I'm guessing it had to be some sort of ground beef. The tofu was cooked perfect though not too soft not to hard\n\nSeafood Beef: 2/5  My boyfriend got this dish because he loves sea food in this Tofu, but omg super salty it tasted to bland not even tasty. There was barely any sea food in his the only thing I could recall were scallops and they tasted like imitation scallops. The tofu was cooked perfect though not too soft not to hard\n\nSide dishes: 2/5 I actually really liked their assortment of side dishes but our waitress was never around to refill them. I was pretty disappointed.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2012-02-22", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 3}, "user_id": "HkOZSO6pN7u5NG7yjEyvww", "review_id": "zLqaoy1P5IyoFHEwzys7vA", "text": "Came in on a Friday afternoon. Surprisingly quiet and empty, immediately greeted and sat. Tofu Hut does not have a special interior design. It's located next to a car shop garage and some other smaller businesses across from the Chinatown strip mall, but it is nothing that is run down or hole in the wall. I am not aware of the peak hours at Tofu Hut, but I will tell you the restaurant is quite small in space and seating.\n\nI am actually not too much into meat in general (sounds crazy for me even coming here, right?) but they have a wonderful vegetable buckwheat cold noodle dish that's extremely big and extremely filling. My friends ordered the awesome all you can eat Korean BBQ. This place has probably one of the best all you can eats near Chinatown: refillable salad bowls, tasty cuts of ribeye, beef, and chicken, and amongst other side dishes of kimchi and noodle you can order.\n\nGiving this place a four because it's such a deal breaker for finding a good all you can eat with quality food to a cultural level other than the redundant buffets found in Vegas. I would just recommend getting to know the times that are the least busiest so you won't have to wait for the already limited seating they have.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-12-01", "type": "review"}
{"votes": {"funny": 9, "useful": 20, "cool": 13}, "user_id": "yNxdgWJoCwg3cdO-N03nhQ", "review_id": "1HO6njj1p5Wwy_B6BLZ3eg", "text": "I'm at tofu hut on a weekly basis and i'm surprised i havent gotten sick of this place!!! My BF & I mostly go during happy hour (after 10pm) and our orders usually consist of : brisket, regular pork belly, ribeye and marinated pork belly. My top fave is not included during happy hr and u have to pay extra (Short ribs). I noticed a decline in their marinated pork belly. I noticed during the last several visits, most of the meat is fat. Brisket comes in different thickness/length with each order, but still tastes the same. (Pls keep it long & thick!....\"that's what she said....\")..When we first started coming here, we didnt know if what they gave us was brisket or tongue coz it ALWAYS looked so different every time they brought it out....I am a HUGE fan of their salad...so flavorful! i'm not a big salad girl and this is a definite must have every time i eat here..My bf loves their korean pancakes and i am a fan of the japchae. Overall, good banchan.  Our servers are usually the same 2 guys at night and they are both so friendly, attentive and hard workers! \n\nThis and Sura are my faves for Korean bbq...Honey Pig wasnt bad either!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "CbY45zEM2jdopLOoUkOL8Q", "review_id": "E72C4wxhCtcqGUVh9D5iag", "text": "Pretty meh.\n\nThe tofu soup was good, but the banchan and rice was barely passable. Nothing tasted right except for the kimchee in the banchan. The rice tasted extremely chewy and watery. Towards the end I stopped eating my rice altogether and just finished the soup. Thankfully, the soup is tasty; I had the combination tofu dish that has slices of meat as well as seafood. I wish there was a little more seafood in the soup but it's not too bad.\n\nNot a huge fan but willing to give it another shot in the future.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2012-12-25", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "1wSDrzQAOg9RNsZFJ2UNuQ", "review_id": "_JPzzPE9i4jo04a1xZpQrQ", "text": "I used to be a big fan of this place even before they went AYCE. The spark that used to burn bright in this restaurant must be going out. \n\nMe and the woman decide for lunch at The Hut. Usually when leaving an AYCE Korean BBQ, satisfaction is usually the attitude that I feel in my gut. I think Tofu Hut needs to up their game. \n\n The sides were up to par. The salad came pretty late.  Brisket was on point. The pork belly, which I am a big fan of, was looking pretty slim. Usually the pork belly is in thick crazy cuts. This time around, not so thick. We didn't get the usual seconds on the belly. So we stuck to the brisket.  \n\nThere is some tough competition out there in AYCE Korean BBQ. Maybe this was an off day for The Hut. I haven't given up on them. Will try again just to make sure.\n\nI really want to lika chu peoples...", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2012-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VthTon28zXlj9y9yH2n_YA", "review_id": "9U5HC56xij1fWu3_uqfMXw", "text": "This review is SOLELY for the late night special: After 10PM AYCE is $13.99 -everyday\n\n1) Expect to wait anytime after 10pm especially if you are in a large group. \n2) Brisket and beef tongue are bomb. my two favorites. \n3) Make your own dipping sauce of half vinegar and half soy sauce-mix with the sesame oil they give you also. YUM! \n4) Ask for the salad. \n\nUsually there is one main asian guy running the joint, and man, is he FAST. I've gone when he wasn't there and was replaced with 3 different workers. They were so slow I left still kind of hungry.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2013-01-11", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "W769leHuV8lNaLJhbw6MyA", "review_id": "EAvifMP62L6Pcrlxl7Id_w", "text": "BLEH!!!!!! This place ain't what it used to be.\n\nI'm sure no actual Korean people come and eat here. At least for sundubu that is. It tasted bland, there were no good flavors, the banchan was horrible. What a lifeless drab of a meal. On top of that, the bill wasn't even that affordable.\n\nI think they're just kept busy because of tradition. This is one of the oldest Korean tofu houses in Las Vegas, and people have come to recognize it. PEOPLE --- I implore you to expand your horizons and venture to new places. Try Mr. Tofu literally across the street. That'll be a step in the right direction.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2013-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uz5dEjeSCQ7Zbgn32D01-g", "review_id": "DbGKHMAUQTKMJXwY6eO0NA", "text": "Really good.  A little loud. Service was fast and efficient.  Meat was yummy yummy yummy. We got pork belly, chicken, short ribs and prime rib I think.  Salad they give you with the order is delish and the price $16.99 all you can eat is awesome.  We got four meats and we were stuffed and satisfied.  I recommend this place. :)", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4kpXQ--YssFbG5hi5GbleQ", "review_id": "_ZaNjrSZbXP0ihPDWGgrtg", "text": "I kept hearing so many people talk about this place so on Valentine's Day, my boyfriend and I decided to check this place out after the gym. We went around 12:30am-1am and much to our delight, we found out that they have a daily deal from 10pm-2am, their korean bbq is $13! It was delicious and we enjoyed ourselves very much and it helped save our Valentine's Day! \n\nWe will definitely be going back again. \nThe only con is that the amount of tables for korean bbq only fill half the room. The other half is regular tables for their restaurant food. They need more grill tables! So they won't have to make so many people wait to get BBQ.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-02-18", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "qxDyQkuMR1x1_cTNRNUH7w", "review_id": "YbL5O3tHUfIdIUV9FvSpxw", "text": "Korean BBQ in Vegas isn't anywhere close to Korean BBQ in SoCal. For real. But you get what you can get and Tofu Hut is the place to get your Korean BBQ fix for a decent price.\n\nDuring their regular hours AYCE is $16.99, while late night (10 PM - 3 AM) is priced at $13.99. Not too shabby, considering you can get as much meat as you want. They offer a good variety - brisket, bulgogi (marinated beef), thick pork belly slices, tripe, squid, beef tongue and a few others. I'm a fan of the brisket, personally. You can't go wrong with ultra thin slices of beef dipped in their sesame oil/pepper sauce! The marinade on the bulgogi is decent, nothing to rave about. The pork belly is pretty fatty, just a warning. \n\nSide dishes are just as important to a Korean BBQ meal as the meat itself. There wasn't a lot of side dishes - kimchi, spicy cucumbers, japchae (stir-fried vermicelli noodles), fishcakes, steamed egg and a pre-dressed salad (essential for any Korean BBQ meal). This may sound like a lot, but really good BBQ places offer a lot more, probably twice as much. I was longing for some bean paste, maybe some garlic and jalapenos. Perhaps I'm asking for too much. After all, you get what you pay for. \n\nSo why the name 'Tofu Hut' when this place is popular for their Korean BBQ? Before the BBQ times, they once strictly sold a variety of soondubu (soft tofu stew). You can get this from not-so-spicy at all to ultra spicy, all depends on your taste buds. They still have this here and are decently priced. But why spend a near ten bucks on a mediocre soondubu dish if you can pay a few dollars more and eat like a king?", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2013-02-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "yRubqnQy4ExPYTel7KsNog", "review_id": "Q7fohUbJQXRVbiBcDEeZ9w", "text": "Ah KBBQ - I almost didn't believe it when a friend described it as \"all you can eat meat buffett\" but it was true, and a dream come true!\n\nThere are a couple AYCE KBBQ here in town, most right up in Chinatown on Spring Mtn. For the most part there are same, with some slight variations. Tofu Hut is one my favorite though.\n\nTofu is set-up where they bring the meet to you. Its a small place so there really isn't much room for you to actually go up and get the food yourself. This of course puts you at the mercy of the wait staff. But usually their service is on point and there isn't much of a delay in getting what you want.\n\nThe prices are pretty cheap when compared to some of the other KBBQ joints. AYCE is $17, and they knock off $4 after 10pm. They have the full of assortment of Korean meats: brisket, bulgogi, pork belly, squid, beef tongue, and the like. I absolutely love the Kalbi, its delicious as is the steamed egg. (I have been calling it egg soup and no one has ever bothered to correct me).\n\nDespite the name Tofu.. this place is anything but it. Overall a above average KBBQ spot and a great value.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "n02dxfgovFw3fSZEoVGYTg", "review_id": "FzIicdQ_cfzu9g8_SN7UiQ", "text": "Came here for all you can eat Korean BBQ and we were not too impressed.\n\nThe location is in the Chinatown area off of Spring Mountain. Parking lot is on the side of the restaurant and there is amble spaces.\n\nThe restaurant itself was not busy when we arrived but it was when we left. I don't think this location is worth a wait for Korean BBQ due to not enough tables with a grill and service lacked.\n\nCame here with a group of three. Prices were typical for all you can eat.\n\nThey do not have teriyaki sauce\nThey do not have any iced tea.\n\nThe meats were marinated pretty good and decent quality too.\n\nService was not the best for us.\n\nThis was our first visit here and I think we will be trying different Korean BBQ restaurants before we come back to this place again.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2013-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OAe9UovjjCk5oG-UzJQIFQ", "review_id": "dm9ucU8s65XYlEdHRBuh3w", "text": "In my opinion, the food here isn't that good, sometimes even bland. But to me, this isn't that place where you come here expecting great food and service. You come here when you just finished partying and it's 12:47 at night, you come here when your friend is feeling bummed out and you want to treat him, or just to catch up with a group of friends you haven't seen in awhile. It's that type of place. \n\nThey just recently remodeled to some more modern furniture so that's pretty nice to see. The place is located on spring mountain right off the i-15 it can be really easy to miss so just keep your eye out. \n\nIf you come here on during the day you should have no problem finding a table. But coming in at night is a different story. Expect a min. of a 40 minute wait. And no you can't make reservations haha.\n\nThe service here can be very different at times. But lately they have been on top of it. Sometimes you have to raise your hand to be get some attention. Don't expect top notch service.\n\nWaiting for food isn't a problem, when you order they usually get it out within a few minutes. Top priorities should be bulgogi, pork belly, and brisket. They don't have it on their menu but you can ask for rice! For the taste, nothing is really note worthy all just average tasting food.\n\nPRO TIP! Call in to see how long their wait is, if it's too long for you just go to another place to eat. Instead of being surprise when you get there and saying what a waste of gas it was too come.\n\nIf I could change something about this place I wish they would just expand their place already! The waits are too dam long.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NPHMQrrMpUsDKkAEjCRBWg", "review_id": "-r2AxS_Qm6ENw7jbSk-LPA", "text": "This ayce bbq place is average. Good price for good food, nothing great. The bulgolgi could have had more flavor. Service was ok but since it was busy it was hard to flag down the two servers when we needed things. \n\nThe AYCE is $18.30 per person with tax \n\nI did see that they did have a special AYCE  price after 10pm for $13something", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2013-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WnsPLkIKlGvp4h7OdTEskg", "review_id": "mwuvitV0jRN5VgArEQ65ww", "text": "I believe I have found my new Korean BBQ place in Tofu Hut. The simplicity of this place makes this an enjoyable place for me and whoever I come to this place with.\n\nThe dinner price is about $17 bucks and includes all the items on the all you can eat menu and about $14 after 10 P.M. The extra items you get for the extra three dollars are the short ribs and the steamed eggs. The short ribs I would say is well worth it because that is my favorite meat on the menu personally. The egg is good as well, but it's not as special as the short ribs. I do really enjoy the bulgogi (marinated sliced ribeye), the brisket, and the short rib the most, but the pork belly and chicken thigh are good as well. The meats have been fresh every time I have visited and so I haven't had any problems there. The rest of the food are served with various side dishes and you can ask for that, as well as salad and rice when you run out of those things. \n\nThe service is adequate, but sometimes it feels like they see your hand, but they just ignore you just cause. They do bring you your meat and whatever else you ask for in due time. The food is good, and the only way the food sucks is if you suck at cooking, so don't suck at cooking. I recommend this place for anyone that wants to get a Korean BBQ fix in the area, especially late night.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-12-25", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 3}, "user_id": "OaFcpi3W4AwxrD8W2pgC_A", "review_id": "2aJrVCufjMMCyRTRb_wFJw", "text": "The good thing about Tofu Hut is that you can get a cheap meal late at night. $14 from 10pm-2am or $17 any other time. \n\nMy friends and I had dinner and drinks prior to coming here. There was no other reason for us to be here other than we were craving Korean BBQ. I can eat pretty much every hour since I'm always hungry. There were some empty tables at 1am which is why it didn't make sense to me to have to wait for a table. There were 2 guys before us waiting for a table.\n\nWe got our ban chan which were pretty tasty. But their meat selections were pretty limited. We got the marinated rib eye, pork belly and brisket. There's an AYCE Korean BBQ place that has rib eye not too far away from TH and I like theirs better. So, I was a bit disappointed with TH's rib eye...it wasn't tasty for being marinated and it's not that tender. You can't go wrong with brisket since it's super quick to cook and it's good stuff. Pork belly - we kept ordering this. They have a limit of 4 orders and at least 2 people need to do AYCE. You mean, if I sleep eat they won't serve me anything? Well, booooo!!!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2013-12-26", "type": "review"}
{"votes": {"funny": 4, "useful": 4, "cool": 3}, "user_id": "ucKJFC8_cVK0NbW5uk4xTQ", "review_id": "7RfR-f-DFo71zeBU9itOzA", "text": "Fact: if you have upwards of 18 tables in your dining room and 2 servers, one of whom is manning the cash register, you DO NOT need to be Asian to do the math that this is not enough people to manage the operation. \n\nI came in right before Christmas with the fam bam because nothing says \"holiday cheer\" like a hot bowl of tofu. Of all the tofu premises around Vegas we usually frequent Tofu Hut for the below: \n+ Consistency\n+ Flavor\n+ Prices (& lunch specials M-F, excluding holidays)\n\nHere are the things you will have to wait for: \n- Seating\n- Ban chan\n- Water. Hot tea. Beverages in general.\n- Having your order taken.\n- Your check. \n\nSo another math lesson: 3 pros for 5 cons is muy malo. However, when your pros outweigh the cons, what can you do but come back for what is otherwise a solid tofu fixing? If you can't beat 'em, join 'em.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2013-12-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "scT0mhdGmoaKrC-Q7WlcfQ", "review_id": "lKpXtXf7mvHAcwlUCApLAQ", "text": "$13.99 after 10pm & it's worth it! (10pm-2am) [[$16.99 Anytime]]\n\nWent with a few friends (4 of us), each paid $15 -no tip added to final price- but still had to tip a few bucks as I work in the tip business.\n\n90 minutes to eat and I have no problem with that because I was waiting for an open table for awhile before I got to sit.\n\nCONS: With the amount of people serving tables. It is a wait just to get your next plate and sometimes had to remind them for the next round.\n\nStill a place I would eat if I was hungry late at night.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-01-04", "type": "review"}
{"votes": {"funny": 3, "useful": 8, "cool": 6}, "user_id": "kSVYpNWA19wUplbdi0U0Uw", "review_id": "bFFMu4O6t0fORz3aVLS4CA", "text": "Yeah, I would say \"Hut\" is a good word to describe this place. It is kind of small for being a Korean Barbeque joint. \n\nHere's the deal. When you first come in, the left half of the restaurant is designated for AYCE while the right half is for a la carte. Make sure to sign in so you can have your place in line. Don't forget to include the time you signed in along with the number in your party.\n\nI would say you got room for about 48 people total in the whole restaurant. So on really busy days, you just might be waiting a while to sit down.\n\nThe day I went, we had total of 16 for our party. Surprisingly, we were seated after waiting about 30 minutes. Not bad for a party of our size.\n\nSo here's the low down if AYCE is your option.\n- You need a minimum of two people to pick this option so if you are going solo, then a la carte is your only option.\n- $16.99 per person any time. $13.99 from 10 pm to 2 am.\n- No to go or take home. (Duh!)\n- Don't be afraid to ask for refills on any of your sides because there is no extra charge.\n- You must eat all the meat that you order or you will be charged extra.\n\nAs for the meats, I was pleasantly surprised, especially the marinated items like brisket, ribeye, and pork. The sides were good as well from the kimchi all the way to the salad, which is very solid. The salad itself I can eat all day.\n\nService was fast and furious, which would of made Paul Walker proud (may he Rest In Peace) for our party was eating like there was no tomorrow. I was impressed because not only did they keep up with our demands, but all our waters were constantly refilled. \n\nSo TH, I will definitely mention you if anybody asks about ACYE Korean Barbeque.\n\nYelp 2014 365 Review Challenge #5", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hW7-T7GLJ5DT9tOzwKQBMg", "review_id": "BOSjNL14limKGzMQs2UQiw", "text": "My only qualm is that it isn't open 24 hours!\nThe salad is great, the sides are amazing, the meat is tasty and fresh, the service is fast!\nI feel as they need to expand because there are never enough tables.\nI usually order 4 orders of the marinated ribeye, 1 order or the beef tongue, and one order of the brisket.\nThe price is more affordable then most places also.\n$13.99 after 10. $16.99 any other time.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2014-01-06", "type": "review"}
{"votes": {"funny": 21, "useful": 20, "cool": 21}, "user_id": "KyIPG6zBQj9Jqgl69tHtNQ", "review_id": "V9QPEG02FLutdEXdXVy6nw", "text": "If you are look for a good place to eat at Vegas and it is after 10:00PM this is the place to go. You would want to come with an empty stomach since this place is a All You Can Eat Korean BBQ. I dare you to come out of this place not smelling like Korean BBQ. So if you plan to go to a party after you might wanna bring a change of clothes. If this is your first time trying Korean BBQ let me tell you that the smell will linger on your clothes and hair. \n\nThis is an AYCE location starting at 10:00pm-2:00am and it only cost $18-20 depending on the tipping amount. This is a great deal since NYC prices are outrageous of this type of food. Along with the Korean BBQ meat that you order it comes with Banchan. Banchan are small tradition Korean side dishes such as kimchee, bean sprout, fish cake, pancake etc. If these dishes run out you can always ask for more. I am used to my basket of fresh lettuce but instead they served chop lettuce with some dressing. This is a complete shock to me, maybe the basket of fresh lettuce is a NYC thing. The basket of fresh lettuce here is served like a salad with a fresh sesame dressing. \n\nI will recommend  this brisket, marinated pork belly and sliced sliced rib-eye. I will stay away from the squid because it comes really elastic when it is cooked. The marinated pork belly was my favorite because it comes with so much favor. Keep in mind that this place does not change the Korean BBQ grill. Since the pork belly is marinated the grill turns black quicker and they will not replace it until you finish the dinner. \n\nThe restaurant is split into two parts. When you walk in the left side is for Korean BBQ quest. They have 6 tables that can seat 4 people each and 3 long table that can hold at least 8 individuals. The right side are for guest who do not want to eat Korean BBQ but just want Korean food. \n\nThe only reason this place lost a star is because of service and the wait. I came at 10:03pm and had to wait for an hour to get seated. The service is slow and they seem like zombies. When the table before us finish eating it took 10 minutes to clean the table and when the table was clean the waitress did not call us until another 10 minutes has passed. So the turn around rate for the table is around 20 minutes because they lack the help. Since only two people are working it takes a lot longer for wait and the meat to come out. If they hired more help this place would have earn five stars. \n\nHint: When you walk in place your name, time you came in and number in your party on that sheet of paper near the door. This place get pack after 10:15pm!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dUAFgAWQkKqZxX7q16IFoA", "review_id": "oy0EVLjMy4kmeHFVHUJxRA", "text": "Nice price for ayce korean bbq.  Small little shop with good list of cuts to choose from.\n\nI first discovered this place with my friend since we haven't found a decent ayce bbq place.  First attraction was the price.  Two different prices they have to offer and I prefer to go late night.  \n\nA lot of people like the marination meats, but I prefer simple fast cooking meats.  Load up on brisket and sliced rib.  Easy to cook and easy to see if they are cooked properly.  Don't want to consume undercooked meat.  I enjoyed the service here, very fast pace and on top of bringing us what we asked for.  I did try the intestines, but no taste.  Very hard to swallow.  The condiments that they offer is wonderful, always like the steamed egg.  I didn't enjoy the bean soup very much, not too much flavor.  \n\nPlace gets very packed so coming early is recommended.  There is a menu selection that folks can choose instead of doing ayce.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-01-22", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "EQXgqA7jGO81EoPImGFexQ", "review_id": "p9iPVhq5WLczJstdJOU4mQ", "text": "Been going here for years! AYCE Korean BBQ for decent price! Lots of sides and  varieties of meats to choose from!\n\nPlace is ALWAYS so packed! Especially dinner time and later! They're open til 3am.. Sometimes they close earlier.. So this is the place to eat at if you're trying to sober up! ;)\n\nBrisket, pork belly and steamed egg are my favorite!! \n\nOne bad thing about this place is service could be more consistent..", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "Tt88fGVlVMTGyQptdj4CBA", "review_id": "O4IghYv23z4kjS-7I8V38A", "text": "I love tofu hut.\n\nI've been here many times.\n\nOverall it is my favorite AYCE KBBQ place.\n\nThey have my favorite kimchi and salad ban chan.\n\nTheir decor, Service, and meat is actually improving. Although they offer a late night special on AYCE the best meat isn't offered so go for the $16.99 option.\n\nMy one gripe is the service is really lacking.\nThey don't come around much, they hardly refill drinks, they hardly bring around napkins, they don't seem to like when you request a banchan refill. That last part is most annoying. I admit it is a hit or miss. It really just depends on the time and who is working.\n\nI first noticed this annoyance when dining at Sura. They are buffet style yet their servers come come around so much! They refill and check on you more than Tofu Hut and that is just disappointing for Tofu Hut.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ppLbcdyGy5yqOecg350ieQ", "review_id": "qIsmsjyFDeDPbu6OaI20ew", "text": "Nice place to go always busy. I was craving kalbi and tofu soup so I went here. They have great combination and I was so excited . After all it was Chinese New year. The waiter and waitress was attentive too. Their side dishes  were awesome. I asked and exchanged one of my side dish  and they said, Ok. I was happy and I had a great lunch.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mzOcI330IJLiHj_AquvZqg", "review_id": "R74RtCM3dOEBSlPK-F03Vg", "text": "This is my go to place for kbbq. I mean it's probably the cheapest in town. Also, after 10pm it's only $15. That's $3 cheaper than it normally is. \n\nI usually get brisket, pork belly, and beef tongue. They're all so good and they go well with the free side dishes that you get with your meal! This place is usually always packed with a long wait after 10 PM so watch out!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_s2FXfShj36gDbqBtU7PBA", "review_id": "NQa-AqhRletKoC75V3qtCg", "text": "Cheap AYCE kbbq? I'm sold. I usually come here after 10 for the late night special ($15 per person). Be warned the wait can be very very long but it is definitely worth it.\n\nI love their brisket, pork belly, and beef tongue. Sometimes I get a plate of marinated rib eye or marinated pork belly, but I generally stick to the brisket.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j1giswp7DH6xanpCflrLxA", "review_id": "NGyIzx3UFvjRBeDVAex6GQ", "text": "The short rib was so greaaaat! Try the spicy chicken as well. The tofu was so-so. I came around 7 pm for dinner and just had to wait for 5 mins to seat. Overall, it's highly recommended!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MR1X9tO3YsYfsF9lY4nOQQ", "review_id": "QOiLzRVIyFNmXEQPcOz-iA", "text": "This was my first korean bbq experience and I wasnt blown away, but I also wasnt dissapointed. It is a great value for the all you can eat! My favorite was the marinated rib-eye, it had great flavor.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2014-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k8zh893FC07uFif52JMjug", "review_id": "aBHn8N7VnDViSecpPxQiRQ", "text": "Took my kids here for an early dinner and their first try at Korean BBQ.  \n\nWe had the AYCE for $16.99 and ordered the short ribs, brisket, marinated pork belly, and rib eye.  \n\nWe had no wait, probably because it was only 4:15 when we got there.  By the time we left a line was starting to form.\n\nThe grills and tables were clean.  The vent did an okay job at pulling the smoke away but we still walked out smelling of BBQ.  Not a bad thing really.  \n\nThe portions were just right.  I was worried because the service was ... lackluster to say the least.  So I didn't want to be waiting forever for each round of meat.  \n\nThe meats were tasty, tender, and flavorful.  My younger son thought some of the banchan and the marinated pork belly was too spicy but he that is normal.\n\nAll in all, we'll be back.  Just wish the service was better about refilling drinks, taking away empty plates, etc.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "KOI1cDE5lZsv-kCOYLlzLA", "review_id": "pmA5KlCNt0QjPC-L9S34cw", "text": "I honestly love love Korean Barbecue. It is my absolute favorite thing to do! Tofu hut is a great place to get KBBQ. I love this place. The meat is great, the marination is a little sweet but Americans would love them. The meat that they give you is frozen. Like they had a frozen block of meat and cut them right before they give it to you so the meat is frozen when they bring it to you. \nThe salad is great, a little salty but still good. A long with the kimchi, salty but good. Their other sides are pretty good as well. I love love the pickled cucumber.\nAnd I don't know if it's an Asian thing or it's just them but they're very \"not attentive\" if that makes sense. Like they could careless about their customers. Every time we asked for something, they always give us this \"ugh, again?\" face. I'm Asian myself and I've worked with a lot of customers but I would never do that. They're stingy and doesn't want to give you the food. I had to order brisket and beef tongue like 3 times before I got them. If they were busy I would understand but no one was there. They just seemed very careless. \nFood quality wise, it's very good and delicious. \nCustomer service wise, it was pretty bad. \nThey charged us the 18% gratuity and there was only 4 of us in our party so that's another thing. I don't mind tipping at all, I really don't. I do it according to the service that was provided but the service was pretty bad. \nUsually I give more then 18% but since they want just 18% I just let them. \nIf you're looking for good food and don't care about service, I say go for it! \nIf you want service and don't want to cook your own food, I say pass.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2014-12-11", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 3}, "user_id": "Q_TtZmZQCKrkRzKmxKAQvg", "review_id": "Yl9seiI6_5XxMREIr7NVwg", "text": "The food is okay. Gave it 2 star cause they have a late night happy hour and it's all you can eat or than that, the services sucks, not enough grills so wait time for a table is forever. Waiting seats are not comfortable, bathrooms are gross, parking sucks & over all I don't recommend this place.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2014-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "IlaDHSriYs2gL64nDw_1GA", "review_id": "QPWociVFmp1V6f9ig5Zzzg", "text": "I love the place. One of the best AYCE restaurants in town. We go there so often as the meat was good with a great price, $16.99 per person. We tried everything in the menu but we now only order the beef tongue, pork belly, squid, kalbi and the steam egg which we like the most. The salad and the other sides were pretty good as well. \nI think they offer $13.99 per person after 9 pm, but for this price you can't get the kalbi and steam egg.\nTheir place was small, you may have to wait if you get in during the dinner time.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2014-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "AUR1dcWPSnqsQ6Mz_ncODg", "review_id": "Sqv3OmVSOu0uIAajo6biyw", "text": "A nice show stopper restaurant to take family and friends (to impress) where you grill your own food. Food was amazing (it does help if someone in you party knows how to cook meat...if not it will definitely be a learning experience for you). All you can eat and over all a good place. Only recommendation is if your traveling in a big party, arrive early. We were a party of 7, so we waited a bit for a table. Also (if traveling in a big party), apparently gratuity was included in our bill without the server informing us or indicating on the bill...just a heads up if you don't want to double tip", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2014-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "wzSVbULQNV5LxafPmHYKUA", "review_id": "NVlttUgQ7mudoWn6Fbty9A", "text": "This place was dirty. Service was lousy. Food was alright. I've had better KBB. The only reason I'm giving a 3-star is because I don't speak Korean (which you honestly need to, to communicate with the employees), so I can't fairly judge the customer service.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2014-12-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "kYcYAWwQ0_JgRfFlXOujsA", "review_id": "JzBa7cw32D_gKCBSpL74fA", "text": "I had an absolutely wonderful time and a lovely meal last night at tofu hut. It was an interactive, authentic Korean BBQ experience. The short rib is well worth the additional charge, and with the tab for my party of 3 closing under $54, the reasonable prices cannot be matched either. If you are going for the AYCE, I suggest arriving early, as there was a bit of a wait. The wait, however, was well worth it and I will certainly recommend tofu hut as a legitimate establishment to get your Korean BBQ fix.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2014-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "HFyLGmjI4xf_gwCIUvr4rA", "review_id": "UnKc8Urdp9lA9z5qgreP9A", "text": "yeah, no thanks. Never again. I came here a couple months ago to wait for 1 1/2 hours and STILL not be seated. We ended up going to Sura.  Meanwhile, people who signed in after me got seated because of the number in my party (6). Im sorry but seriously? How do you expect to run a place that has like 5 cooking tables (the rest are for a la carte, but no one wants that)... and not expect hungry-angry waiting customers?  Well, I forgave this incident and came back another time thinking it'd be different. Yeeeeaah, NO. Waited for almost 2 hours! We sat at an empty table and were luckily able to at least order drinks, but still! They had forgotten us!  After this I'm never coming back. Oh and when we finally got seated? HORRIBLE and SLOW (can i bold the word SLOW) service! It's no wonder they aren't able to turn their tables fast enough!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2015-01-02", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "WZwfmfP5X1gDDeL-M9vzZA", "review_id": "cavPMkKSVi3hEXSX_d71fw", "text": "I had been here a couple times in the past, but it had been a couple years, mainly due to the recent health issues they were having around 2013 but decided to give it another try so I came here last month with Rachel S, Stephanie K and Michael K. It was a Friday night and when we arrived, there was a 30-40 min wait! Wow, I've never seen it so packed! I guess people weren't concerned about their health violations anymore which was a good sign to me. \n\nOnce we sat down we ordered a bunch of food including: marinated short ribs (kalbi), spicy pork, pork belly, marinated pork belly, marinated rib eye (bulgogi), beef tongue, and steamed egg. We were also brought a big house salad, rice, and banchan dishes while we waited for our meat. The banchan was ok and I really only liked the kimchi. The salad was surprisingly very tasty and I actually wanted more! The salad and banchan are refillable so don't be shy! It's all you can eat!\n\nAs usual, my favorite meat was the pork belly! It was basically just sliced pork belly but it was great with the salt/pepper/oil sauce mixture they give you. The kalbi and bulgogi were good too but the thing I kept wanting more of was the pork belly! I also couldn't get enough of the sauce even though it was so simple. Goes to show that sometimes the best things in life are the simple things! The steamed egg was also awesome and I could've eaten multple bowls! My least favorite was the marinated pork belly which looked mushy and was chewy and not like pork belly at all...\n\nThe grills were ok, just make sure yours is turnt up because ours wasn't and in the beginning we were trying to figure out why it was taking so long to warm up. The vents also do nothing here so you'll smell like grilled meats when you leave here so I'd suggest not getting all dressed up to come eat here. The staff was ok as well. Sometimes it was hard to get a server's attention because it was so busy so you have to flag them down as they walk by otherwise you won't really get checked on. Parking is also pretty horrendous on busy nights so you may have to drive around multiple times to find a spot at all.\n\nAt $16.99 AYCE Korean BBQ, this place is hard to beat in value for what you get and it will remain my go to KBBQ spot.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "n6YLiDiYSpMKbCK41OrmFA", "review_id": "AYU75h_5DB2Y0vNX1CgbdA", "text": "While I was here, I couldn't eat anything because I was saving for curry, which they don't sell here. I had to watch my two friends enjoy/stuff themselves and grill lots and lots of delicious-looking, delicious-smelling, sizzling meat that made me salivate and get a whole lot hungrier. I'm definitely gonna be eating the next time I come here. Gotta get that AYCE, know what I'm sayin'?\n10/10, would put meat on grill", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "V8eNv32hu7ofAltMiVIqiQ", "review_id": "mu0na33DdTZtEwsYKPH67g", "text": "Tofu Hut is my favorite (and only go-to) all you can eat KBBQ place. With an assortment of sides such as noodles, korean pancake, fish cake, kimchi, bean sprouts, etc you can never go wrong. Plus, it is definitely the most affordable AYCE KBBQ in Las Vegas at just $15! After 10pm when there is a cheaper special, you'll end up waiting about 30 min or longer for your table but it'll be worth it when you can indulge yourself in all you can eat meat. Sides, korean salad and rice are all unlimited with your AYCE meal, so go hungry and leave very full!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EFbN6KDGPcrz7zZCYi9Xsg", "review_id": "qbYQb6939dYDTCv67RvGbQ", "text": "It was my first time eating Korean BBQ and I decided on Tofu Hut because of the Yelp reviews. It was fun to cook your own meat at the table and they give you plenty. I was stuffed when I left.  The place looked clean and I received good service.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FNEWmQ6GnTgHCNReFzee4A", "review_id": "Ym9dYjH8O_9aoNg6QXO60A", "text": "This is probably My go to AYCE Korean BBQ place here in Vegas. I've been here many times already with friends and so far there's nothing that much bad to say about the place so let's focus on the good. \n\nFirst of all their dry meats are the best ones to go for. The marinated items just don't cut it for me. The steamed egg is always perfect and the Salad is always appetizing. $16.99 is pretty good for their prices, not too much out of the range of other AYCE places. \n\nThe only gripe I have with this place is the space and waiting times. They need to move somewhere larger. As good as their food is people come here because they want to binge and are hungry right at the moment they step in the door. To wait for another 30 minutes just to get seated kinda ruins it for some people. Parking is also an issue since there's more people coming in individually with their own cars versus people who carpool. Most times I park in the junkyard right behind the garage in front of the resto(not that I care though since the Tire shop in front of it is pretty well lit). \n\nOverall the place is an institution with foodies and Tofu Hut has already grabbed their fair share of regulars including Me and My crew. The place just needs enlarging both in resto space and parking space. Will be coming back here expecting for more Korean BBQ awesomeness.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NNO7hmrZY8StSq4QIgFD_w", "review_id": "RwMzdkK7VrD7D6vSdC_uUw", "text": "5 star for the price and service! We have always gone out to eat here and we are always satisfied! The food is great and the service is good. Best of all it is CHEAP! Only downside is the wait to be seated and sometimes parking.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-01-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "mNB7TdcPC-Cp2_x_DfsVqg", "review_id": "ot9YqtHmF1VM7aMwyoVK7g", "text": "Well it's freezing outside it only makes sense to go to tofu hut and sink your face into a steaming spicy hot clay pot of suun do boo. Well it hit the spot tonight. There is usually no wait if you are not getting the all you can eat bbq so if that's you check the right part of restaurant first there will prob be tables for you to start grubbing. I got the dumpling which comes with dumplings and beef. All tofu soup is $8 something. It wasn't the best I've had but I was impressed by the amount of beef and dumpling in it. Usually you get super shisted but they don't hold out. The ban chan is not bad either. Also the combo with tofu soup and meat is a good value. I tried the combo short ribs and it was good but you can tell it wasn't a great piece of meat. Service was fast and food was hot though and I am a very happy wannabe Korean despite the continuous play of ghetto Korean music videos with skinny Korean chicks' shaking their little butts and words like swag sporadicly pop up in mist of all the bootie shaking and tofu soup. You may think that I'm going off on a bit of a tangent but all these little elements adds to the dining experience. So yeah eat at your own discretion.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2015-01-26", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "oy9xc30EU3vFklNR0BYwIA", "review_id": "835SCA6tW9Gvb5pv6kXbGw", "text": "Located just off Wynn road and Spring Mountain in China Town Las Vegas...I give this place 4 stars straight to the point only because I keep coming back for more. That must mean something, considering there is nothing really special about this place. It's as simple as simplicity gets. This small AYCE Korean BBQ has enough choices to satisfy those Korean craving tastebuds. But on any given night be prepared to wait anywhere from a reasonable 30 minutes to a sometimes ridiculous 2 hour standby. It is pretty much a hit or miss, just expect the expected. After 10:00pm is a discounted price of $13.99 compared to the $16.99 regular price, which is still not bad.  Just know that the discounted price will not include short ribs and steamed egg. You can opt out those prices to get those menu items included.\n\nThis place has been on KTNV channel 13 news for Dirty Dining before, but I guess sometimes the dirtiest place taste good! (No pun intended but not saying that is a good status to acclaim). The times I have been here however were clean enough, but behind the kitchen only the prying eyes will know.   This place could improve on size, but I think renovating the place is out or question.  Again this place is not anything special, but a local hot spot amidst the Chinatown district and open late for those night owl cravers. I do recommend it though!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NF-pO1UQ_1EwdFC6Ut-51Q", "review_id": "Ga8YEF6fmnb-fKyfrZkc9Q", "text": "The food was pretty good. If you want Korean bbq this is he place to be. It is a small place, so the wait might be very long depending on when you go. It's all you can eat and the variety is not too bad for the price.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2015-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cbjUyxN1S0DH-KJkxLliVw", "review_id": "CTU4r-jIGWqZydJIt0djug", "text": "One of the best Korean BBQ places in town. It may be that the wait makes the hunger grow, but it does make the food taste much better. The salad is filling and the BBQ comes at your request (unlike other places that are BBQ Nazis). Be prepared to wait as they are cheaper than the others, therefore, require a long waiting period.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1aNyBVJe2hNSXrVY5zsR1Q", "review_id": "IhLAB8m4okwxa74jQR3uzQ", "text": "I used to really like Tofu Hut. I thought the late night special was such a great deal! $13.99 after 10pm. \n\nHowever, I recently got back from Korea where I had Korean bbq constantly. It was more expensive to eat Korean bbq there, but the meat quality was so much better. The last time I went to Tofu Hut, the meat was horrible. The Kalbi was tough. Most of the meat was tough and dry. I really enjoyed the steam egg and the salad, but I was not eating Korean Bbq to eat those items. \n\nThe service was decent. It was neither good or bad. Nothing worth noting about. \n\nThe meat quality was pretty horrible, and I don't know the next time that I will be returning.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2015-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "BoehglpHMN0jOtLk58VKLA", "review_id": "ykxVV83oj8H9Fvvw78d7fg", "text": "Best kbbq place in Vegas! Good food for a good price! \nCons: The wait can be kind of long on the weekends after 10PM (since AYCE becomes cheaper after 10PM) and service is mediocre.\nBut if you're on a budget, this is the place to go if you're craving kbbq.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-02-12", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "ZTk05PSFDo8csT0YKmwYnQ", "review_id": "67BRUWeWOywKECbydA9u3Q", "text": "Come here with an open mind and an empty stomach!\n\nThe only reason why they wouldn't get a 5 is because of cleanliness.\nPut that aside and BAM, you've got the best KBBQ in town for the BEST prices!\n\nYou can never go wrong with Tofu Hut. I've never had issues during or after my visits (and trust me, I've gone more times than you could ever imagine). \n\nI'm a firm believer of, if it tastes good, and cost is reasonable, then WHY NOT. Nothing bad has ever happened to me, so until then, I'm on Tofu Hut's side.\n\nThey have AYCE KBBQ. After 10pm it's cheaper, and a DEAL TO STEAL!!!!! \n\nMy top three to order would be: brisket, bulgolgi, and squid.\n\nThey have the BEST salad in China Town. No other KBBQ salad could ever compare to their salad. It's got a yummy sauce and a little spicy kick to it that will make you crave it on the daily. \n\nTheir steamed egg is okay, I've had much better in another spot in town.\n\nBut, for price, and quality, you can't get any better than Tofu Hut.\n\nScrew what the people say, my friends and I will always be found here.\n\nBe careful for wait times, it can be extremely long if you're with a large party!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jvTht0uGYGW3uqL9Bpu4Kw", "review_id": "ilRiBzB7nDFq28vdPh9sSA", "text": "This 4 star is only for the food. This is the best all-u-can eat Korean BBQ in Las Vegas. Don't order rice so u can fill up on delicious meats! Make sure u ask for your brisket and beef tongue a thicker cut so it doesn't fall apart when u pull it off the grill. The service is really really bad, but the food compensates for it. I recommend the brisket, bulgolgi, and spicy pork belly. All the sides are wonderful, the best is the veggie pancake. Don't forget the dipping sauce for the meats! It's sesame oil with salt and pepper-- so good. This is your typical spring mountain restaurant. Yes, it looks really sketchy, no you have no idea what you're ordering, but it's so wonderful. Just go for it!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fM4IojPOjZRm4HruYL4Lmw", "review_id": "AZzXcGXKnAI6v-qJa8DrrQ", "text": "Came here a few months ago with a friend to check it out before I'd bring actual family.  We were NOT disappointed!  \n\nThe only negative part was to get the cheaper rate, you have to come late and they have limited seating.  Which meant we waited almost an hour for a table.  \n\nThey were clean.  The food was marinated perfectly.  And it was much fresher than some other buffet style AYCE K BBQ places due to it just coming out of the freezer, ie. the Bacon (AKA Pork Belly).  \n\nBy far it was the best bulgogi I've had.  This month I'm taking the fam for birthdays and it will sure not disappoint!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PNNTE3-u1pnfodLbHlF3tw", "review_id": "UDoELY31sRGjHRW5TPlDXw", "text": "I give Tofu Hut 5/5 because it is my favorite AYCE Korean BBQ in Las Vegas.\n\nThe prices are fantastic, $16.99 anytime and $13.99 for late night (10p-2a). I would recommend just ordering the $16.99 whenever you go because you'll be able to get the garan-jjim (steamed egg) which comes out sizzling hot and the kalbi (marinated short ribs). \n\nIt's a pretty popular AYCE KBBQ as I don't recall a time I haven't had to wait for a table. There's two sides to the restaurant, one where you can order all you can eat and the other for those who prefer to order off of the menu. I've tried both and am a fan of both, however, I prefer Tofu Hut for the Korean BBQ. \n\nThe service is good; they bring you out waters, banchan (Korean side dishes), salad, and take your order shortly after being seated. They give you salt and pepper in sesame oil for dipping sauce but you can also request for the soybean paste or soy sauce and vinegar if you like. There's always plenty of banchan provided, which are very tasty, and the servers happily refill them when requested. I love the salad they give you here... The dressing is amazing and the salad pairs perfectly with the BBQ. \n\nTofu Hut does not compare to the Korean BBQs in LA, but for Vegas... It is definitely the place to go for AYCE KBBQ. 5 stars for me and highly recommended!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_2vRsTgCXU00WCj-yN-iaA", "review_id": "RRMtAYEBItIyHCCYDgiKfg", "text": "DELISH!!! For us (family of 3) it was $48, you are allowed 4 meats only for your order. The brisket was bland, but what brisket isn't. The marinated beef and short ribs was good. My son isn't meat eater and he greatly enjoyed the short ribs more than the others which made me extremely happy cuz I didn't want to lay for him if he wasn't going to eat.\n\nThe salad is amazing. So good for a salad. Sided are no different for any other sides I've had at others but I would for sure come back again. We had about 6 sides and it comes with a bowl of rice for each person. \n\nThe entire place seemed to be remodeled/updated because tables and space looked very modern and clean. The bathrooms were just as updated as the dining space which was a nice surprise considering the small hallway you take to get to them.\n\nAnytime price (the hours that are not listed below) is $16.99 per person\nHours between 10pm and 3am the price is $13.99 per person.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vEQgOufhYOGDbgZeP6C35g", "review_id": "xmIGzCbtloReEwq13DAm5g", "text": "I love it been there twice if you expect to be seated right away don't expect it. Love the food we always try to get one of everything. We had a point where someone came to lower or stoves kind of understood because something fell in but Iunderstood would go again.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-12-05", "type": "review"}
