{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Iu6AxdBYGR4A0wspR9BYHA", "review_id": "KPvLNJ21_4wbYNctrOwWdQ", "text": "Excellent food. Superb customer service. I miss the mario machines they used to have, but it's still a great place steeped in tradition.", "business_id": "5UmKMjUEUNdYWqANhGckJw", "stars": 5, "date": "2014-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6MQjQ3jfCUUxItIvKadJsw", "review_id": "MKt00EwMtUlh9z9DJ4luaw", "text": "I don't know why but this McDonalds always managed to get my order wrong.  This is almost constant.   However there is a young assistant management who is extremely professional and friendly.  He make sure that all of the customers incorrect orders are made correctly. I believe his name is Matt or something that begins with a M.  (Young guy, brown hair, and awesome tattoos).    \n\nMany of my orders get messed up because SOME (not all) of the cashiers are busy talking to each other while my order is being taken.  I don't mind that but focus on the customers too.\n\nThe major complaint that I have with this location is when the high schools let out.  The tons of students from various of communities just hanging out, cussing or making a lot of noise.  They sit on the tables and often just sit at your table.  When Arby's and Wendy's use to be open next door, the management  of these establishments did not put up with this loitering or chaos..", "business_id": "4LcFKTr6Ah87VcxW2z5e6w", "stars": 2, "date": "2014-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Wi_9p4C1OFyrMOACiYu29g", "review_id": "T2lLo293GSv5MpnLuyJl6Q", "text": "Consistently the slowest service ever experienced at any McD's.", "business_id": "CnuxQ4_7j9MKyQiO5YWsFA", "stars": 1, "date": "2013-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "xrPtS7uo5r_VJB5g3pDzTg", "review_id": "a9-3JUijpvz3x80IR3-BrQ", "text": "I always forget about Jersey Mikes in uptown because it's not in the over street mall area. This location is found in the Citizen bank building. It's super busy on Tuesdays because they run their $6.59 lunch special (regular sub, chips & drink), but the service has always been super fast. \n\nMy go to choice the the #7- turkey and cheese all the way with banana peppers added. Wondering what 'all the way' means? Well it's lettuce, onion, tomato, pepper, salt, oil,vinegar and special seasoning. It tastes awesome. They also have a bunch of different sandwiches to pick from. \n\nAdditionally, Jersey Mike's doesn't skimp on the toppings. Every time I've been here they load up the meat. There's a good amount on your sub so you won't leave disappointed.", "business_id": "6ICGve6UyGPuLaGrKQBVuw", "stars": 4, "date": "2015-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uBUGZtTxmaG-8YpUWpU5_Q", "review_id": "_idmLgFnUL3Ih8M97wsbtQ", "text": "I rarely write up fast food places, but this particular location is amazing, not for the food but for the engineering that went into siting this location.\n\nLocated immediately opposite South Park Mall, this two-story McDonald's is a complete operation including drive thru, delivery to your car in waiting parking spaces and even has a piano in the main ordering area.\n\nMy 96 year old dad's doctor is next door so we always get something while there for his monthly check-ups.  Dad LOVES the McDonald's burgers and is happy as a little kid when he gets his order.  Never fails...thanks McDonald's.\n\nIt is tricky to get in, so just trust the signs.  Coming off of always busy Fairview Road you come down a narrow drive and almost immediately make a left into the drive thru/enter entrance.  You circle the building and have to look quickly to find a parking space.  If you dally, you have to re-circle that narrow area.\n\nA masterful siting for the building and the inside reminds me of the giant McDonald's in Asia.  Multistory and all the goodies.  And it is immaculate.  Have never seen a scrap of misplaced paper.\n\nSame consistent food selections done exactly as they are in every other location.", "business_id": "4kM-mP7z1nP015R2Tlz1Tw", "stars": 3, "date": "2015-01-10", "type": "review"}
{"votes": {"funny": 8, "useful": 4, "cool": 4}, "user_id": "4tuG9tZ1tI7ZahbJUpwK2A", "review_id": "JUvC2yTSiLQoeAH8owknYQ", "text": "When I first moved to Charlotte a few years ago, it was the giggle-inducing name that drew me in: Bojangles--- its just kinda funny in the cute sense :)  \n\nAnyway, on my maiden voyage to Bojangles, I wanted to keep it simple so I can sample the smaller items.  One bite of the fluffy pillow from heaven--also known as buttermilk biscuit, and I nearly went into nirvana!  It was so simple, yet made my taste buds forget Im in public.  I knew I was in love.  I also had the small order of Bo rounds, and because Im a sucker for hash browns, I fell in love all over again.  I greedily ordered another one, just before my last bite ended.  They season it with some sort of fairy dust and it makes all the difference.\nIm also in love with their egg and cheese biscuit.  So greasy and so yummy.  \nIts days like this that I wish I had my own personal bojangles in my basement, and my food order would come through those bank suction thing-ies :D", "business_id": "JId-omv3reUpFcL0dhhegQ", "stars": 5, "date": "2009-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-_1ctLaz3jhPYc12hKXsEQ", "review_id": "dqR0B47V8IaJAJpCB0eKNA", "text": "Strangely, I only ever seem to eat breakfast at this location.  The good news is that it gives me time to work it off throughout the day.  Not like I'm working out or anything, but it makes me feel better.\n\nI don't remember exactly when this store was built, but it is very nice on the inside - not your typical plastic style McDonald's, but a much nicer, more upscale look.  You won't confuse it for a Starbucks or anything (even with the McCafe stand inside), but it does have nice windows and a generally pleasing atmosphere.  The food is about the same, though!", "business_id": "n_t3HHkoR3TXomoBOcVZaQ", "stars": 3, "date": "2008-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Veue6umxTpA3o1eEydowZg", "review_id": "Tfn4EfjyWInS-4ZtGAFNNw", "text": "Everything was great except for the burgers they are greasy and very charred compared to other stores.", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 3, "date": "2013-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6zoKHExCjxIttyuIp_sXLg", "review_id": "1zl-zeQMwNolviep7qthLA", "text": "This place has wonderful servers who are friendly and ready to take their time helping every customer. Unfortunately, the management has a problem with scheduling enough employees to work. There is always just one trying to serve the whole floor every time I go there. And I've never once seen any of them get a break. Over worked employees.... Its sad. This place needs some serious help.", "business_id": "DWZ1_iy-cTeehK5FTiqH-g", "stars": 2, "date": "2015-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TCEqENMcnIjsBCjlI_Stzg", "review_id": "3Z_V-_yiTR9FWmByDfMARQ", "text": "Every time I go to Whataburger, I get chicken strips. It is the only place I can think of that gives you a piece of toast with your meal.", "business_id": "ixTr1qXUFGTzyaZUuCDDvg", "stars": 4, "date": "2011-12-01", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "PeWTVqaIBsMYGOUGFH9yww", "review_id": "i9Zy_6QbHnf1MJdaWFLR9Q", "text": "Just went to grab a quick lunch to go and must say this is the wrost prepared food to date. I've gone hear at least 30 times before and this is the first time that I can honestly say it sucked. They weren't really busy, since I went at 10:30 am. I hope this isn't a new trend.", "business_id": "5UBAWhxukaPrc_0DalT-3w", "stars": 2, "date": "2012-02-13", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "WjAcCllCrnwmXJof_VWM4w", "review_id": "SD5oS5zj1HeAVnjPWsu4_w", "text": "Mexican pizza tasted like chemicals. The beef in the burritos were awful tasting. Pretty much everything we ordered was terrible. Don't even stop here.", "business_id": "kIvIqHvvFOc6aCutFYIvNg", "stars": 1, "date": "2013-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BLL8JdzUlyDn6bdD8k6RcQ", "review_id": "egibDOxGCflO2_H2rac46g", "text": "The floors are sticky, the food is not fresh.\nWe waited almost 20 minutes for a carry out order that consisted of two 2 piece meals and 2 large sides and 4 biscuits. The biscuits were hard as rocks and stale, the cold slaw was not fresh and was completely dry, just shredded cabbage in a cup. One of the 2 piece meals was packed up wrong, dark meat was ordered and white meat was given. The staff was completely unprepared and had no urgency in getting orders completed.\nThis place has been nixed for a lunch stop during the work week.", "business_id": "lgWe8lSmcBk4Pq0kVI9-0A", "stars": 1, "date": "2014-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "fQrdlbJt6e5jvSRzSCgh-Q", "review_id": "l_dS_fDE7sug_PDbrWGM-w", "text": "The service was terrible, they made a huge deal about me asking for extra cheese. The lady working there made a fat joke about my bf and she laughed in my face. They didn't have anymore food so my burrito bowl was skimped on the ingredients over all a terrible experience I will never come here again.", "business_id": "K2_Hmmo5crTYWiT_1sWnfQ", "stars": 1, "date": "2015-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aRu3QUnaHps6nDGz3QZhsQ", "review_id": "6CKRoTTQ6SzqFcMVoH4VcQ", "text": "Great food at reasonable prices, if you like PF Changes you'll love Pei Wei. Same company and very similar food.", "business_id": "9Vu9KhK2-kBSM-FXvxXGNg", "stars": 5, "date": "2015-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "FMpINhPJSBmyiiA58uEung", "review_id": "QrNmo6Ub_03N1SDJuk61UQ", "text": "Let me first start off with the fact that I literally just left this establishment. I always love take out from pei Wei so this has nothing to do with the food. It is all service. For one the building smelled like sewage which i understand can happen due to location but it took my appetite away. Second, I walked in and two young girls were standing at the counter. One was changing a roll of receipt paper a foot away from me and completely ignored me. Then turned her back to the line. The other girl was talking to a customer for about a minute  and the customer left. She then looks up at me, doesn't say a word, and proceeds to turn her back to me and text on her cell phone in plain sight for several minutes. This whole time, neither girl acknowledges me whatsoever but I am clearly standing at the counter waiting to be helped. A young man comes and asks the girls if I have been helped and without looking up the both respond no. He helps me and is friendly and fast so I am not completely furious. I still tipped the staff because I work in the industry, but I will never return to this location if this is how they are trained and managed.", "business_id": "PxqufEwqzIHAbQGRdZ3bUw", "stars": 1, "date": "2015-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mYPmxkBG1u6KjnZmwSsOsQ", "review_id": "uaW-4rzeySFnpY3QLbQx_Q", "text": "The staff here is a little wacky and off the wall, but they made good recommendations when I wasn't sure what kind of sauce to get with my sandwich. Also, for some reason it was cheaper for me to get the meal rather than just the breakfast sandwich, so they saved me some money by telling me about that.", "business_id": "TepT2VeFe3tMYdAiqj12vg", "stars": 5, "date": "2014-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BEe04ziifpSkBdKsCSAUXA", "review_id": "Cri3GIgKs8M3rpnu7pu3EQ", "text": "The coke still has a funny taste. I was hoping after they remodeled that that would be fixed.", "business_id": "41SzC2WJ-RVUpVZ2NJfE-w", "stars": 2, "date": "2012-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "14zExR4sZj-J32rhLJVPaA", "review_id": "Z-Zlny2G0LU9J_tkxvGgYw", "text": "I stopped on the way home tonight. It was dinner hour and pretty empty in the dining room. I think there were three customers in the dining area. There wasn't a line, but customers had to wait because the staff was more concerned about the schedule than the few customers that were waiting. We weren't even recognized as we stood waiting for service. Staff is loud, ever see \"king burger\" video? I think bon qui qui might work here. Inside is nicely decorated, but few totally sterile. You could probably just bring a hose in to clean it since there are few padded seats. I will choose a different one next time. McDonald's has changed so much over the years it's hard to recognized.", "business_id": "-0HGqwlfw3I8nkJyMHxAsQ", "stars": 2, "date": "2015-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XBHJCDzNh--mBhJkzyM_iA", "review_id": "ILQdNTynNIVrRjl8hP_J2Q", "text": "I do not think I will eat another Fatburger ever again.  I even used a Groupon (that's the star) and I could not stomach the food.  I'm not sure entirely what was going on here.  I've been to a Fatburger before and this very location in the past and it seems to be getting worse and worse each time.  The jumbo ketchup pump was empty, the soda station was a disaster, there was only one other guy in there, I think there should have been someone out tidying up.  The place looked like a mess- so that turned me off instantly.  The food was not good.  My burger was a giant sloppy mess thrown all together.  How  can a burger be done so wrong?  Why does this place looked like it just got looted?  Why is there a broom on the table next to me and why does my burger taste like a greasy mound of crap?", "business_id": "Fd0mINs0v_cma-ORPDBQSQ", "stars": 1, "date": "2012-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rEpGBjNu1YgTTNNAUiy0Ug", "review_id": "ek5HiY8r-AG4-xLp8KTxKw", "text": "Great Store and staff..  Love this store..", "business_id": "xPDbCj9tfp5nnGzYzoCHwA", "stars": 5, "date": "2014-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_TUmUYMRZSa3rLwADWlqcQ", "review_id": "iiA_0aovfEWt1JnFBB5kag", "text": "Great burger. Get it with the green chiles or better yet get the Monterey burger. Great flavor. :)", "business_id": "FKoqqNLG47bl_AjMwg3PjA", "stars": 4, "date": "2014-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RuwOqj0SBYKm_uYwuhLOGw", "review_id": "CtLIRLrhX9gxgiwgB2Aogw", "text": "Customer service was excellent. The woman who took my order was in a fantastic mood and seemed like she was having a great day, a very pleasant, simple thing that brightened my day up after having difficulties at work. Food was standard Taco Bell, delicious and streamlined to taste the same everywhere, but the customer service was impeccable and due to this I will definitely return.", "business_id": "L530QbNnHIwCvnElu7ENug", "stars": 5, "date": "2013-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "nMHu8rkh1wkKn5Md0MzNHA", "review_id": "F5Go59TnLhTnWeu7IC1zOA", "text": "First time here. 11:30 on a Tuesday morning and it's only 1/4 full. Where is everyone? Sat by the drive thru window and that line was busy and crawling. Too bad. Maybe that's where everyone is?\nOrdered the Angus beef and cheese on jalapeño cheddar bread. It arrived in 7 mins. Bread was fresh (toasted), produce crisp and the meat was heated-all good. Not as much meat as, say, Port of Subs. Tasted good tho. Good table side hot sauce. Gave it a nice kick. Good touch guys. \nI recommend the beef and cheese sandwich. It was tasty and filling.", "business_id": "-jBymA8tI-WURtSBcuUdXQ", "stars": 5, "date": "2014-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wETlbv7kyLGo73Sh8Ss1AA", "review_id": "W73R954WY1PsYZfYgsIfqw", "text": "Is there an option for no stars? This sonic was very unprofessional. We arrived around 1pm and I had made 2 separate orders because me and my friend wanted to pay for ourselves. My order took 20minutes to come out and her order was never even rang up. After waiting 15 Minutes i decided to page them and ask when the next order wound be ready. \"What order?\" they said. Great.....She had work at 2:30 pm and was late because of how long it took. I had asked to speak to a manager and he was absolutely rude and deserves to be demoted. Not sure of his name but he was a Mexican man with black facial hair. He had said \"if the order was all on one ticket then there would be no problem.\" excuse me, but i worked at a restaurant for 2 years and now i am working at a fast food joint and that is NOT how you handle a complaint. He was rude and unhelpful and after waiting an hour for 2 orders my friend STILL HAD TO PAY FOR THE FOOD. Not to mention that my drink and my little sisters was suppose to be a Root Beer and they gave me a Sprite and her a coke, but i was done with this place. I didn't care. I also did not get my ranch or marinara sauce and had to ask a second time for it. The manager did not even say sorry and he didn't even seem genuine. He had a very bad attitude and yes, i understand that it is busy but there's a way to be accurate and busy rather than inaccurate and sloppy. My hotdog looked like it was literally thrown into the bag. $13.00 for her order and they had only managed to give us half off. So not only was my order on time but completely sloppy and wrong, but my friends order took almost 45 Min to get and she was also late to work. I will drive the extra 10 minutes to go to the southern and Crismon sonic. This place sucks.", "business_id": "6JKOKRgtnJWn3KgsgFYaYw", "stars": 1, "date": "2015-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gDFL_qyyCVcpmdTdCfU_gQ", "review_id": "MIo5QGway5uxX7xFkbhOtg", "text": "Who knew?\n \nI did! \n\nI remember eating many many many times way back in the early childhood of Chipotle back in Denver. Like the picture on the wall in every Chipotle. (yep on evans and university) I had a feeling this place was going somewhere and Chaching!\n\nAnyway, long story short, as we all have eaten at a Chipolte somewhere. It simply is the best quick healthyish mexican there is period! \n\nOn a side note if you are one of those wierd vegan people this is my favorite burrito (veggie fajita black w/ all the salsas no queso or crema greens and of course 3 lbs of guac!) Yuuuuuuuuuuuuummmmmmmmmaaaaaeeeeeee!!!!!", "business_id": "Cv4kZH9zN0wpN2Drn0qkLg", "stars": 5, "date": "2011-01-08", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 1}, "user_id": "eajlr7s1k9_1poiK_Tf0Tg", "review_id": "holbi4a1i82dkkf0u4TW0w", "text": "I was in town for a business trip.  It was late.  I was hungry.  I just got gas before getting to the hotel to save time on the car rental return the next day and asked the folks at the gas station how this place was compared to Jack or Carl's and was told it was awesome.\n\nIt was far from awesome, it wasn't even that good.  The drink and lid were terrible, they didn't fit right and caused it to leak a little.  I got a chicken sandwich the bread was a cool idea but it just didn't work for the meal.  Nothing was overly terrible but versus some of the other local fast food places nothing really sets this place a part or stand out.  Maybe breakfast is good but...wasn't willing to go back.", "business_id": "EVRoFKVKbgP-rz9_6enViQ", "stars": 1, "date": "2013-12-11", "type": "review"}
