{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "xzie68uK2ViI0ddnLHw1tw", "review_id": "N1O_3yeUB0nn3otEJc88tA", "text": "Used to go there for tires, brakes, etc.  Their prices have gone way up-$400 for 4 mid-level tires for a Toyota.  Plus, 1 of the new tires went flat within 3 weeks.  Since they don\"t make appointments,  the wait to get the tire looked at was ~2 hours.  Sorry--can't wait that long to get a warranted repair,  They lost my business for good.", "business_id": "b12U9TFESStdy7CsTtcOeg", "stars": 1, "date": "2012-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RsaEvod4EOBYIdbRBBv0sw", "review_id": "ap4IaJaTlj_txbJe99D6oQ", "text": "Contrary to other reviews, I have zero complaints about the service or the prices. I have been getting tire service here for the past 5 years now, and compared to my experience with places like Pep Boys, these guys are experienced and know what they're doing. \nAlso, this is one place that I do not feel like I am being taken advantage of, just because of my gender. Other auto mechanics have been notorious for capitalizing on my ignorance of cars, and have sucked my bank account dry. But here, my service and road coverage has all been well explained - and let up to me to decide. \nAnd they just renovated the waiting room. It looks a lot better than it did in previous years.", "business_id": "b12U9TFESStdy7CsTtcOeg", "stars": 4, "date": "2014-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5noqL9IulqZx326u6eg4Rw", "review_id": "Yip27oh0XMK0_1C3bN_DNA", "text": "Last summer I had an appointment to get new tires and had to wait a super long time. I also went in this week for them to fix a minor problem with a tire they put on. They \"fixed\" it for free, and the very next morning I had the same issue. I called to complain, and the \"manager\" didn't even apologize!!! So frustrated. Never going back.  They seem overpriced, too.", "business_id": "b12U9TFESStdy7CsTtcOeg", "stars": 1, "date": "2014-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6J36XywWc15MBLWWAzKi2A", "review_id": "8WEnHgoPsW8ozleiyLir1A", "text": "I'm not someone that's mechanically inclined, so I can't say for sure that the deal I got was a good one. But that said Alan and the crew at Master Muffler certainly appears to have done a great job fixing my car to a degree better than I expected and at a price much lower than I was expecting. And with a great warranty on their work I feel comfortable knowing that if there is a problem I'll be covered. I would absolutely recommend them to all my friends.", "business_id": "frIRW4BGhdAWbSsG5ev2ng", "stars": 4, "date": "2013-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VUdK-vXEu82cvBbE9w8d3Q", "review_id": "iyCIbTIJNoNfJiXcmM6vmw", "text": "Absolutely amazing guys here! We were in Pittsburgh visiting my family and the driver's seatbelt stopped working. Day after Thanksgiving and these guys got us in despite obviously being incredibly busy.  It turns out that a piece of plastic had gotten stuck in the buckle. Now we are able to drive home. Thanks!!!!!", "business_id": "G-PlXGCY3G4zNOUzD61ZDA", "stars": 5, "date": "2013-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "H8wJwuWusTZvc9W5bY4gFw", "review_id": "TQ4mJZyDApU6YUoZU6p7ow", "text": "These guys do everything by the book.\nI had lapsed in my PenDot stickers and registration, and they helped me get that together (they won't work on your car if it's registration isn't valid).\n\nThey told me my 2004 Toyota would need new wipers to pass safety inspection. They had me, but the cost was reasonable.", "business_id": "l-dc5DeNBiHYJA1XO4cFPA", "stars": 3, "date": "2008-12-17", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "rPVnUFJE6TMzNg8kCFCQdg", "review_id": "DadZrJ6zDiYntpqMha5SjQ", "text": "I have taken my cars to Bastone's for years and would highly recommend them.  Always friendly, always courteous, never trying to sell me on unnecessary work.   I really appreciate their honesty and their help in keeping my old car working and on the road.", "business_id": "l-dc5DeNBiHYJA1XO4cFPA", "stars": 5, "date": "2012-12-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pRykOrAKHu1dCoVY_ItTRw", "review_id": "mYHEcgNYipvVihOzeBpnyA", "text": "Bastone was able to get my car into the shop the very day I was out looking to get my car repaired. Carl, the man who assisted me, was very friendly, addressed all my concerns, and called me with an estimate before doing work (front end and alignment). Compared to the horror stories you can read online, their prices are very reasonable. I picked up my car a few hours later and the steering is tight, dead-center, and hasn't felt this good to drive since I bought it. I will definitely be returning if any other problem with my car arises. Nice work guys.", "business_id": "l-dc5DeNBiHYJA1XO4cFPA", "stars": 5, "date": "2015-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tF8mocOh5wabNQ2zFm6GYA", "review_id": "HEQ5XFVEzopfljWDRRq4Cw", "text": "The guys at Bastone are great. Everyone is friendly and knowledgable. We've brought our car in several times for both regular service and repairs and they always work quickly and provide a solution at a reasonable price. They're always very patient when we ask lots of questions. Our car has never been in better shape thanks to Bastone.", "business_id": "l-dc5DeNBiHYJA1XO4cFPA", "stars": 5, "date": "2015-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RrE7U5MVI9jutvFLM8gq5g", "review_id": "Kiinji19KbDa7GrzM4vp9g", "text": "Tire replacement, was told it would take about 1.5 hours (when I had an existing appointment). It's almost been 2.5 hours and I'm still waiting. Ridiculous.", "business_id": "UFhcxnTzfLO-ROftyP_ukw", "stars": 1, "date": "2013-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iurbZ56AKx-c47IFL8UsSg", "review_id": "N_pSF_RWc5PilQ5ysbsUWQ", "text": "Like the previous reviewer, the new manager Ray is awesome. I needed a relatively simple tire change. It was handled professionally and friendly.\n\nWhat got my attention is that, while I was waiting, Ray was dealing with a really difficult customer. I would have blown my top at this guy, but Ray was calm told him his options (which, as a car guy, I agreed with) and handled his concern. Like a pro.", "business_id": "t15LDNaHFpu-bAEJSdoV-g", "stars": 4, "date": "2013-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "qDPHTcJ6VC2-O-aX6tjvkw", "review_id": "gma3gA33193sp0u8hEsrgg", "text": "I came in here to have a diagnosis done on my car because the ABS light was on. \nThey removed all the tires, showed me how the sensor and ABS work, did not perform the diagnosis I originally went in for and told me that I should have the back wheel hubs replaced for a total of $1,222, this with a new set of breaks (that I knew about) and \"without\" charging me labor. \nI may not know much about cars but I know how to search the internet and ask for advice. I found the cost of wheel hubs, they are no more than $150 each (for my car) and here they said that they cost $550 each (before labor). \n\nI also found out that the sensors get so soiled from all the dirt and salt that most of the time all the car needs is a simple wash on the undercarriage. You should always have your car washed, specially in the winter. It may save you $100's.\n\nThis place will rob you blind.\n\nNever have work done in a place like this until you do your homework!", "business_id": "t15LDNaHFpu-bAEJSdoV-g", "stars": 1, "date": "2013-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_qAlstQ-K-AoKYTmtcMwGw", "review_id": "8nYf5YhXuAwVw9iuxGx7ng", "text": "I took a subaru outback here for the annual state safety and emissions inspections.  First I was charged more for this service than what was clearly posted on the service station wall.  Secondly I was failed for a lug nut that had rusted to the point that the technicians could not get it off.   I was quoted $425 for them to get it off.  I was able to accomplish this with a $6 bottle of penetrating oil and a breaker bar.  \n\nWhen I returned to have the reinspection I was charged for it (their policy posted on the service wall clearly states you get a second inspection within 30 days of initially failing free of charge).  This time they were able to get the lug nut off but supposedly could not get it back on.  This was odd as I had taken it off and put it back on numerous times to ensure it was okay to pass.  They once again quoted me $425, stating they would have to replace the wheel stud.  The new wheel stud cost me $3.50 at the local parts store and I did the job in under an hour without a single power tool.  \n\nThis shop is not following the guidelines they have clearly posted on their wall and are fabricating problems in an effort to overcharge you for simple repairs.  Avoid this shop.", "business_id": "t15LDNaHFpu-bAEJSdoV-g", "stars": 1, "date": "2014-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SVd6Re9tpabo413b4LghYw", "review_id": "swcpavpx95ZxweS9-y6opg", "text": "Walter's is just a fantastic establishment.  Tim is a phenomenal mechanic, who is as honest as they come, charges amazingly low prices, and - Morten H. is not lying - will actually suggest ways to save you money.  The shop is small and usually pretty busy, but they will do their best to fit you in and get your car fixed up ASAP, and Tim always takes time to explain your car's problems to you.  He will even show you what's wrong inside the car, or tell you how to do something yourself if that's what would be more sensible.  I recommend Walter's to anyone who's in the market for a mechanic.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2009-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "C7tCtwh8GJSL7_OnxhOLqQ", "review_id": "fFGJZgnrYMU-3A_rwwR_nQ", "text": "I went to Walt's due to the reviews I saw here on Yelp.  I like supporting local business and I also wanted to find a garage I could trust.  There was nothing wrong with my car I just needed the oil changed and I asked them to make sure I was \"good to go\" for the winter season.  They changed the oil, check my tires and topped off all my fluids all for $36.  Tim is a helpful guy and will take his time to explain things to you.  They seem to be quite busy all the time which I see as a good thing.  However, it does mean that you have to call ahead for an appointment and you may not get your car in on the same day.   I will be going back for all my car care needs!", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 4, "date": "2010-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a5JhPLbRxz4MLU0jDC77-w", "review_id": "nmpFOFwP7SMuakk1qhuLYA", "text": "Excellent and trustworthy mechanic.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2011-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "N_9d9na8fEGFr57h20QHnA", "review_id": "Eddkqy74mgcee5Eh0l0QJw", "text": "Walter's was SO helpful  when our daughter's car was misdiagnosed by another garage. He talked us through the options over the phone (we're 300 miles away) and helped us find a solution. Two thumbs up!", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2011-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 6}, "user_id": "TIFX0jkfFLpsPWvsHqSdng", "review_id": "f3BN4Vv1wNG9xe406F1qxg", "text": "As numerous people have pointed out, Walter's is indeed a great repair shop.  Tim (Walter is his last name) and the rest of his staff are friendly, honest, professional, and reliable.  I highly recommend this shop for repairs, maintenance, and check ups.  \n\nHowever, they are victims of their own awesomeness.  The waits here can be long--2 weeks or more--due to how busy they are and they only have one bay.  If you do have a pressing safety concern though, Tim is always willing to take your car for a spin or do a quick diagnosis to let you know if something needs to be taken care of.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2012-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2i2jCFZ5v-ZHfg815mfN6g", "review_id": "1MH7p8E3dljNbBaJA-9QIQ", "text": "Great place. I take my car there for everything. Inexpensive, friendly, and knowledgeable. They've fixed my tire, taped a broken hose temporarily, and done other things for no charge several times. I'd definitely recommend them.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2012-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WCwdlbIvi2nDriaAw3150Q", "review_id": "4PmEQ5bqbRGDYGc84yZ0ng", "text": "Walter's garage is awesome!  I was in real trouble with my car and needed immediate repairs and he managed to fit me into his busy schedule and charged a fair price for the work.  He was kind and honest--what more could you ask for from a mechanic?  :)", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2012-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GMtILOfAHXUMrfMgLPG0gg", "review_id": "LAFKuOhbpM660_jJPm0kKA", "text": "I found this mechanic based on the excellent Yelp reviews and I was not disappointed.  I came to Walter's because my radiator was leaking coolant and Walter tried to save me money by doing a patch job on the leak which he was only going to charge me $20.  Unfortunately it didn't work and I still had to go through with the replacement, but I appreciated the time he took to give a cheaper alternative a try.  And Tim Walter is a friendly guy who will take the time to discuss the problem with you and give you a fair deal.  This place gets busy so you will likely have to call a week in advance and leave your car at least overnight, but it's close to bus stops.  There is no waiting area and I don't think they do any quick jobs that you can stay and wait for.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2012-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JPQfBSN1FA824RLmUIEIfA", "review_id": "-0wu9GztIQ2Y60wd9emYhQ", "text": "I was having an issue with the emissions light in my car. I spoke with Arlene, who gave me a rundown of what I could expect while my car was in the shop. She then told me that even though they were very busy, I could stop by before my appointment so that Tim could check things out and make sure my car was safe to drive. Tim poked around, figured out it was the gas cap, and sent me on my way without charging. A good mechanic is worth their weight in gold and I will not only return to this garage but refer others as well.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2012-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "YBD4PfWdEYjWSGNjKn9uYQ", "review_id": "dDZQ_bfg4C2IsQdl7as2cA", "text": "A trust worthy mechanic is very rare these days...\n\nI split time between Seattle (work) and The Burgh (Family) so when my car began to lose power on acceleration I searched for a local repair shop on yelp... Based on the numerous positive reviews I made an appointment at Walters on Baum Blvd.\n\nMy appointment was made for two weeks in advance but Tim had me bring my car in and we took it for a test drive. Tim determined that it was the Cat converter and recommended that I not drive the vehicle very much as to not cause further damage. Tim said that he and one of his mechanics were going to work extra hours that weekend to get caught up and that he would try to get to my vehicle. So I dropped my car off on Wed night, on Thursday Tim called with an estimate that was 150.00 to 200.00 less than what others had quoted. \n\nI expected my car to be worked on over the weekend however at the end of Thursday Tim called and told me that my car was ready and running great! Wow! I was surprised and grateful. \n\nWhen I picked up my car on Friday the cost for repairs was 15.00 less than my original quote due to a gasket that was included with the part and not ordered separate. I figure that many shops would have just kept the refund from the extra part and would have charged me for the quoted price but not Tim at Walter's.\n\nI can't say enough about the excellent service I received from Walter's...", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2012-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "Jmp98s8eh5Fmj1TRbWDJuA", "review_id": "JZBx1ibavaWn1tEFErFFhQ", "text": "I cannot sing Tim Walter's praises loud enough.\n\nI have taken my car to him for about 5 years, and I always leave with a new experience attesting to his awesomeness. If you think you might have something wrong with your car that you're not sure what it is, you can just stop by, and he'll usually take a break from what he's working on to get in your car with you and drive for a little bit and then give you his opinion. Then, when he diagnoses your car, he'll explain it to you like you're not an idiot, and he'll make sure you understand what's going on. He's incredibly honest and cares about his customers. For instance, once I had a tire that needed to be replaced but he didn't have it in stock. He told me how much it would cost to have the tire ordered and how long it would take to come in, then he called another shop to see if they had it and asked how much they were charging for it, and he sent me there because it would be cheaper and faster for me than having him order it. The price difference was like ten bucks, so I had him do it because it wasn't an emergency and I'd rather give him my business. He's awesome.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2013-02-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BZDv6ZW6uestHjDFe0JSCA", "review_id": "t8qNrcjT7gd85IVscJxj7A", "text": "Mr. Walter is great. Reasonable prices, he's honest and tells you like it is. As a first-time car owner, he's helped me out numerous times and been very kind and generous in the face of my total ignorance!", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2013-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jOPGVsoqAIcpOZUYDbahOw", "review_id": "EL3PMCL8wuXJxUstWNkNWg", "text": "What excellent service!  I couldn't be happier.  We have taken our car to Walter's for just about everything.  I have never felt so comfortable taking our care to an auto shop.  They are seriously the best in town, not to mention extremely helpful!  Happy to give them all of our car business, they are life-savers!", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2013-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "jd5yWDLRt5NnwTZdPRAnuQ", "review_id": "C2dgtJkiPNpykoyDTRffVg", "text": "Recently had some problems with my battery and took to yelp to find a nearby/reputable mechanic.  After reading all the great reviews on Walter's Automative, I made an appointment as recommended and brought my car in.\n\nLong story short, minus all the technical details, Walter was very helpful and informative in helping me resolve the problem.  He was very open to listening to me describe the problem and was patient and quick to look into the issue and provide his expert advice. \n\nCustomer service was great as well!  It was really easy to call and schedule an appointment, and when I arrived the minimal office space looked pretty organized, given that it's inside an auto shop.  All the keys looked organized and labeled.  The appointment book looked clear and kept up.  I can really appreciate when a business is well run.\n\nI would definitely recommend giving this business a try!", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2014-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zELP3yd4lLG1IuW2fWtGew", "review_id": "PutKEOck_hJxHygC4hILSw", "text": "Honest. Reliable. Trust Worthy.\n\nTim goes above and beyond with his service. He came to my house 3x one day to check everything he could before I ended up towing it to the garage. I will definitely go back!", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2014-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Hys6HzKi24j2809kI_7dKA", "review_id": "bWbZiQ9sa3xWRPuLU8mWKw", "text": "Even though I work nearby, there are several auto repair shops in the area so what drew me to Walter's was the fantastic reviews on Yelp, and I agree, and am a very satisfied customer.  They were able to squeeze me in for my past-due yearly inspection after my dealership was unable to keep my scheduled appointment last Saturday due to a power outage.  I dropped the car off before work and was able to pick it up easily.  They were attentive, friendly, and fair-priced - I plan on using them again not only for my yearly inspection but for my regular car maintenance.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2015-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BdHI4JDwid74Hn6P-LA8Dg", "review_id": "65118htlm_vR12UP1Tab1w", "text": "My car had the SRS (supplemental restraint system, I think) light go on, which means either airbag or seatbelt issues.  Brought it into Walter, who mentioned that for my year car, there's usually a warranty covering this part, and I'd be better off at the dealer.  But I had been told by a dealer in the North Hills (in retrospect, incorrectly) that it wouldn't be covered, so I left it with Walter.\n\nHe diagnosed the problem as the seat belt buckle, called Shadyside Honda with my car's VIN, and Shadyside confirmed that the part *was* under warranty.  Walter then called me and suggested I take it there.  And he refused to charge me anything, even after two offers to pay.\n\nSo, in terms of honesty and willingness to really go beyond what a customer would expect, Walter's automotive gets top ratings!", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2015-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TmLohChzRaIBwoJq37eMWQ", "review_id": "K9Cw618JZpUVZ1izyvdNvg", "text": "I used this shop in order to perform my annual inspection. They were extremely flexible with me being from out of state and my busy schedule. I was a bit apprehensive having an older car, but it passed without any issues. They're professional yet very approachable and reasonable prices. Fully recommend!", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2015-02-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 3}, "user_id": "-Ots3oKQXuQWgzT6o5kNwg", "review_id": "d7dAF6CniM4338rWlzde1w", "text": "Leaving another review because Walter's has basically become the only car place I will go to. \n\nRecently had my car in for an inspection. As always, the mechanics did great work and offered a very reasonable price for the services provided. \n\nThat's not why I'm leaving another review. \n\nWhile I was there, a ring that has sentimental value to me fell out of my pocket. I didn't notice until later, and I had been to several places. I called each place and gave a description of the ring. But I figured that it was probably lost forever or had been stolen.\n\nToday (a day after I called) the mechanic at Walter's called me back and told me that he'd found the ring. \n\nNot only did the staff there humor me and look for something that I figured lost forever, but they found it and returned it!\n\nThanks so much for being not just great mechanics, but great human beings too, Walter's staff!", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2015-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "U3zmr40_StH9t4Tj-T_Jzg", "review_id": "ZD_5LFHga3pTts0clCECqQ", "text": "Shhhhh don't tell anybody!", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2015-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ekgHZNA8g9SVf1swF4lgAQ", "review_id": "T9Usw7iGMIrF74aI44fJrg", "text": "Not cheap by any means.  Rather expensive for the most part. Others rave about this guy, but honestly, I don't really see what makes him that great! He charges just like any other mechanics...parts are marked up just like everyone else. It is not like one can barter with what the prices a mechanic charges; otherwise you can't get the car back.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 3, "date": "2015-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mrrRs0B77UPL_A9nULr4dw", "review_id": "pWP3CJDmUK28L-FNt1_IQw", "text": "These dudes are the best. \n\nGreat service, great explanations, and their prices are the best in town for an oil change (though this does mean that for oil changes they're always super busy - because they're awesome!)\n\nHighly recommended over nearly any other automotive care company in the vicinity - I've tried them all. These guys are the best.", "business_id": "FZ67NZD-_aou82e-7TT_nA", "stars": 5, "date": "2010-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ezaytStHJaX8n5OBTd7pMg", "review_id": "2YztGhEsGrUpRLEE2ImCaw", "text": "Service was okay, at best. I wouldn't go there again.  They quoted me at thousands of dollars of repairs for my car to pass inspection.  I took it somewhere else and had it done for a fraction of the quote.", "business_id": "t_Mjhtr0KTB9uGNzxl37WQ", "stars": 2, "date": "2010-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m7OkyBDqlyxxxrQjqsz-ZQ", "review_id": "hkB9mcU4XZLCdvqdDd0Xyg", "text": "Terrible slow service.Waited one hour for oil change \n\nWon't come again to this place....", "business_id": "D5AC_cRdXrSWqL8KjJt5KA", "stars": 1, "date": "2015-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2QjMuYy9nj-ScKstFW5Jnw", "review_id": "XUsobqxebOSNG_xynf2fcg", "text": "First time to this place. Overall a very good experience considering I had to get a state inspection and everybody knows how that goes:)", "business_id": "JtViWM5LYyQ22uq2DYqt6A", "stars": 4, "date": "2015-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h_rfssjobncHWW-3GeooMQ", "review_id": "RgQNPPEjLm3pRW3oqGOQsQ", "text": "I had the misfortune of running into a deer 3 weeks ago and had to have front end damage repaired. I was referred to Liotus & Winter by a co-worker that that had body and paint work done on multiple vehicles there. The work they did on my truck is great. It looks even better than before I hit the deer! The paint work blends perfectly and the fact that the truck was wrecked is not even noticeable. The truck also rides and drives perfectly. They were pleasant to deal with and kept me updated many times throughout the repair process. They were also able to take care of my rental car return for me so that I didn't have to get a ride from someone else when my truck was finished. I would absolutely recommend this shop to anyone. They were very helpful and very appreciative that I chose them to repair my car.", "business_id": "FXj0ZOHbyV5n_0S_QZOOuQ", "stars": 5, "date": "2015-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3AvK6jGKnIgV5OVzxCGR6w", "review_id": "mBkTJnh5X-aa2lrh6b6Vcg", "text": "The group here was outstanding.  Not only did they repair my car quickly, but they also cleaned my car and lent me one of theirs (at no extra cost) because I did not have rental insurance on my car.  This place is family owned and professional.", "business_id": "fM5hwoJGY5gn1jEQnKiyDw", "stars": 5, "date": "2011-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oA9bhCUalf0YZDIsYxyGiA", "review_id": "sf-zvApodImK2VOmzA3eUQ", "text": "After someone backed into me, needed a little bumper repair. After hearing horror stories of auto mechanics, I was dreading finding a shop to fix my car. My State Farm agent recommended Penn Automotive. They were AWESOME. They made the whole experience very pleasant and super easy. They got me in the next week and gave me a loaner while they had my car for 2 days and did a wonderful job. They did my inspection while they had my car and did not try to sell me on anything.\n\nI highly recommend them to anyone!!", "business_id": "fM5hwoJGY5gn1jEQnKiyDw", "stars": 5, "date": "2013-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sOcDlX_x7C3wxeF-4KChzg", "review_id": "wsZjkHEsIK5cjl2cuELmNQ", "text": "These guys are excellent. Friendly, conscientious, full if integrity. Plus the best holiday decorations around!", "business_id": "fM5hwoJGY5gn1jEQnKiyDw", "stars": 5, "date": "2014-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZgXftA36WmOinEH46VzIzA", "review_id": "sGLbEIcb0WZyC_sB3s6BYQ", "text": "Took my car in today at 11:30 for an oil change and was told by the lanky guy behind the counter that I'd have to wait til the end of the day to get it back. I thought it over and agreed, and confirmed with him twice that the business day closed at 7.  I spend the next seven hours in the local strip mall, eating, watching a movie, etc., and came came back at 6:45, having not heard anything yet.  I inquire about my car and I'm told that it would not be ready until the next day.  I calmy explained that I was dissaponted not to have my car, and the same lanky guy (see above) told me that he had said there was a CHANCE my car would be ready by the end of the day.  \n\nWhy am I never going to this location (or any Mr. Tire, for that matter) again?  Terrible service, rude employees, and quite frankly, less than satisfactory prices.", "business_id": "H27egCbna1FH8X8HFpLD_A", "stars": 1, "date": "2014-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QsxVre3aLaxrGZM3fw3YgQ", "review_id": "xlaIUr5EPKDwV9pd_CgFhQ", "text": "John (owner) is someone I trust my families safety to.  I know that when he tells me something, it is the truth.  He is good at what he does and does not charge you a fortune to fix it. He has inspected a problem with my car and told me to take it to a specialist to get it fixed.  John is a good chirstian man and he will NOT do you wrong.", "business_id": "fvKQpza6x2daBFXaGSm4Fg", "stars": 5, "date": "2010-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Op6clSDiXDSeLkUAvNUv-A", "review_id": "lvXaPrb2utLzJGTapvaPRA", "text": "I was looking  around for a place to take my car when I came across reading reviews about Tullock Automotive.  Convinced by the reviews I decided to call in.  All I can say was they were absolutely awesome and friendly.  They were able to quickly diagnose the problem of my car and get it done.  I now take my car to Tullock Automotive because I know that I won't get sucked in by some other places that overcharge and don't always do the best job.  It has a very family oriented atmosphere with Todd's wife working there too.    I totally agree with everyone's reviews that Todd and the guys at Tullock Automotive is the place to take your car.   You WILL not be disappointed!!  So happy that I found these reviews helpful!!!  Highly recommended!!!", "business_id": "MrEABR3VfV0jDm_6oOfvXQ", "stars": 5, "date": "2014-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "fokvar_73ixJD-OollCelA", "review_id": "EPygT4-2w22awqf3vybauA", "text": "When my girlfriend and I moved from NY we had to find someone reliable and trustworthy to work on our vehicles.  Tullock automotive has not disappointed us.  \n\nTodd, his wife and the rest of his staff have been our go to for anything automotive while we have lived here.  Their flexibility, honesty and friendliness are why we keep coming back.  \n\nIf you live in the area or not they are worth the drive to check them out.  You will not be disappointed in the service.  Tullock automotive is a great local business in Stallings.  If you have vehicle issues do not hesitate to give them a call.", "business_id": "MrEABR3VfV0jDm_6oOfvXQ", "stars": 5, "date": "2014-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "J0h_oB2VEhMTlcqKmspjWQ", "review_id": "eCApkfNSjaYJi-ZAcK1fSQ", "text": "I have visited many Sears Auto Centers in time of need.  On this cold day, I dropped off my vehicle to have the tires balanced and rotated.  The tires were purchased at another location which qualify for free rotations.  Service was prompt and thorough though I had to wait about one and a half hours for the service to be completed.  After exhausting ourselves in the mall (physicaly and monetarily), I made my way back to Sears.  Service on my vehice had been completed, but no one called me.  No problem though.  I engaged a staff member, paid for the extra service, and was happily on my way.\n\nReservations are not accepted.  Make plans to keep busy either in the mall or in the waiting room (I prefer the former).", "business_id": "zKGGHa7AXr4EnPvBAaum5A", "stars": 4, "date": "2012-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WqTwL7wNCtaS5wdkzR6qww", "review_id": "tlEKflFPBzH1Q1b_NZKneg", "text": "Great customer focus, professionalism and quality. Thanks for taking care of all of our car care needs!", "business_id": "zKGGHa7AXr4EnPvBAaum5A", "stars": 5, "date": "2014-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "hEFiiqzLHkqNSePBD2jnqA", "review_id": "osXmYaNVSqgjYy8STJokAA", "text": "While I normally don't review auto repair places, I felt compelled to quickly review Carolina Tire. While they aren't the cheapest, they are by far the most professional, efficient and reliable auto repair business I've encountered during my time in Charlotte.\n\nSome key points:\n1. They charge a fair price and don't nickel and dime you on the \"extra's\" - what they quote is what they charge. Also some nice value-adds like free roadside assistance with oil changes.\n2. They are professional - you are dealing with folks who view this as their career and honor their work.\n3. Consistency - it's very underrated! When I need to get my oil changed or car fixed, I want the same experience and no surprises. Carolina Tire delivers on that promise.\n4. They have a good waiting area, complete with a children's play area, big screen TV and free wifi.\n\nOnly downside is that their location is not handy for walking to the mall or restaurants - if you need a ride they will take you to Lynx, but the location doesn't have a lot of stuff immediately next door.\n\nOverall I'm a big fan!", "business_id": "n3jucIUCSjIXrKU-ykIb0w", "stars": 5, "date": "2010-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "GRDBcP2aD3evJzSzc1Y13w", "review_id": "WL11Bey-NUCwvHZeiHo6Tw", "text": "Love these guy's.  I have been taking my car there since 2008.  First time I brought my car there was for an oil change.  Told Rod at the desk I needed cv joints because another mechanic said I did.  Well, I didn't, He however told me what I needed and took me in the shop and showed me every aspect of my car and his suggestions.  I was the first feel good experience I have had at a repair shop.  Rod has since gone and Tim has taken his place and he gives me the same customer service I have grown to love.  Keep it up guys!", "business_id": "VTu63fFRaKQV_BgoU8rquw", "stars": 5, "date": "2012-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fGsrHyx716wEIkwEPus52A", "review_id": "BK-ogKyFbCY9GuR11Yxj5A", "text": "Will never go back. Was there 2 hours before closing for an oil change and was turned away because they did not have enough time.  I gladly took my business elsewhere.", "business_id": "VTu63fFRaKQV_BgoU8rquw", "stars": 1, "date": "2013-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oUhdZ3URftuDUknLCrTUVw", "review_id": "ov7PAm7IycdNRexcR_8txw", "text": "Brought my girlfriends car in this morning to get a NC state inspection. I was greeted by Brian who was extremely friendly and helpful. He got me in and out of there in a half hour and gave me some good advice on my car and what needs to be serviced soon. I would recommend precision auto tune in pineville, NC to anyone who likes good quick service. Ask for Brian! Go Panthers!", "business_id": "VTu63fFRaKQV_BgoU8rquw", "stars": 5, "date": "2014-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "31D7Vgfk3RPaePdkMBSyCw", "review_id": "MlvCD8BHW-SEqvUiW1B7Fw", "text": "When I bought my vehicle two years ago, I decided to go to Precision for my car's routine oil change/tire rotations.  Not exactly sure why, maybe the coupons that come in, or that it is close to us, but I've had no problems dealing with them.\n\nMy only complaint, is they are always busy!  So people must like them, as I always have to wait.  This weekend I went late Saturday afternoon and had about a 1.5 hour wait for my oil change and tire rotation.  I have left work early to have this done as well, and it is still a long wait.  I think that is just part of the business no matter where you go though.  At least their waiting area is nice and comfortable with a clean bathroom!  I've had no problems walking around the adjacent shopping center while I wait as well.\n\nI am also with Brian H. on the female manager.  She was there last year when I came in and I was not a fan of her, she wanted me to do more to my car than what was needed - I said no to all of that.  All the other times, including this time, I was told my car looked great.  I trust them there with my car, but definitely not her.\n\nOne more quick thing, make sure you get your key back for your tires if you have a rotation.  This last time they kept it and I turned right back around to get it.  Previously, I did not even notice they had kept it until I returned months later and it was not in my car, luckily they still had it.  I know they do not mean to do it on purpose, but they get so busy they forget something that could be so important if I get a flat tire. \n\nSo far so good with my car!", "business_id": "VTu63fFRaKQV_BgoU8rquw", "stars": 4, "date": "2014-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "BLTRBkDSUN5IJdtFM4n0og", "review_id": "y6i74ek-Lvj4ai7QAmFBRg", "text": "Slow, absolutely the worst.  Horrible communication skills and customer service. I wouldn't imagine In million years how inconsiderate people in the auto business could be.", "business_id": "VTu63fFRaKQV_BgoU8rquw", "stars": 1, "date": "2014-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Dwug88D6sm31pgca9FC1Iw", "review_id": "m3VSSRI4R0cXyCyrW9mPsA", "text": "My name is Teresa and I own a 2004 BMW 325ci. My car had a cracked radiator and it was leaking fluid so I took it to one of your Precision Tune locations in Pineville, NC @ 10515 B Centrum Pkwy. They did an air pressure test for $39 and they confirmed that it was in fact a cracked radiator causing a leak. I agreed to let them do the work and they assured me that they could do it with no problem \n\nI have a timeline of my interaction with the location and the repairs that they claimed to have done\n \n\n11/26: Jason, the then store manager, told me that my car would cost $987 to fix my radiator.Later, he came back and re-quoted me $1400 to fix everything on the Cooling System\n\n11/28: I got the car back and it began leaking coolant again and making a loud noise (something that it didn't do prior to me taking it to your location). I called the shop and took the car back to Chuck. They were closing and he added anti-freeze and told me to bring the car back the next day so that they could locate the leak (a leak that they assured me that they fixed).\n\n11/30 - 12/3: I took the car to the shop because the car was leaking and Chuck told me that nothing seemed wrong because the car was sounding normal at the time. He couldn't identify a leak because the car was warmed up at the time. He just added anti-freeze again and that was it\n\n12/9: I spoke to Kim concerning the continuous leak and noise. She had Jason, the location manager, give me a call. I took the car back there and he told me that it was a hose leaking and that he would fix it but he would charge me that he'd charge $72 for the parts and waive the labor. He assured me that it would stop the leaking.\n\n12/16: I noticed my car leaking again and called. I talked to Kim and I told her the problem and also stated that I no longer wanted Chuck to work on the car. She told me that an employee named JP would be inspecting the car. I called Jason @704-536-8863 and he told me to call Kim again as she was the new manager. My daughter took the car back to the shop at 12 PM and waited. Kim told me that the head gasket needed to be fixed and that anti-freeze was mixing with engine oil.No one ever mentioned the head gasket until that day\n\n\nI called corporate that afternoon (1-800-227-8863 EXT:0) and I also called (866-944-8863 EXTt: 204). I have yet to receive a call back from their corporate office. I have been spending money on transportation to get me to and from work and it's an expensive inconvenience \n\n\nThis is unacceptable and I plan on seeking council with an attorney if no one from corporate reaches out to help me fix this problem\n\nAvoid this place", "business_id": "VTu63fFRaKQV_BgoU8rquw", "stars": 1, "date": "2015-12-20", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "He-c7mTOI6pMwJtBD9G9LQ", "review_id": "0oe-rmuKWQOpa09i9fIQGg", "text": "I've taken my car here at least twice. Both times it failed on a defective license bulb.\nNot the biggest problem in the world of maintenance but they charged me $8 to screw it in.\n\nIf you get your car tested here, I would recommend checking your bulbs first and if they say they need to be replaced, buy the bulb from them but screw it in yourself.", "business_id": "nLTTeGZrT2S2xaUISCgrSw", "stars": 2, "date": "2012-01-25", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "q1FJRubzB0XoJqqENtncvg", "review_id": "t6jLEX_zlrpq61ZHwyVT7g", "text": "I had my car inspected here. I didn't wait too long but when It got in for service and inspection, they had to fix some other stuff before they passed it, they repaired it but I wasn't impressed with the repair cost, I am sure it would be a lot cheaper if I went some place else but when they get you in a hurry.............", "business_id": "nLTTeGZrT2S2xaUISCgrSw", "stars": 3, "date": "2015-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yA37s9UOTIbhwAVFFcGeOA", "review_id": "v1UvXob_VlC_9CIn_sDwDw", "text": "Went above and beyond in helping me handle a tricky evaporative emissions leak that required 2 trips. Went out of their way to get it right, and I really appreciated their tech Chris taking time to walk me through the work they did and explaining the situation fully.", "business_id": "mnOTw4P5NaLbzFp2bTsm9g", "stars": 5, "date": "2015-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5wxVcaoy9kBl_8L5SJ9Tvw", "review_id": "ZVOYHy6yROXcNTSWYt0jDA", "text": "My husband and I have been taking our cars here for 5+ years. The staff is very helpful and knowledgeable!", "business_id": "mnOTw4P5NaLbzFp2bTsm9g", "stars": 5, "date": "2015-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bUhUrYUIcNRz-EOfX9kIug", "review_id": "ZfUDGB30w1YHiu0oTKNHPw", "text": "Liers and cheats. I chalk it up to them trying to take advantage of me because im young (20).  My brakes had been squealing. I brought my car in and had them look at it. I thought it was the front pads. About 40 minutes later they called me and told me in needed rear pads, rotors, and my brake fluid flushed because my rotors were at 10% and my brakes were destroyed. I've done more work on my car myself than the average guy and frankly it sounded like malarkey.   They quoted me $419.37, which is already ridiculous.   \n\nMy father and I elected to have it worked on back home. Good ol' Mayberry (Mount Airy, NC).  He took it to one of the shops in MA and had them check it out, because they had quoted us $240 for the same job. Within minutes of having the tires off they noticed something strange. All of my pads and rotors were above 50%. Just to be sure we had one of my friends whose been working on cars for years and years look at it. He said the same thing. \n\nGriffen Brothers simply lied to me. I am very thankful I didn't have them do the work. They should be ashamed of the way they act. \n\nThe associates name I spoke to was \"Danny.\"\n\n----------------------------------------------------\nUPDATE: I changed my original rating from one star to two. The general manager reached out to me an hour after posting my original review. It's means a lot to me he took the time to apologize. He explained the pricing difference, which I believe to a healthy extent. He told me he was looking into and was planning out how he'd reprimand the techanican at fault.", "business_id": "mnOTw4P5NaLbzFp2bTsm9g", "stars": 2, "date": "2015-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MWNSECOpcxO0UrZPqT8p5Q", "review_id": "0WJbzw0O4q5OWALXO20DRg", "text": "A very trustworthy car place in my opinion, something that can be difficult to find. \n\nI called ahead one Sunday morning because they were one of the few places open and I needed an oil change. They said to come right in and it would take about an hour. After hanging out for around an hour I wandered over to Bojangles and got breakfast, then over to Aldi and did some grocery shopping. \n\nIt took about 2 hours, but I didn't really have any complaints because they didn't try to oversell me. \n\nA few months later my car was rattling and I took it back. It took about an hour for them to look at it and tell me that I needed my engine rebuilt and needed to take it to a Chevy dealership. They didn't charge me for a diagnostic and seemed to be empathetic for the impending death of my car.", "business_id": "-_SZy-tV0oNRiFgMStMdyA", "stars": 4, "date": "2014-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Hzg-qWvNyHod3wVzsp_TEg", "review_id": "ee2liVpkwSnBGMoZvjOLyA", "text": "These guys were great. I came in early in the morning and they looked at my car right away, patched my tire and i still got to work early. Would definitely  recommend and i will be back for anything automotive related", "business_id": "fPIGHcsfCOclFYg2DPOvFQ", "stars": 5, "date": "2015-02-24", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 0}, "user_id": "LrgQbdg3V7uqLllQEbsKRg", "review_id": "KAV5u0pUgCD0AmhMegrpfQ", "text": "Unfortunately, I can not say I would recommend going to Town and Country Ford to purchase a vehicle. After spending time with a salesman I was told that the deal I was trying to get was impossible. Because I would not allow them to run my credit to run general numbers, I was told by the salesman I was making his job difficult. I have purchased dozens of cars over the years and have never given my social before all the numbers were given. The salesman told me either I let them run my social or they wouldn't do business. At no time did a manager come over and help out. I basically was told either I do it their way or I needed to walk. He told me to leave and that there is no way I could get the deal I wanted. Needless to say I purchased the same vehicle from Keith Hawthorne Ford a couple hours later for less than what I was trying to buy the car for at Town and Country. Some could say that the dealership does not deserve a bad review based on this rather, the salesman didn't do their job. I thought this at first, I just have been asking myself why wouldn't the manager come over and try to stop me from leaving or help work on the deal. Specially, as it was obvious they had a newer salesman.", "business_id": "j3nqWy30B-663uuc1AbDbQ", "stars": 1, "date": "2011-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "QRJVSygNCpQgGcIbBLsf9Q", "review_id": "LPATXARcK3s2Y-NtK2VYrQ", "text": "I recently came here for a safety recall having to do with the cruise control of my 2002 Ford Explorer. I had sent an online request for an appointment Tuesday for the recall service (free) and to get \"THE WORKS? FUEL SAVER PACKAGE $39.95 OR LESS\" which includes free tire rotation. Two days later, I called them after receiving no response. They said that they were having trouble with their e-mail system and to come in on Friday, which I did, arriving around 7:15 in the morning. That, along with tire rotation and oil change, had me ready about 8:45 or so. Unfortunately, the first time, they had charged me for the recall service, which I had to have them correct since per Ford, this should be no charge to me. Because I was in a hurry, I failed to get them to also remove the charge for the tire rotation which was supposed to have been included for free as part of my package. I feel this service department is dishonest and intentionally attempts to avoid honoring their advertised discounts. Very sorry I came here and will not purchase a new car from them in the future.", "business_id": "j3nqWy30B-663uuc1AbDbQ", "stars": 1, "date": "2012-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PpkKVodWC0sdn74TbHQLzA", "review_id": "TEe_Cq3e3fDhNAHCYPL0Dg", "text": "Body Shop did a Great Job!!!\n\nMost of the time I Hate Car Dealerships!  Car Salesmen get infuriated with me (I have stories to tell, though not here)! \n\nBody Shop!  This review is for the Body Shop!  After the body Shop worked on The Hogasaurus Chimped-out Limo (2000 Honda Civic)  it was in better condition than before the Accident!\n\nWhat impressed me most was that they also cleaned (detailed the interior of my car)!  That was not expected!  \n\nThis is the Third time someone has hit the Hogasaurus Chimpmobile not counting being shot three times and four windows being knocked out (one was shot out)... Not too bad a record for a 13 year old car!", "business_id": "j3nqWy30B-663uuc1AbDbQ", "stars": 5, "date": "2012-12-25", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "OH71gTLUc2BduDdY069Yog", "review_id": "GQfHTFaw4cv4M9AyV0FnBw", "text": "I'm still getting mailers from this place. Nope. I won't go. Keep your stinky coupons. Boo.", "business_id": "j3nqWy30B-663uuc1AbDbQ", "stars": 1, "date": "2013-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "1w0jMdnawDgm_CJqgvDWnA", "review_id": "LpoP3sh5wMVQy8T6FljtBg", "text": "I only gave them one star because it may look like I just didn't rate them if I left it at 0. WORST PLACE EVER!! I was told by a rude salesperson and an even more rude manager that I did not qualify for the 04 ford expedition I went to see before I was even given an opportunity to test drive. After leaving highly upset I stopped down the road at City Chevrolet where I was greeted by a courteous sales professional by the name of Avon Spann \"THE CHEVY MANN\". Not only did he get me in a 2014 vehicle which I didn't qualify for as far as ford was concerned. But he treated me so well I don't want to buy cars from anyone or anywhere else. Even if you want a Ford still go see The CHEVY MANN @ City Chevrolet. He'll get you anything you ask for. My brother is working with him to buy a BMW that is in Tallahassee, FL", "business_id": "j3nqWy30B-663uuc1AbDbQ", "stars": 1, "date": "2014-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "fH7XIOqlsohfSzUlP93AHg", "review_id": "hW7iShpGqyf0tRnXrn0IQg", "text": "Everybody here is very rude,  especially Bill. I stood and waited and asked if someone could help me.  One employee actually WALKED AWAY FROM ME! Bill spent 20 minutes on his cell phone talking about everything but what's related to the dealership. I asked Bill what it would cost to service my car and I got a figure that was completely different than what I was quoted on the phone.  I told him about the quote and he said he would check on it. I wait, and wait, and wait.  It took 30 minutes for him to get back to me and said that nobody here gave me that quote  (I got the impression that he thought I was lying by his tone) and it has always been a certain price and always will be a certain price. I think I will look for another place to have my car serviced next time because of the rudeness and because of the customer service.", "business_id": "j3nqWy30B-663uuc1AbDbQ", "stars": 1, "date": "2014-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "aWHKJebYNl-HQioOxHzC3A", "review_id": "P4ko_qDFjZnS1od7Ml48Ow", "text": "First off, from what I gathered, this  business is undergoing a facelift, so what I experienced may not be the same as what existed a year..or more ago! \nSecond, I've learned from car shopping it is often the luck of the draw with sales reps, they're either understanding and helpful, or they're not.\n\nThat being said I had an amazing experience here. After being disregarded and insulted at the Performance Ford Lincoln on South Blvd (DO NOT GO) I came to Town and Country unmotivated and discouraged. After explaining my previous experience to the salesmen, the staff went above and beyond to not only make a sale, but to ENSURE that I walked out with a vehicle I absolutely loved. I was able to compare prices at their location and others (while in-store) and even got a quote and walked out the door (promising I would return). And I did return! And the same salesman that I started the process with, stayed  2 HOURS after he should have been home, to get all of the paperwork done. They made the entire process transparent and proved to me that good customer service still exists in the car industry.\n\nAside from the detailing on the car, which was done fairly quickly, I cannot speak to their service department, but I will likely return to this location for the 1st oil change on my new ford!", "business_id": "j3nqWy30B-663uuc1AbDbQ", "stars": 5, "date": "2015-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oX6V5oaxuYJ3k6BbTD8QoQ", "review_id": "MZSAJb1X-SdBMnSlem2eYg", "text": "Bill in service has done a great job for me!", "business_id": "j3nqWy30B-663uuc1AbDbQ", "stars": 5, "date": "2015-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DfIRoFGgjTXutRq82wefRQ", "review_id": "BO4Cj4BfGl62TKr8KGzy2w", "text": "Ive purchased a few cars from town and country ford over the years and i am very happy with the entire process from sales to parts and service. Go in and ask for tre, he will help you with your new car or truck purchase!", "business_id": "j3nqWy30B-663uuc1AbDbQ", "stars": 5, "date": "2015-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y8bR-FWBeWtgjN0LP-p8Hw", "review_id": "MLN7Ui-HEK3wlwI02vrkTg", "text": "Bought a new F-150 here earlier this year. Had a good experience with the buying process so I decided to let dealership handle first service. I made an appointment on-line which was a simple process. Dropped truck off prior to appointment time and the check-in process was painless. I found out that the first oil change for a new vehicle purchased here is done at no charge.  Nice, I wasn't expecting that. I just had to pay to have tires rotated. I got a phone call a couple hours later when my truck was ready. When I arrived to pick up the truck I was presented with a bill for $23 and some change for the tire rotation and no additional charges. That was the amount I had agreed to when I dropped off the truck. I had to wait less than ten minutes for my truck to be brought around. Oil level was correct, engine compartment was as clean as when I dropped it off and the oil life monitor had been reset as it should be.\nNo complaints from me.", "business_id": "j3nqWy30B-663uuc1AbDbQ", "stars": 4, "date": "2015-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ja0vqMzrq26xSF3Ez4_vuQ", "review_id": "6XbWbnGmc2INhU1Ed3GybQ", "text": "I want to say it was a great experience, but it wasn't. We went in knowing there will be issues. I spent so long trying to avoid bad credit, that I hurt myself, do I knew there would be issues. Walked in saying \"let's get to finances first so we don't waste anyone's time\" instead I was shown warrantee packages. Then we sat down, discussed prices, and was shown a car. Test drove it, fell in love, so we sat down to discuss it. Got all my information in, and when they went to crunch numbers, everything failed. Took them an hour and half. Not only that, but after we complained, we were told they haven't run the #'s on my car yet, they ran it on 2 other cars they didn't even mention to me or even asking if I can drive a stick. Meanwhile the \"experience manager\" came to ask if I needed a water. I told her it was getting late, her answer in a very \"bless your heart\" tone was \"your ride can leave that's fine, you're buying a car today, see my name tag, says experience manager, I know what I'm doing\". No you don't Kelly. We told them off and left. Realizing I left paperwork there, we called and they said it would be waiting at the desk. Go back an hour later, they had to hunt the salesman down, only for him to have it in his pocket and try and sell me on their cars. Save your $ and time and go elsewhere!", "business_id": "j3nqWy30B-663uuc1AbDbQ", "stars": 1, "date": "2015-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GeZYR4rAoeOceQX-wIbqaw", "review_id": "38RNHni_thHabOBOSlqY2g", "text": "Took my wifes car in for warranty work. Had an axle seal leak on the driver side. Service writer Mike at the time was dealing with the repairs. Axle seal was replaced. Not even a day later the seal is leaking again. Advised service of mess in the drive way. They did not offer to clean my garage. Brought vehicle back and was told the entire PTU needed to be changed. I then asked the advisor what the PTU was and he stumbled in his response. I really dont feel confident in repairs if the advisor does not know his material. Will not return for service.", "business_id": "j3nqWy30B-663uuc1AbDbQ", "stars": 2, "date": "2015-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ja0vqMzrq26xSF3Ez4_vuQ", "review_id": "NXpgiDnGLYx6HVtJ3R3-rA", "text": "I understand that sometimes it takes awhile for banks to get back with dealerships, that was not the issue, and not my complaint. I feel the generic response excused what really happened. We were left waiting while our salesman went to run the numbers. After over an hour waiting, while my sister went to find out what was going on, that we found out they didn't even run the numbers on the far I test drove.  Instead they did it on 2 other cars I wasn't even offered, and both were manual when I specifically said automatic. And during the time my sister was at the desk, the \"experience manager\" rudely threw her job title around and suggested my sister abandon me at the dealership. Would you leave your sister, mother, or daughter some where with no guarantee way home? It wasn't until we left, realizing my pay stub was still there, and we had to return, did they run my numbers on the car I test drove. 3 times on 3 cars, 2 without my permission, and 1 after I stormed out. On top of that when I got my customer follow up phone call, I was asked if I enjoyed the Honda Fit I test drove. I drove a Nissan. Care lines idea of helping me? Trying to sell me a car at another location. Real classy guys.", "business_id": "j3nqWy30B-663uuc1AbDbQ", "stars": 1, "date": "2015-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-MaC1wyOK8P_8xRHlTz-gQ", "review_id": "hfpmcfgqpYS5VQipv9yw4Q", "text": "I attempted to obtain pricing via the internet.  I sent an email with the exact specifications including manufacturer codes for options for a car I know I'll need to order.  I requested a firm drive it out quote via email.  A woman called me and pretty much said I would need to come in and discuss this with them.  I was also sent two emails with an invite to come visit them.  Don't know why they have internet sales if you have to come talk with them.  My case is pretty cut and dry - I know exactly what I want and I don't want anything else. I'm not in a hurry, I'm not trading in, and I'm paying cash.  Pretty simple - give me your best price and I'll tell you if I want to buy from you, make a deposit, your order it, it comes in, I come pay the balance and drive out.  I certainly don't need to come in and be put in \"the grind\" (http://tinyurl.com/ka3u2y4). Still no email quote. Not getting my business when other dealers have learned how to deal over the internet.", "business_id": "gdaFZvWpmWIDri1Fv9PEHA", "stars": 1, "date": "2015-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4uQhTXpC7i3NN2sZ1f4iWw", "review_id": "PKO0H33H9kyzzjZPFUCP-Q", "text": "My husband and I spent all day on a Saturday searching for our second car and wanted to find a good deal for a pre-owned vehicle.  After stopping at literally every other dealership in the vicinity and just as we were about to give up, we turned into the Kia dealership on a whim and ended up leaving with a car!\n\nUnlike the other dealerships, when we told them what our budget was, Kia said, \"No problem!\"  We'll find something for you!  Every other place winced or scolded us for asking for a car for that much.  We ended up with a great deal and left with the car the same night, happy as clams.\n\nIf you're looking for the most professional, white glove service.  I'll tell you straight up.  You're not getting it here.  But you will likely get a good deal and that extra money in my pocket is much more valuable to me.", "business_id": "zpNqsFrhLJlxAtPrSkbImg", "stars": 3, "date": "2013-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ImQG8OsC2XncelDF83AFYw", "review_id": "IKTWwe4T0dZZpo4jraWEXg", "text": "I've taken my car to Tuffy on S. Tryon near Ayrsley since I moved to Charlotte, but when the quality of service went downhill recently, I found myself looking for a new mechanic.\n\nCoulwood Tire & Auto in NW Charlotte came recommended by a friend, and my first visit went as well as a trip to the mechanic could. Coming from a guy who never learned how not to get ripped off at the mechanic, that's saying something.\n\nJohn, the manager, was courteous and professional. He didn't try to upsell me on anything. The waiting area was clean and inviting. I even got a ride back to the office by Percy, one of the crew. Nice guy, too.\n\nThe service took a little longer than expected, but not too bad. And hey, I was at work instead of a waiting area...so that's good. The work seems to have been done as expected; I checked the spark plugs, new S-belt...everything seemed in order.\n\nThe price wasn't brutal. Tune-up, oil change and a new serpentine belt: $465. About what I expected. Still tough to swallow, but that's the life of a car owner, ain't it?\n\nAll in all, I'm pleased and will likely head back to Coulwood Tire & Auto next time I need service.", "business_id": "EF4UNFplUpjEEx9LglIR_g", "stars": 4, "date": "2011-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y5sbakJ-Zfv5gWNdDgZkuw", "review_id": "PyljpwbDiGjS9dYbQFz_JQ", "text": "Why is your gas at the pump still $3.30 when everyone else around 3.18", "business_id": "EF4UNFplUpjEEx9LglIR_g", "stars": 2, "date": "2014-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PFA2I01o2Rdmj-Tc-EqlMQ", "review_id": "PawCewRH3yhruPRIyFPsVg", "text": "Don't waste your time coming here. They must not need to make money because when my boyfriend brought a tire here to get repaired they barley looked at it and said it couldn't repaired when clearly it could. Took our business elsewhere.", "business_id": "VkAqGYd5TOMgO4yXo2fjuQ", "stars": 1, "date": "2015-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "JpOyej-qVMQkGuYMOitCWg", "review_id": "sM8nPQ7MBFU-9YFhKQh3_A", "text": "I bought a 1-year old S60 here a few years ago and was very happy with the experience:\n\n* The price I was given was fair- it was not much above the blue book value. I haggled a bit and the sales staff was professional and courteous.\n\n* I had to have routine/preventive maintenance done from time to time, and I was always given a loaner car and the work was always done on time.\n\nI have only one other car-buying experience (at a horrible Mercedes dealership in Fairfield, CT) and University Volvo was heaven by comparison.", "business_id": "UWtpIca-ub74r6Lgwfu0Og", "stars": 5, "date": "2013-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wXHiEEC75Hh3r_l6LOSQMQ", "review_id": "76pwstENCM3HKZWcYFHAnw", "text": "3 time repeat customer here and zero complaints!  We own 3 volvos currently and have always had an excellent experience.  The sales department has always been very fair, prompt and upfront.  The services department goes out of there way even staying after hours to see our need are met.  Keep in mind these folks are not magicians but do evrything in their power to see our cars are fixed properly, on time and with minimal impact to our busy schedules.", "business_id": "UWtpIca-ub74r6Lgwfu0Og", "stars": 5, "date": "2014-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vwucyrfUmE4fSj85Mm3H9A", "review_id": "gKBaUWI_8aeREts-tibx2A", "text": "We,my wife that is, has owned many Volvos, 4 in total two 850 T5s and two wagons one was a T5 purchased new and her current vehicle which is a 2008 V70 3.2 liter. Myself, well I am a Jaguar nut always have been and always will be  I have three classics sitting in my garage. Had I not been a Jaguar nut then I would own a Volvo as they are the best. University Volvo has taken care of two of her Volvos one of which was purchased there. Their service staff including the service writers service technicians and TJ the service manager are second to none. My wife is treated royally with professionalism courtesy, respect and understanding, how many dealers do you know that will, treat a woman like that?\nIn my experience spanning a period of 15 years I have found University Volvo to be honest, diligent and full of integrity, I have found no reason to take our Volvo to my independent Jaguar Mechanic who also works on Volvos. What's important in life is PEOPLE and University Volvo has one of the best teams I know of for working on a Volvo that I have come across,.We have enjoyed building a strong Dealer/customer relationship with University Volvo over the years and will continue to do so.\nPreventive Maintenance regular oil and fluid changes are the key to a reliable good running car she now has over 158,000 miles on her V70 and it still drives like it just came out of the showroom\nWhenever I read a bad review of a company, especially car dealerships I cannot help but wonder how the customer interacted with and treated the service or sales department. Just food for thought", "business_id": "UWtpIca-ub74r6Lgwfu0Og", "stars": 5, "date": "2015-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7epH_J0HeSrkkKQjaLU8MA", "review_id": "_q7igdNfBkfEZTQF0RuzSQ", "text": "Fair and reasonable rates with exceptional service.", "business_id": "fniL8DdDAQnFDxoSmuDBmg", "stars": 5, "date": "2014-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5aNR89OHDBin6Y7eEEAeAQ", "review_id": "eOTmKN1Yb3G7FQnk9HdWkQ", "text": "Alright, if you look at my review history, I am a highly selective review writer. It's either good news or bad news for the business. Anything in the middle is left where it should be - unmentioned. In the case of A-One Autoworks......it is AWESOME. \n\nI've been there twice now. But before i go on, I have to say. DON'T let the location or appearance of the place throw you off. This is a place where I've taken a Porsche and Audi to get worked done and the quality of the workmanship is impeccable (If only the swankier body shops had service as good as they looked from the outside) Price wise, I would say that you get way more than you pay for. \n\nBill (the owner) is an unassuming bespectacled guy who you will often find with a beer in hand. He is the nicest, most honest and sincere auto body workshop owner I have ever met. Which is why I go straight to him even though it is out of the way for me and I have to cab back from the middle of nowhere(Figure of speech) He will tell you honestly what really needs to get done and how he can help you out based on your budget. I highly recommend! \n\nP.s Bring him a 6 pack of beer when you bring the car in to get work done and you'll have a friend for life! (I can't substantiate that claim but you'll know what i'm talking about when you get to it)\n\n1 star - GREAT SERVICE\n1 star - GREAT Workmanship\n1 star - AWESOME Value\n1 star - HONEST ADVICE (even if it means less money for him)\n1 star - FEEL GOOD FEELING (after paying knowing that you didn't get taken for a \n              ride and because you know you most probably saved at least a few \n             hundred bucks from anywhere else\n\nTHEREFORE 5 STARS*****!!", "business_id": "MIqx6o7Tpu0A_y0RKlNsxw", "stars": 5, "date": "2012-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "afHt4_EtFFMpDsXW1IfLgA", "review_id": "bZT5B38aTyvsOA6UBZo2Kw", "text": "I started bringing my Audi here about 3 years ago. The staff is friendly and forthcoming. Generally speaking, car repairs suck but the mechanics here make the process here easier. Most importantly, I feel like I can trust them. I never feel pressured to get more work done than I can afford and they take the time to explain the repairs to me and answer my questions clearly and respectably. They are just stand up guys.", "business_id": "O16EckCLtNoA49hewGht_w", "stars": 5, "date": "2014-02-28", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Yhlx0ob3UDz2PcJRat2QgQ", "review_id": "UwBMnvW0cXLqxQDHO84Ugg", "text": "I don't like getting oil changes. In fact, I avoid them. Not because I don't want to pay for them. Not because I am irresponsible. No. It is because I hate the whole spiel they have to give me about selling me all the other stuff and services even when I tell them no ahead of time.\nThat part aside, I had a fantastic experience with this location. I dropped my car off, walked the block down the road, saw a client in their home, walked back and my car was done. Seeing as I dropped my car off before 10 am (Early bird special is from 7-10 am), I saved an additional 10 dollars. They vacuumed my interior and washed my windows better than the homeless guys on the corners. Yes. I shall be back and it will be before 10 am. Just please, stop trying to up-sell me. My little car doesn't need all that nonsense when it is slated for a trip to the junkyard/big sleep in the near future.", "business_id": "ugGTR2EvJ0c_-TpMS1LSNw", "stars": 4, "date": "2013-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5stdswOPWb0jxXIudgbEvQ", "review_id": "2XU9XT1Rp-Qr-rVPalYwmQ", "text": "DO NOT GO HERE! Had my oil changed on 12/2/14. As I left the lot I pulled out onto University Ave and my car immediately died. I turned around and headed back to Jiffy Lube to see what the problem could be as my car was fine prior to the oil change. They took my car and \"said\" they ran a complete diagnostic test and said that my spark plugs needed to be changed and that my battery was bad. They immediately said \"we have a guy, would you like us to call him?\" I felt like I was being scammed, how can my car be completely fine prior to the oil change and then after the oil change I now need new spark plugs and possibly a new battery? I declined their offer to \"call their guy\" and decided to take the chance and drive home. \n\nOnce home, i took my car to my local garage, which I should have done in the first place, and they informed me that Jiffy Lube failed to put the air filter on correctly after they changed my oil. Considering all Jiffy Lube does is change oil, I feel placing the air filter on correctly is something they do in their sleep. So, the so called diagnostic test that they ran was probably a load of BS and all they wanted to do was scam me into having \"their guy\" fix my unbroken car, which probably would have cost me an arm and leg. Shame on you Jiffy Lube! Just remember, someone is more likely to share a bad customer service experience than a good one, you can bet I will be sharing this bad one!", "business_id": "ugGTR2EvJ0c_-TpMS1LSNw", "stars": 1, "date": "2014-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XmSPy_RTZArCirAqWsVP6w", "review_id": "5DXUbZ83cCt9R44U4wZ1zQ", "text": "Seems that recent turnover has caused a decrease in previously praised customer service. Have had basic oils changes for years at this location. In past oil top offs were included and complimentary. Was advised on recent visit that was not included with basic oil change.When advised no problem in past years was told I could buy a quart for $6.50.. Hmmm. In summary was there for 20 minutes to check oil and received upsells only..", "business_id": "ugGTR2EvJ0c_-TpMS1LSNw", "stars": 2, "date": "2015-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LB4ARClL3KZ-AXLmFmJfqA", "review_id": "K4hgGmLbzXg2BFzlf6IPZQ", "text": "We've been very pleased with Stuart Wakeman in the service department. He's always been straightforward with us about repairs and has let us know whenever a part or service was covered by warranty, even when we weren't aware of it.", "business_id": "uyp8kpTXKfKXvAB8HdJSAA", "stars": 4, "date": "2010-12-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FWuzfJNDjOGAp2KaRcd9PQ", "review_id": "9qHt41AdpsA3FdfjA55LyQ", "text": "Typical dealership.  They know the car well (I should hope so) but every repair is extremely expensive.  You can usually do better to go to a local mechanic.  We needed a new antenna for our Jetta... $50.  Yeah, no thanks, I bought one on ebay for $11.  They do have loaners which is nice, and a nice little waiting room area with free coffee and WiFi, but the location is bad (way far out in middleton, not near any public transport) and the prices are just absurd.", "business_id": "uyp8kpTXKfKXvAB8HdJSAA", "stars": 2, "date": "2011-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cBBarVpwP94MsS63W4KKZg", "review_id": "7snrcq5LynFLL6lThn9Tdw", "text": "I've been taking my two passats here for a number of years - both cars are driven numerous miles - well over 130,000 and 180,000 miles on each of them.  Service has been quite good - a number of repairs and ongoing maintenance.  I've been pleased with the service and attention I get.  The waiting area is very nice and comfortable for anything say 2 to 4 hour wait.  After the quality of service I've gotten, I decided to purchase a car here.  Already owned my other two VW's before moving back to Madison.  Recently purchased a 2012 Jetta Sportwagen and had friendly and attentive sales and service.  Only thing I didn't like was the pressure to purchase add-on items - paint protection?", "business_id": "uyp8kpTXKfKXvAB8HdJSAA", "stars": 4, "date": "2011-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2D3_bP4W1eOU93wtQlxKgA", "review_id": "24GsvzonAK4_O266pq3d3Q", "text": "I called in the morning to get my jetta wagon tires rotated and oil changed. I was able to get an appointment that morning.  On my way to the dealer I picked up a new pair of windshield wipers at an auto supply store per my husband's request. When I arrived at the service desk, the service rep noted that the proceedures would be covered under the 30,000 mile checkup and that my winter salt encrusted car would be washed.  Yea!  They also installed the windshield wipers.  Everyone at Zimbrick was really nice, I got to lounge with coffee and magazines, and the wait was shorter than predicted.  Thanks for the great service!", "business_id": "uyp8kpTXKfKXvAB8HdJSAA", "stars": 5, "date": "2013-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cZFqA2yCS606Sempa8L6vA", "review_id": "qRc4aEOfr8ASksdS2vv2yA", "text": "Brought in my 2012 Passat TDI for its 20k service and received excellent customer service as usual. I even had a last minute change in my schedule that was handled smoothly.", "business_id": "uyp8kpTXKfKXvAB8HdJSAA", "stars": 5, "date": "2013-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cBBarVpwP94MsS63W4KKZg", "review_id": "M1lAG0Ypyen5DN-meEotAw", "text": "I've been bringing my VW's here for nearly 8 years...first my wife's 99 passat wagon and my 04 passat.  Last year, we bought a jetta sportwagen from them, largely because of the quality of the service we've gotten from the service department.\n\nWe've had to face some pretty large repair bills at times but, I've felt they have been fair and done quality work.  There have been a few hiccups but, the service folks have always been accommodating and flexible to help work through things.\n\nI have tried taking my cars to other shops a few times but, honestly, the price savings weren't that great and I have received more reliable service from the dealer....\n\nhint:  If you need a lot of work done, plan ahead and ask for a loaner car.  They're usually really good about that", "business_id": "uyp8kpTXKfKXvAB8HdJSAA", "stars": 4, "date": "2013-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CoWFFmXngPS7Den-2N4mWQ", "review_id": "SH1xGdwaslew1VZ_V59MWw", "text": "I have my work that no one else wants to do done at j&l and I do not get robbed.\nThey do good work and at a good price. I have my oil changes done there also\nand they send me reminders on the internet for this and other special offers.\nThanks to J&L and the crew", "business_id": "XCfRPJ9UCgd1dPkzXRsjPw", "stars": 4, "date": "2015-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xsfGCu0UyoulL1UwVzMVbA", "review_id": "3Nl9F5ohUEoVMYpzNwP9Mw", "text": "Amazing, kind-hearted mechanics you are not out to stick it to you, but who price fairly and do great work.", "business_id": "Y_RXxkTlzXmir57sp2SvSA", "stars": 5, "date": "2013-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zMzVLKJ-cC14zRrF0ogEkQ", "review_id": "glUT6Uma0lX3vnrNvfcBBA", "text": "I had to stop going to Tom's because they are so hard to get in touch with. I still think they do great work once you're in there but it took me weeks once to get anyone on the phone.", "business_id": "XStsiplxlx8Guqf-oV5LAw", "stars": 4, "date": "2014-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "URw2mP76_1JQFZXKAwda4A", "review_id": "tSzUUH1JHC4Fz2-F281dyQ", "text": "We've taken our cars here several times and have never received anything but quality service. Each time I've genuinely felt as if they've provided us the best possible service and genuinely care about our satisfaction as customers.\n\nThe only reason I didn't give them 5 stars was because recently I went in for an alignment and they pointed out a repair that I needed and that they wouldn't be able to check the alignment until I got this repair. So, I went ahead and let them order the part, they fixed it perfectly, tested the alignment, found out the alignment was off and then told me because I drive a Cadillac, they don't have the proper tool to perform the alignment there and that I should take it to a Cadillac or GM dealership. That would've been nice to know before I authorized the repair, it is kind of inconvenient to take it to 2 different places. Not a huge deal though.", "business_id": "Yn89vJYXcdprx9U_w1qmMw", "stars": 4, "date": "2012-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "e7-9o5OmKMiQReixCA6b8A", "review_id": "sf0L_6tggePx76xMCYvW-A", "text": "I'm a happy firestone customer.  After being ripped off by a small family owned auto repair shop in Madison, I was pretty leary of taking my car any where in this city.  \n\nThey've never pressured me to make repairs when I take my car in for an oil change or other minor services.  They have made me aware of things that will need repair or recommended services, but there's no pressure to fix it immediately.  I appreciate the heads up and I'm happy they respect my decision of not making repairs unless it's a safety issue.", "business_id": "Yn89vJYXcdprx9U_w1qmMw", "stars": 4, "date": "2013-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "no9odAfwocTruGYGNUVcIg", "review_id": "xvxrHdCkSzmPCv33nHrrRQ", "text": "I've been here 3 times in the last 2 yrs for oil change, winter tire installation and high mileage services. The price is fair for the great service quality they provide and the staff is very friendly. They have the patience to explain things to customers and I see that they have lots of loyal clients. \n\nThere's waiting area with hot cocoa, soda and coffee. The restroom is clean. They also provide free rides for people who drop off their car on site.\n\nI will definitely service all needs of my car here.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 5, "date": "2008-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3ApXIjJIzNwEeZzjS4ifNA", "review_id": "0l15O6tTwiMawDkbfhWNng", "text": "Honest and dependable.  After inspecting my mother's car, they informed us that spending a large amount of money for the repairs was not advisable.  Most shops would have done the repairs / taken our money regardless of the car's age & condition.  They were very thorough in their explanations.   She has since bought a different car and has had it serviced here.\nThey offer free transportation services and have a nice waiting area, complete with a soda and coffee machine for their customers.  I highly recommend them for your car care needs.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 5, "date": "2011-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wIoUK9dW_Bx2UtKTbg4h-A", "review_id": "wI5a2lY6xsC7QeGQ2aRwUQ", "text": "I called today when I was in a frenzy because my car was acting up, and I was not in my neck of the woods.  \n\nI received a caring voice on the other end.  Unfortunately, he was not able to service my car because they were booked solid, but he gave me suggestions and recommended another establishment.  \n\nI truly think this must be a good place that cares about its customers.\n\nThank you!", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 5, "date": "2012-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "qj1yjRmY4FKykhOiIbPbyA", "review_id": "Xt7KMnjtWFxFbbIkADslcA", "text": "This is the best, most friendly, most trustworthy auto repair shop I have ever used. I needed my brakes replaced and new tires. They dropped me off at home and picked me up at work (my work is pretty far away from the shop.) The man who picked me up at work was so nice and we had a lovely conversation.\n\nThey gave me a discount for military families too. Usually at auto repair places, I have my guard way up, assuming that the place is trying to trick me into paying for services I don't need. I felt so comfortable at this place and never once worried about that sort of thing.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 5, "date": "2013-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-DJPP8LKzssdhoSdqjylhw", "review_id": "OW_oZ5Eo6kyFvZySN7pDEw", "text": "Pretty typical big city auto shop experience.  I was hoping for an outstanding experience based on the other reviews, but I have to say it wasn't a whole lot different than other big city repair places.  Based on my experience there I would advise:\n1. Call for a rough estimate, and make it clear that you haven't committed to any particular shop- my truck was immobile and I made the mistake of having it towed there first and then got the estimate once I was pretty well trapped.  My repair ended up being 10% more expensive than the last identical repair I had gotten done at another shop, and about 30% more than my regular small town mechanic had quoted me.  \n2.  Thoroughly review the estimate in person and make sure there won't be any unexpected add-ons before agreeing to the estimate- I agreed to the estimate only to get a call later saying that there would have to be an additional $150 repair made in order to do the alignment, which should have been quite obvious to them at the time of the initial inspection.\n3.  Ask lots of questions- after getting my estimate, I asked if the $50 estimate charge was included in the quote I had been given- he paused, backpedaled and said no, \"well we haven't even figured out how we're going to get it into the shop and up on the lift to do the repairs yet, so it might be a little more.\"  I'm sorry, but the $50 I agreed to was for the quote you just gave me, not for 'figuring out how to get it into the shop'.\n\nSo, when it was all said and done I had paid what I figure to be at least $150 an hour in labor, which seems to be on the higher end of what shops charge, so I wouldn't go here expecting a deal.  Aside from the gentleman I had the quote snafu with, everyone else seemed professional, but I didn't have a particularly overwhelmingly great customer service experience.  Based on the other reviews it sounds like they go out of their way to make women in particular feel comfortable there, so if you're willing to pay extra for that experience, and you're not a cheapskate guy driving a junky old truck this might be the shop for you.  I personally am going to keep shopping around.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 3, "date": "2014-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3PvyCnNTvOWZLvnSd1fNyA", "review_id": "cN-QYRafBUmsuFR2cbT3bQ", "text": "Have taken my car here a couple of times, because this is where the SO's family takes theirs. The service is quick and friendly, they were able to get me in same day for an oil change when I called. It really has a homey, welcoming atmosphere for a car place. They offer a courtesy shuttle if you need one, which is nice. When I got my oil changed, they noticed a heat shield hanging off the bottom of my car, and took it off for no charge. I asked if that was a problem that would need to be looked into, and they said no, without an explanation as to what it did and why I didn't need it, which seemed a little odd, but I didn't ask for an explanation, and they were busy, so I can't really hold that against them.\n\nAll-in-all, nice place, will probably be taking my car here as long as I'm in the area.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 4, "date": "2015-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pYYvlPynPqTPJGI1zqQ90g", "review_id": "jrKFMAVLa_MFfuey315_iQ", "text": "Called ahead asked if I needed an appointment to bring my vehicle by, said it was ok to drop off anytime. Brought it by that morning and explained the brake problem I was experiencing. Was expecting a call back later that day, but did not receive any follow up. Called back the following morning, and the vehicle hadn't been looked at but I was told they'd have more information for me before lunch time. \n\nGot a call back with a $1200 estimate. Explained that although the part that needed replacing was not expensive or tough to replace, much of the brake system needed replacing because of rust and dry-rot. Picked up my vehicle later that evening and took it to another mechanic for a second opinion. \n\nEnded up getting the job done for $500 less than Chet's quoted, with much of what was said needing repair un-touched. Even got a comment from the second mechanic at how solid the vehicle looked underneath (hardly any rust for it's age). The vehicle has spent all but one year of it's life (1990) in California/Arizona, so it was good news to me that one year in Wisconsin hasn't beat it up too much.\n\nShop around for repair quotes if you can.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 2, "date": "2015-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "C0qc_UQtyZiTJVXIXOUnzA", "review_id": "sN4S57sFv4BVjD5_sXD8bw", "text": "They were one of the first to come up in yelp so I called. Ehmn no thanks!\n\nThe man on the phone started out friendly but lost his mind somewhere along the way. I think at some point he asked me to be quiet.\n\nThe story goes something like this. I have an old car it needs to be fixed. Before I get it fixed I like to get an idea of what I am getting into pricewise.\n\nI called to let him know about my window that stopped working and needed to be fixed. I just need a quote because I am shopping around. This must have got this fella hot and bothered because all of a sudden he blew his lid and became rather prickish. Well, it is still my money and I've still got questions. \n\nHe told me that I was talking too much while explaining to him what was wrong with the car; and , he thinks it is a waste of his time if I call in the parts from Kragen which is what I normally do. It is so much more cost effective to do this because you can take the older parts to Kragen where it will get recycled and refurbished ( you get a small price taken off your purchase, and it is a great for the environment).\n\nThis guy just showed his hand, because he quoted me 2x the amount another shop had quoted me $300ish parts and labor yet he started at $600ish. He must have thought me ripe for the taking, but this isn't my first time at the rodeo.\n\n\nJudging by other reviewers who have shopped around and received price quotes from Chet's, you will be wise to do so too!", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 1, "date": "2015-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7cOc19T2-TrOJX68V_O5kQ", "review_id": "II4SAqv2DVx3PSTT2Dlb1Q", "text": "Completely incomparable! Loved Dave and the service I received. I had a gas leak and needed all of my gas lines replaced. He was able to accomplish this in less than 24  hours. My father was a master mechanic while I was growing up. Unfortunately I don't live near him so I had to look elsewhere for service, but was thoroughly surprised with his knowledge and help. I approve and will use him for as long as I am in Madison.", "business_id": "0-wZJOsaLFwvbMF78aYeiQ", "stars": 5, "date": "2015-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "MODsi-IFV80Bt7RjYaspiw", "review_id": "65U2RKaqxP74IrRlMTr0GQ", "text": "We've been going to Dave exclusively for nearly 20 years and have never been let down! It's so comforting to have a mechanic you can trust.", "business_id": "0-wZJOsaLFwvbMF78aYeiQ", "stars": 5, "date": "2015-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "82hpPg5KCqTv_BlwIDYZ4g", "text": "I haven't used them for service, but I do stop here regularly for fuel and soda/snacks.\n\n+ Easy access\n+ Free air for your tires (near service bay doors)\n+ No ethanol in the premium fuel\n\n+ Inexpensive, effective, touchless car wash \n\n+ Nice little convenience store; staff is friendly\n+ ATM in the back has very reasonable service fee", "business_id": "IFzagko8Y344ajAhWOxnUw", "stars": 4, "date": "2014-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "wE7kSbc96IIXpQxJgLrGMQ", "review_id": "aVajRgfFM8VwcD4FQKBi2Q", "text": "Definitely the most convenient place to fill up and get a car wash on the east side. The wash code prints out on your gas receipt right at the pump. Eight bucks for the best quality touchless wash including scented prewash and undercarriage wash and spot free finish, and the car comes out really clean and shiny and smelling fresh. There's also two lower levels of wash at $7 and $6. Really an affordable day brightener, this time of the dreary winter. I'm a fan. \n\nNote: If your car rides low, or you have an extended bike rack that rides low, be sure not to go out the Fair Oaks St. side of the lot, or you will scrape loudly and painfully on the steep grade. The Milwaukee St. side exit is nice and flat.", "business_id": "IFzagko8Y344ajAhWOxnUw", "stars": 4, "date": "2015-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "udxSfWbg5GeJSf4ZG6e8nw", "review_id": "o1ljB24BkNd9V3VEDsf8lg", "text": "I can count on Dave.   He is HONEST.  A trait hardly seen in the car repair business these days.  I am afraid to buy anything other than a VW because I would never want to lose \"my mechanic.\"  He's simply the best.  - Bob M & Sile S.", "business_id": "IlE4UouTsBEGiJ_bNrb5ug", "stars": 5, "date": "2011-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "RWySlALSCn7-wjx0mxBfTg", "review_id": "G105bezPcBGYeb8WfrPAkQ", "text": "I don't have a VW, but I deliver pizza to this business from time to time. Sometimes money falls out of my pocket when I'm making change, and I guess that happened today. Dave called the pizza store and told us that the driver dropped some money! Thank you for being honest!", "business_id": "IlE4UouTsBEGiJ_bNrb5ug", "stars": 5, "date": "2011-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "p7Jj2adHATSYFJXlZ_f2dA", "review_id": "dYRIs0d4-zPPzAQ2ryYuyQ", "text": "Dave and his team at Courtesy Auto are some of the best I've ever seen. I've been to a handful of mechanics, but tend to not return because I'm less than impressed. Courtesy Auto, on the other hand, has had me as a return customer many times now. Dave is honest and explains what the issue is in very basic English that is easy to understand. Every time I go I always know exactly what the problem is, how it'll be fixed, and how much it's going to cost me. His shop has made me want to continue buying VWs because I know I'll always have a great place to send them whenever an issue arises.\n\nIf you have a VW you MUST go here!!", "business_id": "IlE4UouTsBEGiJ_bNrb5ug", "stars": 5, "date": "2015-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IijNvs6HQMo-QDkFznKeWg", "review_id": "edYb4jNwhmqnPbIxMDQKaw", "text": "The manager and mechanics are kind, honest people who provide phenomenal service. I went in to have my muffler and center pipe replaced due to rusting issues. \n\nThey saved me $600 over the dealership service quote, had the required parts delivered within the hour, and finished the maintenance itself in about an hour.  \n\nI felt entirely comfortable trusting my car to them, and plan to have all of my future servicing done here.", "business_id": "zHdt_KW2QqgJJ9bLmtShdQ", "stars": 5, "date": "2014-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "s9WsXi6ygS6fDIjiEP6nLw", "review_id": "fPsXNZoNYoEqe8ipYxXXcw", "text": "I was a first time customer at Handel on Monday, January 30th. Bill, Laurie and Darryl were very welcoming and easy to talk to. They never made me feel like I didn't know what I was talking about. I had gotten home that day to get ready for work, and my car was acting up. I called them on Tuesday to let them know about the problem, and I was unable to get my vehicle to them that day and I was planning on taking it in on Wednesday. Laurie called me back and told me that they were going to pick my vehicle up at my house and bring a loaner car for me to use. That way they could take a look at my car while I was at work. They went above and beyond to make me happy. At this point I am not really worried about the price, I am just so thankful that they are willing to do that for me!!!", "business_id": "mMiTHeVCf2glBIFFgXqIQw", "stars": 5, "date": "2012-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G1vKFp5QhqV7XwLoveOGow", "review_id": "LO7Bx5_5K9t4Pj0ZVHPZqQ", "text": "We recently had an issue with the coolant system in our car and needed to get the car in to have checked out.  Bill was very helpful and they were quick to determine what the issue was with the engine.(which I think had been previously misdiagnosed at another establishment) I would recommend taking your car to Bill and the Handel team in a heartbeat!", "business_id": "mMiTHeVCf2glBIFFgXqIQw", "stars": 4, "date": "2013-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jfdwxGcg8jMGmYlzniQpgg", "review_id": "6OOqrHzZHYmFganvA1VO2w", "text": "The reviews here amaze me.  Two times I have gone in for an oil change, once with my car and the other with my daughter's.  They told me both times that we needed a new tie rod, and we'd better get it right away as a safety concern.  Knowing how pricey they were, I took the cars to another mechanic out of town.  They couldn't believe we were told that as there was nothing wrong with either car.  Another time two years ago, I went in to have them look at my power steering.  They quoted me $1200 just so they could diagnose the problem.  I walked next door to J& H Auto to buy some power steering fluid and was given the name of a mechanic they would recommend.  He fixed the problem for $60!!!  Yes, the employees at Handel's are very nice, and sound sincere, but definitely get a second opinion.  Three out of three times seems a bit suspicious.", "business_id": "mMiTHeVCf2glBIFFgXqIQw", "stars": 1, "date": "2014-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7hCsRGB7lV2MZYny4w3w0g", "review_id": "k8YhdiwQi3PvhdGVPYpBTA", "text": "This is the first review I have ever written for yelp.  I feel it necessary based off my most recent experience.  Almost $700 for an oil change, fuel filter, O2 sensor replacement and tune up.  Since these services have been completed my gas mileage has decreased significantly.  Not a good experience at all.\n\nUPDATE ON 02/16/15:\n\nAND IT GETS EVEN BETTER!  So after all these services were done I noticed a substantial decrease in gas mileage, so I took it back to Broadway to have them look at it.  They reviewed everything and said it was a \"faulty fuel filter\".  They put in a different one and said everything was fixed.\n\nNOT!  I was still getting terribly gas mileage so I went to a reputable mechanic and he showed me that when my car is on that gas is shooting out right from where my fuel filter is at.  It was spraying everywhere and obviously not fixed.  I am going back to Broadway today to show them again what is going on.  This will now be the third time I have taken it there to get the same thing fixed.", "business_id": "kZiRL1dkGowCcL7nM86OYg", "stars": 1, "date": "2015-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "-ZSPer3Fb79GxWLUIq7Dfw", "review_id": "vDPQAxMJdffxj_3edDo9Zw", "text": "They did a fabulous job fixing my Jetta after it was swiped. It looks amazing, can't even tell it was hit. I cannot comment on the price as it was covered by insurance, but the staff were very friendly and helpful.", "business_id": "L3dTz2TQIyov5NbPdJLkSA", "stars": 5, "date": "2014-02-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7TpIL9ykIa08FVt5iDLmLw", "review_id": "aDa8twOkb-W4W5TOrEFyDA", "text": "Very positive experience with Zimbrick Nissan on High Crossing Blvd.  I recently sailed my KIA into a tree farm on an icy morning.  Not prepared, or in any mood to purchase another vehicle and resume monthly car payments, I eventually relented and did my homework, researching the vast market of SUV's.  I settled on the Nissan Murano and decided upon a 2011 certified pre-owned that they had in inventory.  Keith Cone was our salesman throughout the entire process and I cannot give him  enough positive feedback.  He turned what started out as a scary, unpleasant event into a wonderful experience.  I basically only know how to get gas and turn on a radio.  Keith took his time in explaining and thoroughly answering questions about the vehicles I was comparing and considering.  He is approachable, relatable, knowledgeable, patient, and I could tell he was genuinely sympathetic to the situation.  He goes above and beyond, offering to come in on his day off if needed. At no time did I feel rushed or pushed.  I could also tell that he was not going to let me drive off in a vehicle that was not an appropriate fit for my needs. (I drive over 100-miles daily on crappy country roads). The entire team at Zimbrick were professional and courteous.  The paper signing at the end is usually a long, drawn-out snooze fest, but even this seemed to go quickly and painlessly...thanks, Bill!  Best experience I've had from a dealer.  I had purchased the KIA brand new from Metro Ford/KIA in 2007 and they were rude and unprofessional.  I feel that I will remain a life-long customer of Zimbrick High Crossing and will definitely seek Keith Cone in the future when I am in the market for a new vehicle.  Thanks so much you guys!", "business_id": "AJOejrnO0z4lzp_GHO6wUQ", "stars": 5, "date": "2014-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3ayNzPfO7M9WowVARKsJlA", "review_id": "Wh3Z3z1FZMZXqMNtzIafjg", "text": "I have had multiple experiences with the Zimbrick Nissan Service Department.  Due to an ongoing problem with my truck, I was forced to take it in for warranty service that resulted in several trips (not to the fault of Zimbrick).  Each time, I was promptly driven to work by their shuttle or provided a loaner and dealt with in a professional manner by all staff (including the service manager).  Upon returning, my vehicle was always washed and often times waiting for me in the service garage so I would not have to walk out into the lot.\n\nI would highly recommend Zimbrick for both their service department and their overall customer service as it relates to vehicle repairs.", "business_id": "AJOejrnO0z4lzp_GHO6wUQ", "stars": 5, "date": "2014-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "ZMdFgW5Q9pRUfcERKVQHeA", "text": "This review is for their parts department - what a great group of super helpful folks!\n\nI did some work on a friend's car over the weekend (replacing an alternator) when we discovered that another part (belt tensioner assembly) was also broken... problem: the part was only available from a dealership. Scouring the web and calling every known parts store in the area yielded this realization.\n\nI called Zimbrick first thing on Monday morning and Pete was able to find the exact part and he had it ready right away. Totally saved my bacon. The part was reasonably priced, and everyone from the service department to the parts counter to the cashier was extremely friendly and helpful.\n\nYay!", "business_id": "AJOejrnO0z4lzp_GHO6wUQ", "stars": 5, "date": "2015-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OZCzq4BvNGdTpBE2iUg0Tw", "review_id": "ciIpDEM0QYahc-VXg6Pr5A", "text": "This is the second time I have used Tatman's and both times I have been 100% satisfied with the results.  This latest time was after hitting a deer.  It was simple to get an estimate and everyone was polite and cordial.  They handled most of the paperwork with the insurance company.  It took a few days longer than expected to finish the car but the results were worth the wait.  My Mustang has an unique paint color and they got it right.  They returned the car cleaned inside and out.  Looked great and all repair work is guaranteed for life.", "business_id": "4jlqFH3cZsgRdWxZ6kwwvg", "stars": 5, "date": "2014-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RE0dAd5Roih1CwIL2JLTsA", "review_id": "fNupqnHtlNhaOShwlmBrLQ", "text": "I was on my way to trade my BMW in at a dealership when the engine light came on.  Pro Tech took a look and made the repair right away.  Their fee was fair.  They made my day!  I will go back next time I need something.", "business_id": "P_X0pRArVxBjCihppLmHJg", "stars": 5, "date": "2014-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x1KO_W6NVZRH_AxbReKkUA", "review_id": "BPuu8UdK6ASm7xBZxhPG8A", "text": "They were flexible, got us in quickly (on a Tues.)  and even corrected a mistake they made when they estimated the price.  We just had the rear brakes and rotor replaced for a 2008 Volkwagen Jetta SEL2.5, as well as an oil change.  They found a secondary problem due to us taking so long to get the brakes fixed.  Due to work schedules and having to get the work done on a Tuesday, they drove me to and from work so I could drop off the car and pick it up when it was done.  They also were very friendly and helpful during the entire process.   I would very much recommend their work in the future.", "business_id": "P_X0pRArVxBjCihppLmHJg", "stars": 5, "date": "2014-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4b_Yo9nopZRqRoTQRXp9EQ", "review_id": "VVsYFO2WeAKkrG7Iog4TUQ", "text": "The staff at Urbana Tire Company have always been very friendly, knowledgeable, and incredibly helpful.\n\nThey always provide real timely service at an affordable price and they don't give you the run-around with repair costs or deadlines.\n\nThey are located close enough to downtown Urbana that if you drop off your car you can take a peaceful stroll down Main street, maybe stop by the book store, or drop into any one of the dining/drinking establishments to have a cool beverage and a tasty bite to eat while your car gets fixed.", "business_id": "XL5MmKKzob_TIiRW_GnhAA", "stars": 4, "date": "2011-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "USkmMVTh2omYmajDSRGUSQ", "review_id": "zyMioFUHIpOzuiKn6YA_MQ", "text": "When I lived in Urbana I used to take my Subaru here for repairs because my housemate recommended him.  Tom does great work and he knows his stuff.  He's honest, takes the time to explain your options, and he doesn't do work when you don't need it.  He also doesn't charge for minor stuff.  One time, I took my car in because I was hearing this loud rattling sound.  It turns out that squirrels had stored nuts in my tires! He didn't charge me at all. He's also stayed late a couple of times to hand me my keys when I couldn't get back to the shop before it closed.\n\nI went to him because I was having problems with my brakes so I don't know how he is with other work, but I was happy with his work. (Brakes, heating/air flow problem). Also, shop puppy!\n\nEdited to add: The Orange bus stops right outside(unless they've changed the routes) and the Urbana terminal is only 3 blocks away.", "business_id": "umWStNDUdE1QtbnPjPCfwg", "stars": 4, "date": "2009-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Hd7KPlC4ZUM-4rOsigJi0Q", "review_id": "zTx_MrWjx_ktC4E9kSClGA", "text": "Just an update. I'm still going there 4 years later and am just as happy. He tries to fix instead of replace and doesn't invent problems. He listens carefully and explains what he did without you having to have gone to automotive school to understand what he is talking about. Personable, competent and fair. The trifecta!", "business_id": "umWStNDUdE1QtbnPjPCfwg", "stars": 5, "date": "2013-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NMPsiqxNY9yJROP2dSEw_Q", "review_id": "rx4X7NgJTCIQFC-5u6Ognw", "text": "I called to schedule an oil change right before Christmas when no one could fit my car in. They took it the same day and told me it would take half an hour. I left it there while I went to work. When I picked it up everything was just fine. The people were very friendly and professional. They took my yelp coupon that I showed them on my phone. The only thing was they didn't reset my oil change light, but that only took me about a minute to do myself.", "business_id": "vXxsDHzRvQEhK6YbNs3Nww", "stars": 5, "date": "2015-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5dLpZsEuKVlyoTUnVHTU7g", "review_id": "SalsYcXYvzCwcSuN8T_-RA", "text": "Splendid.\n\nIf you're looking for a steaming latte, the latest fashions and a place to gabble and tweet on your IPhone this isn't the place for you.  If  you need something useful and practical, start here.  High quality tools, hardware by the pound, work clothes, light machines and implements, serious pet stuff...on and on it goes and usually at a good price.  The staff are always as helpful as they are able to be but can sometimes be technically uninformed about the products they carry...it's a discount operation after all.", "business_id": "vA8ed8BFvQxz4HFt8cHd9Q", "stars": 5, "date": "2009-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fXZx3T5ghDZj982rISWwDw", "review_id": "lEbSsfr9cCsPZjGYWzst-g", "text": "Went there over the Thanksgiving weekend with my fiance and my parents.  Even though I went to high school around here, and my parents have lived around here, this was my first time going.  I was surprised by how vast and various it was.  It's almost like a hybrid hardware/department/agricultural store.  For what they had, it was very reasonably priced.  However, the floor layout seems like it was almost randomly done", "business_id": "vA8ed8BFvQxz4HFt8cHd9Q", "stars": 3, "date": "2012-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "19MN_BLvpQe-isX7oPWypg", "review_id": "EMbpeCXVmswIcOsDwFOZFA", "text": "It's a rare day that I can't get what I need here.  I think the last time was when I was looking for a milk frother and I ended up talking to the guy who sells equipment for dairy farmers. But I don't fault them for that.  It's not a common item.\n\nI buy some clothes here.  I find they are getting better with some of the fashion.  Columbia coats are a great item. \n\nI get tools, hardware, bird food, bird feeders, and other miscellaneous here.  \n\nThe best is mechanics shop.  I get free tire rotations for buying my tires there, and I've never had to replace a muffler that they put on (plus guaranteed for life).", "business_id": "vA8ed8BFvQxz4HFt8cHd9Q", "stars": 5, "date": "2014-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "-mqE7uZSnGEAb_quhfcyJQ", "review_id": "qmp4f1mlM3a_QaMnqjy4PQ", "text": "Best garage in town.\n\nWe've been bringing our family cars here for ten years and it's a refreshingly pleasant experience every time.\n\nI came with my brother today to drop off my sister's Volkswagen Bug.  Incidentally, on the way over the heat in my bro's truck died.  The guy at Long's, Rudy, told me that he couldn't do clutch work on the Volkswagen.  We thanked him and were about to leave when my brother piped up about how his heat had just died.  Mind you it was 3:45pm on a Friday.  Rudy said, \"No problem, let me finish this up real quick and I'll come take a look.\"  \n\nOne minute later he was outside laying on his back under the truck in 6 inches of snow.  I couldn't believe it.  He immediately diagnosed the problem and told us how we could save some cash by fixing it ourselves.\n\nLong's has never done more work on our cars than we've asked for and always charges a reasonable price.  The work is consistently high quality and the folks are always in a good mood.\n\nFive stars.", "business_id": "BH5ItzgUlz0GoYJxknV3Zg", "stars": 5, "date": "2010-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G0d_LmadLi2jvygq3vdtuw", "review_id": "kp-CiweQOjESWIB3orZjDA", "text": "Rick's has always been good to me, extremely fair and competent. They are uber-honest, and way more affordable and quicker than a dealer. They've handled everything from my Toyota mini-van to my Porsche.", "business_id": "-StiqyQX9YxKb6VYp2DRfg", "stars": 5, "date": "2014-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "RTojQXjTmJlUyZJujA1fmg", "review_id": "oF-f8luu5_XpIMSCj_f9KA", "text": "Had to have my brakes completely replaced and the staff was decently helpful and the job was reasonably priced. Just make sure to ask for the student discount because they won't give it to you automatically.", "business_id": "UvQCdPSXUdnmzbDEtUaoXQ", "stars": 4, "date": "2014-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tHG5FXpY_KW5biWulTh1Uw", "review_id": "dvJnbG9_D-lZuuHoqoa31Q", "text": "I had a lot of questions about the $650 repair that they insisted that I needed. They were dodgy and defensive when I pressed them for explanation. They mentioned that they would price match other mechanics in town, but when I asked them for the exact names of the parts that needed replacing so I could cross reference the $650 quote, they were reluctant to provide them. I ended up taking my car to Average Joe's and got the same repair for more than $100 cheaper. \n\nI found it difficult to trust these guys.", "business_id": "UvQCdPSXUdnmzbDEtUaoXQ", "stars": 2, "date": "2015-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "OWDHx7bofN32t4dbEbj90A", "review_id": "AKwfnNpAyizprVJ5VUF7HQ", "text": "They fixed a broken door handle on my car.  The shop is your standard rough and tumble garage, but they were friendly and quick.  I was also able to get a better price than at another area body shop.", "business_id": "lPySbFYBYXW1zepKUV4euQ", "stars": 4, "date": "2014-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "A-984bmWW3SYVDgFJ8ZUpw", "review_id": "ybSgJ_C2t-SGn5BNYBqbwQ", "text": "Great service!  They repaired the right side of my car which sustained multiple dents.   A couple of weeks after the service, we noticed that the passenger window didn't go down.  They not only took the car back (as expected), but they took me to work and then brought my car to me when they were done!", "business_id": "lPySbFYBYXW1zepKUV4euQ", "stars": 5, "date": "2015-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_CNbytzQyLw-zGNDWTN3Tg", "review_id": "3PHbc8n0-B8PSUV2hpVFCA", "text": "Central IL Auto Body did a wonderful job fixing my car. I had extensive damage to the roof of my new Toyota. They replaced and repaired everything to perfect condition! Kept me informed through the entire process which was an added benefit. Great people and excellent service!", "business_id": "lPySbFYBYXW1zepKUV4euQ", "stars": 5, "date": "2015-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aEEGWAfqQwAjRW-opv8Ssg", "review_id": "3SB1xC9IPh94ldGLP4FgsQ", "text": "Attentive, warm, and personal service from Charlie, the owner, from the initial estimate to the final payment. I was in this city temporarily without a ride, so he offered me one after I dropped off the car even though public transportation is pretty good. The estimate he gave was lower than two other shops, and he was informative about the insurance process, parts, and options. The ordering and delivery of parts was fast, and the service was completed before expected. Definitely recommended!", "business_id": "lPySbFYBYXW1zepKUV4euQ", "stars": 5, "date": "2015-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OrbBDfge09DzIospdw2Xgw", "review_id": "HXEC5OR63Vxp1zP8YirhTQ", "text": "We did not have a good experience there.  Contrary to what the Saturn company is supposed to stand for, the salesman we worked with was extremely pushy (even for a used car salesman).  We won't go back.", "business_id": "12Cz9K4vwj1cSy2r0sYVQA", "stars": 2, "date": "2009-12-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "r2vglPGmMuyo1BqV91l56g", "review_id": "r8iCsBQjTs7vx9scn83yeA", "text": "What can I say.  They are honest mechanics I know it is a rarity!!!  I have had my car served numerous times from them.  Every time they have been upfront and honest about what needs to be fixed immediately and what can wait to be fixed.  What is also cool is that they will drop you off home and pick you up once your vehicle is ready!!  If you do drop off enough money on your repairs they do have your vehicle washed and cleaned for free.  Which is also cool is that they don't nickel and dime you to death.  For small things like broken light bulbs they replaced them for just the cost of the bulb.\n\nI would definitely recommend them to anyone who needs a repair.", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 5, "date": "2009-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "GVRWfB32i_zvIMJBfbvoBg", "review_id": "2a1-k-VRjvoT-dlgahLVrQ", "text": "This place came HIGHLY recommended by a friend of mine, and so when my car's brakes went all squishy, I took it in.   First, the good:  This place is sooo clean, the guys are all awesome, polite, knowledgeable and you just get a great sense of being in a respectable place.   \n\nThe bad: One the way out the door, the mechanic that checked me in mentioned that it would be \"Fifty bucks to check out the car, and we'll call you with a quote.\"\n\nThe quote came in for almost $900, which was far more than I was able to pay.   When I got back to the shop to pick it up, I was charged $61.34. I questioned the difference between what I was told and what they charged me, and apparently it was $55 for the inspection, plus shop rags, plus tax.  I guess I should have seen this coming?   I have never been charged to look at the car.  And certainly not $62 for a ten minute inspection. \n\nI was in the market for a new mechanic, but this is NOT the one that I will be going with.  They were somewhat surprised that I would fuss at all about the $12 difference.  As if I should have expected a 30% markup from what they told me.  Not a great way to build a relationship.  If they had told me before they took my keys and information about the cost of the inspection, quite honestly, I would have taken my car somewhere else.\n\nBottom line:  I think that if you know you are going to get work done, these guys look really top notch. But be prepared to pay for it.\n\nUPDATE:   I just finished repairing the car myself, and what these guys wanted to charge me $900 for, I was able to do myself for $140.  And that included buying a $20 set of drum brake tools, and a $25 Chilton's manual.  They told me that it would $130 JUST to bleed the brakes, which I did in about ten minutes with nothing but a pair of channel locks.   I am reducing my stars down from two stars to one, because they were OBVIOUSLY out to rip me off, not just charge me a premium for premium service.", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 1, "date": "2010-02-19", "type": "review"}
{"votes": {"funny": 4, "useful": 6, "cool": 5}, "user_id": "aTi0NVrcPJWbN6jAsJVcAw", "review_id": "XsAPP8iVy2-Sos3zMbOqtQ", "text": "I've taken Audrey, my Audi, to Virginia Auto Service a couple times for routine maintenance. I first heard of them through a coupon in the mail, though I'm not sure how they got my address! :)  \n\nBeing new to the area and because the Audi dealership is way up in north Scottsdale, I decided to give them a try. Not to mention because I value the more personalized service of a small business, but that's a longer discussion... \n\nI've been thoroughly impressed with VAS's personal service, their ability to squeeze you in on relatively short notice, the ease in making an appointment, and their communication on what the deal is with your car.  They also have a free ride service to drop you off and pick you up, which is highly convenient! \n\nIf you have a European car, I highly recommend giving these guys a try!  I'm fiercely protective and OCD about my car -- if I trust Audrey to someone, you know you can.", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 5, "date": "2012-12-22", "type": "review"}
{"votes": {"funny": 4, "useful": 7, "cool": 2}, "user_id": "nxVAs0ivaOgupWvj9wJDOw", "review_id": "J-TeqrOyOfArILv5mZAWyQ", "text": "When my car started making scary, loud, noises, I panicked and took it to the nearest reputable mechanic (Virginia Auto).  I had heard they were a bit more expensive than other places, but my brother had just had a really great customer service experience there, so I decided to chance it.  After explaining to the very nice mechanic working the front desk that I really did not have any money to spare, I left my car in their hands and crossed my fingers.  A few hours later, I had a written estimate in hand:  $1,600+.  I was hugely disappointed (who happens to have a spare $1,600 lying around?) so I forwarded the quote to some knowledgeable friends who told me that I should definitely get a second opinion.  Once all was said and done, I managed to work out a solution to my auto troubles for $700 from a different mechanic. \n\nYes, Virginia Auto does good work.  Yes, they offer GREAT customer service.  NO, it's NOT worth paying DOUBLE for.  \n\n\nP.S. Do yourself a favor and check out Inman & Sons instead. :)", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 2, "date": "2013-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "D9WIDdPgbOk8-ChvH_hUfQ", "review_id": "JJdtrQcq82KNS_2Q6-UZQA", "text": "Matt and Tim were great. When going over solutions I felt they were straight forward and upfront about the cost of the repairs. I  also felt that they understood how I felt about being separated from my money. Our Volvo is running great and we hope to keep it running for a long time with the help of Virginia Auto Service.", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 5, "date": "2013-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NvOqcnPhBgVI0Fs7lUzOSA", "review_id": "am8hj398LL2tkY_GBX6aIg", "text": "I have been taking my vehicle's to this shop for the past 5 years. Before then I \nwould float from shop to shop ......never satisfied with work or price, if work is\nquality I can justify it with price, but if workmanship and price don't match up \nits frustrating. It is so hard to trust in these type of businesses especially when \nyou are a women with no knowledge of anything to do with a vehicle, sometimes\nyou feel you are being taken advantage of. Since finding this shop, I hope they \nnever ever close their business doors, because I am a forever customer. I will \ndrive whatever distance I have to drive to get my vehicle here in their most \ncapable hands. Their customer service is unsurpassed. They provide transportation\nto and from your work or home. Their workmanship is excellent. They may not\nbe the cheapest in town, but if you haven't already learned this lesson by now,\nyou will \"You Get What You Pay For\" . Trust me.....This business will not disappoint!", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 5, "date": "2013-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "dlIscnAD4-MUljRFtb9m3g", "review_id": "RYbeVRklTIeS_MOJwG4vbA", "text": "The men here have always taken care of my car, which is now getting up there in age. They're patient and always willing to explain what services will be done to my car and give me a fair price. They're not the cheapest in town but they do high quality work. Even when I had to have work done at another shop they called and had the details of the work faxed over to double check and ensure that everything was done properly.", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 5, "date": "2014-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "imlhSpqG_f39ORm_bhrmgg", "review_id": "3oDQ7dVGVooPkwCYrkESVQ", "text": "I've been using Virginia Auto for years because I trust them to do it right the first time.  They are clean, friendly, and helpful.  They will loan you a car, or drive you to and from their place if you need it.  They are expensive, but they pay their employees well which in turn let's them hire top notch employees.", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 4, "date": "2014-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "saNCRlGYQEBkgpvalJsvRw", "review_id": "WD-jTNplqfvGM-dX46NIFQ", "text": "Well, I have a little 2001 Ford Taurus.  My lovely silver grandma car is fantastic for the 100-200 miles I drive per month.  And now, my little car has a great shop looking after her.\n\nI took my car in as it was time for an oil change and I was convinced my serpentine belt was about to go.  It had that tell-tale burning smell which was making me nervous.  Turns out I had a loose oil-filter from my last oil change and dripping oil + catalytic converter = my car is about to die smell.\n\nVirginia Auto Service changed my oil and cleaned up my engine.  It was so nice to receive a call from them saying my belt was fine and an oil change was all I needed.  It was refreshing to be given an honest assessment vs being told some great story about some random repair that was needed...I am a female after all and have received some rather odd diagnoses in the past (your rotors fell off, so you'll need to have them replaced for example).\n\nIt is very reassuring to know I now have an honest, kind and reliable repair shop for my car.  Did my oil change run a bit more than some $19.99 special?  Yes, but it was so worth it!  Now my little one won't be getting an oil change for another year most likely, but my service advisor, Robert, asked me to please stop by every three months so they could check out my belts, tire pressure, etc just to be safe.  Now THAT is service!", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 5, "date": "2014-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "9aK_wxv9FLFHZLrvC_Go4Q", "review_id": "2K95X24SM306lUBU4oGGdQ", "text": "I know a little something about cars.  my uncle has been a mechanic for over 40 years.  I took my car to virginia auto service for a very specific issue.  They called me with a totally different problem the cost to fix was outrageous.   I repeated what i needed and they told me no, no, no.  They really thought i would be bullied into getting a service done that I don't need and that would not fix what was wrong to begin with.  So they are either incompetent or just puling a scam on a \"girl\".  what is even more outrageous is all these people think they are doing a good job.  i hope no one gets hurt because of virginia auto service", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 1, "date": "2015-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "QZw1k9gTtoLkgp74JTlJxA", "review_id": "7CVkYBywWBNBYdUecDTShA", "text": "BEWARE.  After getting an emission test, my vehicle barely failed, meeting two of the three criteria and needed only minor adjustments.  After spending more than $800 at Virginia Auto my car failed two more trips to the emissions testing center.  In fact, scoring substantially worse than before going to Virginia Auto and failing all three criteria.  In short, my car is worse than before I took it to Virginia Auto. The emissions testing center recommended applying for a waiver, if you spend more than $425.  I applied for a waiver and was denied because of, as told to me by the technicians, the lack of a proper diagnosis and insufficient repairs provided by Virginia Auto. I lodged a complaint with the owner and requested a refund.  He laughed and said he would only communicate in writing with me.  He has never once asked about my complaint, he has never offered a resolution, he has never attempted any level of customer service. He has never even engaged me in a substantial conversation regarding this issue, even though I am a repeat customer.  He has only sent vague and threatening emails.  And on a BIZARRE and CREEPY note the owner Matt Allen told me (in writing of course) they record their conversations with customers.  BEWARE.", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 1, "date": "2015-01-22", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "XNUID_eWSQ_7EBl-tbmuTg", "review_id": "aF77m21bC9iHcvIiydTGzQ", "text": "I knew I was in the right place when...\nI spied a quote taped to the wall about the invaluable price of honesty and quality.\n\nI knew I was in the right place when...\nat least eight certificates of completion by their employees and owners lined the top of the office walls.\n\nI knew I was in the right place when...\nI saw their love of BMW's evident in the racing team they sponsor.\n\nI knew I was in the right place when...\nI explained my psychotic attachment to the car and Ken was kind enough to talk me through their repair procedure. \n\nI knew I was in the right place when...\nI was given a ride back to my house by the OWNER (30+ years) who flies around the country to learn new things about the cars he services. LOVE the flag detailing on the company (aka HIS) car!\n\nLook I'll be honest, the shop isn't sleek like a dealer's and I find that comforting.*  It means they put their efforts under the hoods of the cars they service rather than in upscale sofas, noshes and newspapers. \n\nThese guys take pride in what they do. One trip and I'm in love.\n\nI will never go back to Chapman BMW on Camelback when I can have excellence, pride, quality and affordability from Ken and the team at Bavarian Motors.\n\n*For the record it's not a pig stye. it's homey and comfortable... Like a family's refrigerator with the kids' drawings and good grades on it.", "business_id": "OceUtK4lKAziifRdkRh4Dg", "stars": 5, "date": "2012-01-02", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "evIzZLbCpz04LlZz1FoiVA", "review_id": "RxoQSE7TeW9jfg-0kUB63A", "text": "After researching indie shops on various sites including yelp and m3forum, I decided to take my '04 M3 to Bavarian.  I had a pretty vigorous oil leak and wanted them to install a new fuel filter and emergency brake pads.  I dealt with Ray who could not have been more pleasant.  These guys really take their reputation seriously and do thorough, honest work.  They found the leaking component and called me before doing any work.  Their prices were reasonable, a fraction of what the dealer would have charged and no doubt with much better and personal customer service.  They kept me posted on progress and completed the work sooner than expected.  Ray was just terrific to work with and though I will continue to do my own regular maintenance, anything else that comes up will be done at Bavarian no doubt.  Thanks guys, I'll def recommend you on the M3/BMW on line forums as people are often asking for local indie shop recs!", "business_id": "OceUtK4lKAziifRdkRh4Dg", "stars": 5, "date": "2012-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "I4nAWGoPXUjbY5f_bOnMTg", "review_id": "LE6EdvVP2gvUhg5y7VoDXw", "text": "We love Bavarian! They have serviced two of our BMWs. They always do a thorough, honest job. The car often needs less than BMW says it does. Bavarian tells you straight what is really necessary & charges a very fair price. Go to them over the dealership every time. Highly recommend them.", "business_id": "OceUtK4lKAziifRdkRh4Dg", "stars": 5, "date": "2014-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6CIxnHYCfM7D4hGx8WWYGQ", "review_id": "ghzcLMsBrse8anogrRvu1g", "text": "Great shop, they absolutely know their stuff like nobodies business. Not only do they know what they are talking about, they are courteous. The customer service and knowledge shown here is a pleasant surprise in what is typically an unpleasant space (independent repair shops). Randy, is very thorough, and even speaks fluent German! Couldn't recommend enough.", "business_id": "OceUtK4lKAziifRdkRh4Dg", "stars": 5, "date": "2014-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZyxiWy2PdFqqDisc40s1dg", "review_id": "JSL0FskjVsG-2qHpPZyP-g", "text": "I recently acquired a beautiful red BMW convertible with a black top and tan interior while on a trip to Daytona Beach, Florida.  I drove the car back to Scottsdale, Arizona.  I was now faced with the daunting task of finding a fair and honest BMW shop.  I have become a huge fan of Yelp, so I relied on their reviews for a BMW shop.  The reviews for Bavarian Motors LTD. were excellent.  I went to Bavarian Motors for a question and answer visit.  The guys at Bavarian Motors were very friendly and knowledgeable about old and new BMW's.  I was impressed with how clean and organized the service bays were and the attention given to detail.  I was very pleased with the service and the price of my oil change.", "business_id": "OceUtK4lKAziifRdkRh4Dg", "stars": 5, "date": "2015-02-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "eCtkMHrbM8j0R5yabfrRzg", "review_id": "gQolVxfdrja5E_U-nbZstA", "text": "Yesterday just before I was going to go apt hunting, my car started blowing a white smoke.  It must have been a sign that i would not like the apartments I was about to visit; furthermore it was a sign that my belts were waving a white flag. As quickly as I got back in I called this Pep-Boys, while not all of their locations have a good reputation...this one does.  I set up an appointment, but my car was seen a couple hours before that.  turns out my car has a nasty case of H1N1, the quote was 1195.  Knowing that I couldn't spit that right out I asked what parts could wait.  The lady on the phone was very nice and told me that I only had to replace a few hoses and of course the dreaded belt.  By doing so it lowered it to 500 and something.  She felt my pain though and gave me a 10% discount..for what I don't know, but I am not going to argue now lol.  I am very happy with the service that has been provided here.  Everyone is very nice and willing to help you out.", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 4, "date": "2010-01-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "eCtkMHrbM8j0R5yabfrRzg", "review_id": "pGrq9FS7q6Zzu2OY3wEhqw", "text": "two star knockdown because one of the gaskets that they replaced...was still leaking! Now I have to take it back, which isn't the biggest deal...it's that I don't want to pay for having to take it back.  I have had so much better service from this place in the past...and now they let me down :( The lady who originally quoted me, wasn't there so I ended up paying 30 bucks more than she said. Good thing I have my own personal money tree!", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 2, "date": "2010-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "WJkmgkrSPMHTfDTD3VgqqA", "review_id": "5s7spFDvWPVM19mrMonQ8Q", "text": "Why is everyone standing around?\n\nIt was a slow night and they were obviously over-staffed. But no one was really anxious to help me out. I was shuffled from the battery center, to the front desk, to the service center and then stood  there awkwardly while the employees made casual conversation and no one told me there was a waiting area. \n\nI just came in to get a new battery for my car. Kinda peeved that I paid for installation, if you can even call it that. Autozone does it for free with purchase and I thought most places did too. Not these Pep Boys. I should have went elsewhere but my car needed it bad. Oh well... live and learn.", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 1, "date": "2010-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4pJvBS_BWEP5FSrtKzbwdw", "review_id": "PmwS3jjZ0Y4_jqK1jsKOGg", "text": "This is a good place to waste your time looking for customer service. Don't waste your hard earned money, too. Auto repair here is on the shoddy side, and don't expect an explanation for items recommended for replacement, because only 'someone' else knows. Took three individuals to figure out who was going to help me check out at the register, so yes, they're committed to a great customer service experience. Must have been another customer...", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 2, "date": "2012-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wGZZOMkKhdmkf8M0XnPzmA", "review_id": "zJUhJZ08IeC_Fh0Tae9RBQ", "text": "I had my car serviced here.  I may be a female, but don't try to pull one over on me. \n\nGo somewhere else for work on your car. Hopefully there are other shops are more helpful and honest.", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 1, "date": "2013-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "meXB2eJmWVxYekJqm50RmQ", "review_id": "flappjwazjtYYdcn3gOxfw", "text": "Always been pretty good to me at the\nParts counter friendly People and \nKnowledgable enough to get what I need", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 4, "date": "2014-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NkxFV7RefN87jL_LeVlIPg", "review_id": "HxSOtqSjWKyYm1Sc-2XaQA", "text": "Luis made testing and getting a new battery the easiest experience. He was straight forward, to the point and polite. Can't ask for more. I plan on coming back to this location for future maintenance repairs.", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 5, "date": "2014-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hnCf18XK8Cz0KQJZ6nLXFw", "review_id": "SjlMHx8MWDCWws2IJarrHA", "text": "I had to stop here last week when my tire went flat.  These  guys were awesome.  They fixed my tire and made sure they were all at the right pressure.  In addition, I had some minor body damage and Anthony gave me multiple options for how to fix including an option/advice for what to say if I wanted a body shop to repair.  I ended up getting some stuff from the store and car looks great.  Ken and Anthony you got me to spend $200 dollars and I walked out feeling like I got a deal.  I work in finance and I'm hard to impress but these guys were impressive.  Great job!!!", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 5, "date": "2014-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xXxoYIsbfXFK8BKndCcnZg", "review_id": "5Bf7JGcT2g_UeAfbxvTG0g", "text": "John has been my mechanic since 1989. He will never be rich becuz he's just too dang honest! I have sent him many clients and they all agree: he's TOP NOTCH! Don't waste your money; go see John!", "business_id": "R5zU2QNqKW9U2CRePh-bEQ", "stars": 5, "date": "2013-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J8DQNfSsEvxsUENY1TUf2A", "review_id": "j3VNd_ZPWaQeypfBaLV7Sw", "text": "I went to Terry for two years with my 96 Nissan Maxima when I lived in the area. He runs a great shop, very honest, aboveboard, and downright knowledgeable. I would highly recommend him and his shop, their work is superb. Moreover, as a graduate student at the time I had a great appreciation for their reasonable rates, he and his crew were always upfront about costs. \n\nI have nothing but good things to say about Terry, Jack, the shop, and their mechanics.", "business_id": "NUR1pLEwUETAvcW_1rfGFw", "stars": 5, "date": "2014-02-27", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 4}, "user_id": "sEWeeq41k4ohBz4jS_iGRw", "review_id": "c7atsaUnYA72i0HFfnbnmw", "text": "I have complete confidence with this shop. Super knowledgeable and were quick and friendly.\n\nI took my truck to them for a second opinion and they found that the \"recommendations\" from the other shop were completely untrue.\n\nI saved over $700 by having them do the work and not the first overpriced shop.", "business_id": "osI3BT6AagWA-ravXrmK3w", "stars": 5, "date": "2014-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LP8JFPcEtA0ti8g_BRBX4w", "review_id": "ofcrHyUr0tKrW59A9F41qA", "text": "Trustworthy. Thorough. Dependable. Tucked on the corner of 32nd Street and Oak this longtime Central Phoenix repair shop has been my go-to for about 4 years. They get to know their customers and the cars they drive and never ever upsell. If you don't really need a repair they'll tell you it can wait. They'll give you a ride to work and pick you up when your vehicle is done. These are good people who do good work for an honest rate.", "business_id": "osI3BT6AagWA-ravXrmK3w", "stars": 5, "date": "2015-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "YParCZHEeRFb_Sv8FhpKWg", "review_id": "Enwi-QWhUY7dRZBJ5ms5jQ", "text": "Bud is outstanding. He knows the brand very well and is especially adept at keeping my beloved 300CE operating properly. He also has a true love of these cars which is demonstrated by his excellent work.", "business_id": "0Xnduj9w6aYHOtN_RlHUng", "stars": 5, "date": "2011-01-05", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "EQJD_-Z-_CGVfyzZUyx_jA", "review_id": "ydJ_bkF9noAkZWqkAMPflg", "text": "MB Motors is surely the best Benz service in town.  For four years they kept my Mercedes serviced well and were always polite and fair and knew Mercedes inside out.  I sold that one 3 years ago and bought another one.  Turned out it had a unspecific odor inside the car.  I fooled with it and tried a few things and was starting to figure the exit plan for the car because I couldn't stand it.  Then I took it to Bud at MB and he looked at it for a couple of minutes and said he had seen it two times before and he thought it was worth a try to try an ionizer treatment on the inside (who's ever heard of that?).  He and Jamie called around and found on of their contacts could do it.  It is like new now!   Bud is a Wizard!  As long as I have a MBZ this is the only place to go.  Oh, by the way - no charge!", "business_id": "0Xnduj9w6aYHOtN_RlHUng", "stars": 5, "date": "2015-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vM3r9l4q24ya6TDtrbWFcA", "review_id": "99Z6AMjQGCUKi7EVwZev_g", "text": "I found my MB 380SL through this repair business and I have taken it back each time it needed attention. It was an amazing car when I bought it and after it's last visit this car is running as good as the day it rolled off the showroom floor in '85, even better then the day I bought it. I found this business through a MB blog and then I checked M B Motors on out on Yelp to check out another 380SL I'd bought. This business was very highly rated and rightly so. I will use this M B Motors the next time there is the need.", "business_id": "0Xnduj9w6aYHOtN_RlHUng", "stars": 5, "date": "2015-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SLcdGaUxukYL7Rrd_n8Raw", "review_id": "LvO4FvYdpJgq-xFHgpz0Gg", "text": "Dario is the only mechanic that my family and I trust. He is honest, punctual and stands behind his work. He will never sell you parts that your car doesn't need. If you are looking for a place that will treat you and your car right, then look no further.", "business_id": "KXh8CE7KF3u3RdC70Ecenw", "stars": 5, "date": "2014-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mQrfTT80n1kIgWjYZdJLaw", "review_id": "uhFYZaNFRYTKM5GJwAWpvQ", "text": "Mazvo is the best!!!  Let me tell you why!?!  I work for a local law office and help solve client's problems - callers say,  \"I got cheated by a garage, I want to sue\", etc....  I refer everyone to Shahi at Mazvo.  Shahi (Shawn) is friendly, knowledgeable and, most important, can be trusted!!!!   I have had only excellent experiences at Mazvo; and, I will not take my vehicle(s), and most important, my '73 Corvette Convertible, anywhere else!  If you need a vehicle repaired, do yourself a favor, and go see Shahi at Mazvo - you will be happy that you did!!!!  Phil J", "business_id": "L95jFICMBewv08k7YUx5OQ", "stars": 5, "date": "2014-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cSbP2ReW_u1-B0g6-gqrcg", "review_id": "-kKF_nhDrqsfaIrbtXrrfg", "text": "When I was stationed at Luke AFB as an Airman, I was totally taken advantaged by this place. I was young and inexperienced with life so I didn't know the thing I know now. But I will share my story with you about how horrible this place is and why it should be shut down. \n\nI had an 85 chevy monte carlo, it was a good running car, but if I sold it, I'd probably get 1500 for it.. and book value it's prob worth $900. I didn't know a lot about cars then like I do now (I ended up using my monte as a project car and learned everythign I know today). Well I had an issue with one of my back brake lines busting.. My brake light came on and I didn't know what to do so I went to \"just brakes\"  thinking professionals would be working on my car.. \n\nSo first some young kid pulls my car in and takes off my tires.. I had brand new rims on there and he drops it on the wheel plate (the part you park the left front tire on to align the car with the car lift) and he dents the center cap.. I told them that wasn't like that when I pulled the car in and don't expect to leave with it like that. So they take it in back and try to \"fix it\" and the heavy set guy comes out and tells me oh I fixed it for you.. I look and the chrome is all crinkled on the part he \"fixed,\"  I told him that was ridiculous and that's not how I brought it in.. He then said well we will buy you another if it has to come out of my own pocket (trying to make me feel sorry for him or something) I said sounds good to me.. So one of them went and picked me up a new one from discount tires..   \n\nSecond, they do a walk around and show me the rare line was busted, and then started trying to talk me into all this stuff with my brakes.. New rotors, new pads, new seals.. new cylinders.. and I asked the old man, if they did military discounts.. he said no, our prices are too cheap to do it and you won't find a better deal anywhere else.. He starts crunching numbers and looks at his calculator funny and says, hmm now maybe ill consider giving you a discount. I said how much is the total? He said $800 or something ridiculous (this was in 2003 mind you..) I said that is insane.. for an extra $100 you can have the car.. put all my stuff back together and fix my line and that's it.. Just the line fix and the brake line bleeding cost me something around $200.. also ridiculous now that i know better, but I had no other choice... a brake like prob cost them $5.. and the bleeding isn't much either.. I was asking the \"manager\" (the one who did the walk around me claiming all this stuff I needed done from a professional opinion),  how he liked his job and how long he worked there for.. he said it wasn't bad and he started 2 weeks ago.. I chuckled inside.. two weeks.. \n\nso then they do the repair, and took it for the \"test drive,\"  I remember the other guy saying, \"you know what to do..\"   the other guy said, yep..   So he comes back and says everything checks out.. ( great knowing now that i know now I wish it didn't and the guy flew off the road into a lamp post or something) well I get my car back and it's making like a hesitation vibration feeling.. as I'm driving it back.. so I get back on base and I'm looking at my engine, and I noticed my spark plug wires were sliced.. a few of them.. just enough to cause issues once in a while..  Lol.. they sliced my spark plugs wires because they were butt hurt that I made them get me a new center cap that they broke.. and hurt their feelings when I made them look dumb for telling me I need $800 worth of brake work on a $900 car.. How low class, uneducated, and unprofessional can you be??   Jokes on them .. I needed to replace the spark plugs and wires anyway so I did that that weekend with their motivation!   Also, they wanted something like 130$ to replace each rotor.. I paid $30 for each rotor and did it myself ..    Take it from Just Brakes is just another franchise to rip off the customer and work off commission.. That location is very un-loyal and filled with people who two weeks ago didn't know anymore than you did.. Stay clear from this place.. go to a real mechanic.. because you will pay top dollar for some high school drop outs to sorta of fix it and rip you off... \n\nHope I inspired you to not give this location any of your business! they don't deserve it!", "business_id": "6jsv1cp0Gd26X0BiE2tmTw", "stars": 1, "date": "2013-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "phzSab6kEGXIK6ZxV7oXog", "review_id": "BpAaa9nmcnfgd9eUmmf3KA", "text": "Just Brakes did a wonderful job.  My last mechanic told me my brakes were fine even after my sensor said they needed replaced. I kept driving until I got another warning on my car that it was critical to fix my brakes.  I came to just brakes and they explained everything thoroughly.  Very knowledgable and friendly staff.  Thank you Jim and the Just Brakes Crew!   Merry Christmas", "business_id": "6jsv1cp0Gd26X0BiE2tmTw", "stars": 5, "date": "2014-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "AEisV_JDqb8-v0CxvT0aww", "review_id": "j7q0U9xWMsP6tGoNDyUGbA", "text": "I went to Coulter on recommendation from my mechanic around the corner who said it would be faster for me to go to a dealer to get my car fixed and said Coulter were good guys if I couldn't find an actual Pontiac dealer.\n\nI have a 2006 Pontiac Vibe, which is not a Cadillac. Or Oldsmobile. But anyway, I had a problem with my car that (luckily) was still covered by warranty but there are pretty much no Pontiac dealers left since Pontiac is no longer in business.\n\nCoulter couldn't have been nicer to me, they didn't try to get me to buy anything and they offer free coffee, tea and donuts in their lounge area along with other food items for sale at their counter in the lounge. They immediately looked up the warranty and all that jazz and offered to drive me somewhere while I waited for the work to be done. They also looked over my car and checked everything, like fluid levels, tires, brakes and CLEANED MY CAR! And mind you all of this was free as I was getting just a warranty repair done. They also were quick with getting the work done, only a couple of hours which isn't bad at all.\n\nI couldn't recommend Coulter more, next time I need to buy a car I will certainly keep them in mind as well as for any repairs I don't think my around the corner mechanic can't handle.", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 5, "date": "2010-01-14", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 1}, "user_id": "DJ1T6ZCsG0ANSEK6YsqHBQ", "review_id": "c1-TWm943p0REOAj4GnVyg", "text": "I went in to look at the GMC Terrain. I asked the salesman what he thought of it. His reply? \"It's Ok, if you can't afford a Cadillac.\"\n\nSERIOUSLY?????", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 2, "date": "2013-01-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "qDBaslzhTlpzOPg7hARuzA", "review_id": "zBo7jw5ys10WjqE8bdG6IQ", "text": "Buying a car at Coulter ranks as the best car buying experience I've had in the 35 years I've been buying cars. I dealt with Marty Katz and he (and the rest of the staff) dealt with us honestly, fairly and with great transparency. The most telling thing I can say is that the quality of the sales team will make me pick this dealership and Cadillac in particular over other brands in the future.", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 5, "date": "2013-01-11", "type": "review"}
{"votes": {"funny": 4, "useful": 6, "cool": 6}, "user_id": "THr8peJ3dxCXVgPlKjagHA", "review_id": "nPzcxNuH-kveU5hYNQ4Esg", "text": "I'm done with the antiquated Turkish bazaar style of sales \"technique\" car dealerships provide. In this day and age we shouldn't have to spend multiple hours going back and forth just to make a purchase. Sitting in empty offices while the salesperson disappears to \"talk to my manager\" - don't BS me, I've seen Fargo, I know what you are really doing.\n\nEveryone uses the internet to research the type of car they want, you can look up the MPG, the cargo room, the legroom. You know what colours are available and what trims. You can even look at the dealer website and see what inventory is in stock, complete with accessories and MSRP* (The Manufacturer's Suggested Retail Price excludes destination freight charge, tax, title, license, dealer fees and optional equipment. See your dealer for details)\n\nSo I had gone onto the GMC website, found the exact model of vehicle I wanted to buy with the exact specifications that fit my need and my budget. I got a generic email from John, the Coulter Internet Manager telling me he's my man. There were two models listed in stock, so I sent an email to him with the VINs of the cars I was interested in, together with the make model and mileage of my trade-in. I never heard anything back.\n\nSo a couple of days later I walk into Coulter. This is not your typical dealership with hundreds of cars on the lot, there are maybe 6 cars out front and a couple more in the showroom. Imagine the scene - I walk into the showroom which has car salesmen all hanging around each others desks, chewing the fat and yucking it up. They scatter like cockroaches when I walk in. An older gentleman approaches me, \n\nYou looking for parts?\nNo, I want to buy a car\nWell if you are looking for parts, it's down that way\nNo, I want to buy a car\nOh, come this way\n\nThat's how I met Dean. Dean has a PhD. I know this because it's on his business card AND on the door plate to his office. Don't ask for Dean if you are in a rush, because he moves like molasses. Up we go in an elevator, through a door to a second floor garage. We are looking for the car I am interested in. Dean is half listening to me. I tell him that I have the exact car I need to see. I tell him that according to your website you have two in stock, one silver and one white. Let's find either of them. He doesn't know where they are. We look in the garage; we look out on the lot. We go back down the elevator to his office. I give him the VINs, he disappears, comes back and off we go to try and find either of the two cars. After much searching and much shuffling we find one of them, out on a parking lot, behind the service area, mixed in with private cars and one with the whole side missing. Yep, you guessed it, Dean doesn't have the keys.\n\nWhen he finally returns with the keys, he reluctantly takes me on a test drive. No you can't drive it out of the lot, we have security. Where is this security when we were looking for the car? Maybe they can instigate a search for the white one I was really interested in. We then go on the most pedestrian test drive ever. No freeway exposure, just literally around the block. I'm driving a V6 I want to let it go, see what it can do, but nope.\n\nSo the car drives well, the MSRP is right. All that is needed now is to work out how much they are going to give me for my trade-in. As a good internet user I have researched the Kelly Blue Book value of my car. The KBB trade-in value is low, I expect that. They offer a range based on the condition of the car, from a low number if the car is ready for the scrapheap, to a high number if it is in pristine condition. I figure I'm somewhere in the middle. But it is what it is and with the range in hand we begin the negotiations. Cue Dean's exit again, this time with my car keys.\n\nAt first he can't get the VIN entered into his computer, so he figures he wrote it down wrong, then he takes his iPhone and snaps a photo of it, that doesn't work. He asks me if I have my insurance card and he reads the VIN off that. Finally, he gets the computer to accept the number. Lots of button pushing ensues, then he curses the printer, then he prints something, then he's off again.\n\nWhen Dean finally returns, he has a price for me. $2,000 less than the low price on my range! Are you kidding me? At least he doesn't try to spin me a line about the age of the car or the condition. Just this is the price, take it or leave it. I say I'll leave it. This is a critical time in the car sales negotiation process, I waited half a second and then it came.\n\n\"What can we do to get you in a new car today?\"\n\nI said you can stop insulting me with that price and offer something within the KBB range. Ok, he says, \"Let me go talk to my manager\". So Dean makes his final departure. When he returns he shakes my hand and says we are getting nowhere, just wasting each other's time and goodbye.\n\nSo here I am, three hours later no further forward in the car buying process than I was before. \n\nSigh. I wish Amazon sold cars", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 2, "date": "2013-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 7, "cool": 0}, "user_id": "11nPfbEj3klY4P9mR_9MpA", "review_id": "8nDfbbMZCNdi9KpyMGMirA", "text": "I don't usually come on Yelp to write explicitly negative reviews, but my experience at this dealership was so poor that I feel I need some sort of recourse, with a review seeming to be the most reasonable option. Please note that the problem was with the service department and I know nothing about the sales at this dealership. Now, I know better than to have service done at a dealership for the most part, but my only problem was a dead turn signal, which I figured would be a quick job; my old Hyundai used to take about 5 minutes and cost $3 for parts. I came in last week and the place was swamped, so it was recommended that I make an appointment and return. I did so for today, calling in the morning for a 1:30 appointment. When I showed up, I was told it would take about 2 hours because they were getting backed up, this despite the fact I had called ahead. When I repeated this fact, the manager-who seemed like he could not care less about my business on either occasion-said we could \"move things around\" to speed it up. In all I spent close to 1.5 hours there and my bill was $90 for a $5 part and maybe 20 minutes with of labor, as they need to disassemble an area to get to the bulb. By far the worst experience I've had with any car service and I would not return there with my business.", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 1, "date": "2013-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q0U5eM90xWn4g_aqR-aWzw", "review_id": "Zsn8mHjRFYr9d2ppHxHvkw", "text": "I have purchased 2 cars from Coulter a 2002 Cadillac deVille and a 2012 Buick LaCrosse.  Both used, both times I was treated with respect,  deal was fair and service good. I would recommend them to anybody and mt salesman, Roger Farney, was excellent. He worked with me for six months, answering my questions, no pressure at all. My experience was excellent.", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 5, "date": "2015-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "QXdHXP8psGUHqWO-QVkkdA", "review_id": "DtBHUOIwubbeLBMEg2hCGg", "text": "Their all about YOUR MONEY! Highlights of my complaints:\n- Never offered a loaner for ALL DAY service to your vehicle (this happen twice)\n- If you have them drop you off you still wait an hour+ to GET the ride (tell your boss you'll be two hours late to work if you have to drop your car off...)\n- They do NOT have your best interests at hand (they will do expensive maintenance even though your vehicle may not even \"need\" it)!\n- I trust them about as far as I can throw them after going to them these last few times! I will NOT be going back!\n- Update: the $130 cabin air filter charge is a TOTAL ripoff! I bought the filter for $8 at Autozone and installed it myself. Watched a video on YouTube...I did the replacement myself within 30 seconds! No exaggeration on that! And they wanted to charge me $130!!! \n\nWant a quick'n easy oil change? HA! The first time I waited it was close to TWO HOURS and then it runs about $80!  On two separate occasions I had them look at problems I was having as my vehicle is still under factory warranty. You would think that you would be offered a loaner vehicle ( as all my friends have told me their dealers do),...NOPE! They will give you a ride back home/to work AFTER you sit in the waiting room for an HOUR+ before they actually bring you to where you need to be! Then after leaving the vehicle there all day they called at 5 to tell me they couldn't figure out the issue and asked if I wanted them to come pick me up. This was on two separate occasions and both times I was given an lame excuse as to why it was happening and sent on my way. They ALSO LOVE to charge you for things you really don't need and they don't give you the option to wait. You're guilted in to doing the \"suggested\" work. I have a 2013 and literally only have 14k miles on it since I work from home fulltime. This last simple oil change turned in to a $300+ maintenance!! They said I needed to rotate my tires again and balance them (even though I said that's funny cause I didn't feel any pulling/jolting in my steering wheel from being out of balance) and then the internal cabin filter (that smells funny when you turn the AC on) was going to be $130 JUST to replace that! I said to forget that, but still had over $200 in other maintenance all my friends said I should've never done because it wasn't worth it because I literally drive the vehicle a few miles a week!? \nAfter going there these last few times and comparing my experience/expenses with friends that go to other dealers (Nissan, Lexus, Mazda) I feel these guys are ALL about taking your money FIRST and then customer service/your best interest LAST!", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 1, "date": "2015-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r2fwDC-iGpZf5ZkS8MHKtQ", "review_id": "OS-USwS_hH7GyccarkV8Hw", "text": "We recently welcomed our first child and needed to upgrade to an SUV.   We purchased a 2015 GMC Acadia and I absolutely love it - especially the auto lift gate, and captain chairs with a car seat.  It was not our intention to purchase this vehicle... we needed a third row SUV and were previously leaning towards the Kia Sorento.  After coming home and realizing that the sales person was trying to sell us the same vehicle over MSRP - I didn't care if I paid more I would not give that dealership any of my business.  My family has worked with Brad Majercin (Service Advisor) for years, so we contacted him and he set us up with Gary Allen.  Car shopping with a 7 week old is not fun, but it was so easy and I wasn't stressed I was getting taken to the cleaners.  We got a great deal, and it wasn't a hassle of back and forth.  It was just a different buying experience than we have got in the past and for that I am thankful for Mr. Majercin and Mr Allen.  \n\nThe customer lounge was great, and Georgia made us a great lunch.", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 5, "date": "2015-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wQAIt2AwAnX8XKJ1JiNzAw", "review_id": "x0-seVengU8oGA8PWR_1sw", "text": "Have a 2012 Buick Enclave. This place (Gary more specifically) have always gone above and beyond. I'm not mad at Coulter Cadillac for the stupid reasons I have to bring my Enclave here. Gary always asks how everything is going and the service waiting room is comfortable, free wi-fi, immaculate restrooms and a loaner car on hand if I need it. Highly recommend", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 5, "date": "2015-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0OcR7pFYOlRMi4cPVjkC0A", "review_id": "ILNBT6871Uq6MEQIQK5Rrg", "text": "Cant comment on parts and accessories but as far as mechanical services go, #1.\nI bought a typical Barrett Jackson ride, looks great but always a gamble if it is a pile of bondo and if the drive train will last. Actually bought a solid truck with a 502 ram jet in desperate need of a tune and computer diagnostic. \n Was told exactly what was required to get this thing to pass emissions and run right. And told what the price would be and what time it would be done.  Delivered as promised.\n\nEnd of the day, the correct temp and gapped plugs were installed, valves shimmed and computer tuning on dyno completed. Big job and everything was done in one day.\n\nI am a firm believer in value and getting what I pay for. \nWas the price lowest in town? NO. Was it anywhere convenient for me? NO. \n\nWas it done professionally with no BS? ABSOLUTELY. \n\n I have a number of high HP cars and can attest that this is, one of the best I have used.\n\nThis is the only shop I will use for my Arizona rides.", "business_id": "R72PRg4ZKOjstjUiTCUWTw", "stars": 4, "date": "2014-01-17", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 0}, "user_id": "HN-Ml7Ra8Q70ZQUBw4GfVg", "review_id": "EsJ0X_QgYNJ1wQzUi0u4SQ", "text": "Absolutely horrible customer service! I went there after a buddy of mine recommended Mike for dyno tuning because he had a good experience with him on a separate type of repair. I don't usually review places but this was so bad I had to say something.\n\nI told him that someone put a tune in my truck but I don't think the guy knew what he was doing and I wanted his opinion. Mike proceeds to tell me that his opinion is like everyone's aashole...its different. \n\nAfter walking back and forth and telling me that I'm the type of guy who goes from one place to another getting opinions and then criticizes the work, he proceeds to pull my vehicle into the bay and look at the tune.  Wouldn't you know it...the tune WAS done improperly and the air to fuel mixture is so rich, the engine is in danger of having failure down the road. \n\nMike says its not his fault someone did bad work and that I'm crying to him (those were his exact words) to do a new tune but it will cost me $800-$1000 for him to tune it. That is the most expensive quote I've ever heard of but if he did great work, fine, but its amazing the place is still in business when the owner has a mouth like that to a new customer he's never met\n\nThis guy is ridiculous and does not deserve anybody's money.", "business_id": "R72PRg4ZKOjstjUiTCUWTw", "stars": 1, "date": "2014-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "OJsOWLO5Tb_rzu3aBvD0iQ", "review_id": "jI0ak6YxKFdGYLypNzk_PQ", "text": "Watch out full on fraud ! Do not do business with Mike at loppers service ever ! . Was charged for name brand parts and inferior parts were installed creating a oil restoration, after I took it to a real machine shop they explained the problems to me . I requested a copy of the bill and was told the computer hard drive broke and could not get a receipt. $4000 DOWN THE DRAIN.", "business_id": "R72PRg4ZKOjstjUiTCUWTw", "stars": 1, "date": "2014-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "7izaZThzAWk2UjrDTL849w", "review_id": "mjeNtZTLuNxxXDkT9KCMSw", "text": "This is a rather non-descript looking repair shop next to a Circle K.  But don't let that turn you off, this is a decent & honest repair shop.  I took my Toyota there a couple of years ago for a starter replacemnt.  I got genuine and straightforward diagnosis of the car's problem and recommendation for repair.  There was no coming back to me with pressure to have $1500 of additional repairs (you know, the mechanic's upsell????), just altogether good service.  It's a family run business according to their website.  I'd use them again with no reservations.", "business_id": "NjwxCfOTleHsYgcHtEsAPQ", "stars": 5, "date": "2008-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ejXvxuLImj6lOcQ8HS5Ffg", "review_id": "4RXAGAKESBZFqFu3kFAFig", "text": "Were super helpful, friendly, and fixed the alignment on my car quickly while I waiting (with a scheduled appt, I was not a walk-in). This is a family-run type place, and it was nice to see the names of everyone on that wall that worked there, accompanied by their photo and how many years they had worked there.", "business_id": "n4N4NyNS78JUvamWttTxJw", "stars": 5, "date": "2013-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kIddeMFsvL-iiBnjZXObKA", "review_id": "pUFVyKr-OQdYrmJx8HfhUA", "text": "I have been to Tucker Tire & Auto twice and am VERY pleased with their work.  They treat me with the greatest respect and the job is done in a decent time frame.  I feel like they operate as if they were a small town operation only in a very large city.  It is nice to know I'm not just a number on their list.  Both gentlemen that work in the office explain things carefully and even the owner chats with all of the customers in the waiting area.  This is a fantastic place to bring your car to.  Thank you Charlie Stevenson!", "business_id": "n4N4NyNS78JUvamWttTxJw", "stars": 5, "date": "2014-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "t7NYJB0yw6BMUSJ3yDr7Yw", "review_id": "JYIF0L6kxIzDI-R3a8KSsQ", "text": "My neighbor suggested  this place for my car repairs. What a great place. Al and Frank are honest, nice and affordable. Always let you bring your vehicle in no problem. I highly recommend them.", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 5, "date": "2011-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "aG-TNLDfWfFIAMvAt6u9YA", "review_id": "Xy9dvlxalNiiiefRGirLhQ", "text": "I have been going to Al and Frank for years and several vehicles. They are honest and do a great job. Ive had very little issues with them. The shop is older with 4 bays seems a dirty. Best thing about them is that they are trustworthy and upfront. I have recommended them to several friends. I go back because there is no hassle and I drive away knowing I'm in good hands and if something isn't right they fix it. Their weak side is communication and updating the customer.", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 4, "date": "2014-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nwExQDQMJ-9ni-gUZkXesQ", "review_id": "JJ9eKGverQu986Rgs8YB5Q", "text": "As a female, going into a car repair shop seems intimidating, however, everyone at Precision Imports has always been completely honest and fair. I completely trust these guys and they do great work! I've gone to them for over 3 years whenever my 2008 car has given me issues. I'll call Al, drop my car off and it is normally taken care of in a day unless it's something major. I hope I never move too far away from these guys!", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 5, "date": "2015-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vDo3NHgFZG6wQ10V_3-K1Q", "review_id": "2ScTkER6rID5bLZrWQYRCw", "text": "A friend recommended them. Frank and crew were very helpful and reasonably priced. Would recommend them to anyone who wants good honest service.", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 5, "date": "2015-02-05", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 4}, "user_id": "gq_G5VCDziyEV2-bzGuqzw", "review_id": "po70743utp5aKsA0pyTtHQ", "text": "Before my sparkly new Honda Element SC, I was eternally betrothed (guess not!) to Volvo wagons (Volvo XC remains my dream car... I'm an incredible bore in real life, I promise).\n\nBoth of which had this funny habit of breaking all the goddamn time, surely not because of my penchant for not only playing tag with shopping carts in my college days but also the whole speeding and driving recklessly thing. So, needless to say, I spent a lot of time here.\n\nThey do a great job (as in, I never had to repair the same thing twice), were honest (\"Look, your car's falling apart. Period. The most we can do is slap some silicon on it and charge you $5 for the trouble.\"), and charged a fair price. \n\nI highly recommend for Volvo nuts like myself.", "business_id": "7P3ECWrdSepztN5A3boTmg", "stars": 5, "date": "2007-12-11", "type": "review"}
{"votes": {"funny": 3, "useful": 7, "cool": 4}, "user_id": "k4-6lakq7t3kCgbvPxcuvg", "review_id": "gX0I1IdEW6KsxHHus80-Uw", "text": "I took my teenage daughter's 1996 960 here late this last summer because it wouldn't pass emissions due to both oxygen sensors (allegedly) being dead.  So I turn to the Volvo specialists I've used lots of times before for my own Volvo with few issues...except perhaps for the uncomfortable, stony silence they give you when your budget is bottomed out and you politely decline one of their suggested, additional services while embarrassedly explaining that you'll have to wait to get it done until you have more money.  Very uncomfortable.\n\nSo I'm thinking, no problem, these guys know their stuff, right? Apparently it *was* a problem, because after I made an appointment and dropped off my daughter's car, it took them 3 weeks and over $600 and the car STILL doesn't run!  :/ \n\nAdding to this, my husband and I had to call every few days and ask for an update on the car because we weren't being updated on the progress of the repair at all.  Have you ever had to placate an impatient 17 year old girl who needs her car to get to and from school?  It's living hell.\n\nIn fact, during one of the calls I made about the car's status, I discovered that they had replaced both oxygen sensors but that wasn't the problem, but they thought they had sorted out what the new hold up was but that nobody had gotten around to calling us to let us know any of this yet, and when I authorized them over the phone to address the new issue the response to me was \"Well, we have all these other cars ahead of you now\".  Wait...what?  Am I not ALSO a paying customer that also had an appointment?  How did I suddenly lose my place in 'line' behind all these other customers?  Shouldn't you finish my car before starting work on a different car?  :/\n\nSo yeah, after 3 weeks and over $600 they finally declared that they just didn't know what else to do with it and we paid our bill and picked up the car.  Fast forward a few months and it still hasn't passed emissions and just sits in my driveway, covered in dust, because I gave Volvo Am I all the money we could scrape together to sink into it and now I'm nervous to spend another penny since they couldn't figure it out the first time.   \n\nI'm not sure if I'm more offended that they thought we could afford repairs approaching half of the value of the car, or that we didn't deserve any follow up communications on the repair status, or that when I called to find out what was going on I discovered that we'd been dropped to the back of the line for no discernible reason whatsoever.\n\nSo yeah, I'm no longer a happy customer.", "business_id": "7P3ECWrdSepztN5A3boTmg", "stars": 1, "date": "2014-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ph_RHBtehze2x52T96IAfg", "review_id": "S1NFo4mmfpZqTWzkX0ogEA", "text": "I have been taking my 240 GL 1989 Volvo to Volvo am I since 1996 when I bought the car.  In 1996, Rob owned Volvo am I and years later Top Mechanic Ted bought Volvo am I. Ted has kept my car running through a tough economy and treated me with honesty, and integrity as a customer. This 240GL Volvo has driven 19 years and over 300 thousand miles thanks to Ted and Mark and three other great mechanics that have since retired.  Thank you Ted and Mark.", "business_id": "7P3ECWrdSepztN5A3boTmg", "stars": 5, "date": "2015-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 7, "cool": 6}, "user_id": "frEtELnTATd1BOD6Ndh0CQ", "review_id": "lrclKfsDJ5PCkW_j9X-Pnw", "text": "Our car failed emissions three times. DOh!\n\nFinally we determined that we needed a new catalytic converter. I called Mad Hatter at 12:10 on a Saturday. They said they close at one pm, but if we got there quick they could do what we needed. They gave us a price quote.\n\nWe arrived at 12:20. They installed a new catalytic converter, we paid the quoted amount. We left at 12:40. \n\nHow's that for all done, no fuss no muss? \n\nWe passed our emissions test with flying colors. \n\nGOLD. Honest, fast, wonderful service! We love this Mad Hatter location!", "business_id": "5jqqVt-A8bwwJDj7Ii7tvw", "stars": 5, "date": "2008-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "AQxlX8bOQiSDwvlrHThnMg", "review_id": "txHvveTJn8Hz5fvk85uKMg", "text": "Looking for a great break job at a good price? This place is thorough, efficient and honest.  When I showed up a little after 8am there were already 2 cars ahead of me.  Mark gave me a realistic time estimate for my free brake check and after the diagnosis, they efficiently completed the job and I was on my way.  Mark was personable, courteous, informative and old school honest.  What a rare and welcomed combination!", "business_id": "5jqqVt-A8bwwJDj7Ii7tvw", "stars": 5, "date": "2013-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6zVALhHLbAOO-cF8wN3y4w", "review_id": "8SzYUC1Y3zdwYI3S7kkqrw", "text": "I live in the neighborhood and wanted to support local businesses. The guys at Mad Hatter did an efficient job on my brakes. I felt they were honest and stood by their work. They did what they said and charged a fair price. I recommend!", "business_id": "5jqqVt-A8bwwJDj7Ii7tvw", "stars": 4, "date": "2014-12-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "69eTr32OMRw5fD8Km5RN8A", "review_id": "83K6Pb4AMmsgF9ZprXuBnQ", "text": "Mark is the most professional and knowledgeable mechanic I have ever met. Fair prices and real customer service. Thank you so much for doing what you do! If you ever read this, my car has been fine ever since you looked at it and I am so grateful!", "business_id": "5jqqVt-A8bwwJDj7Ii7tvw", "stars": 5, "date": "2015-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KTbQ-kibt5TwGlIatHelIg", "review_id": "85O78WXcawRwWBQbixGKYQ", "text": "I have been coming here for about 15 years. I get  fast, great, reliable service. Rarely do I have to come back for the same issue. My uncle from pit of town who has had his own shop for 30 years said he would take his var here go if he had to. Hearing that from my uncle just reinforced how I feel about this place. They know me not just my car. Will come here until I move or they close. Honest guys!¡", "business_id": "lgWOnPbDjKrpa-hhugGZGQ", "stars": 5, "date": "2015-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9J2qULE0Fn56Wy1yK--frA", "review_id": "lDf-WEG1jrhFT6XKY100JQ", "text": "I cannot say enough great things about Inmans!!!  Jay and Jeff are always super helpful and patient with me.  I am a girl and I know nothing about cars.  I just want my car to work well and Inmans takes care of me every time.  They will pick you up and drop you off, which is heavensent amidst the whole inconvenient car trouble times in your life.  Their lobby is clean and spacious.  Their bathroom is girl friendly.  Yes, these are things I take into consideration with a mechanic!  Their prices may be a little higher than your greasy, dirty, scary joint on the corner....but I would pay a few more bucks for Inmans service any day!", "business_id": "4OY51VjcxPKO6WGzRfVdVw", "stars": 5, "date": "2011-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nxVAs0ivaOgupWvj9wJDOw", "review_id": "aJEGeJCuMmqXKWSt78xVRw", "text": "UPDATE:  Sooooo... the timing belt that Inman & Sons told me I should probably replace whenever I had the spare money finally gave out.  All I knew was that my car was making scary loud noises, so I drove it to the closest reputable mechanic to my work (Virginia Auto).  After explaining to the very nice person at Virginia Auto that I have been working three jobs to save up for some international travel and had NO spare cash, I left my car in their hands and crossed my fingers.  They called hours later and delivered the blow:  a $1,600 repair.  It occurred to me then to run the quote past my old pals at Inman & Sons, so I gave Jeff a call, sent him the estimate, and we were able to work out a solution for less than $700.  No joke.  Going to Inman & Sons saved me $700 (I still had to pay a $200 diagnostic fee to Virginia).\n\nI literally hugged Jeff when I picked up my car.\n\nThe rest of the story:  They had the repair done in hours, offered me rides both ways, and took the time to walk me through exactly which parts needed to be replaced and why.  They even showed me the parts they took off the car.  Seriously, these people are heaven-sent.  So lucky to have found them.", "business_id": "4OY51VjcxPKO6WGzRfVdVw", "stars": 5, "date": "2013-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "4sIK_74UwkKU9YQXIfgCdg", "review_id": "aOzukalpJwiLSydWrbjUBw", "text": "One day I was backing out of a parking space and backed into a car coming off the street.  I told the person that hit that I had insurance and all that. In my mind I was wondering what this was going to do to my insurance rates. The man asked me if I saw any damage to either of our car,  I said no.  He said he had a repair shop and knew there wasn't anything to worry about.  I asked him where his shop was because with with what he was doing for me, I'd like to give him my work..  He said that was not a reason to go there.  Go there to get good service was his attitude and for no other reason. \n\nTwo cars later I finally got there.  They are AAA approved.  They may not be as inexpensive as some places, but I believe you get what you pay for as far as the quality of the work that is done.  They are courteous and knowledgeable.  The man at the front desk always takes the time to explain what they are doing.  I leave thee with a pretty good idea of what to expect.  I also have never had to return to Tony's because the work don my car was incomplete.  I  try not to complain but is it asking to much to just do the job right the first time!  Cheers to these guys on this one!when that has happened but having to do it has always really irritated.   Jeff, the manager has even saved me money by sending me somewhere else where I could get something done for less! I was told I needed two new tires and they should be replace pretty soon.  They could put them on there but I could save money if I went to Discount Tires down the street.  Actually one of the tires looked okay to me, but it wasn't worth the aggravation to not agree.  I have gotten the bad tire story more than once in my travels.  A few days later, I did go down to Discount Tires. I asked them to look at my two front tires.  First thing the guy did was to show me was where the tire I thought was okay was bad.  It was separating near the side in a weird way and did need to be replaced.  He said I was fortunate because with the make of the tire he could prorate it even though I hadn't bought it there!  Jeff did save me money with his suggestion..  \n\nI sent my 87 year old neighbor to Tony's to have her car serviced.  As well as they treated me, I worried because I couldn't go with her and make sure they didn't take advantage of her. When she got their they actually saved her money.  There were several things that the dealer ALWAYS did when she went in. I can't begin to tell you the what it would cost her when she took her car in there just for an oil change!  She was happily surprised when they told her they several things didn't need to be done on her car at that time unless she really wanted to spend more money.  I have since found more than a few of my neighbors have been going there for years and they feel the same as I do. \n\nOne advantage to Tony's is it's location.  You can find it.  It is relatively easy to get in and out of.   They shop is kept organized and clean with a front desk-no having to look for who's in charge-and a nice waiting area.  No place is perfect but Tony's does things in a way that puts it a cut above.  Do you know what a shock it is that I have given an auto repair place a 5!?!", "business_id": "2fXVpii6fawN7qCL_M2Urw", "stars": 5, "date": "2009-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-yZJr73bAoPtlpHUL7JBzg", "review_id": "SIjHByIx7W34hsBZ4xDFaQ", "text": "I agree with David M.  Tony's is fair and honest. Work is done right the first time. They will tell you what they found and what may happen if it's ignored. I was also told once that a noise I heard while may be annoying will not affect the performance in any way and the car had no safety issues.  They're not open on Saturdays but, they do have a van to take you to work and pick you up.", "business_id": "2fXVpii6fawN7qCL_M2Urw", "stars": 4, "date": "2009-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q8tz6gofk3jjSjBUWNRCCw", "review_id": "Yr8e6IpaZoChcgDdhAArOg", "text": "I have been taking my car to Danny and his guys for years and can't say enough great things! As a female, I never worry about being taken advantage of and feel very comfortable every time I'm there. Thanks for being awesome, Danny!", "business_id": "2fXVpii6fawN7qCL_M2Urw", "stars": 5, "date": "2015-01-26", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "kvBcEmrcMAdxA31A3dhYfw", "review_id": "I4iGvbevisBhe7uiZUfU_g", "text": "I found these guys on yelp and have been very satisfied with the service.  The office is clean, organized and friendly.  I needed a ride home after dropping my car off, and they provided shuttle services and even picked me up from work when my car was ready.\nMy brakes were squeaking noise, and I couldn't tolerate the sound.  I was on the verge of going insane.  They fixed my brake, and found out what was causing the noise (brake pads, and calipers were installed wrong). They were good at communicating and honest throughout the entire process.   The price was fair for the time and efforts.\nI just left the shop and my brakes are now working like new... and another auto-shop may have elected to do an entire brake job.\n\nI will definitely be bringing my car back here for future service.", "business_id": "uKNp1tdMEibbriPE9bhZKg", "stars": 5, "date": "2012-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XnZkcl4rek18mgQGx9IvIw", "review_id": "VbXDIa9x_yt4YXXqC2uP7Q", "text": "Went for an oil change today and the service was amazing! They offered to drive me to work, showed me where the coffee was, and gave a great run down on the prices for things that I needed work on my car. Next time my car breaks down, I know exactly who to call!!", "business_id": "uKNp1tdMEibbriPE9bhZKg", "stars": 5, "date": "2013-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ne84WI_yKuxf89q3DGgQpw", "review_id": "ymBQc8HHgUT1ssMFLyfRQQ", "text": "I was looking for an honest mechanic and found even more than I was expecting here.  I was quoted a price at another garage for 100$ more and didn't really have a great vibe about the guy. I did a random Internet search for 'honest mechanic' in Phoenix and \nGoogle serendipitously brought me to Martin's Yelp page.  I called and spoke with Glen there and they were able to get my vehicle in the next day.  They gave me a fair quote and a helpful list of maintenance items to be aware of for the future if I chose to repair them.  Everyone that I spoke with here was really kind, personable, and knowledgeable.  This is a great business and I would hands down recommend it to anyone and will continue to come here for other repairs.  Hopefully, I won't be needing that many though:).", "business_id": "uKNp1tdMEibbriPE9bhZKg", "stars": 5, "date": "2014-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6hOd6SFprHi3ExPqSisSvA", "review_id": "_6DNnoq-NzDNxko1kuJBeg", "text": "After reading reviews about Martin's Auto Repair, I decided to take my Toyota in for a routine oil change. The employees were professional and personable and, though I didn't take advantage, they have a courtesy vehicle to get you where you need to go rather than wait at the shop. Prior to servicing my vehicle, I received a phone call explaining the options as far as types of oil and an explanation of the benefits of one over another. Though a little pricey, I was pleased with my experience at Martin's Auto Repair and will take my car back for maintenance and service.", "business_id": "uKNp1tdMEibbriPE9bhZKg", "stars": 5, "date": "2014-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "g9lf21-BUkdCGe2wA_tANw", "review_id": "xRJZEyO7LnbyOCgoenxJYA", "text": "I took my BMW here because the dealership I purchased it from (used) took it here to have an oil leak repaired.  First off, the oil leak was \"repaired\" only to find out later that it really wasn't.  Turns out there was a slit (cut) in the valve cover gasket, which either occurred when this shop put the part in, or they purchased it with the defect, but either way, the problem was missed on their part, which tells me they do not pay attention to detail.  \n\nSo, when we noticed the leak was still an issue, it was under warranty through this shop for the original work, so I took it back.  I spent a few hours waiting since I live in the far east valley, they did repair it, however later that day my \"service engine\" light came on, then went off.  A few days later, I parked my car, turned it off, and went to start it again after picking up my mail, and the car would not start.  Thankfully, my husband is a mechanic (the only reason he did not fix the oil leak the 2nd time around was because it was under warranty), we towed my vehicle back to my house, which was only down the road, but it was dead.  Come to find out, the cam positioning sensor had not been plugged back into the vehicle all the way, which is what tripped my \"service engine\" light a couple of days before, and once it became looser over the course of driving the vehicle, the vehicle finally wouldn't start.  My husband plugged this in completely (like it should have been doen at the shop after fixing the oil leak), and there have been zero issues since.\n\nNow, I'm not sure if this shop did this on purpose, or if they just do not pay attention to detail very well.  But, given that something as simple as an oil leak required TWO visits due to a part that they either didn't notice was defective or they messed up themselves, and then they did not finish putting the vehicle back together when they were finished, I am not very happy.  On top of it, I had to have my vehicle towed (thank goodness for towing on my insurance!), and had to deal with a dead vehicle when my school aged son, and I were both sick at the time.\n\nI would NEVER recommend this shop to anyone, I will never ever go back, and I also intend on notifying the dealership I purchased my vehicle from of the issues in the hopes that they choose another BMW shop in the future to service any used BMW's that come onto their lot.  What a complete and utter nightmare.", "business_id": "3jBkt2zeO1t0mUUBJMzTJg", "stars": 1, "date": "2012-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pJK1iS2seiKKNpigBHw8tA", "review_id": "JDXsdvJeOe8oe7UPAoiaCg", "text": "I've been bringing my vehicles to Johnston's for a good 17-18 years.  This is my third vehicle in that time period and I don't trust anyone to work on it but them. Locally owned and operated, Dwight, Rod and now Mike are good honest guys who will not charge you for nor suggest any unnecessary repairs. The shop is at 24th St. and Osborn and I live in Chandler but I make the trek because I trust them.  They will even provide me a one way ride to my office in Scottsdale if need be. I highly recommend these guys.", "business_id": "sBgB9OLYOOewtw2RdHitzQ", "stars": 5, "date": "2014-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 1}, "user_id": "upssaszVG_egJVRKBU5Dzg", "review_id": "0JiipW3mrP4caYPUjSYRyw", "text": "I'm gonna add to the growing list of previous reviewers who have also had great service at 25th Street Automotive by giving it a well deserved 5 stars.\n\nMy clutch had all but completely gone out and I had to have it towed to the auto shop. The car was also running very hot in an unrelated issue. One of the Bills called me 3 or 4 times throughout the day to keep me in the loop of what they had discovered and what was recommended.\n\nThe service was all complete in one day and I was able to pick it up the same evening. My car is running great! Every positive comment about this auto shop is very true. They are professional, extremely courteous, reasonable and above all, they are trustworthy. \n\nA good auto shop is one of those things that seems to be all so elusive, so I'm thankful for the previous yelpers guiding me here. I hope to not have anymore breakdowns or many maintenance needs but if I do, I will return here. I am a fan and I will recommend them to anyone I hear of having a vehicle issue.", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2011-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "mMSWtsCiMkzGtd1aMhh5VQ", "review_id": "VsR84ubOyiL2-eXq2aMutQ", "text": "I've found the mechanics here to be honest, competent and interested in making customers for life.  What more could you want in your mechanic? They also provide a free shuttle, free coffee and free bottles water on a hot day and once you're on the mailing list they'll send you coupons for your next service.", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2011-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nC1mftAxoNKGN1Q1bGh1Mg", "review_id": "uB-r3eRHdtsieMt2TwTBhA", "text": "Best place to go!! I am a female who doesn't know anything about cars and they always explain so I understand. They really do what is best for their customers and don't try and add on little extra charges here and there like most places. The Bills are very nice people and I am never going anywhere else in Phoenix!", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2013-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "WQhBfTQmJ3keNgYDGEfMdA", "review_id": "dFn6SYL2sX9iPVraXZPoaQ", "text": "When I moved to Phoenix a couple of years ago, I sought out a local garage to service my vehicle.  It is an older car with not much life left in it, so I wanted to work with someone honest who would not pressure me to sink a lot of money into the vehicle.  Through Living Social and Yelp, I found 25th Street Automotive.  I wish I had gone elsewhere.  The Living Social Certificate provided for 3 oil changes in about a year's time.   This car is driven very little, so it would not need 3 oil changes in one year.  When I inquired at 25th Street, they told me \"No problem, we'll honor it, as long as you get the FIRST oil change done within the year before it expires, we'll honor the other two.\"  This was NOT the case.  The first two oil changes were done there and last week, I made an appointment to have the third one done today.  I mentioned the Living Social Certificate on the phone when I made the appointment.  My wife took the car in for the appointment and they told her that they would NOT honor it because it had expired.  If they had been honest with me up front and said \"we'll only honor it for X period of time,\" I would have had no problem, but they gave me their word they would honor the offer and they did not live up to their word.  My wife was not pleased with their response and left the garage without having the oil change done.\n\nAnother problem I had is when I took the car in for one of the earlier oil changes, they investigated a known issue that I had with the car.  They did not verbally inform me that there would be a cost to investigate the problem.  (I did sign the standard form that likely authorized the work, so I realize that I was legally on the hook and didn't complain at the time).  I was somewhat surprised to find a $60+ change on the bill for the cost to investigate the problem and provide an estimate.  Once again, had they been more forthright and verbally told me that there would be a cost, I could have made an educated decision and likely would have OK'd it.  Finally, the estimate for this repair was in the $600-$700 range.  They insisted on using a \"Genuine AC Delco\" part that cost somewhere north of $400.  I asked if they would be willing to use an aftermarket part or obtain a used part from a salvage parts dealer and they would not.  To put it in perspective, this car has a book value of less than $1,000, so why would you install a brand new $400 part when much less costly alternatives are available?  It just made no sense at all.  (I do own a newer, nicer car for which their method of repair WOULD make sense).  I declined to do the repair and ultimately found a brand new aftermarket part on the Internet for $45 and had it installed another garage for $120 (which included a warranty on the work) and the problem has been solved.  In a fair assessment, the guys at 25th Street are probably good mechanics and they may be well-suited for working on newer or higher-end cars, or for working with people who are not as cost-sensitive as I am about their cars.  They are pleasant on the phone, accommodating with appointments and have a free shuttle service which may be a great convenience for many people.  For those who have older cars or are highly cost-sensitive, you may want to take my experience into consideration.  Also, regardless of the type of car you have, I highly recommend you ask a lot of questions up front and if any promises are made, get them in writing.", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 2, "date": "2013-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "BiZvuNKi0bs_YwttHhhq4w", "review_id": "D6Rg8FBuL24nJa5QZJTjuA", "text": "We brought boyfriends car here based on a recommendation from a friend. Boyfriend knew immediately to check Yelp and all of the reviews are amazing. \n\nThey were so communicative it was insane. We have brought his car other places and it would take days to get a response. These guys clearly pride themselves on communication and customer service. \n\nWe dropped the car off after hours and he had it back the next day after a quick call and explanation. These guys want to give you the best deal possible. They had some coupons they offered which helped us out (even if just a bit).\n\nIf you think their service is a little more expensive, its worth it!!! Having taken the car other places and not had service like this, we would take both of our cars back here and pay far more than any other place.", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2014-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Z7JJmRSSVQTxw_o8FwLGIA", "review_id": "yoisW9h1GdOrhbxdCc2kFw", "text": "After receiving a pricey estimate for repairs on my truck, I took to Yelp for helpful Yelper advice.  I came across this shop and Bill and team were terrific.  On the phone, Bill told me my estimated repairs were probably not likely and that I should come in for a cheap inspection to look everything over.  He was right.  The repairs that I needed were minimal compared to what the 'other' shop wanted (not needed) to repair.  Bill and staff got me up and running in no time and for much less than I was expecting to pay.  Thanks!", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2014-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cUeFrgBzMhRjOb_6CeGpYg", "review_id": "0EF5UuFqGkLd86GppGTAgg", "text": "This is officially my new go-to auto shop. I took my recently-purchased, used car here for my first maintenance on it and they were extremely helpful. I'm the type of person who need honest people who will tell me straight what's going on with my car and that's exactly what I got, and for $46! You can't beat that. I love this place!", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2014-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "i4dYFyRoskak-jt0NHtOSw", "review_id": "_fqiPSWOiFicCBtnQ51oDw", "text": "This shop is awesome.  They are right down the street from my house.  I used to take my car to the dealership for the regular oil change and whatnot,  but then I wised up.  The guys here are so nice. They don't try to up sell you or rope you into getting unnecessary repairs.  \nThey made some suggestions as to what might need to be fixed and by when.  I asked them about an issue with my steering wheel and the cost to repair it.  The man that helped me told me that the  part that needed to be fixed had a recall on it,  but that my car wasn't included in the recall.   He suggested I contact Toyota Motor Co anyway and see if I could get it repaired for free or at a discount.  His advice saved me $600 as Toyota repaired it for free. That's some amazing customer service!  I'll be coming here regularly to service my car.", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2015-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UE_ECdDpHjCwhkddrQ6Oow", "review_id": "cda3GMqBeqiXJBrLnuwfnA", "text": "The guy's at 25th Street automotive are incredibly thorough, courteous and are dedicated to giving an extremely high level of service. The best part is they listen. I felt pretty confident there might have been something wrong with the control arm on my Chevy Tahoe. They inspected it not once but twice while I was there just to be extra sure. Bill then took the time to explain some of the things I might be hearing and assure me that it was well taken care of.\n\nLong story short I trusted my family vehicle 225th Street automotive and I suggest you do too.", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2015-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WJkmgkrSPMHTfDTD3VgqqA", "review_id": "duraLBqF4o9BYRvJAATcsA", "text": "A receipt coupon for a $20 oil change from Fry's brought me to Midas. And I was also 1k miles past due for an oil change. \n\nI called ahead to make sure they could accommodate me and was told that they were busy but come in about 2 hours and they should be clear. So I showed up 2 hours later and they were able to take me right away. \n\nThe guys there were professional and found some other repairs I needed. They took the time to actually show me the problem areas. The manager was supposed to provide me an estimate/pricing on the repairs but when I mentioned that I wanted to run the problems by my regular mechanic and compare costs, he left off the estimate on my receipt. Of course, I didn't notice until I reviewed my receipt.\n\nI brought my laptop with me because I saw that they had wi-fi and sometimes these oil changes can be longer than an hour. Well, the wi-fi didn't work but at least my service time was only 45 min and the Cardinals' game was on TV so I had that to keep me preoccupied for a little while. \n\nI'll start at 3 stars and once I talk to my regular mechanic I can see how accurate they were with their assessment.", "business_id": "it7e85D0cwN2W2M1BVKHUA", "stars": 3, "date": "2010-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3DXtjwsOPKUaWO3CNReqJA", "review_id": "4cvUX6DhK-fGufAFNU7gOQ", "text": "I'm not one to normally write a review, but people need to know about this place.  It's clean, organized and well run.  Whether you're talking with the Manager (Terry) or anyone else, they are friendly and sure to explain what is going on.\n\nI took my car in because it was leaking some oil...that was actually spilled oil from an oil change done elsewhere. They cleaned it up without charge and without the awful upsell you get at most other repair shops.  I'll be going there exclusively.", "business_id": "gCaccP5CxQn-j2KCNbD4gg", "stars": 5, "date": "2012-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vTRKCJ8_N9awbM8n3r7aEg", "review_id": "N4VlPCjjWtb3oJm7j_vqEg", "text": "GREAT service!  Blew a tire a few blocks down the street from Purcell on Christmas Eve, and they came and put my spare on so that I could drive my car.  This was above and beyond, and saved me a tow charge.  What incredibly friendly, accommodating service by Kevin and Bill on what was a really busy day for them.  \n\nI will, of course, be buying my replacement tire from them - they earned a lot of customer loyalty today!", "business_id": "gCaccP5CxQn-j2KCNbD4gg", "stars": 5, "date": "2013-12-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "3dno9Y7mtvi2tq6IfMpDeA", "review_id": "O6QCmC76l0eipADpNUjsng", "text": "You might notice I have more than one check in here.  I came in with a very slight pull to the right.  Left with a ver slight pull to the left and the guy telling me that my car might ride differently because he set it up for tire wear, not performance like the factory.  WHAT?\n\nThey ended up fixing the pull but since there isn't a computer in the place and they didn't seem to fond of seeing me again I felt uncomfortable asking them to put it to factory settings. \n\nNow my car doesn't handle as well (honestly, there is a noticable difference) and I am force to go to another shop to get me back to factory specs.  \n\nBummer.  \n\nI must say that I won't be going to a place again that doesn't have modern equipement.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 3, "date": "2012-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4pJvBS_BWEP5FSrtKzbwdw", "review_id": "Jc9yPocn_BxLqsvzNq_28w", "text": "I have taken my cars to Jack's since 2000, and I have owned a few: Volvo, Chevrolet S10, Honda Civic Hatch, Chevrolet 1500 Full Size, and a Mazda 3 Hatch. This shop came highly recommended, and I can say I see why it did. I first worked with Mark, but the shop's owner, Ken, is awesome to work with. They've always taken care of my vehicles and have not drained my wallet. \n\nAll their work carries warranties, and I had to take my Volvo back in after a trip to Mexico. They adjusted my car's alignment w/o charging me anything. Doing business the old-fashioned way is what they're about, and I cannot say enough about how nice these folks are to their customers.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2013-01-21", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "tN_BAs1m8TzvNsaMPRa3OA", "review_id": "8J4SuNuaCUB98nA_JL4rhg", "text": "Ive had aprox. 5 alignments done there over the past few years and always had good work done.  Joel is always very nice, however Ken  (the older gentleman) is usually in a bad mood and probably needs to retire. Last time I was there he was very short and rude. I don't know if he was having a really bad day or what, but I wont be going back.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 1, "date": "2014-02-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "R0J0Nm1H8zAfSSJzgekWPg", "review_id": "x3SK7zcia0aG8lftWXWiug", "text": "These guys know whats up. Took the time to tell me about some tire problems that I had, and even asked me if I drive the car 'aggressively' as they would have set it up a bit different. Not many places left that actually seem like specialist of a trade. Will be going back for sure!", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2014-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "O927TTluf2hv5sFhEANCKw", "review_id": "S2Vdv84BDJ1GkrxCbF7MQw", "text": "Ken is the Man!! I've been to network alignment 3 times, 2 different shops. Ken took to time to figure out my problem and not let me leave until it was right and I was happy. I have a Toyota Tacoma lifted and he mad it perfect! I will be telling everyone if you want it done right go see ken! He reminds me of a guy who just knows his stuff and can fix anything. Not some young guy been doing it for 5 years and thinks he is king. Thanks so much for taking the time and making my 40 minute drive WELL worth it!", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2015-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LGNx8aXHVyV8nZkKNZMGDg", "review_id": "Wqm4MpJqdEjJ4S9d5aZeYA", "text": "These guys get five stars. First, I found their prices to be the lowest in town. I didn't call every shop, but they were about 10 to 20% lower than everyone else. Second, and most important, they didn't take a dime from me. They gave my alignment a thorough check, and found that it was not the issue. They made some helpful recommendations and sent me on my way with a free inspection and peace of mind. It's rare to find a mechanic these days that operates with such integrity.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2015-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Ljjm6q7GpfmerjcVaOC17Q", "review_id": "9aYHy0de3HSRksvqWFTHNg", "text": "This location is terrible. They did nothing but screw up multiple cars of mine. Now it's two years later, and the compressor they broke and replaced is broken again. \n\nDO NOT GO THERE!", "business_id": "nDJ9Pbt0RF6iXLgVzGyC3Q", "stars": 1, "date": "2010-01-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "zTygpljE4TazYFfJvVAFYQ", "review_id": "qFMAI8-dR1C80F5j_ndMlA", "text": "Avoid this corrupt company... terrible! \nI sent my wife in for an oil change and to get the brakes looked at because they were squeeking.\nThey did the oil change and told her that the rotors would have to be ground down or replaced and the rear brakes needed to be cleaned, the bill would be about $400.00\nI said no, bought $18.00 brake pads from another company, and did the repair myself in about an hour\nWhen I looked at the rotors, they were LIKE GLASS, in immaculate condition, absolutely did not require any grinding/replacement...  (the vehicle is only a few years old, with low mileage) \nThey completely tried to take advantage of my wife, fabricated a completely false story about the vehicle to try to make a quick buck... they should be shut down... \nYou've been warned!!", "business_id": "nDJ9Pbt0RF6iXLgVzGyC3Q", "stars": 1, "date": "2011-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kjnznsE7LsddoNWDzE79Fg", "review_id": "EPIlmMPbpv2TqPt1f0R8Iw", "text": "Made an appt for an oil change and had to call a few times to change the time. I spoke with Seth who I'm not sure if he was the manager or owner but he was incredibly nice and helpful. \n\nWhen I went into the store he was there and just as professional and kind in person. I was in an out for the oil change in less than an hour and the store itself was clean and well kept. Will definitely be going back!", "business_id": "nDJ9Pbt0RF6iXLgVzGyC3Q", "stars": 5, "date": "2014-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_MP3POTtBoP_81ycZBMqKg", "review_id": "ntEBwAkZJyHzzpba7k3Xjg", "text": "Great customer service! Thanks Maurice! \nSuper fast service and fair prices. I will be coming back with both my vehicles.", "business_id": "nDJ9Pbt0RF6iXLgVzGyC3Q", "stars": 5, "date": "2015-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SHi0ZKtsebge11hV5LfbQw", "review_id": "KwO6uvSwBM44zkxF6lrbZQ", "text": "I am stunned that mine is the first review of Tony's Auto Service Center.     This is a family-owned business that has served residents in the Arcadia area for decades.     \n\nThey are fabulous.    They are competent, honest, and friendly.     Their prices are quite fair.    I trust them totally.      I have always had great experiences there.     \n\nI am not a car lover.    I want my car to run.    That is all.     Anyone can tell that is easy to take advantage of me,, but Tony's never does.    A recent experience showed me how truly terrific they are:    The other day, I brought one (very old) car to them that needed a brake job and I told them I thought something else was wrong as well.     They did a diagnostic and found multiple problems.    I decided it was time to give up the ghost and replace the car in lieu of making the repairs...this was fine with them.    My other car had a very minor problem in that it was easily fixed...but it was crucial to me so that I could be comfortable driving.     They fixed it in less than a minute...no charge.     \n\nI wish all businesses could run like Tony's.", "business_id": "S1q51o5JqD5rzzDq_WD5_w", "stars": 5, "date": "2010-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8WUFsW1Hz4dkoaPMUMq4xg", "review_id": "LUS50Tnn1RI1dQHSQZaMOw", "text": "THumbs up for local businesses! I dealt with the owner and his wife (who works the desk at times) and they were great! I take my car here for all my repairs!", "business_id": "S1q51o5JqD5rzzDq_WD5_w", "stars": 5, "date": "2012-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3vDuLN-oR3PSkhTbE27Jhw", "review_id": "GqyQxcvkgbqkx6YiA0LBlw", "text": "I've been taking my two cars to Tony's Service Center for many years, and I continue to be amazed at their professionalism, their courtesy and their caring attitude.  From the office staff to the experienced mechanics to the people they employ to give you a ride to and from their repair shop, they are, to a one, extremely helpful.  I think what I like best is that Scott and Catherine tell me what my car needs, in order of priority.  Then, with that, I'm able to decide what I can put aside until the next visit and what I need to attend to immediately, and that suits my budget just fine.  What's more, their repairs are done in a timely manner and are done properly.  I think their charges are very reasonable for the level of service expertise that they provide.  Many years ago, before I started taking my cars to Tony's, I did business with another car repair shop.  One time I had to take my car back three times before the items were fixed properly, and on two occasions, things came back broken that hadn't been when I took my car in.  It was maddening, and that's when I switched to Tony's Auto Service Center.  Tony's does the repair right the first time, and I'm back on the road, knowing that the problem has been fixed -- period.  In addition, record-keeping at Tony's is excellent.  They maintain my car's repair history back to the first day I brought it there.  I have never dealt with care repair people whom I trust so implicitly.  Their ethics are outstanding.  It's no wonder they have received so many awards for their service.", "business_id": "S1q51o5JqD5rzzDq_WD5_w", "stars": 5, "date": "2014-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WlB4WvFOs3RZD2wLWMC7OQ", "review_id": "UfRs0uTh9QMJfMC7F-YIKQ", "text": "New to the area and saw good reviews so called for an oil change and once over.  Oil change was fine and fair priced.  But then they told me that I needed a major rear brake job - to the tune of $1000+.  So I checked two other shops and got quotes over 2/3 LOWER for the work.  Got the work done at a different 5-star YELP rated facility and am happy that YELP helped me find what I needed at a fair price.  As for Tony's, check it out  . . . if you need an oil change.", "business_id": "S1q51o5JqD5rzzDq_WD5_w", "stars": 3, "date": "2014-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W3dlspd1WP7nwt-zS_CWjQ", "review_id": "ytbE8-lFNi4emQRG2mIKGQ", "text": "I have been a AAA member for a long time.  For years I took my vehicles to Marshall Motors that is only 5 blocks from my home.  I got so tired of their constant failure to properly diagnose the problems with my cars that constantly broke down in the most inappropriate locations that required towing to that garage to try and fix something that they just couldn't find.  Usual remark: We couldn't find anything wrong with your car!\"  I decided to use our Firestone Service Garage for a couple of years until one day when I needed a tow the driver suggested that I go to TONY'S Auto Service on East Thomas Road.  Boy, was that good advice.  First, the personnel were so darn friendly, ready to listen to my problem, and knowledgeable enough to voice a possible fix even before they looked at the vehicle.  I have taken my vehicles to Tony's three times now and each time I was treated courteously and my vehicles repaired the same day, paying for only what needed replacement on the car.  I was immediately given a \"New Customer\" discount with a constant flow of discount coupons in the mail, \"Discount on your next visit card\" which have been applied to my bill without even mentioning it to them.  (Something I never received from the \"award winning\" Marshall Motors, even after years of patronage.)  The other day I called Tony's for an appointment to have my car towed in because it wouldn't start.  I was asked to describe the problem, and over the phone I was given the solution.  I called AAA Battery Service (who arrived within the hour, great service) and installed a new battery and my problems were over.  Thanks to the friendly advice from Tony's my day was saved I only paid for the cost of a new battery.  Every mechanic at Tony's is great and I like the fact that they take pride in keeping my old pride and joy '95 Buick in tip top shape that seems to run better than my new Honda.  I would recommend Tony's Auto Service Center on East Thomas Road to everyone who wants their car repaired right the first time by guys who really take pride in their work.", "business_id": "S1q51o5JqD5rzzDq_WD5_w", "stars": 5, "date": "2015-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "d8hI4HDZCLxN5G6xlOGRPA", "review_id": "f14GqWuFAsoVY36eEn6GNw", "text": "I took my car there when i had a flat tire. They found a nail in it and replaced it. Great prices on tires.  Another time i thought i had another flat and took it there to get checked. They checked and told me my tires were fine and they refilled my tires. But they had not! I went home and check the pressures and it was as low as 25 psi. Not sure i will trust them again!", "business_id": "cX0BRezhCTm-pkK8_lwWAw", "stars": 2, "date": "2011-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tPstbtdQa8sDLAsBDZOVuw", "review_id": "xGzSy66DOMkGkkFhzTig4g", "text": "These guys are crooks. Shop manager there said I needed a new tire and that another guy was going to come in an tell me about options available. Guy B comes in and says oh you need 2 tires so let's get some prices. I said your shop manager just said I needed one. \"Well I recommend 2.\" I'll do with 1 thank you. Guy B says oh you're just in luck I have XYZ Brand tire for $108 per tire... I drive a PT CRUISER! I could get all 4 tires BRAND NEW up the street at they're competitors shop without hassle for $75 more. Why the hell would i pay that for 1?! This place is a joke.", "business_id": "cX0BRezhCTm-pkK8_lwWAw", "stars": 1, "date": "2013-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sbjqWAdurd-PfLFbTxBrVA", "review_id": "F4da1FiOQtNZs1j27jWOCQ", "text": "I would never recommend this place to anyone. I was flat out lied too. They do not respect their customers and will tell you anything to take your money. If you are going here, bring someone that knows what they're talking about. Never go here if you don't know know about cars because they'll replace things that don't need to be replaced and do a horrible job doing so. I wish I could give them 0 stars.", "business_id": "cX0BRezhCTm-pkK8_lwWAw", "stars": 1, "date": "2014-01-04", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 5}, "user_id": "gzJpPaHN-NXBkAZcZri3hw", "review_id": "92G3sMaIuT-wU4NJylUH5g", "text": "Cars. Haven't owned many of them. I've ridden subway cars for most of my life. When a car did need some work there was always a man around (Dad! My brother!) to handle the fixin'.\n\nYes. That's the sexist truth. So after hearing a number that made me gasp from a Ford dealer I turned to a dude. He recommended Spitfire Automotive. Actually, who he recommended was \"Mike Carlton on Indian and near you.\"\n\nCan I tell you next to useless this bit of information is on Google? (Still shaking my head on that one.) Anyhoo, I finally found the owner. With such a glowing referral (the dude had used him to fix his off road racing bikes many, many times) I figured, \"Eh. Ok. Besides, what do I know?\" And it was conveniently close.\n\nAfter speaking to Mike to confirm his hours of operation I dropped my car off. His team was able to look at my car the next day of operation. They confirmed the diagnosis the dealer made lickity split. I was shocked, there's no way to emphasize the level here, but SHOCKED when Mike called with his estimate. The difference was substantially less *and* my car was going to be ready the very next day.\n\nLet me say that last part again:\nMy car was going to be ready THE NEXT DAY.\n\nI don't know the location of the magical unicorn tree where Mike grows Ford dealer parts. But my car, Bear, is so very happy. No need for a rental car, so I was happy too! \n\nSpitfire Automotive is family owned and operated. It was opened in 1958 by Mike's grandfather when Indian School was a two-way dirt road. Currently the shop handles automobiles and motorbikes. There are plans to move motorbike repair to a northern Scottsdale location (74th St & Butherus Dr.) where it will be called \"Dirt Riders West\". Motorbikes can be purchased at Spitfire Automotive. While there I got my first up close and personal look at something called an off-road Beta Motorcycle 300.\n\nThe next part will make men groan. (Ok. Maybe some women too!) I'm looking at the bike and I think. \"Hmm. It's ...red.\" I don't know! These are things that go thru my head. That, and, you better gosh darn write a review for this place. It's girl friendly. Manly place, but girl friendly. \n\nOh! And efficiently fast!", "business_id": "3r8xc7tYfRsK6-wdf8knlA", "stars": 5, "date": "2014-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PwbbCr0rZd6NOZdRu4FxEw", "review_id": "MqH7T9e3QjsS4XfzQNVwtw", "text": "Mont and Mark are rock stars. They provide a rare combination of competence, thoroughness, communication, integrity and reasonable price in their services. After a very bad experience at a nearby VW dealer that lasted three weeks with zero results and a bill, Mont and Mark had me complete in four days. The dealer's diagnosis was completely wrong, to a ridiculous degree, and this dealer supposedly is a specialist in my vehicle. On top of that Mark found a couple serious, latent problems that the dealer inspection completely missed. Plus Mark found and fixed a couple small problems I'd known about yet forgotten to tell him about. Funny thing was Mont had worked on a vehicle of mine 30 years ago and I recently \"rediscovered\" him. The service experience 30 years ago was identical to this one.", "business_id": "8wF2zj1Np6x7DY5BpJ4C-w", "stars": 5, "date": "2014-12-22", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "tzgvnA_XwOMUuGPOAVZwFA", "review_id": "J5F9CmGetzyqGhaew33DwQ", "text": "I set an appointment to bring my vehicle to Alexander's for a wheel alignment and battery change which seemed simple enough. \n\nUpon arrival I spoke with Alexander, he had no idea I had an appointment. I explained to him for the 2nd time that I needed a wheel alignment and a battery change. He broke down the cost, but never offered to check the battery to see if it just needed a charge.\n\nI walked him out to my car and explained in great detail how my vehicle had a anti-theft starter and physically showed Alexander how to start the vehicle. He verified he knew how to start the vehicle because he was \"a professional\". \n\nAn hour later I received a phone call from Alexander stating that he could not start my car after installing a new battery. I politely reminded Alexander about the anti-theft starter, but he said the starter was bad and that would cost only 399.99. I assured him that I didn't need a starter and I felt like I was being screwed. He got very defensive over the phone and finally told me to come pick up the car that he will not work on it. Alexander then hung up on me. I tried calling him back to ask what the issue was, but he yelled that he was putting my old battery back in the car and to come pick it up, again hung up on me. \n\nI took off work to go and pick up my car which had no work done. When I got to the shop, Alexander didn't even look or talk to me, threw my keys on the counter and walked away. I went to my car expecting the worst and my car started perfectly, just like it did when I dropped it off. I checked under the hood to see if anything was touched. Low and behold not a single thing had been touched. He didn't install a new anything. I could still see the grime and dirt on the nuts of the battery. \n\nI assume Alexander did not listen to a word I said about the anti-theft device and then tried to sell me parts that were not needed. I drove out of there and got the work done at Meineke, minus the battery because they were able to check it and determine it just needed charging. \n\nI will never return to Alexander's auto. I tried to register a complaint with the BBB but they are not a registered business. \n\nThe treatment I received at Alexander's was the worst service I have ever experienced from a business and very, very far from professional.", "business_id": "Y1ReKMzP5pl76oDUrheaBg", "stars": 1, "date": "2011-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "WlgIfH4_wdwV2TdMtG_B8g", "review_id": "e3bx83Y-Bg7wduHE4YKMCA", "text": "Yesterday, I took my car to the Discount Tire next door to this garage for tire repair. Turned out I needed two new tires. When they got it up on the rack, they found one frozen bolt and one broken off, each on a different front wheel. They told me that Alexanders (A & J) could fix that for me, and what they had said it would cost. When I walked over there, it was pretty clear I wasn't happy about all the $$$$ I was ending up spending, but I said it wasn't their fault. When they were done and I walked over to pick it up, the young man behind the counter said he wasn't going to charge me, shook my hand, and wished me a nice day. Made me quite a bit happier.", "business_id": "Y1ReKMzP5pl76oDUrheaBg", "stars": 5, "date": "2012-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OkjQ2BA6oyM1_NLk4zMBHA", "review_id": "jNI9_QD0UMQoJmKVgRxtsw", "text": "Had major suspension issues.  Guys got right on it quoted me a fair price and had it riding nearly like new.  If I have to get other work I will definitely entrust my BMW 318is with Alexander's.  \nThanks again guys for the great deal!", "business_id": "Y1ReKMzP5pl76oDUrheaBg", "stars": 4, "date": "2015-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "NNdfPF-UhvLB8FxbsuSC5A", "review_id": "gbFE1IxwlUG4mnGKT2y49A", "text": "Went there for an oil change recently.  Didn't know if there's going to be a wait time so I called ahead and make an appointment.  In and out of the store in under 30 minutes.  Great service and friendly staffs.", "business_id": "5m1L5l_k2xFTZO3jttmVOg", "stars": 4, "date": "2014-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GyeV0fMvhbL84pYy9ntI4g", "review_id": "nqyeqQLXjoHiNMtuSWbQzA", "text": "So I'm new in town and needed a oil change.\nWent here and am soooo glad I did.\nAfter calling around this place charged a whole %50 less then everywhere else i checked.\nI drive a smart and the oil changes for it are normally more expensive then most cars cause it requires a full synthetic oil cause of its super tiny engine.\nSo before i knew any better i used to pay like over $100 for oil changes cause auto shops kept scamming and taking advantage of me.\nI now work in the auto industry and deal w/ estematics, so now I finally know what its supposed to cost and went in this shopping for a oil change battle and ready to fight, auto bodys are notorious for scamming women, so i wasnt about to let that happen this time. \n\nWell i didnt have to here\nThey were honest, friendly, clean, charged fairly on the oil and had a fair labor rate. \nWas in and out in 30 minutes\nand they even gave me a lil coupon. \n\nSo I'm won as a customer and will go here for all my auto needs from now on and no more needing to stress out everytime i need something with my car. yay ^-^", "business_id": "5m1L5l_k2xFTZO3jttmVOg", "stars": 5, "date": "2015-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "edUm8D0ow-K45yWLuUcAmw", "review_id": "5QOciZd2Dck1gHtxsIZcvA", "text": "I went there to change my break pads. They asked me to do couple of more stuff, I chose to skip the break fluid change. The price was good. Bad part is that I had to wait for 2 hours and 30 minutes because they first got a spare that didn't fit and had to go back to find the right one again. Wish they gave a proper estimated wait time so I would have chosen to drop it off.", "business_id": "5m1L5l_k2xFTZO3jttmVOg", "stars": 3, "date": "2015-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QfMkmIcJVAiKYgItdX5D5A", "review_id": "U1Y6UMvQ8q3bZrO2za-GFA", "text": "I have been bringing my BMW's here since '98.....best BMW shop in town.....they only sell you what you need and they are honest......", "business_id": "Yhbsyq_n4J3vLhw9WkXwAw", "stars": 5, "date": "2014-01-14", "type": "review"}
