{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iyrxeeRCBceFbvaLlk1ifg", "review_id": "yKtXcu3ZGvEJVPLQYyivDw", "text": "I didn't know what to expect when I walked in, but I am now a fan. There is a cool way to review the menu on a touch kiosk to find out the calorie count. \n\nThe place looked nice. It was clean and really cool looking. The food was really good and our waiter was nice and friendly. I will be going back to try their pizza and other food. \n\nWe had a burger, which was really good, and we had the lobster slider. French fries were good to.", "business_id": "6p9TlP2I8S4agxYMNFSDjg", "stars": 4, "date": "2010-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "jfvv8uvdSJYa5NWEAloxpQ", "review_id": "DFQvdDMih5M92k22nlh7_g", "text": "According to Urbanspoon (blasphemy I know) their are like 1,100 pizza places in pittsburgh. So what is the best pizza in Pittsburgh. Everyone has an opinion and so here is mine: The best pizza in Pittsburgh is the pie comes from the place in you neighborhood that has quality ingredients, fair prices, and friendly service. Eddie's Pizza Place  is all of these things and since I live in this neighborhood this is my favorite.", "business_id": "OcTG-KzDleuRub-pb6JS3Q", "stars": 5, "date": "2013-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fKjeDQvPropMmuv4pegUhA", "review_id": "xpkzFKpJ6_DiA8nBf9GQdQ", "text": "This Valentines Day I ordered a pizza for my boyfriend and asked that they make a heart on it out of green peppers. The pizza was great, the heart was perfect, and he loved it!", "business_id": "lHP5STO7aomlEQixH8m1aA", "stars": 5, "date": "2012-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8WQ5lyjIH24F7Tl2M-l7vw", "review_id": "F9G4ntAnaXOonQb3xP0zXg", "text": "Delivery time was 11:30. Called at 12 to check on my order and was told it was just going in the oven and would be another 45 minutes to an hour until it was delivered. Told them to just cancel the order. And they got an attitude with me about it. Not to mention in the past they couldn't even bring me my entire order.", "business_id": "rEKBr81s19Soh3dYj4bcGQ", "stars": 1, "date": "2015-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sjy_Y14H9ITKqGqZYLXTDQ", "review_id": "dd1FdtUaPmMgpHyinAPqZQ", "text": "Good pizza as well as other great menu options.  Good prices too.", "business_id": "93UCt9OgWYmypZCpXtUu8g", "stars": 4, "date": "2014-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bA_mSbsMGKI0iar76foRFA", "review_id": "TVHuQsdx3H9jCkasB64sEg", "text": "The pizza is great. Other food items might disappoint. They do deliver! Service is hit and miss. There is one rude,  smile-less bartender... I have actually seen him through the window and decided to go somewhere else because I was in the mood for good service.", "business_id": "qemCNgjeYGcFsRwxW9x4xw", "stars": 3, "date": "2011-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "mXJS_e-zR68eExLhMrxJPA", "review_id": "KDon06zc8tSD1s_NraFkJQ", "text": "Nice, clean local place in Green Tree. Might be a little pricey but the food is good and homemade.", "business_id": "KZXtzoI84iI1CEcAnD7OPA", "stars": 4, "date": "2009-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q7MrNVt1FE23rwtWmPYWHg", "review_id": "Y0iJbBMavnNZMCTHPDJgrA", "text": "We stopped in here during one of our recent Downtown adventures, and I didn't find the place to be a dump at all. They should turn down the yellow, though! LOL. The pizza's pretty good as well. I had a big slice of pepperoni pizza and had no problems with it. They have a large menu also.", "business_id": "SvoJ3Y3uqDfB4iGUaWXh8Q", "stars": 4, "date": "2013-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XFZIPlTT4fapnuAws7Dgug", "review_id": "GUQq3nTkqiWTPPUYTfdd7g", "text": "I really really wanted a turkey hoagie... I called one day and they were completely out of turkey. Like wth. Out of turkey? So I called again the next week. FINALLY! They have some turkey!  So I ordered a turkey hoagie with a little bit of their homemade mayo and some Italian dressing. It was $10 for a whole. Not to bad of price because this hoagie was HUGE. It was okay... They added a lot more of the mayo than I would have liked and the Italian dressing was very oily so it made the sandwich extremely soggy and sloppy. Gross. I had to wipe some of the dressing off the bread, which made the hoagie manageable to eat and someone good.  I also hear they have free delivery! Yahoo!!!!", "business_id": "PTS4MxQel-xzj5qWxVn3LQ", "stars": 3, "date": "2015-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "bSkco4ZdB7REFtDsJUVrDA", "review_id": "rHPfnPIK5SQV1sLZ1SatRQ", "text": "This place has been hyped up to me for a while, and I have to admit it definitaley lived up to the hype.\n\nThe pizza is cooked hot and fresh.  It is cheesy, delicious, and savoyery.  It is easy to make a mediocre pizza, but to take it to that next step of memorable, it takes some special deliciousness, and this place took it to that next step.\n\nI could easily see myself going out of my way to eat this pizza again.  Also, the staff was very friendly, and the atmosphere of this place is the perfect setting of a local, classic pizza joint.  \n\nGo here, enjoy the pizza, come back for more.", "business_id": "r8jeeS3k_diihMDSu9IjlA", "stars": 4, "date": "2011-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k1btx_ToqOGT2Ykddkazdw", "review_id": "54yCc46wOs6dvGzstH3XNw", "text": "Ok I'm from the southhills and realize people in Pgh have no idea what good pizza is. I assure you this place isn't it. Problem is the block heads that love this place so much just say they love it cause they are from brookline and think it's cool to say \"I love fioris\" with a really slang sound . Hoagies are garbage and sorry but provolone cheese isn't used on a true ital pizza and sweet sauce ? Garbage !!!! After all the garbage food you get unbelievable attitude. Lol this place would not last 2 weeks in New York plain and simple!!!", "business_id": "r8jeeS3k_diihMDSu9IjlA", "stars": 1, "date": "2015-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "JEvkfVPf_DuhX-ntE5L6bQ", "review_id": "i1FzJFS6IG294NsJidseNg", "text": "After living in Italy for 7 months during my college years I can say that I have a voice in the discussion of what first-rate Italian should taste like. Just so you all know I have tried almost every dish on the menu but will stick to what in my opinion is the best. I did not leave 5 stars because I do think it is a bit overpriced. The last time I went my server was really impatient and snobby when I was asking questions and trying to decide on the wine.  I arrived before the dinner rush on my birthday so I could take the time to really dine with my boyfriend. \n\nWhy I crave Pizzaiolo? Mozzarella di bufala. I know for a fact that every Thursday they fly in many choice ingredients directly from Italia. This creamy delicacy is by far my best loved. It either comes on the DOC Margherita pizza or mixed in with some of the pasta selections. I always order the DOC as an appetizer then the Rigatoni Alla Siciliana. They also only use San Marzano tomatoes in the marinara sauces which introduces a bold rich flavor without as much acidity. The key to these dense, deep red fruits is that they are grown in the fertile volcanic soil in Italy.  The Siciliana is an eggplant based dish that I find myself desiring often in my favorite dish spankbank. The perfect texture of the al dente pasta combined with the melt in your mouth salty, tart smoothness of the mozzarella and eggplant in the sweet heavily basil based garlic sauce is a party for the taste buds. I just keep eating until I am uncomfortably full. The wine selection is also above par, I enjoy the Berro Barberra. Full bodied, spicy, splashes of berry, and low in tannins. \n\nAs for the pizza, it is reminiscent of the famous brick oven pizzas of Da Michele found in only Napoli. The crust is extremely thin, light. and crispy. Follow that with my \"Pièce de résistance\" mozzarella di bufala, tangy san marzano tomato sauce, and fresh leaves of basil you will find that simplicity is more. (yes I know that reference is french) So mangia bene at Il Pizzaillo", "business_id": "6-rJjW6ITl5o_FliiNgZRA", "stars": 4, "date": "2011-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "haDwMRaUHKjxHj707kuAow", "review_id": "FWkswin5sPdRfktbxC3AsA", "text": "Excellent service!  Waitress is friendly and personable.  Clean and nice interior.  Pizza reminded me of authentic pizza from Italy.  Atmosphere is friendly and casual.  Kids will enjoy and adults too!", "business_id": "6-rJjW6ITl5o_FliiNgZRA", "stars": 5, "date": "2014-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iCOPqpQ_mmQ3jaBP2Lz1bQ", "review_id": "RxywhSC2-qoFGgQjdtHm8g", "text": "I have gone to Doc's Place for awhile now - and it's a great staple when you're visiting Shadyside. Right on Walnut street across from J. Crew on one side, and Shady Grove on the other, it's your typical neighborhood bar. The downstairs has a full bar, and an eat-in area, with a dart board and some hi-top tables. Upstairs there's another bar, half inside area, and half of the area an outside deck/patio with seating. It's a great spot in the summer, or when you're enjoying Jam on Walnut (in July). My friends and I went to Doc's this past Sunday to watch the Superbowl. We had a private area upstairs by the fireplace and it was a perfect spot for it! Their food is above average bar food and it's a great place to catch up with friends.", "business_id": "Oq5MyNxNi-xuXdPOWR9O_g", "stars": 4, "date": "2011-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bXGfO52kG3aKdjRvZgpkfw", "review_id": "4f0Q7c2b0UOxOwVBhT4aFw", "text": "Awesome place for Pizza.  Other than pizza, their pastas are not made on-site simply put together at the restaurant.   Most desserts are from a food service and not made there. \n\nPizza is awesome if that's what your going for.   I've had their manicotti, egg plant parmesan, chicken Parmesan, and their spaghetti.... All 4 dishes taste relatively the exact same.  \n\nThe bread the meals come with is just a warmed tough roll.   They should start giving the option of garlic knots instead of French bread loaf.", "business_id": "sJtGRBWYUj013nkFA4Hrdg", "stars": 4, "date": "2013-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_o3XTEER-fYU9pi-SWe23A", "review_id": "XvUD4eSV3g5mrbEdMIkOUQ", "text": "Originally left a bad reviw. Bur since then I was contacted by the district manager. You really seem to care about this restaurant's reputation. He said they're making improvements and that I should try it again. I told him I would and I will hold my review until I do that again. Everybody deserves a second chance.", "business_id": "SVKC_-gIQFkHElZ6bFsE6g", "stars": 2, "date": "2013-12-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "X2E6ALwXlopXg5fKauYiwA", "review_id": "2oCJOfoPXiMjNLHnlywbgQ", "text": "Average pizza at best and sub-par appetizers. Decent beer specials are only upside. Walk across the street and eat at Fuel for some real pizza.", "business_id": "kAid56AY_laxGYslMdsYJw", "stars": 3, "date": "2008-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8BMV0hIk2WDH2ZiV6j7kKQ", "review_id": "Rd_15FMYk-WIm2x2pbv8tA", "text": "My reasons for a 5 star review are two-fold... 1. The pizza and salad at Brixx are consistently well made, fresh, and delicious!  I'm never disappointed; but the REAL reason for my review of the Uptown Brixx today is 2. the Catering service!  Casey Offerman is the catering manager... today, I called him at 12:30 for enough pizza to feed lunch to the 40 people in my office... I ordered 24 pizzas and salad for all... They arrived here within 30 minutes with hot pizza, cold salad, napkins, plates, and smiles!  AMAZINGLY fast and reliable service.  This is not the first time I have laid a last minute mid-week lunch on them either... they are always this fast and always this wonderful to work with!", "business_id": "kAid56AY_laxGYslMdsYJw", "stars": 5, "date": "2015-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "76Gm_zTtwk7KG-uVhZ8VOg", "review_id": "OGrxgC9PafS4VBzkpZR7Fw", "text": "I'll keep it simple. Didn't expect much from Pizza Hut. We order from here fairly regularly since it's close to the apartment. Three of five times we have ordered recently have resulted in phone calls stating they are out of what we ordered. How exactly does a pizza joint *run out* of pizza?!?! This wasn't on a holiday or near closing..and it's happened three separate times. Don't waste your time here, try a local place instead!", "business_id": "jr8D3lu1S0-eRpIVxkKnMA", "stars": 2, "date": "2015-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7-0Cl06NnIpHLxqv_xMUtQ", "review_id": "vdOEeVpfyQb-eR4p51tOcg", "text": "Great pizza at a great price! We order from this place even though it's on the other side of Matthews from where we live. Sure beats Domino's or Papa John's.", "business_id": "ZXl9KGsv-VEoDKCC_08j4A", "stars": 4, "date": "2008-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "T1Ju5Uin6Ja3iki17ME6fA", "review_id": "i1I1_yWvJ6kNazCzGj2mGQ", "text": "I didn't know I liked thin crust pizza until I tried Anna's! I've never actually been TO Anna's. We've ordered delivery both times I've had it so far. Also, as far as I can tell, they don't have an online menu. We ordered the works off of a recommendation on a review and it.is.delicious. The garlic bread is great too!\n\nOur order arrived to our house in a very timeline manner and the delivery guy was really friendly!\n\nIf you're looking for thin crust pizza in Sun Prairie, I haven't had better than Anna's.", "business_id": "b3HiA0pIJ-qIUfXwqIvAZQ", "stars": 5, "date": "2013-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XVuxUGIwzMs9Q02g50HNSA", "review_id": "VKXuj5ITZmjH7Z5NTFZ3KA", "text": "Great staff and food. The potato skins deep dish thing is amazing. I don't care much for salads normally but love the honey crisp chicken salad.", "business_id": "R825-NTAI2wG2C4mN-dtNA", "stars": 5, "date": "2014-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I3qt_NaZfu3j5RfCQTiq4Q", "review_id": "ttYQPtAnCuH4LkQXY2j--g", "text": "A friend of mine told me this place has some fantastic Pizza (she being of the skinny eat nothing calorie-full type), and well, I made a mistake of listening to her! It was a Saturday night, when the bar is super crowded.  We were a group of 4, and as always finding parking spots on downtown Champaign can be a such a chore in weekends. \n\nAnyway, you order your food to the bartenders. Waiting for the bartender to notice you in a crowded bar could be ok if you want to order a beer or shot, but for food? I don't like the idea. \n\nI ordered a Greek Pizza, while the aforementioned friend ordered a garden pizza (I can't remember the name now, but it was their vegetarian pizza) . To be honest, I dodn't like either of them. The Greek one was a disaster. It had clusters of feta cheese spread over a thin crust, and almost nothing else. It was supposed to have sausage, but I couldn't taste any. The vegetarian one, although being the better one, was kind of juicy. A juicy pizza is NOT my favorite. \n\nI'm not against non-American-style thin crust pizzas. As a matter of fact, I love Jupiter's pizzas. But these ones, well, you heard me. There should be a reason these were so cheap (I guess around $7), and I now know it.", "business_id": "pPWre8lbVAssER6CN0uWMw", "stars": 2, "date": "2008-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZRWDnvo07YZxxtrDYWf02A", "review_id": "AA6iJ1KQt1YkQybVipbrFg", "text": "Great pizza and friendly service.  The place is plenty big, so it doesn't get too loud.", "business_id": "6U94ybDpNd0fTL7TIzb5Kg", "stars": 4, "date": "2011-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "usQTOj7LQ9v0Fl98gRa3Iw", "review_id": "ZnW03uiAVckrxFNNhtCKuw", "text": "I should've ordered the pizza, but noooo I went for the wings...yeah wings not boneless bites.  I got wings 3 ways...6 wings, lucliky I paid happy hour price, I can't see paying the regular menu price for 6 wings.  I tried the asian, garlic buffalo and sam adams bbq.   The asian was bland and too p-nutty, the bbq was lame, the garlic buffalo much better and left me wanting more.  \nI sat at the bar, only 2 of us there but it was raining out and a little cold.  Since I live just 2 blocks from here I am sure I will be back, I will order something other than the wings next time.", "business_id": "nc3IiY5LNdmEwUZCW84yuA", "stars": 2, "date": "2010-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "i7qUFnEVmNbyCMZ81FO5Bg", "review_id": "5AJW32OqJY7umpMDEywNjA", "text": "Had a taste for pizza, and after just coming home from NYC I have been on the quest to find authentic NYC pizza. \nA few people told me thier pizza was good, and after falling in love Spinato's pizza, and finding out they were closed on Monday's I decided to give Streets of New York pizza a try.\nI should have waited until Tuesday when Spinato's was open.\nStreets of NY Pizza was mediocre. Nothing like NY Pizza but better than Pizza Hut (I stay away from major chains).\nI was disappointed.\nOrdered my pizza to go, the server at the bar was only 18 and talking about all her \"personal\" boyfriend business with another customer.\nFelt like it was very unprofessional, but then again--she was only 18.\n\nIt was $2 per topping. My pizza was over $20. I think it was overpriced for the quality.\nI probably would have been better off waiting until Tuesday to visit Spinato's (which TRULY is good pizza) or went to the Groceries and bought a Digiorno pizza.", "business_id": "JN2qXIuDXnV2d8WnSqd28A", "stars": 2, "date": "2013-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "9b5TY9v0-RibDNYUDqvDmA", "review_id": "F2D8vOta7Om5Qi6j7Lw5pw", "text": "Excellent place for food. I've only been here twice but the food is so tasty. I really love the atmosphere of it, especially on a Saturday or Sunday brunch time. 4 out of 5 simply because they're NEVER OPEN!", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2008-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zing3W2AVxcHwmBHid-Fcg", "review_id": "klYpyXnGm4TmzZ6z8OQBfg", "text": "If you're looking for a higher than average priced sandwich that comes with more arugula than tuna, come here. I'm guessing that the 8$ I paid for the sandwich is more for covering the hip little piece of chocolate, the napkin and the overall \"look\" of the restaurant than it is for the sandwich. \n\nIs this an 8$ sandwich? No. I'd say more of a 6.50 w/ tax. Some points:\n\n- Yes, the tuna is tasty. Is it AMAZING, or heaven, or any other word used before in the other reviews to signify that this HAS to be the GREATEST tuna ever? No. \n- Bread is really good. I'll give credit where it's due. \n- Way too much arugula on the sandwich. Seriously, I opened it up and had to go looking for the tuna. Don't think I didn't catch that the tuna is all in the middle so it looks like there is a lot but really there isn't. \n\nI'm sure that tons and tons of people love this place because it's slightly better than most places in Phoenix. That's the thing about beating the competition. You don't have to be mind-blowingly amazing. You just have to try 5% harder than the rest. \n\nThis is 5% more of an effort, and it shows, but let's not pretend that Pane Bianco is the next greatest thing ever even if some of the other reviewers will have you believe it. \n\nI'll give it one more try and if I'm not satisfied with their mozzarella sandwich, I most likely will not go back. I didn't even finish the sandwich I just bought which makes me mad because I really was looking forward to it. Maybe I'm not a foodie or I don't appreciate subtle flavors or whatever, but I was not happy with this sandwich.\n\n+ 1 for the chocolate, -2 for the overabundance of arugula and not enough tuna, +1 for the bread, + 1 for the fast service.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 3, "date": "2010-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p4w1SWmsIa5uwDZX7pkvxA", "review_id": "caa2vjptyH8Nb_SKBYEhlA", "text": "Great place to for for lunch. The sandwiches were delicious, we had the mozzarella with tomato and basil one as well as Sopresetta. There was plenty of seating arrangements outside but i'm imagining during rush time there won't be a whole lot left. \nGreat atmosphere and had lots of parking too.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2011-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PpmrxAfusZme01pm6WHGkw", "review_id": "-zvNsZQ9GYxtKJ-5bEOE2A", "text": "I dream about Pane Bianco's rustic loaves. \n\nOn a weekend trip to Arizona I stumbled upon this joint. I bought a loaf of bread and gobbled it down in minutes. The next day I returned for another loaf. I couldn't get enough.\n\nThe bread: perfectly salty, with a crunchy crust, and fluffy crumb. \n\nI am now hunting for a comparable loaf in my hometown, Los Angeles.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2013-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y8KQR51RTTdVvUa3tL4GjA", "review_id": "60QApVKAx2OV3WpaO2zjSQ", "text": "After my same-sex date and I sat down at the bar, it took more than 10 minutes (I was watching the clock) before the waiter first addressed us and only AFTER serving an opposite-sex couple who had sat down next to us FIVE minutes later.  I was very disappointed that we weren't served in the order in which we arrived.  We had gone to Pizzera Bianco the previous weekend and thoroughly enjoyed every aspect of the dining experience.  So, we had similarly high expectations for the Pane Bianco cafe.  We were disappointed.  If we weren't starving, we would've gone elsewhere.  We're not entirely sure that the unsatisfactory service was the result of our sexual orientation, but it was very suspicious.  The food was great, however, but we are certain that we will think twice before going to any more of the Bianco's restaurants.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 2, "date": "2014-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4RAqqzn1aRKln5bfQ-pomg", "review_id": "Z-yv7yYf5qt9w4ea-A6XLQ", "text": "solid good food, little on the pricey end for what it is", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2015-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HvTcoZA6ZuWzgRBO6PVAbQ", "review_id": "PQrDDkFqny2y3mcnKACdig", "text": "Awesome restaurant! Lots of choices on the menu. It takes at least 10 minutes to read through all of it. I recommend the thin crust pizza. It is to die for. Lots of options to choose from no matter what you are craving. Outdoor seating is nice as well.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 5, "date": "2010-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4VaskLw9ByZSJhRnC4mwJg", "review_id": "vyzdMARpHGvCnCd2rB_XQA", "text": "I am from California and all I got to say is this place is the bomb. Garlic bread is awesome and so was the cheese stuffed pizza! I have never had a pizza with so much cheese!", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 5, "date": "2012-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Gkw5Gld5XM2juMRRuu1e-Q", "review_id": "Rf11U5Hd1HmgXshSV8RWmA", "text": "I've left a review before saying that I love this place and they have great service!  Boy did my waiter prove me wrong today!! We had the worst service ever! He was rude and never came to ask how we were doing or if we needed anything! He kept passing by but would never come to our table. I was so disappointed!", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 1, "date": "2013-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d8pL3pmdksQGPrijdYCEgw", "review_id": "hAidlOX_wZyjHNTEFWDLFA", "text": "Super impressed! Being from Chicago pizza has to be really good. This was such a delight! Great service! Awesome antipasti salad!", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 4, "date": "2015-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-yZJr73bAoPtlpHUL7JBzg", "review_id": "AJCgadBcF5J9JD9d1SvrVA", "text": "The Pizza Bianca with ricotta is worth 5 stars all by itself. I read some bad reviews by other Yelpers about this restaurant and I guess you must have gotten the wrong thing on the wrong day. I love this place.", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 5, "date": "2009-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "m7vtKWpZ9wdEQ95wJxrMrg", "review_id": "MlHY2ugvuMA1tExFdZV3DA", "text": "At last, a restaurant that serves delicious pasta that, upon request, can be made as a gluten-free option! My friend and fellow yelper John M. had a very good dining experience at this restaurant and invited me to have dinner there with him so I can try it out - and I'm glad he did. It's a cozy little bistro with its own parking area - a plus for this part of 7th Avenue. The staff is very friendly and service was quick.  My order, penne al greco (I chose the gluten-free option with brown rice penne), had feta, spinach, calamata olives, sun dried tomatoes, and zucchini; it can only be described as heavenly.  It was truly ambrosia, and I chose beer as my nectar. I'm looking forward to trying more dishes at this restaurant really soon!", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 4, "date": "2013-01-30", "type": "review"}
{"votes": {"funny": 1, "useful": 8, "cool": 4}, "user_id": "wuCszpVPMIMyOCualnZtaw", "review_id": "RydHTAH5dGohETPDg6kw0w", "text": "Even the name fails to covey what lies inside.\n\nPizza Heaven is the type of place you could drive by and never even notice however, that would be a mistake because Pizza Heaven Bistro  is a great place to grab Italian food at a reasonable  price.\n\nI have been to Pizza Heaven a few times and have never been disappointed. The menu includes a wide variety of pizzas along with a tasty selection of pasta entrée's.\n\nPizza Heaven Bistro is fairly small however, they have a robust take out business as well as a very busy dine in traffic.  The food and the service are always good. The atmosphere  feels a bit like home. What more could you asked for.  Good food,  good service,  great prices.", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 4, "date": "2015-01-12", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "a2Eczq8Hi0iN2cNFC7xRSw", "review_id": "9_bT9lmQOQ3gjgYxq_xdDw", "text": "HOORIBLE. you ask for something special on the order - the pizza cooked well done - and it doesn't happen. Worst thing is in got bread sticks that were coated in butter. What the world. I called the store and spoke to them answer on duty, Brain, and he acted as if this was a bother and didn't have time. \n\nGo across the street to the other pizza places.", "business_id": "BJLoCsSp2TkHeTv00fJTVQ", "stars": 1, "date": "2015-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "3gIfcQq5KxAegwCPXc83cQ", "review_id": "DW41QTqz4_XS2-iQnxjGsA", "text": "NYPD pizza is overall good pizza in Phoenix. I have been to several of the locations and they are fairly consistent. They have pizza by the slice, which I like, and you can get all kinds of toppings on your pizza for cheap -ish. I had a slice with garlic, basil, meatball, tomato, goat cheese, and something else I can't think of right this second....it was pretty delicious. The BF and I shared some spinach artichoke dip as well, which is always delicious and terrible for you. The service is somewhat inconsistent, sometimes it is fast and friendly and sometimes it is slow for no apparent reason. The last time I went it was the latter. Despite this, I would go back because the pizza is tasty and cheap.", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 4, "date": "2013-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dBvjLwFTI9VQCO_2uoKq4A", "review_id": "Y_YdBxnDMnGSofgEA9ZNdw", "text": "Excellent service... Michelle was awesome and very attentive... Wings were great and meaty, spicy but not umbearable. Pizza just the way i liked it.  Thanks for a very pleasant evening.", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 5, "date": "2015-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "T3OqI85mcQe8cBT0nEffsw", "review_id": "JUElkSrXPVzyY7WC_nWI7Q", "text": "I dont' think I've every had a bad experience at CPK.  My favorite is the Barbeque Chicken Salad.  There are alot of restaurants that try to duplicate this recipe but can never achieve it.  \nAlong from that, the Margarita Pizza is also delicious.  There are too many to choose from!", "business_id": "ut-kla-EA23nJOij_dcL0Q", "stars": 4, "date": "2011-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "fJGWSgGsvb6leJzOuE2O3Q", "review_id": "TW9zBpdSfH2kuL9cgxkK4A", "text": "There are a few things I LOVE about this place. It's very quaint, they serve you warm, buttery homemade croissants with jam when you sit down, plus at the end of your meal, you get a complimentary dessert - which is different every time and is always delish. It keeps me coming back!\n\nI've been here a few time for breakfast and lunch. I absolutely love their omelets - super fluffy! I've yet to find anything I love on their lunch menu, but nothing is bad either. \n\nNext time I go, I hope to go for dinner and try their pizza.\n\nI come here often with my boyfriend who loves the croissants and dessert too - but it's the perfect place for a lunch with your girlfriends.", "business_id": "oc0Wl6ktfMLb5VZ2Uz6M2A", "stars": 4, "date": "2012-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "yp90PduP1gD7kgCLWuQg4w", "review_id": "1OdtBCqFuyNgJ2dA_nEo8A", "text": "I will give S.o.S. a 4 star rating for now for two reasons. I have only tried two items from their menu. The pizza and the cheese calzone. Definitely a solid pizza and an awesome calzone. The only downside is that it is a little bit small and fills up quick. It's not a problem if you're doing carry out but if you're on your lunch break and want to sit down and enjoy your meal it can be difficult at times. They have great lunch specials and all the typical dishes that you will find at a basic Italian joint. Although I can't say for sure, if they make their dishes like their pizzas and zone's, I'm willing to bet they will be pretty solid. I guess I will have to go back pretty soon and try on for myself!", "business_id": "j0Uc-GuOe-x9_N_IK1KPpA", "stars": 4, "date": "2010-12-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "KiNy4wkkQnq4LPm__hNl9g", "review_id": "eDfRtlkZngg48hCkYEPfAg", "text": "Ok. So let's start with the fact that I have been ordering from this place for at least 3 years. And I order in spurts cuz sometimes I'm lazy and pizza delivery is easy. Anyways, in the past 6 months I have had nothing but issues with this place. From the pizza being cold, to it being 45min late or to tonight's issue of never being delivered. Seriously? Now, I could have understood if there was an issue, but I called once it was 30 min late and they said oh it's there just for me to call another 10 min later to be told a story of how the guy couldn't get to my apt but 1st I was told they went to the wrong address, then they tried calling me 30 min before when the pizza was supposed to be delivered but my phone never rang. If you're going to BS me at least keep your story straight... don't bother with this place. I know I'm done.", "business_id": "jHte0SjUldZeDDZ5py0ZhA", "stars": 1, "date": "2015-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "o8J-ergbGYjrUy85I_rxzw", "review_id": "9zf9PQ9LfwgHp2GPVOTXxg", "text": "I've lived within walking distance for over a year and just had the chance to try it when I was treated to an early lunch last Saturday via madre. \nTwo big, thin slices of a cheese pizza and an excellent cannoli for under $6 can't be beat. Mom got her slices with a generous portion of mushrooms for an extra fee and a cannoli for herself. Add in a soda and totaled at just under $12 for a filling, yummy lunch.\nMust remember this place next time I get pizza and support local business instead of Papa John's!", "business_id": "GvwDppcJLm9lso9iS2hSIw", "stars": 3, "date": "2013-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "QiR2X306Yzd9fuJdKDhkGg", "review_id": "wjhnoRoMpKPIrvju-12v6w", "text": "Lately I find my tastes changing. These changes ambush me without warning: not long ago I stopped putting Splenda in my tea - cold turkey. I started liking pastrami instead of corned beef. I stopped watching the news on TV. Is this a function of aging? I don't know.\n\nOne of the more dramatic changes has been my growing appreciation of the overall \"character\" of a restaurant. I find myself much more willing to overlook small gaffes in the food preparation if the staff is friendly and knowledgeable, or if the ambience is cheerful and interesting in some way. It doesn't have to be fancy - but it can't be gloomy and boring.\n\nThis was brought home to me today at lunch. Our friend Sue picked a place I had never been to - Spinato's Pizza. It's a family owned and run local chain with four locations. We went to the one at Bell and 16th Street. Sue brought along her friend/employer Lee. It happens that Lee's grandson works in Spinato's kitchen. He always makes it a point to arrive 35 minutes before his shift begins so he can take advantage of employee dinner and he appreciates being treated like family. The place is cute - decorated in red, green and white. There are striped awnings above the booths, and trellises with vines. The chairs are white with green (or red) seats, and the table tops are white with the Spinato logo in the corners. The patio has tables with red-checked cloths. We were warmly greeted , and our server arrived promptly to offer drinks.\n\nKen and I ordered a large Spicy Italian pie ($19.50) with added ricotta. We also got a salad ($3.99). Lee requested garlic bread ($3.99, $4.79 with cheese), and a small spinach calzone, one of the house specialties ($9). Sue got spinach too, but in the form of a \"lil\" (smaller than small) pizza ($7.50). The salads arrived first, notable mostly for their large size. While the ingredients were fresh, there was nothing exciting there. The olive oil and balsamic vinegar served with them were of good quality. The garlic bread, eight pieces in the order, was outstanding - lots and lots of fresh garlic and a generous amount of butter. You have to make sure that everyone you'll be talking to in the next few hours has eaten some too. The staff checked in frequently to ask if we were happy. The pizzas were served on a wire rack, a great idea since the thin crust remains nice and crisp. Instead of slices, our pie was cut into many small squares. I found that for some reason this caused me to eat less. The pizza wasn't loaded down with sauce, and it had plenty of toppings. I tasted Sue's spinach pie and it was really good. The spinach is marinated before being put on the pizza, and there's tons of fresh garlic. Lee's calzone was quite large - he took half of it home.\n\nThe menu isn't extensive. Besides the pizzas (10 varieties, plus design your own)  and calzone (there's a spaghetti and meatball one) there are two pastas and five sandwiches. We didn't inquire about dessert. The story behind Spinato's is told on the back of the menu. The family was worried that when they left Chicago for Phoenix, back in the \"70's, they wouldn't be able to find good pizza. What choice did they have but to open their own pizza parlor?! As the family grew so did the number of parlors. While the prices aren't low, you can go to lunchclub.com and get a 25% off the entire bill coupon. Aren't coupons great!!\n\nI have to say that if I was doing a blind taste-test between Stumpy's pizza (see the archives) and Spinato's, I'd probably give the nod to Stumpy's. But if you add in those other factors which have become important to me, as a dining destination Spinato's wins. It's also won awards from Phoenix New Times, the Scottsdale Culinary Festival and City Search.", "business_id": "YldXB1hRpnE1CWLF3mvgpQ", "stars": 4, "date": "2010-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YZAMEqMJMDbGNAtLpfIB4A", "review_id": "DqH9idXIJwdTL9apsz4arg", "text": "This is a terrible place to try to take a large group.  The food is mediocre at best.  But they run the place poorly.\n\nWe called ahead to see if they could seat a party of 8.  They told us that they could not take our name over the phone, instead we had to show up to put our names in.  My wife went ahead and reserved the table.  She was told it would be 45 minutes.  She came home and we began getting the kids ready.  We showed up 15 minutes before we were told, but they had already given the table away.  We were told that it would be another half hour before we could be seated.  \n\nUnfortunately, their waiting area is very packed and does not hold 8 comfortably.   We left, I will never go back.  It should not be a hassle to take your family out to eat.  The main reason for eating out is to avoid hassle.  Spinato's does a good job of making life difficult.", "business_id": "YldXB1hRpnE1CWLF3mvgpQ", "stars": 1, "date": "2012-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BkxVH70gSJynqO2xxtrqmQ", "review_id": "bBs_X1r__HAm6ht7JT6twg", "text": "I ordered a pizza and salad for delivery from GrubHub. While my delivery showed up on time, my order was wrong. The pizza was missing 2 of the toppings I was charged for and was under-cooked. Additionally my salad came with the wrong dressing. The experience was disappointing. It's the small things that make a difference and Streets of New York dropped the ball tonight.", "business_id": "hIe65VALe8rxseYECVj08w", "stars": 2, "date": "2015-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "885Hnyynyzfi_HrGfCOitw", "review_id": "69cLO_xIKwvyXEzgI9t9sw", "text": "We really love your pizza.  As NC Phoenix residents, you stole our business from Raffaelles.  But your order takers can never hear, and I have to yell into the phone.  That's fine I guess, but tonight, when the order was incorrect, I got the \"sassiest\" girl on the phone I think I've ever had, who explained that I had repeated my order to her, and, furthermore, I got what I ordered.  Unless she has a beehive wig and is chewing a big wad of gum, I am not interested in her perspective.  Great delivered pizza.  Wrong order.  Guest service from 17 year olds who don't give a crap, at least this time.  You can do better.", "business_id": "kxDGexkbP30fBvxVI0CzFQ", "stars": 3, "date": "2014-12-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S_KBUw3Qqj88MbGtE-hcEA", "review_id": "ISgyNc6w9htLKuqfNxf9-A", "text": "Love it here! The staff is always friendly and accommodating. I like it that they remember their repeat customers and we are repeats because of the excellent food and service they provide. Thank you!", "business_id": "V3lQtk1LgwAEcF9j-BzchA", "stars": 5, "date": "2014-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rMkQzwPkMVUnDzsvLJ3h8g", "review_id": "wBGUuw7C5_aSSWTXXd5D_g", "text": "I don't eat here, normally, but i was in the mood for so buffalo wings. I stopped to get two different kinds of wings. I wanted honey bbq and mild wings. This was  Disappointing. I realize they offer a gluten free pizza, but from what i understand its from Gluten Creations and i really don't like that crust, so that is out. \nThe two stars was for the customer service. They gave me a drink and offered free bread sticks while i waited. Thought that was nice. \nAlthough they were really friendly here, i can't see why we needed to make a second attempt.\n\n\nDear Rick P. \nI didn't eat the breadsticks because of my allergies, did have some water while I waited. \nI wasn't planning on getting a pizza that night, just the wings, but I was told previously that your crust was gluten creations, my mistake. \nThe 2 stars are for the disappointing wings. \nThey were really bad.  And your third comment, \"we, as in me and my family\" don't feel we need to try Streets of New York", "business_id": "rGHktXbee4CErLsMrPqbrA", "stars": 2, "date": "2015-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Pdwec6sh7VRUGqI-g4OKfQ", "review_id": "56MX8hSNZZIsnt7HkgSr8Q", "text": "I was skeptical about \"Phoenix Pizza\" after growing up with NYC pizza. However, Spinato's didn't disappoint! We had the spinach/garlic/tomato (their house special) and it was delicious. Different for sure than a typical NYC pizza, but oh so good. If you are in Phoenix definitely try it out! Oh, and the wait staff was super friendly and the beer selection great!", "business_id": "pF7uRzygyZsltbmVpjIyvw", "stars": 5, "date": "2011-01-16", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "PfLQZx6wQY8NVas2W0Dh2Q", "review_id": "ATlUBwFoC3_YKG2QrEC17Q", "text": "I am from Chicago, and Spinatos is by far the best pizza in az.  Just like south side Chicago pizza, thin crust.  Amazing sauce like no other.  Delivery takes a bit but it is well worth the wait!", "business_id": "pF7uRzygyZsltbmVpjIyvw", "stars": 5, "date": "2014-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "jhFs50aXeqCdWw0SQD_MZg", "review_id": "_mme6OBZsbWGz_qN079WkA", "text": "Best pizza I've had IN ARIZONA. PERIOD. HANDS DOWN.\n\nAs a girl born & raised in the Midwest, I'm accustomed to good pizza....good Chicago-style pizza that is: Hearty sauce and thick crust. So imagine my dismay upon relocating to AZ & being inundated with piddly thin crust pizza everywhere (like having pizza toppings on a Saltine cracker IMO) with weak sauce.\n\nLuckily that's not the case with Spinatos! The Sicilian style pizza is exquisite. The crust is thick, the sauce is robust & sweet, and the cheese is pure perfection. They add spices on top and it really enhances the flavor!\n\nAnytime I venture out & try a different pizza place I wind up disappointed & compare it (unfavorably) to Spinatos. Well, I'm DONE trying new/different pizza joints. Screw variety, Spinatos is the spice of life!", "business_id": "pF7uRzygyZsltbmVpjIyvw", "stars": 5, "date": "2015-02-11", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "kDJ9PRlYugp5RIa9ontPZg", "review_id": "bWt4_TYw3pwSubX5tdrikQ", "text": "Five stars for their new happy hour menu, which they call their \"economic stimulus package.\" \n\n4:00-6:00pm and 9:00pm-close: Domestic drafts are 75 cents. Pitchers? $2.99. Small pitchers are somewhere in between. \n\nI'm really, really easy to please.", "business_id": "lf42gtgq_2_jPvjfp_K1nQ", "stars": 5, "date": "2008-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "h2rd2NwJARVn37qRAKRxYw", "review_id": "wpVWkC7Gl1Zwo8w5XWDEvQ", "text": "I wish this place was in L.A.  Every trip to Phoenix I come here.  The happy hour beer prices are mind boggling... $6 for a pitcher of Blue Moon?  Count me in!  Wings are A+ and pizza is B+ and prices are dirt cheap!  Oh and everyone is super friendly and the service is very good. Looooove this place.  This is the sort of down home awesomeness that I don't think even exists in Los Angeles.", "business_id": "lf42gtgq_2_jPvjfp_K1nQ", "stars": 5, "date": "2012-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eEA6PtfeiwqqFOI2PaSl1w", "review_id": "veBv9XoGd-Sdi18TswH3og", "text": "First visit tonight. We just had the Red Devil Combo pizza which was pepperoni sausage mushrooms onions and I think bell pepper. The ingredients were fresh but lacked flavor. I added salt Parmesan cheese and red chile flakes to it. Red chile flakes had absolutely no heat. \nWe had wings also. Half were NY mild and half were medium. Those were excellent. I wasn't crazy about the bread rolls. They did have a nice crust to them and were pretty hearty. My preference is just soft light rolls. \nThe service was excellent, attentive throughout our dinner. There was a huge private party in the back room but our servers never left us waiting for anything .\nI would like to go back for the wings and something different than pizza.", "business_id": "0gQrhOYWdO0XVZEKtOrvaA", "stars": 3, "date": "2012-02-29", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "GIvmQUO2n0GcJSFt2KZFEw", "review_id": "H61D6mh4oMw_MJ53aJy3ag", "text": "We were invited to a party here this weekend and....\n\nThe employees don't care about their job.  The food is disgusting, even down to the watered down soda!  \n\nI asked for a table to be cleaned and the employee just smeared it around, I ended up cleaning it up.\n\nHold a party there and Chuck E. Cheese is lackluster and the employees can't even fake a good time for the kiddos!  The tables are jammed so close together that when kids are sitting back to back, another child can't even get through.  I saw multiple childeren trying to squeeze their way out and ended up falling and throwing their tokens everywhere... this included my own child.  \n\nThe \"games\" eat your tokens and good luck finding an employee to get the token back!\n\nThen to top it all off, it is not the cleanliest place and  I got a stomach bug from there and am still miserable 2 days later!\n\nKids love it, but we need to be their protectors and keep them away from places like this. \n\nSpare yourself, find another venue for a party!", "business_id": "HghAgkxoEpUNZNQbAY485A", "stars": 1, "date": "2013-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BzNYrMmsuliaJfvwRMxwhw", "review_id": "fkCniBqabfXQM9ssoMGJZw", "text": "Awesome pizza has the pan deluxe it was amazing will def be coming back!  The aptmosphere  is great small private the staff is so friendly!  The wings are baked not fried, I was scared at first because I love wings but they hit the nail right on the head! Hats off to fat so's!  We will be back", "business_id": "u5o4H8h0sIVhqa8Lcusi5g", "stars": 5, "date": "2014-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HZ3ItZ23xZHqjUjRIdPi7Q", "review_id": "AbF0Px9uY9N8l2JI5z5c0Q", "text": "I complained recently that there were no local takeout pizza places nearby, to which several friends responded that I was nuts. \"Have you tried Gino's?!?!\" they asked..... I promised that I would get there ASAP and finally did so tonight. I had my in-laws over and we all agreed that it was generally very good. I don't know that I'm a fan of the crust, but there's not much of it and I am a fan of that. Plus, I was impressed to find tasty fresh red onions on our veggie pizza (weird that this simple ingredient is remarkable, but it was), and overall good toppings with slightly above average sauce. I vow to immediately stop ordering from the chain place around the corner unless I'm really desperate -- all future business goes to Gino's when I'm in the neighborhood and looking for takeout. And there's also a decent little area for dining in, including arcade, but who knows when we'll ever make the time to stay. Maybe if there's ever a band on the stage?", "business_id": "NTgVdfRLbU0aKJH_9h3VCw", "stars": 4, "date": "2013-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "T3rEFiOVLUy4w8d92SsWKQ", "review_id": "4E7gF8Pceq32MsIl2a3zvw", "text": "Awesome food, awesome staff, and awesome fun.\nKeep up the great service.", "business_id": "RYZ08XAToBaN-bS5HHVEhQ", "stars": 5, "date": "2014-01-22", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "lF1pxEjXyGBEKpvwzhyRPg", "review_id": "LxS4TjQxR8aSP_EPaO1B8w", "text": "This gem has been at this location in Ahwatukee for 11 years (next to Va  Bene). I can't believe I only just now found it! Being Italian, I'm pretty picky about my Italian food and this place is so good and is reasonably priced! At the outset though, I had my doubts because their bread is a really poor excuse for Italian bread. It's soft and not anything like the crusty Italian bread I'm used to. Normally this does not bode well for the quality of the food. However...\n\nLasagna and eggplant parm were very good (don't think I'll ever find any as good as mama's or my own). Salad with house Italian dressing was quite good (no wilted lettuce as another reviewer experienced). Trio pizza (ricotta, tomato, basil) and clam pizza were excellent! Never had clam pizza before. It was garlicky and wonderful. They also made me a red clam sauce version. It was good too, but not as garlicky as the white. Also had pasta with broccoli and sausage... Excellent. Only thing is that the clam pizza and pasta were a bit oily for my liking. Next time I'll ask them to cut back on the oil.\n\nThey make their own Sangria and oh my! Love it!! Nice and fruity, not too sweet and not too dry. Finally, I had the cannoli--hands down the best cannoli I've had in a LONG time.  \n\nThe other thing I love about this place is that it's family-owned and you can tell they love what they do. All were so warm and friendly. I went for my birthday dinner with my husband and they really made it special. But get this... they didn't even know it was my birthday! I had finished my sangria and thinking about how I'd love another when the waiter came over and asked if I wanted what was left in the carafe, which turned out to be a full glass. Then when he brought the check he served us a cannoli on the house! When I thanked my hubby for telling them it was my bday, he said he hadn't! \n\nDefinitely returning often... Especially for the special pricing on their pasta dishes on Mondays and Tuesdays!", "business_id": "hgb1RihLYRSpFBjBhn8rZw", "stars": 5, "date": "2012-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5nwC7miF3OCghvfWUSyzHQ", "review_id": "TWURPG2iKlTeu3w0m3Vfrg", "text": "Pizza might be good if it was hot. I have tried to eat this place on numerous occasions and the pizza is never heated through. Real bummer as I think it may be good if heated properly.", "business_id": "kvrgvuxO6A6i9fXYaUKqcg", "stars": 2, "date": "2015-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "I5N3Qj5X2ylSB7e817_X0g", "review_id": "aTxHlziRgG5yOIhWaeXDMQ", "text": "The best pizza I've had in the Valley since moving back from NY 8 years ago.", "business_id": "m3O2EFVs3eo8s40MGGzmsA", "stars": 5, "date": "2013-02-18", "type": "review"}
