{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "T_wjLgPOPXry7Bea4MzoVQ", "review_id": "Ba193vShA-AKcfLYvaEOnA", "text": "Average run of the mill store.  Associates are young teens and they really don't know where anything is.  Luckily I am able to get around to find everything.  Found my puppy treats and moved on.", "business_id": "yXuao0pFz1AxB21vJjDf5w", "stars": 2, "date": "2010-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I-jk9_xWCV3zfDqwrIJDSQ", "review_id": "BvtJqv4xK0kUDYal-6WI9g", "text": "The Cajun Pasta I ordered was just spicy enough to keep me sipping my Rock Bottom IPA. It may be a chain but I always get that microbrew restaurant feel when I'm here. They could upgrade the quality of the servers but I've never had a really bad experience with the service.", "business_id": "McikHxxEqZ2X0joaRNKlaw", "stars": 4, "date": "2014-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "-DCSpG7OP7ATeQ6VrPGARw", "review_id": "RsHR3fI56sGV5GiCWCJztg", "text": "Came here from PGH for the first time.  This bakery is legit.  I bought some Rye bread and Italian 5 grain.  Delicious.  A strange snickerdoodle thing with pink frosting.  Delicious. Chocolate chip cookie dipped in chocolate, extra chewy and humongous.  Delicious.\n\nAnd a sweet old lady serving em up.\n\nThe best.\n\nDelicious.", "business_id": "hnHt6EinzC-IX6y3GSF7jw", "stars": 5, "date": "2013-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Gd_ot1jL-6mnmFIq6SJfeA", "review_id": "0OVO_qoVxqWlcodosbm2Kg", "text": "one of the best espresso bars i've been to.\n\n+1 for great espresso.  i had a shot of ethiopian espresso.  fantastic!  grabbed a costa rican pour-over on my way out ... perhaps one of the best cups of coffee i've ever had.\n\n+1 for baristas who pay great attention to detail\n\n+1 for great atmosphere.  the ceiling is tastefully ornate, and the decor is pleasing.  hearty wood furniture used throughout.\n\n+0 for having a location a bit far from downtown.\n\na favorite for locals and not-so-locals alike.\n\nhighly recommended!  i will return...", "business_id": "83_p9vIqOq1TUIf3_GD7bA", "stars": 5, "date": "2011-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E-VACKSQEpo_0KGkyu9GgQ", "review_id": "OuG5m_WY87b_rgd4haShUQ", "text": "This is the best little bakery in Pittsburgh!  My favorites include: key lime cake, biscuits, strata and their ham sandwiches!  The line is always out the door, but you won't be disappointed!", "business_id": "YMEtEsUDQKOYJOcE5Fx3gQ", "stars": 5, "date": "2015-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Hys6HzKi24j2809kI_7dKA", "review_id": "Nnf2bIWrUMHcSlGqD6RITw", "text": "I love Whole Foods!  I know that it's pricey and sometimes people scoff when they hear others say that there are certain things that one can only find at WF but it's TRUE!  I do try to do a lot of my shopping at Trader Joes and Market District, but the Market District on Centre Ave is almost comparable in price for the same products at WF and sometimes a little more expensive.  This WF is clean, well laid out, and the staff overall are helpful and friendly though I've run into some employees with attitude particularly at the checkouts, but overall it's a great store and you just have to know that not everything is organic (always read your labels) and that the parking lot will always be a nightmare.  Overall this is a great Whole Foods just avoid shopping here just before any major holiday because it's always madness!", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 4, "date": "2015-02-10", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "d9AfUK4A1xZikqhsc5k07w", "review_id": "KIDucche0LhpKA8W9HHBlg", "text": "The menu looks awesome and the dish concepts are good except everything that comes out is disappointingly bland. Thank god there were bottles of hot sauce and salt on the table. The best part of the meal was the peanut butter chocolate milk shake. The burger and \"spicy\" Cajun soup were very mediocre.", "business_id": "PzG0XmAmtXFs6Fdnubf41g", "stars": 2, "date": "2010-12-16", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "iurbZ56AKx-c47IFL8UsSg", "review_id": "8lnkg9qBcn3W_Y0cez-VsA", "text": "Andrew here said it best: \"...  food served by workers who mostly don't seem to notice they're working, and when they do, only respond snarkily.\"\n\nIt took me 40 minutes to get a sandwich here, and when I complained I didn't get an apology, just a snarky remark \"well you can see we have a small kitchen\"", "business_id": "PzG0XmAmtXFs6Fdnubf41g", "stars": 2, "date": "2013-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "J_q8jN623uew8ZzMChXBCA", "review_id": "WDIGwoVKXz8mQPgopDDxmg", "text": "I am a huge fan of Breadworks. They make high quality breads at reasonable prices. They are very consistently good and the bread is always delicious and fresh. Some favorites include the Walnut Raisin and the Sourdough.  A good shopping tip is to arrive 1/2 hour before closing, and everything in the store is half off.", "business_id": "Z7HNl4Gz00cA0_wt0S-vSw", "stars": 5, "date": "2011-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "T_wjLgPOPXry7Bea4MzoVQ", "review_id": "kvavM6JceU_dXTDbvMc5Xg", "text": "Great small grocer!\n\nGiant Eagle offers a lot of things, but they don't offer me everything I am looking for when I go shopping.  Kuhn's, on the other hand, offers all of those little idiosyncrasies and nuances that I look for that I cannot find anywhere else.  The biggest thing for me is the fact that they carry Boar's Head brand luncheon meats.  I really don't know how anyone eats any other brand of luncheon meat since they all just taste so stale in comparison.  \n\nI can tell that a higher number of Italian-American folk patronize this store as well.  Why? The pasta selection is awesome.  I despise the typical noodles carried everywhere else; but here I can find the noodles that I have grown to love.  \n\nGetting beyond the reasons above, I do enjoy the store as a whole and the fact that I can find what I am looking for.  I will definitely be returning; I just have to make certain to be careful of the parking situation since this particular store's parking lot layout is prone to jamming.  In this case, it is better to park near PNC and walk.", "business_id": "9NL2GL4jSPVj9SKijH5PqA", "stars": 5, "date": "2011-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cZAZPOnHHFziDtRH-3cBsQ", "review_id": "-hn9hmdoBRegX6Fh0jukow", "text": "Received bad service today.  Got the wrong chase for my sandwich,  Got decaf tea instead of regular tea even though he was told black tea.  Usually you have to ask for decaf. \nHowever, lots of seats since the place was empty.  We left Einstein's because it was  crowded.\nThey Missed an opportunity to impress a new customer.  Guess it's back to Einstein's.", "business_id": "uwiD9jxs09xxXG0by_xKuA", "stars": 2, "date": "2014-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yfRrC6MhxpIJ4-xMcrmk5Q", "review_id": "W25y0XTm1ymtJ475R8kM2A", "text": "Never had food from their taco stand (but it looks super delish), but I have been to the grocery store a few times now, and I dig it.\n\nOne of the major bummers about moving from Chicago to Pittsburgh was the total lack of a significant Latino population.  From Wikipedia: Latinos make up about 25% of the Chi-town population....about 2% of the Pittsburgh population.  Wah wah waaaaaah (sad trombone.  sad mariachi band?)\n\nSo the lack of authentic Latino ingredients has been a huge bummer.  Where's a girl supposed to get a taco around here?  This is why I was so happy to find Reyna.  In my home kitchen, we tend to cook lots of Asian and Indian food, but when we DO go the Latin America route, we want to do it right.  Homemade style.  So a place with fresh tortillas, Mexican cheeses, bulk dried peppers, Jumex (boyfriend is obsessed with these canned juices/nectars), and other tasty things is a much-needed addition to the Strip, with its diverse culinary offerings.\n\nI will always return here for Latin American ingredients - partially because Reyna is great, but also because - where else could you get that around here?  I do wish Reyna was bigger, but I shouldn't complain.", "business_id": "buVALudg30kgkDusqB3yJw", "stars": 4, "date": "2010-12-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KFRC_GdFH-bXb6brxd7WvQ", "review_id": "ZdKCTAomO0x_4vkemzLyMw", "text": "Reyna has the best sit-down Mexican in the city. I really enjoy the margaritas, which as quite generously portioned. I always try one of the fruit flavors, and ask for them \"less sweet.\" The bar staff is always accommodating to my request. The restaurant is pretty new, and the environment is nice. I love the Mexican pine tables and chairs, and the art is always a great conversation starter. The chip and salsa sample lets you try the best of the salsas from Reyna's. I normally go for the Chile Rellenos, but everything I had tried is well cooked, flavorful, and interesting. I have taken many guests here, and definitely recommend.", "business_id": "buVALudg30kgkDusqB3yJw", "stars": 5, "date": "2015-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gwnVSev8aNLvMArs3WTfFw", "review_id": "pnc_u98CuzNSTERMS_JY7g", "text": "Decent food but a little overpriced. They will make you a salad (you can choose 3 items) and a meat for $7.49.  You get a bread stick too. You can also get overpriced soup or a sandwich.  Lots of choices.  The cookies and scones and pastries are on the high end; similar to Panera.  Average tasting at best.  I wouldn't call this bakery fresh.  They are all over Pittsburgh.", "business_id": "shrMOQmX_SX-KualwYoAzA", "stars": 3, "date": "2012-12-02", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 0}, "user_id": "qDPHTcJ6VC2-O-aX6tjvkw", "review_id": "bGvhrLksjX6IeEBoRYNFLg", "text": "The spruced man that stands by the main register is not well mannered. I was answered about a product I was looking for with a \"AH? I DON'T KNOW! MAYBE THERE!\" brushed me off and pointed to the isle the product I wanted was at. Don't worry, I found it after looking for it for 10 minutes.\n\nAside from this impertinent man, the store seems to have a variety of products. They're always busy and their shelfs are stocked frequently. \n\nI was also told their tofu is fresh, so much so that a coworker of mine eats it raw. \n\nUnfortunately it's hard to find some products. Most packaging are in Asian writing and I don't understand it.", "business_id": "lVB0HB2PxC9OTtMcz0wagA", "stars": 3, "date": "2013-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "G-Y7xyXC_jCYJJvEgKucFg", "review_id": "Po6aCHvlYwEqAabFcahHRQ", "text": "I stopped by Mon Aimee because they carry a chocolate hazelnut wafer (hanuta) that myself and a few friends enjoy. I decided to take a quick snap chat video of their other varieties to show some out of towners what they were missing out on. As soon as I opened the app a woman (very rudely) stopped me and insisted I put my phone away or leave. I understand they don't want any one to copy their style. However that is not what Pittsburgh is about. There is no room for 'snobs' like that in our city. This is just my experience. I have heard others say they were not very friendly which is very unfortunate because Pittsburgh is so welcoming. Grandpa Joe's and Sinful Sweets are great alternatives.", "business_id": "gFT2yXDXJ1qfuGOSfSU5Bw", "stars": 1, "date": "2015-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "74CAfWVFOmfdGKgpBShYWg", "review_id": "QTVVBft47kuf-oo-jtTt9Q", "text": "Their olive bar is awesome. They also have cheese and dip samples. I really like their feta humus.", "business_id": "tyXvO1G2qK3MUfaap30auw", "stars": 5, "date": "2015-02-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "l8ZjFuNLi56prFvGiYyQSQ", "review_id": "PEyvBM8g4WTjbKx4r5cl5g", "text": "A required stop on every visit to the Strip. Best selection of Pasta, cheeses and meats. Try the Antipasto salad at the Olive bar. It's the best!", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2013-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NmJ0tN6f61sS7mwg7HM0VQ", "review_id": "6_p-uySGaZCL_F1FhSpZCQ", "text": "This is the only place we get our coffee and tea. They have a huge selection, the staff are always helpful and they have a lot of specialty foods. Prices on coffee/espresso/tea makers are very reasonable and they have a deli with coffee, smoothies and more. There is something for everyone at this cute, adorable shop and it is packed full of goodies from floor to ceiling. Def should be on your list of places to check out when you visit the Strip District.", "business_id": "TASUnYvk_nvTUyKtroCJSA", "stars": 5, "date": "2015-12-13", "type": "review"}
{"votes": {"funny": 8, "useful": 14, "cool": 11}, "user_id": "9OZH1Ecw-qUkCW5MS0NefA", "review_id": "C9rGJ7zcpsvB2_2tKco-DA", "text": "I've now been to Donatelli's multiple times, and have sampled several of their products, so I feel that I can review it comprehensively. Overall, I've been pleased with most of their products, the prices, and the customer service and atmosphere, hence the 4-star rating.\n\nAs others have mentioned, the space is rather cramped and chaotic, esp. during peak business hours (e.g., Sat. around noon, when I last stopped in).  The layout when you walk in is a bit strange, to the point that I inadvertently ended up behind the counter on my first visit.  (Stay to the left and you won't have this problem.)  The most crowded section of the store is the deli counter, where you can obtain not only meats and cheeses, but a variety of made-to-order sandwiches and sides.  If you visit the deli counter during peak hours and are feeling indecisive, take a number right away--trust me, you'll have plenty of time to decide what to get as others are being helped.\n\nAs for the grocery products, there is enough variety that you can find several versions of most Italian ingredients you'll need here, as well as other general grocery items like milk and ice cream. In general, prices are very reasonable-- generally less expensive than Groceria Italiana.  Unlike Groceria Italiana, a good portion of the product consists of commercially-available brands--albeit many that you wouldn't encounter in a mainstream grocery store like Giant Eagle. Having said that, the main attraction for me is the made-in-house items, such as the fresh pasta, the sauces, and the biscotti, as well as the hot meals.\n\nIn the interest of brevity, here is a list of products I've bought at Donatelli's, followed by price, recommendation, and comments:\n\nGrandma's plain sauce ($3.65): Recommended--Better flavor and seasoning than commercial jarred sauces (e.g., Ragu, etc.)  Also, I like that Donatelli's makes meatless red sauce, unlike Groceria Italiana, since I don't eat beef.\n\nLobster ravioli ($9.99): Not recommended--After following boiling directions (necessary to avoid curdling cream sauce via baking), pasta was good, but filling was mushy.  Also, included imitation crabmeat, and I'm not a fan of imitation foods.  I'll be sticking to Groceria Italiana's handmade ravioli from now on.\n\nRicotta pie ($5.49): Recommended--Though this was my first time trying it, I was favorably impressed with the flavor and texture.\n\nBiscotti ($3.52): Recommended--I've only had the spumoni biscotti (a flavor I haven't seen elsewhere), but it tasted fresh and was good.\n\nItalian bread ($1.50): Recommended--Soft and fresh, and inexpensive\n\nHot food from deli counter: Recommended--I had the half pound fish sandwich ($2.49) and a half pound of the white cheddar bake ($2.99), and both were very good.  Notably, the roll was proportional to the fish, so the sandwich didn't fall apart, as is common at other PGH eateries serving fish sandwiches.\n\nDespite how hectic Donatelli's can be during peak hours, I've been impressed at the friendly service that I've received at the deli counter and checkout.  If there's one drawback, it's that waits at both counters are inevitable during these times.  Of course, if your schedule permits, this problem can be avoided by simply visiting at non-peak times.\n\nWhile Donatelli's may feel kind of cramped and may not seem as immaculately clean as some big box grocery stores (at least for the section the customer sees), this is part of its charm as a neighborhood ethnic grocery store.  I'll definitely continue stopping in for certain Italian grocery items, such as the plain sauce, biscotti, and bread, as well as for inexpensive, delicious hot lunch items.", "business_id": "KH6stvNdq_aV0HvKw8P5yA", "stars": 4, "date": "2015-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AbAhyubpyUFmsJwRC0LATg", "review_id": "Z10VUwNmCno6y0R8ogk5Qg", "text": "Bad coffee.  Good baked goods that are a bit overpriced.  Don't go here for coffee, get a milkshake instead.  Or buy your baked goods here and go down the street to Aldo for your coffee.", "business_id": "DJKpwLp4mISNDNDpNz67tw", "stars": 3, "date": "2009-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pMNcEMrgaAiT0zb7rw8YCw", "review_id": "NzTM1shT-14ueJ7n2s-Xbg", "text": "Don't come here from NYC looking for a good bagel and lox, stick w the ice cream.", "business_id": "LHyGQnuWR2q44bsrw1ZLAg", "stars": 2, "date": "2013-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Zs1j6H38V4GZUP4vpQoe2g", "review_id": "WkXk3nxOK4AKd46h-m4wmQ", "text": "I have three words for you:  burnt almond torte.  I'm not a huge fan of pastries, but this is tremendous.", "business_id": "yWVY1Bq19lDxu3BP7_96EQ", "stars": 5, "date": "2014-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "KHTgGwxzPq7yrkePwJjV8g", "review_id": "l3v_6FjUNRCugoqJJ1hmRA", "text": "I had afternoon tea here and I find the scones unique because of the fruit used in scones. Service was good as well and a fair selection of teas. I would def be back when I'm in Pittsburgh!", "business_id": "rUQfZOengMpXFkLvJrNJ3g", "stars": 4, "date": "2013-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "o9XGClSBzCsQxbcCzTPdnQ", "review_id": "XGYbB45VUyNB4RYEBKX2nA", "text": "I don't care for this Giant Eagle, and that is being kind. The only reason I ever go here is for a quick item or two. My ideas for grabbing something in a \"quick\" manner always end up being terrible because there is nothing quick about this place. The staff is generally unfriendly except for a few employees (2 or 3) who are always wonderful and helpful.\n\nNo one seems to enjoy working here at all, and there are always soooo many lines because there are never more than three to four aisles open at any given time, even on weekends.\n\nEverything is overpriced, except they will occasionally have deals on soda and greek yogurt.", "business_id": "Tfysaq2SdZAc5_TyPpuyLA", "stars": 2, "date": "2014-01-31", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 3}, "user_id": "FLxgiNF9rsiXR-zbEcWBRQ", "review_id": "59J74nmZKbH0z2R9_e0dYA", "text": "I really like this william sonoma.  the staff is very helpful and it always smell so yummy when you go by. \n\nwish i could buy everything in the store!!!", "business_id": "QlHQzegL2Ew3z5YgK0ZeOw", "stars": 4, "date": "2009-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "ybG5P8QlP5rA58yd7NRqDg", "review_id": "TUk9Pkie8THNWU5gbP8MUQ", "text": "Close by grocery store ... Open 24 hrs - but count on it ... If you have a need for something specific - there's a good chance they will be out of it or have discontinued carrying it ... This place is not dependable for the real groceries... Go to Harris Teeter or Trader Joes for that ... This is good for creamer or milk or eggs ... Maybe ...  Also watch the cashiers - famous for over charges and not giving credit for coupons even after they're mentioned to them ... Most definitely pay attention to your charges !", "business_id": "_yZbIA76UR0cIgoq0jM5zQ", "stars": 2, "date": "2014-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B3jmGTuI1b0kY5VBSHY8OQ", "review_id": "oGhMI_XfZ8_ePPxvYyqSBg", "text": "THE BEST place to get coffee in Charlotte!  Clay, Phoebe and the rest of the staff will do their best to make you welcome!", "business_id": "frnJyUd335JCPDjKHc75OA", "stars": 5, "date": "2011-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Ul93T_U5jDh1FIIpiiTxuw", "review_id": "UvlgL-AVLCL_DNGWYUOQeg", "text": "Despite the earlier review, this Smoothie King is actually located in the One Wachovia (now Wells Fargo) building, on the plaza level.  Since it is adjacent to the Childress Klien YMCA, I am often drawn here for a healthy post-workout shake.\n\nThe 'King is a chain, with several other locations throughout the area.  The menu is a standardized but plentiful list of fruit-based smoothies broken down by general category of what you might be looking for.  For example, if you are looking for a sweet splurge, try the Indulgence category.  Want something lighter?  Try the Trim Down category.  \n\nAlong with your mix of fruits and juices you can also add on any of an number of supplements or 'enhancers.'  All the usual suspects here- vitamins, caffeine, anti-oxidants, fiber-blend.  If this is your bag, you can pump up the nutritional value (and price) of your smoothie.  You can also ask to have any smoothie made \"skinny\" whereby they leave out the honey and/or turbinado.  I actually prefer this, as you can taste the actual fruit in the drinks and they are not so cloyingly sweet.  \n\nFor those a little more hard-core, they also offer smoothies with the powdered supplement packages such as MetRx meal replacements.  You have a choice among three different sizes and the prices go up as you go bigger and the hike is not a good deal till you get to the biggest monster, a 40 oz. but then what single person needs a 2.5 pound smoothie?\n\nBesides smoothies, the store also has a small bulk food set-up with snacks such as gummies, yogurt covered pretzels and a number of fruit and nut mixes.  Prices are by the ounce and can get a little pricey as there is no nearby scale to check your purchase till you get to the register.  They also sell of host of supplement bars and others snacks, many vegan or low carb.  \n\nAll preparation is quick and, unless there is a line, I am rarely in the store more than 5 minutes.  Nice and snappy, and the staff doesn't spend time trying to up-sell anything.  \n\nJust know that even the small size smoothie is going to run you about $4.50.  At about $2,00 to step up to a medium.  Prices of other snacks are also a little higher than you might find elsewhere.  This tends to be the going rate, however, at other smoothie shops in the area.  Makes me want to grab my Vitamixer and set up shop somewhere, but such is the price for convenience I suppose.", "business_id": "5dn_3KLiTl2vVe8O91pJ6g", "stars": 4, "date": "2011-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Qe1l1ln6bf_pcWUUuLswFA", "review_id": "9yrdg74C_AlLtzc2gleOHA", "text": "They're open til 10pm on weekends which is nice.  Our movie at Phillips Place Stadium was sold out so we came in to grab a sandwich and easily killed an hour in the cafe area while waiting for the next showing.  On my next visit I'll browse the wine selection.  This is a great date spot with lots of hip young foot traffic.", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 4, "date": "2007-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V4VW69mBsRzfa3mLmyBqLQ", "review_id": "m1N9xL8n4Mqm8i0R6QhsYw", "text": "Yeah, all these locations are excellent.  The know their stuff.", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 5, "date": "2013-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fSmJ5hc1zygeo89Dnsp2nQ", "review_id": "TiCYBJgfPyUnVd7vTz1SVw", "text": "Offers the same great items the one on South Blvd does the only downside to this location is the lack of deli and smoothie/juice stand.", "business_id": "I3oqfVYgp9_xCMXnGUsmHg", "stars": 3, "date": "2012-02-27", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "skjHfMWG_AIrZNoH9_yBWw", "review_id": "glXPK-cl_yEgsUUFsTjc9g", "text": "This Caribou Coffee location was quite lovely. It had that warm, cozy cabin feel that all Caribou Coffee's offer. It is in a smaller shopping center and attached to a UPS store, which was a bit peculiar, but didn't take away from the ambiance. The cafe and seating area was a bit more cramped than some other locations, but there were plenty of people visiting, working and sipping on some delicious beverages. \n\nI always tend to order something a little more complicated at Caribou Coffee. Today I ordered the Campfire Mocha with dark chocolate, soy milk and three shots of espresso. I got it with half of the allotted chocolate and half of the syrup; I'm not a fan of sickeningly sweet coffee drinks. It had the perfect balance of marshmallowy goodness and that semi sweet chocolate flavor and the 3 shots made it just perfect. Thanks to the barista on bar for being a rockstar!\n\nThe three ladies working were all very polite, and gave me a chance to decide on my complex drink. The retail options for sale are so cute! I would have been happy with any of their mugs, sleeves, or ornaments. If I'm ever in the area, I will definitely stop by again.", "business_id": "H-w8OMEloBosW78_f0f7Hw", "stars": 4, "date": "2015-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nUQ2vgi-naBU6b9Yu2HYnQ", "review_id": "R04uI1brt8bOiEGuFlmiqw", "text": "The only reason I gave this Starbucks 2 stars as opposed to 1 is because they have a drivethru.\n\nI liked this Starbucks before they moved to the new location.  The old location would usually be moderately busy. But not like it is now.  Every time I visit this Starbucks, it is completely slammed.  Being busy isn't the problem, it's the size of the interior.  This Starbucks has people squished in like sardines....they have huge tables that almost always have one person sitting at them with their laptop and schoolbooks spread out.  I can never find a seat and no one EVER LEAVES.  I think they need to have a time limit for people who sit there all day.\n\nThe employees all look stressed, I assume because this is the busiest Starbucks in Charlotte.  They are usually friendly though.  \n\nI would avoid this Starbucks and hit the one on Mallard Creek or Davis Creek roads.", "business_id": "UdcvNApAUs7Z7NkFSFTl8w", "stars": 2, "date": "2014-02-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LgY5Z6aaiZu4AAXEDOnPDA", "review_id": "GluTxCzz0lWN_UxeuaSSSQ", "text": "This is how a grocery store ought to be.  Tremendous selection, friendly staff, clean store.  Lots of extras.  I hope when Publix opens in Lake Wylie, its comparable.\n\nNote to Harris Teeter Senior Management - You need to open a store over in Clover, SC.  There is a perfect piece of land available too - at the intersection of 274 and 49 (where they split) near the entrance to Bethelfields.", "business_id": "yP20Y-TVGZ2sUNGGLzJ5Fg", "stars": 5, "date": "2013-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2sklUYBnk7LxzM-11yPUPg", "review_id": "nmX7lMtrsWw_z6i6Nt5ltA", "text": "Next to Chick-Fil-A, Culver's is my fav fast food chain.  Rarely is a snowboarding trip complete without Culver's to top off the day.\n\nThe butter burgers hit the spot (though mine was heavy on the red onions; good thing those are easily removeable), and the fried cheese curds are to die for.  You don't find those floating around just anywhere.  But if there is anything you MUST get, it's a cup of the frozen custard.  Damn, that's good stuff.", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 5, "date": "2008-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4U224EJoQm0TtVLIx6KZwg", "review_id": "k7s6dyENZO5Ri2s7NHaEGg", "text": "I'm big on culture/sense of community and this place rocks! It's cash / check only and I was unprepared - an embarrassing moment until the woman behind me offered to pay and then the woman at the register did as well. That kind of culture you cannot overlook! \n\nThe coffee and food were well done! \n\nWhen I am in WI they will always have my support! \n\nCheers to all who helped build the culture of this coffee shop / restaurant!", "business_id": "ShEYKerTwb2LSORE5o_s7A", "stars": 5, "date": "2015-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "aYhKsAUQaaRGgdgcZC5XAw", "review_id": "Avv0Jd_0CpglgqDEoTJitw", "text": "Spent a Saturday driving around to the breweries in the area, and this was hands down my favorite.  The atmosphere during the tour was super casual, the bar inside was full of friendly bartenders/tour guides. (Bier Garten was closed as it was practically winter.) This was my favorite tour because the guides actually describe the process of making beer and tastings were handed out rather copiously.", "business_id": "Wn8NhS-L1ck6jbTjX88Kkg", "stars": 5, "date": "2009-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SSGzCtibsyfSDnz8ZXH2_A", "review_id": "BN611fWfAuJj1_5PSGCRbQ", "text": "Waitress gives you wrong food then says you ordered wrong. Cool. Thanks Perkins for the horrible over priced meal I didn't order. I got some weird dish with hash browns in my pancakes and scrambled eggs. I despise scrambled eggs (the army ruined them) and these looked just like army scrambled eggs. They didn't look fresh at all and I know I would never order them. \n\n\nUpdate::: she heard me telling my friend when we got the bills and walks back to tell me I'm wrong, that what she wrote down is right. Even though I have never ordered scrambled eggs once in my life and everything on the plate was wrong. \n\nI have never been treated so rudely by a server. I work in the industry so I get it. It can be a shitty job but if something is clearly wrong I fix it instead of being rude, condescending and mean.", "business_id": "yYIEKwgQUHJpySOcVdCAkg", "stars": 1, "date": "2015-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "4AGRXB5C588iitXZY-y3wQ", "review_id": "ls8kROr2g1khMuIrR0GZ9w", "text": "I want to love Jim's because John the owner is such a nice guy but I can only give it 3 stars. \n\nWe got a $20 for $10 coupon and heard great things about the 100 items for $100 deal. So, we splurged in order to fill up our freezer and went for it. \n\nFirst, I counted the number of items (joking at first) and noticed that we only got 89 items. Not a big deal but it essentially negated the discount / groupon we were using. \n\nSecond, almost everything was mislabeled! Cube steak was hamburger patties. Chicken breasts were chicken tenders. Beef hamburgers were bratwurst patties. Pork cutlets were sausage patties....etc. Again, not a huge deal but annoying when you plan ahead, thaw an item for meal and end up having to improvise in the end anyway (hamburger stir fry isn't bad, neither is a bratwurst cheeseburger).\n\nFinally, I am not sure it was an outstanding value. We ended up with about 70 hot dogs, assorted bratwurst and assorted bratwurst patties which are quite inexpensive. Of the remaining items, portions were quite small and anything expensive was bulked up by wrapping it in bacon. Also, the assorted kabobs we got were simply flavored by dusting them with powder flavorings. They were still good, just not very gourmet and something I could have done easily myself. \n\nOn a positive note, the chicken Parmesan cutlets/patties were amazing!!\n\nAlso, the over the counter items always look and smell great! I have also heard their wings are the best around. \n\nI'll go back for the brats in the summer but I don't think I could eat another one until then!", "business_id": "WxfedycTcbQO_GuXHo9Ypw", "stars": 3, "date": "2013-02-10", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "VgfxD1RTs9C9kd9HEFNXKw", "review_id": "qzdjU5fr4wgx0qQOtSpdVw", "text": "A freezer full of titles that need to be decoded!\n\nI asked the counter guy the tough questions: \n\n\"What's the difference between bear claw, elephant trax, and badger trax?\"\n\nI can't remember what the difference was other than that elephant trax sounded the best.  I didn't want to risk ending my day with artificial caramel, so chose the chocolate custard with peanut butter cups.\n\nPerhaps a little steep at upwards of $5 per pint, but hey, it's not much more expensive than regular-price Haagen-Dazs or Ben&Jerry's is getting these days, and I think it's at least on par, plus it's freshly made!", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 4, "date": "2013-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uADx804KQ47bwXk4TsHKyw", "review_id": "xUvRzts5ffPbjjfCN8VDTA", "text": "I like going to different grocery stores and trying them out until I find something I really like from each store. As such I would find myself going to different stores every weekend to get a bunch of stuffs from each of them.\n\nFor Metcalfe's it is their huge selection of meat, especially steak, pork and lamb. They have all the different cuts, including the usual rib eye, lamb ribs, steak etc to the not-so-typical liver, stomach, kidneys, tails etc. More than enough options to satisfy my creativity in cooking! \n\nIt doesn't take a lot to realize they are more on the upscale end. Your everyday items are going to cost more than the nearby target and copps. For someone with the spending ability for healthier options, vegan options, organic options etc, this would be a good place for all your needs. Until I find a real job one day ~~~~ *wistful look*", "business_id": "OxR3b_qcMJlzwzGPU5fmdA", "stars": 4, "date": "2014-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "yiDiS5kG124_Z2zfdCSpBg", "review_id": "VQrkBo1bChXr_6wdtkws2A", "text": "I like Ken's. The store is so close to my house I can walk to it, and they have grocery staples, priced only slightly higher than the grocery store so it's helpful when I need to grab something quickly. Their meat case has a great selection. Anytime I buy something from the meat case and succeed in not burning it, I am impressed. \n\nMy favorite item continues to be the burgundy steak sirloin. In the summer, we grill these, and in the winter, we put them in the oven at 400 for exactly 20 minutes. My kid really enjoys their cheddar wurst, which can really come in handy if you're suffering from lack of salt in your diet. \n\nThey've got a decent selection of beer, wine, cheese and other local accoutrements which, again, is really handy since they're right down the street.\n\nI don't really care for any of the items in the prepared meat case. They usually have ribs, cooked chicken and various side dishes (potato salad, pasta salad) in this case, and while none of these prepared items is particularly *good,* they are all adequate and helpful if you're looking for some extra calories to go with your meat.", "business_id": "LWmlH8MwUnwMWN5Ma8utnQ", "stars": 4, "date": "2015-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "9yAsh0pQgH7451dHv2k4sw", "review_id": "ldEQUsMBNalfvXOC20fRqQ", "text": "I'm not going to do too much of an in-depth review, most of the basics have already been covered below....but I must note that their lattes are astounding. I never actually had a latte prior to going here, but just decided to go for it since they have $2 latte Wednesdays....the Carmel Latte here is excellent, now it's a mainstay of mine. Also great for its obvious proximity to the Psych building, even though I've only taken one class there. A little excessive on the Starbuck's bashing though...hoorah pretention!", "business_id": "40KhR3J9snVooFfTdc-8ZQ", "stars": 4, "date": "2008-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7cU03OKZgmjNLLLGpbBiOw", "review_id": "XkwuA5b1Ho9bbfbHpxzaUQ", "text": "I never thought I'd review a butcher, but that's how good Old Time is. \nTop-notch ingredients. Excellent supplies for BBQ/smoking. \nThe staff knows their stuff - I've walked in and said \"What am I in the mood to make this weekend?\" and they answer me thoroughly and don't look annoyed at all (which, honestly, they completely could because that's annoying of me to ask).\nI'm kind of surprised they don't have better cheese, given how great everything else is, but I can't deduct for that.", "business_id": "niK-GkBZ_RIFscfy-nH1rg", "stars": 5, "date": "2015-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HqaXK9toBpQdcz-0-rVwKw", "review_id": "nvss290XS8w281yXbDhRkA", "text": "This is CU's top-notch coffee shop. They have delicious hot and cold drinks and wonderfully fresh pastries. If you want to get some hardcore studying done, this place has good study seatings(outlets galore!) and a diverse enough menu to provide sustenance. Though I am an undergrad myself, the distance from campus means there aren't too many of my kind here...and it's probably better that way.", "business_id": "yzInxReAkf7r0aRbwj02Yw", "stars": 5, "date": "2006-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JkKHUJf_NKdTTZdoPEQw4Q", "review_id": "wAiKpd3K3p3Vv58aek9-ZA", "text": "There isn't lots of room to study; most tables are typically being used, but if you do find a spot, it's a great place to work.  Typically quiet, with a noise level just above library-silence, and a nice bright ambiance in the \"green\" room.  The \"yellow\" room is typically just a little bit noisier, but still relatively quiet compared to Espresso Royale.  Music barely audible and of the \"indie\" variety, and there is always free naturally-flavored water!  I love this place, but wish it would be open later than midnight.  I could honestly work here for hours at a time.  \n\nDocking 1 star only because it's usually hard to find a good spot.  \n\nI guess I should say something about the beverages... I haven't consumed food here, so I will leave that out, though I will say it is available and seems tasty if you want a quick refuel.  Coffee-- I've had a few of the different concoctions and have never been disappointed.  I am particularly in love with their \"miel\" coffee, which is basically honey and milk with coffee.  \n\nTea, however, is the surprise triumph, here.  I don't know what they do to their green tea latte, but it's different and greatly superior to any other I've ordered pretty much anywhere.  The bold green \"earthiness\" is balanced with a sweet shot of vanilla.  This is typical of green tea lattes, but the one at Kopi is particularly \"earthy,\" for the lack of a better descriptor.  I also love the regular teas, plentiful in selection and served with an adorable teapot if you're drinking in-house.  \n\nFive stars, minus the lack of seats.   If you find one, you're set.", "business_id": "yzInxReAkf7r0aRbwj02Yw", "stars": 4, "date": "2014-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hQbfq7XwuSCIAzzVqTGHvA", "review_id": "R_2mFOTxQ8Gk5oT6TVo3Kg", "text": "Cannot believe that I went to U of I (albeit for one year) and never ever went here! Though it's a blessing in a disguise b/c I probably would have put on the legendary \"freshman fifteen\" during the first month of school!\nSo glad my hotel was across the street and that I was here in November - I was able to try the Pumpkin Pie snowstorm which puts the consistency of Dairy Queen's blizzard to shame and makes the frozen custard from Culver's taste like poop in comparison.\nI also tried a small vanilla sundae with their signature cold fudge - wow.\nAlso gotta love the fact that they have a drive-thru! :-)", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2010-12-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "SqQe5KNOG213VB4hFhBrZA", "review_id": "MLqVEQwjdy0vmcbjQiqmuw", "text": "I agree with other reviewer's when it comes to this store. \n\nI've come here primarily in the morning hour's, but I can assure you that it will not make much of a difference when people are determined to engage in mayhem that involves i.e. sexual harassment, aggressive panhandling and making you want to carry a crowbar in case the fur hits the ceiling.\n\nThe store inside is okay, but do you really thinking putting a Starbucks inside is going to make people forget about the insanity that goes on inside? That they'll ignore the lackluster service, the slightly inflated prices, and other nonsense going on?\n\nI hate to say this,but dressing up a salt water crocodile in a Christian Dior dress won't change the fact you'll end up being decapitated.", "business_id": "7Z7IkR_-94AjUuDw0fbI7g", "stars": 2, "date": "2015-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "25ChQa3NMHJNq_qpHU6TqQ", "review_id": "tdJZgPuQ0TgA-O0F5B_aYg", "text": "I always find myself here before flights out of Sky Harbor. Just like walking into a mercado! Yummy stuff. Haven't tried everything on the menu, but can't see where they'd go wrong.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2010-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lquqcLhSRn2t0MzNOkQ99A", "review_id": "XQrfvDXiQXufLbb2in0s3w", "text": "Bomb. I usually don't write reviews after one visit but I tried so many diff't things I feel comfortable doing it. The fish tacos are excellent. Grilled and simple, not slathered in sauce. Ceviche Tostada is one of a kind and excellent. Carne Asada good but not as excellent as the rest. Pastries super yummy and the tortillas (to bring home) are house made and fresh. Oh yeah, the creamy salsa they have is ridiculous. I don't even want to know what's in it because it's so good!", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2014-02-12", "type": "review"}
{"votes": {"funny": 4, "useful": 7, "cool": 4}, "user_id": "XBHJCDzNh--mBhJkzyM_iA", "review_id": "268rYC3igokA7VsFZTxEhw", "text": "If Ranch Market is not your thing-- then you are missing out on some really great things.  \n\n1.  Chips  (as in chips and salsa)-- they make their own tortilla chips that are only 99cents for a bag.  I brought them to a work party and everyone liked me more than the day before.\n\n2. Birthday cakes for kiddies--- wow- talk about a frickin' cool Dora the Explorer cake, or a Spongebob cake-- it put Costco and Aunt Cindy to shame.\n\n3.  Meat-- this meat case is LOADED, even if you don't want to buy fresh meat, just go there to look at it. \n\n4.  The affordabiltiy-- C&H Sugar was $1.19 at Ranch Market and $2.99 at any other grocery (non sale priced).  \n\nIt's like a party in this place, the last time I was there was right before the holidays and I found myself just having a good ol' time grabbing the chips for a work party.  I even stopped by the jewelry counter and contemplated purchasing a 3 inch gold cross, but decided against it.  :o)", "business_id": "VXIkI9_EbDbYHeO9IzKjJg", "stars": 5, "date": "2009-01-08", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 1}, "user_id": "5mvaOdV7nyKCP2Xct7yDTw", "review_id": "XtbuT-hnpF9Mt1YfweHS8A", "text": "If you have the time to plan a grocery shopping trip around making it to a Ranch Market here in the valley, I would advise doing so. And go without a list. You will not cooperate with your list once you've walked through the entry to the glorious Ranch Market. \n\nDo also go when you have the time to enjoy the market as it is always bustling and the check out lines can take a while. \n\nI almost always walk out of RM with some fresh pico, and other salsas depending on my mood, and some fresh chips to go with that. I then usually wander until I come up with some Mexican meal I want to make and go at it. \n\nPricing is great as you can find prices similar to a Food City or Walmart. All fair and same good stuff. \n\nOnly knock I have is the food they serve inside RM at the food bar, while deliicous smelling, and also well priced, has not always been high quality. So I skip the food bar, and drop my good grocery money on the fresh made items and other ingredients necessary for a yummy mexican meal.", "business_id": "VXIkI9_EbDbYHeO9IzKjJg", "stars": 4, "date": "2014-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Jf9vBT3qYamjlllkoSFW3A", "review_id": "E9wH_hafQXr_kef1-sEjzA", "text": "Came here for a kolachi but only the northern location has them. Oh well. But still enjoyed the maple bacon donut and the sprinkle donut. Not good for the diet but good for the soul. The lady behind counter was super sweet and nice. Really liked the friendly atmosphere.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2014-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kEeIrbREnRip5AWQZe5YfQ", "review_id": "LTfu7HbEFs3pwFiGCjztFQ", "text": "You know, I really wish that one day when I walked into a circle K I I could give a positive review. Today however, is not one of those days. \n\nThe store itself is filthy. Located in a poor neighborhood does not justify the condition in which the store is in. For example; the place where you get your lids form, for your cups , has a thick layer of dust within it. You drink sodas that come in contact with lids, that are in contact with that dust. This is completely unacceptable.\n\nWhy I was there there was a long line that stretched all the way to the back of the store. With only one register open by the other person refused to open up the second register stock the store. Something he could easily return to after he assisted the other clerk in reducing the line.\n\nHow do you expect repeat customers , when this is how you treat them? \n\nAdding it to all this is the gauntlet of homeless people you must by pass to enter the store people were begging you for money. What other homeless people are sleeping and just hanging around on the east side of the store. When you see this stuff, you just want to bypass the store all together and are willing to drive further down the road to avoid the hassle an eyesore. \n\nYou feel kind of like, why you there you're going to get mugged. My suggestion to everyone ; avoid the store until they get their act together.", "business_id": "8ukXESjPTI7Axn63SsWWRg", "stars": 1, "date": "2015-12-06", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 3}, "user_id": "z1c8uQv7tfgrP4-sVggbTA", "review_id": "deYhr5Exsos6ViOT_z-AUw", "text": "So, I have a thing against Costco, which is why I only gave it 3 stars. Once, an entrance greeter told me I wasn't allowed to wear my earphones inside the warehouse. Really? Are you kidding me? She literally would not let me enter until I took them off. How am I supposed to listen to The Instance if i can't wear my earphones. Seriously!\n\nMy four-year-old's love of the Costco Food Court, however, redeems Costco a bit. He loves their hot dogs, and laughs every time he sees the poster of the giant hot dog.\n\nAlso, Costco is directly responsible for the fact that I am now full of anti-oxidents. Every month I make sure I have stocked up on soy milk, pomegranate juice, frozen fruit, and frozen berries. I try to make myself a smoothie before work every day, which would be easier if I didn't have to start at such an ungodly hour (7:30am).", "business_id": "XLqnjlLYt0_q_NG7l_BpMA", "stars": 3, "date": "2011-02-20", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 5}, "user_id": "4_YfcfHkCem1onJFkItxjA", "review_id": "QGi91NXccoSOofls8O0sKw", "text": "I don't care much for Basha's and I really can't stand Food City (see Phoenix Ranch Market), but AJ's is how the Basha family does it right.  \n\nMy friend Bobo and I didn't even flinch yesterday when our total for two ribeye steaks, asparagus spears and corn cobs came out to nearly $50, because we knew we were getting high-quality grub.\n\nI don't come here often these days, probably because I used to come here all the time when I dated some pretentious A-HOLE a while back who preferred AJ's at all costs.  But I do come here when I prepare for dinner parties I'm hosting, go to brunches or just want to feel nostalgic for Bristol Farms and Gelson's from back home.\n\nYou can never go wrong with ANY of their food whether its croissants or desserts from their boulangerie (which is French for \"I'm a fancy bakery you can't afford, you chump\"), the butcher block, pizza counter or cheese deli.\n\nBut my absolute favorite part about AJ's is their wine selection and florist area.  I was gratifyingly reassured when I showed up to the home of Kristin S one day with the same exact cava, that lo and behold, we both religiously drink.  And when you're on the run you can always be sure they will have a trained wine sommelier help you in a pinch and chill a bottle for you in minutes.\n\nIf you're looking to be romantic and get laid, this is a one-stop shop with the fresh fruit salad in the deli case, cheeses, wine, chocolate selection, flowers all under one roof -- plus Castle Boutique is just one block over.  Score!", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 5, "date": "2008-01-15", "type": "review"}
{"votes": {"funny": 13, "useful": 11, "cool": 8}, "user_id": "C8ZTiwa7qWoPSMIivTeSfw", "review_id": "LeWPvV5OKPCOHkrAxB3c1g", "text": "The polio vaccine. \nPlymouth Rock.\nThe earth is round.\n\nA list of great human discoveries would not be complete without, perhaps, the most important of all.\n\nNEVER use the regular cashiers at Walgreen's. Go directly to the cosmetics counter. Cue the heavenly muzak. Yes, yelpers, I NEVER wait for my Snore Strips, Snicker bars or Burt's Bee's Lip Balm. I grab and buy. Otherwise you're behind the lady with the coupons. And she's still cuttin them out. Or the five pimple faced teenagers. All paying separately. Or, the worst, someone who apparently is stocking their bomb shelter and has two carts full of crap.\n\nNEVER. Just go to the cosmetics counter. Tell 'em Thomas S. sent ya!", "business_id": "HfWkdqxegjiGEXzI8j7Wwg", "stars": 4, "date": "2008-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "18vTyU-FpeXiaOsUj_bRvA", "review_id": "U_KF6zbO800hYyZ3CGVmrA", "text": "Really into this spot. Reminds me of a classic NYC deli. Sandwiches are tasty and the space is cozy.  The service is really friendly.. I recommend the tall lean Texan.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 4, "date": "2014-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ESb5cHmhe5dc_irM9TJXZg", "review_id": "huqLJpz280FWxS5XY4osAw", "text": "Main reason to go to Sonora - the Kobe burger!  By far the best burger in town.  I usually go for lunch since its close to my office and have never been disappointed by the food.  Great service, great waitstaff, great food.  I've been once for dinner and the beer is exceptional.  All around a great pick! Even worth the drive from the NW Valley.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 5, "date": "2009-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "QBQlErZajdIyXX84dvFUnQ", "review_id": "Jug-iIK01Yty4Kfwbf7MUA", "text": "Cool place! The beer we tried was good my fav was the hefeweizen. The green chili pork with tortillas was really good and I have been back many times for it. The food prices are good and the burgers are good, wings are just ok. The staff is always friendly and quick to get our drinks. Happy we tried this place and its close to home.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2011-12-05", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "UbHN4QkIJa5exMert5rTyA", "review_id": "nfakWJbfAoJPDcSsMh6O1g", "text": "For me, Sun Up is a strange concoction of microbrewery, pub food, hipster alternative music and silent sports bar. I filly do not understand why this place keeps the tv on, and volume off... Especially when there is a game people really want to watch. \n\nThe beer is tasty and the selection is pretty good. The service can be hit and miss (I was here one day and the oven was broken, limiting the menu).  But it's not bad. \n\nOverall, the get 3 stars.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 3, "date": "2014-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "5yQMUyoZYCVDQiftf0Uw1w", "review_id": "W3fqF1SyoBO8EhYpUsaHOg", "text": "Ha ha ha ha!  The best people watching experience that I have ever had!  Ever!!  I was quickly in and out with one of the best venti upside down caramel macchiatos that has ever been made!  Starbucks is always reliably wonderful but today was even better than most other days.", "business_id": "dSQh1Hx2BiSrYog4ad740A", "stars": 4, "date": "2013-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "65Bb2FZJZb3hByOr2j4-XQ", "review_id": "ibpg2EmcaAYp_0e6V_lY_w", "text": "Ok. This place is THE BEST place to get sausages in Phoenix PERIOD! The breakfast sausage could very well best the best ever. I go here regularly and have had so many of thier sausages, they have all been great. I do not even buy supermarket sausage anymore after finding this place, not even in the same ball park. Top notch.", "business_id": "XRBTHOXaJK_AJ2wy5mX_1A", "stars": 5, "date": "2011-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "go8iR9E-MfDJqFATDApuVQ", "review_id": "_AbIRnPKSRAHVwv4_K-Vhw", "text": "I really like the selection of flavors here. I make my own juice for my e-cig and ABC offers a nice variety that help keep our vaping interesting. My only complaint about the place is their hours, I wish they were open later on weekends!", "business_id": "XAaXT0e70-USVYVKcnljsg", "stars": 4, "date": "2012-02-25", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "l53FUDHRHLg7BQ89KgAtxQ", "review_id": "PoussiZ2YDVTfh4jelKc7Q", "text": "Cost Plus has grown with me.  As a teen, it was a place to pick up something small here and there (cards, lamp, frames), and dream about what \"my house\" would look like.  In the early 20's, I was still just getting little things (posters, candles, linens) because I had no money, but I would have fantastic dreams about what I would do - one day.  Moving into the later 20's, this became my go-to place for creating upscale Christmas baskets. (My favorite was an Italian night basket with the pasta, pasta sauce, bread sticks, Italian cake, chocolates, a few bottles of wine and wine glasses - and something special like a CD or special espresso beans.  A classic given and appreciated SEVERAL times.) Now in my (sigh) 30's I've completely resigned myself to the idea that I will NEVER get anything but little things here.  And I'm totally ok with that.  Cost plus is my favorite place for Christmas.  I do stockings for my whole family and I can find things that work for everyone(Ornaments, Chocolate coins) and things that show I was really thinking of them (This year's had a theme - everyone got drinks but that ranged from Thai Chai to Japanese Saki).\n\nMy new favorite thing about Cost Plus is their jewelry section.  It's made huge leaps forward in the last 5-6 years.  Almost all of it is very \"today\" with prices that look very yesteryear.  I found beautiful handmade beaded dangling earrings for $5.  An amazing matching necklace was $15.  These both could have gone for 2-3 times this amount and been absolutely worth the price.  Let's home they don't realize that any time soon....\n\nWhile agreeing with a previous post about the cost of the furniture, I'd say it's most likely worth the cost as those expensive pieces have always seemed quite solid.  But then again - I don't go for the furniture. The things I love, which is a good chunk of the store, can each fit in a hand basket.\n\nIf you haven't been to Cost Plus before, give yourself some time and walk down each aisle.  It can be amazing the things you find hidden in the shelves that you might have missed if you just scanned down from the end.  And wear comfortable shoes - you might be there awhile.", "business_id": "u8bQvtkVa5lW-SNwRLH6Vg", "stars": 4, "date": "2007-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WcMlLMMUGNZvxjf47gevAQ", "review_id": "wjshMNkcxwPiTZnl0lKzXw", "text": "Too bad their bagels are yummy- just the staff is unpleasant!!   Went to get a bagel, they did not call out my name for pick up. The bagel was sitting on their workbench for 10 min- then someone asked if I was waiting for something & I said, \"Yes, my order.\" The guy working asked my name then went hunting & found the bagel. He handed it to me, then I said the bagel is cold because they had set it aside after toasting it & was hard. I just wanted a bagel :(  I shouldn't have to feel bad for paying for a product & service that I had no part in making.", "business_id": "KNIw6kwf8LZkrS1lEnaLiw", "stars": 1, "date": "2015-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "CWYHXKPXqP4KgY3TyI54lg", "review_id": "kmx9PgSXO-iwttau0OLmgw", "text": "Local deli, locally owned.\n\nSmall little place tucked in a strip mall behind the A&J BBQ about a quarter mile north of Bethany Home on the West side of 16th Street.\n\nLove their sandwiches.  Never had the pizza.  Love the Italian cheese and desert treats selection.  Love the small but densely packed shelves of canned and bottled cooking materials.", "business_id": "T5HYqRADhAL6VPRAacz74Q", "stars": 4, "date": "2007-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nwExQDQMJ-9ni-gUZkXesQ", "review_id": "0DXrZVK0Iq07Co98Otj1WA", "text": "Singlehandedly the most amazing Italian food I've ever had!! I love picking up a pan of their mouthwatering lasagna and/or eating a huge sub in house. You feel like you're right at home with your long lost Italian family. The owners are such a lovely family and treat every customer with exceptional customer service. This is my go-to spot whenever I need to bring a dish over to a party.", "business_id": "T5HYqRADhAL6VPRAacz74Q", "stars": 5, "date": "2015-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9UtNYyrWnpMbpshMrZSRGQ", "review_id": "NeAs-eZGGTImQ6a0CG2FZw", "text": "My Jamba order is consistently the same, so it is easy for me to compare them all... and this is the one of the more reliable and consistent locations in the Phoenix area!  Seriously, what's not to love about JJ anyway... five stars!", "business_id": "aeRyndix1wheBlff2FBsMg", "stars": 5, "date": "2013-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "C3VpWgCsdwyYs6Xoy1JcJQ", "review_id": "uEZRb_4PGn_5RrQfCKsa4A", "text": "Ok finally checked it out for lunch today, all I can say is they have cabbage rolls !! There awesome ! Old school food nothing fancy just hearty classic stuff.", "business_id": "fmuj7u1gflmEjW-h0v9bwg", "stars": 4, "date": "2013-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4dnDsoHuxUtzhaumxbpR5w", "review_id": "3SanizT67IviI5qxT8cGXQ", "text": "I wish I could say this place is a secret guilty pleasure. I don't know what it is that keeps bringing me back, perhaps it's the never-ending menu and the hope that maybe someday I will order something I like. However, that has yet to happen and more often than not I find myself disappointed. \n\nOr maybe I am just not ordering the right dishes? I've tried the grilled cheese, Pasta Da Vinci, chicken Madeira, Caesar Salad, Cheese pizza, Roasted chicken.....all being mediocre. Sure, they load your plate with enough food to last you an extra three meals, but they're an extra three meals I'm just not really interested in. \n\nThe service is always great, though. Maybe they feel the need to make up for the ridiculously long waits this location often suffers....\n\nI think I am done experimenting.", "business_id": "2r8jGeuYvMkyP2ik_X-Bxw", "stars": 3, "date": "2008-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BXuwYUljJIGWbscJdzkmUw", "review_id": "YipV49M7azwZ9Et43EssCw", "text": "I always have a pleasant experience when I go to Cheesecake Factory. The service is superb. Huge servings but the food is ridiculously overpriced. You're just paying for the ambiance. you can get better food elsewhere.", "business_id": "2r8jGeuYvMkyP2ik_X-Bxw", "stars": 3, "date": "2013-02-07", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "38BNIi0H7C98g_AjFcepJA", "review_id": "s9TCAgp9fd7tPJJKL4aVYw", "text": "I'm not big on chain restaurants but gave this one another try mostly because I was taking a friend and her daughter out for her birthday.   3 people - no alcoholic drinks nearly $80 with the tip, how ridiculous.   Mediocre service, which had to be hunted down several times for water and soft drink refills, they didn't even give my friend anything for her birthday.  \nBest part is when we were ready to leave, we were told we would have to wait because their systems were down and they couldn't close anyones bill out - so 20 minutes and no apologies or discount later, we got our check.  It will be my last time at any Cheesecake Factory, they can take their overpriced crap and keep it.", "business_id": "2r8jGeuYvMkyP2ik_X-Bxw", "stars": 1, "date": "2015-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "QSzbhLINnOVxYEVhuTituA", "review_id": "DKR5F43T1JLHQQcpxksiwQ", "text": "Literally ran into this delicious place this morning with a friend while taking a nice run around Old Town Scottsdale bright & early. They just moved here from the Biltmore & I could not be happier about it! \n\nWe devoured the ham and swiss croissant, which was to die for, while sipping on great coffee. Can't wait to go back & try more of the food!", "business_id": "wftoNIA0Q8nX-Da47psBCA", "stars": 5, "date": "2011-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Br9mpMhkVunsp8Un5GpYWA", "review_id": "1xKJhpuW3CQbdO5L-V-HCQ", "text": "This location feels like the perfect spot for a TJs.  It just fits the area, we have been to the one at Arrowhead and it feels a little out of place up there.  But at Camelback and 20th its just the right fit.  I always like to buy one new thing when doing a large grocery shop and am always pleased!  \nHere are a few of our Favs: \nPeanut Butter Cream Cheese\nFresh Motz Cheese Balls \nChocolate Jo Jos\nGarlic Herb Pizza Dough\n\nThese are just to name a few.  Trader Joes knows how to do a unique, fun, healthy market.", "business_id": "Sy-hmzSH1OmWpHmAfZtxRA", "stars": 5, "date": "2012-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9sNNkO6sojotXUnaikslhg", "review_id": "AiDZL0K0GhVSKAzdH_uJyQ", "text": "In a world of Starbucks, this is a rare gem.  The espresso beans are awesome & they will sell you some to take home.  I don't really go for flavored beans, but they have those too.  They have a big selection of baked goods and the scones are buttery and amazing.  They have a great selection of teas & brew every cup fresh.  The pomegranate green tea is awesome. I love that they still have punch cards to get your 10th drink free (any way you want it).", "business_id": "2h9LsLPdJ7OvZrYJZhVdAw", "stars": 5, "date": "2009-02-17", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "J72XoQspNBmPsX2iKl2YvA", "review_id": "QY-VyhPKpcTJ37kunMRjdQ", "text": "Attended the 12/4/2010 Technique Class (complimentary) : The Holiday Dinner\na) Eggnog with Nutmeg and Cinnamon\nb) Standing Rib Roast with Yorkshire Pudding\nc) Creamy Gratin of Winter Root Vegetables\nd) Chestnut Panettone Bread Pudding\n\nAll very tasty and very informative plus price was right...\n\nIf I were so inclined to cook  a standing rib roast a remote meat thermometer would be useful.  Remove roast when 125 is reached and let it rest for 15 minutes.  Don't poke meat or juices will escape...", "business_id": "31bXixwy2GNmRlhpl21reA", "stars": 4, "date": "2010-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0VJkru53hi_-YqQ4LoIbnw", "review_id": "3gXsqSKvZRW6yTUJzLNofQ", "text": "Hands down the best cupcake I have ever had in my whole life. The Cosmo Cupcakes are to die for! The chocolate ones are amazing. A friend of mine had the Cheesecake and said it was pretty amazing as well. \nI brought these to my trainers at the gym for a cheat day and they all went crazy over them. I even traded a dozen of them for some free training sessions, LOL! Everytime I go in to the gym they all bug me about bringing them cupcakes. \nI wont go anywhere for cupcakes now but Barb, They have ruined me for life :) \nTHANKS!!!!!!!!!!!!!!!", "business_id": "vv1uvJRBUqi707TA5GuhCg", "stars": 5, "date": "2013-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MzvIbg2bEeyeR9-dRF_Jzg", "review_id": "CCwTHw_N_l0vkyxrFkNQWw", "text": "Just had breakfast here. Really good, great toast. Very affordable, also.", "business_id": "e_kbfiEZ87L-ZryMZxvJkA", "stars": 5, "date": "2012-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fbeHfeZ6mKTIbUHZ0vMbow", "review_id": "Mc7gfnaoitIap0kJh9XKLA", "text": "talk about a place that puts the love into their food and cares about their customers, this is the spot.", "business_id": "j0Uc-GuOe-x9_N_IK1KPpA", "stars": 5, "date": "2015-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UD3vWFqlJbn_7yXvJCCqfA", "review_id": "iUUGXcRQPDauE6pDnPUIdQ", "text": "Worst deli department I've ever been to. Nikki the women working behind the deli counter is just plain rude. Yelling at her coworkers and mumbling racial and homophobic slurs under her breath while helping customers. The deli department staff will look at you waiting for them and just ignore you. There is no self check out so you may wait in line for a while. Many staff members have poor hygiene; sneezing and blowing their nose while checking you out and touching your food. I asked a member of the produce staff if they had any more kale and he said \"what's kale?\". If this grocery store wasn't so close to my house I would not shop here.", "business_id": "a7OF5WBirAFlVH7Xp1885g", "stars": 1, "date": "2015-12-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "UHWSMoTUnoBuUgujsYIXhw", "review_id": "0KVFAEomSDisJ2SsIwVxUA", "text": "Someone in class suggested this place and it was such a let down. A large group of us went and many people liked their sandwiches but my turkey cranberry w/ stuffing sandwich was awful. The stuffing looked like dog food and it tasted like cardboard and fennel. The cranberry sauce tasted like it came from a can and there was nothing special about the bread. The upside is we got our orders fairly quickly and the atmosphere was alright for a quick lunch spot.", "business_id": "S8R5c7-plWe3NtmijYAJvg", "stars": 1, "date": "2013-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YOQ_be_EtdKeEmSzVUy-0Q", "review_id": "7Ik5_LUQAQQKQPn5VelZ3Q", "text": "New in town, I had heard nothing but good things about Mama Java's, so since I live half a mile up 36th, I decided to walk down and try it for myself. I walked in and was immediately introduced to a warm, welcoming atmosphere. A very popular place, there were many people, and there was still ample seating. As I approached the counter, I had asked a friendly employee what they would recommend. As soon as she had asked if I liked chocolate, I quickly nodded in confirmation. I didn't have to wait very long for preparation of my soy mocha, which tasted truly outstanding. I highly recommend Mama Java's Coffee House, it's very well worth the price...SO much better than commercially owned coffee houses like Starbucks.", "business_id": "Mb46iSlA4qmTwXf-WrqtQA", "stars": 5, "date": "2012-01-02", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "3_tMJjAsNaRlEpNTDvqDbw", "review_id": "gXIIh_5FoanQdORlauo0yw", "text": "I would give LGO six stars if I could. I love this place, they really have done everything right. The food is amazing, the displays are fantastic, and the music selection is always great. Parking can be frusterating but once you get inside you realize that it was worth the wait.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2008-02-09", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "TVJP9jSapI_jVHJ89mmijA", "review_id": "qJCoSvywxpe8Qu6nk-dRQQ", "text": "I always come here for lunch with my friends and our dogs after hiking Camelback Mountain. I've tried most of the sandwiches and while they are all good, nothing compares to the hot pressed tuna sandwich - love it! The breakfast items are also tasty and I don't usually crave breakfast foods. \n\nThe food takes awhile to come out if you are there on a Saturday afternoon around lunch time - because the place is always packed. I've never had trouble finding an open table though. \n\nLike everyone says, the parking sucks unless you happen to be there when someone is leaving. There are 2 small non-valet parking lots north and northwest of the restaurant. There are always people who park along the curb in the north lot - that is really annoying because the cars that are in the parking spots have trouble backing out. \n\nIt's a very dog friendly place and the staff always brings out bowls of water for the dogs. Check this place out sometime!", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2009-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "ZpYU1YeBKMyem0-c4FJzyw", "review_id": "PnRD45aLpEXfO-SmX6rVbA", "text": "This place is awesome... it makes me forget that I'm in Phoenix sometimes.  While I can't review the whole menu, I know their yogurt, orange juice, and coffee is awesome!  Service is usually really good and friendly, and the fact that you see a lot of the same people there a lot means that they're probably keeping more than just me happy.\n\nCheck it out next time you're in the area... driving, cycling, or walking.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2010-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nmpONbwjEBD7Mqiqs2aOAg", "review_id": "6TJntY1I1kUBTXfI1SUdMQ", "text": "Good but a little overhyped. I had the commuter sandwich which would have been just ok other than the bomb homemade English muffin, which was so good I bought a pack to take home. Desserts are delicious, especially the Ooey Gooey cupcake. I'd go back for the cupcake, complimentary valet, and the awesome view of Camelback.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2012-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "efsFj9GrwYztcfXOx3XWJA", "review_id": "2fPTK9BBZOr75JruQNunqA", "text": "I love La Grande Orange. Fun atmosphere, nice people, free WiFi, and plenty of space to eat, drink, and work/read/lounge. They have yummy cookies, pancakes, sandwiches, and iced coffee. Lots of cool stuff in the grocery and \"old school candy\" section, too.\nEveryone who works here is super nice and sweet. Oh--and it's dog friendly and has bike parking, too. :-D", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2013-01-03", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "XxA5k_iyzf9HdvPMp_J27w", "review_id": "Af2RECenwhV2LXcZNGmnRA", "text": "Two stars is being generous for this place. I tried to go here for breakfast with a large group and the system to get food was so chaotic and busy that I actually had to leave. It's not bad enough that I had to spend twenty minutes to find a place to park since space is limited and there is no parking on the street.  I have had their English muffins and they are fabulous but even their greatness doesn't entice me to ever want to return here.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 2, "date": "2013-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "elmaGs-dCj6_UY2esIavpA", "review_id": "_YbXeAm8oP5tlcaIu642Cw", "text": "Delicious coffee, great food and an incredible atmosphere. If I lived in this city I'd be here on a regular basis. It's a little pricy for the amount of food you get but I think it's worth it.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2014-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CsfuOOeYQLN7HwfuZZPj9Q", "review_id": "WMXkXzcl8XoTt54YFmchMA", "text": "I love LGO! It is such a great place to hang out on a Saturday or Sunday and get breakfast, brunch or lunch. There is a great atmosphere and lots of delicious food. The salted chocolate chip cookies are to die for. Love the croque madame too. YUM!", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2015-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2OLdiDZNdrPkdjp1WmW0-w", "review_id": "JV05YEc7AVq3aw2Y_nc97A", "text": "Great donuts.  I think they are just a slight step below BoSa, but they are very good.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 4, "date": "2010-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oUGmoziFCwNi2oUHB54SGg", "review_id": "sLmWtcpY0CtBlbBhyLsiAQ", "text": "Some of the best coffee I've ever had -- and I lived in Portland. Insanely good selection & product. Tanzanian peaberry off the charts. Owner gets beans from multiple sources to ensure that his selection is the best.", "business_id": "4eFIVmbeCvJGCrhzmd-VYA", "stars": 5, "date": "2011-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PgINUOMQqSpro4CF5xsziA", "review_id": "CkTqLjWlTaDjniCOntbY5A", "text": "Cool, chill, relaxed employees. Day and night. Always nicely greeted with a smile. Floors and counters seem pretty clean. Shelves always stocked and organized. Easy to find anything. Only 3 stars because one night I got a really bad hot dog. That makes me iffy bout their cleanliness. But it was 1 out of about 50 times I've gotten a hot dog there.", "business_id": "9BPYwkcrItZgnI9V0Cz7DQ", "stars": 3, "date": "2012-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "scytnI5S7pJshUv8G8ivVg", "review_id": "th2Wwz8X4zpjM0LeFyxiLA", "text": "Great food, not so great barista knowledge. I've given a few \"lessons\" in Americano drink building here. Not sure if employees were new, but higher expectations from a place with an expensive espresso machine. \nI take my coffee cravings two miles down the street to DD now.", "business_id": "pNJhovUsGAZ4XqG3lCU-5g", "stars": 2, "date": "2015-02-08", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "PohhnLA5mMVcy_cnvOcZRw", "review_id": "NozX4kWRDqlbI0MeK1QJnA", "text": "I hate this place!!! I live less than a mile away so I ve had to keep giving it a few chances BC its so damn close but Im done! Honestly I get a my stuff at Costco but when I need small things I have to go to this shit hole. I swear every time I leave I'm so annoyed and they re all awful I litterly just almost walked out the damn store and just left my shit! There's no one around to help I had to go up to customer survive to find stuff BC they have no one walking around helping customers like every regular store around... Last time this little 17 yr old (tops) was so damn rude I'm not even gonna get into it but point is this place blows! Still pricy and they're produce is rotting I don't get it whatever tho I'm done I'll make it the extra mile to frus from now on never ever had a problem w them :) finally learned my lesson. I always feel like I'm at a food city when I'm there anyway so dull and shitty ughh", "business_id": "kP_NxoI4DyQ1y60i5xsTCQ", "stars": 1, "date": "2015-02-15", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "1q-NR8saXXMK66p7Fh_8Mg", "review_id": "u3oRuwhFdhHBxdBA8hm7Eg", "text": "Went to Whole Food Market on Friday to for take out. Been to this to this place several times. It is expensive but only go for specific items that you can not get at other places (weird stuff like like shortening that has no PHO, Miso paste, grape seed oil, truffle oil .....etc... and not so weird stuff like fresh fish, cheese and wine). \n\nThis is the first time I went for the ready made food. I agree with some other reviewers, the food looks as if it has been sitting out for some time. My wife has been to the one in Hawaii by Kahala Mall (which just recently just opened within the year) and she said the ready made food is pretty good there. We LOVE the island favorite fresh POKI, this Whole Foods does this dish NO justice. Yuk. (tried it on a previous trip) Can't wait for the family trip to Hawaii to try out the Whole Foods in Hawaii, wife says it has smoked meat section, more selection, and Much better food. \n\nEnough with what could have been........Friday's ready made meal was Roasted Chicken, Broccoli Crunch, Flat Bread, and Cranberry Cheese. I have to say it took awhile going thru the store to find something that the kids would like and look like it was not sitting out for a long time. The roasted chicken was dry. It must be the fact that they use chickens that are not Pumped up with salt water (was talking to someone about their chicken). The seasoning was good though. Broccoli Crunch was good, kids like it, the crunch was from the fact the Broccoli was not cooked and it had almonds in it. Flat Bread was OK, can't complain about it. One thing I must say a positive about Whole Foods is the Cheese selection, you don't see that set up in too many places (at least where I can go that's a few minutes away). They had a sampling of Cranberry Cheddar out, the kids tried it and got their approval. Oh we also had Potato Leek Soup which was really good in my opinion. \n\nFresh Produce, Cheese, Wine, Desserts, Coffee, kitchen cooking hard to finds (if you like to cook), Fresh Fish and Meat. Would be my limited Good things to say about Whole Foods in general. \n\nI hope they get the message and get better with the prepared foods.", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 3, "date": "2009-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vobM3d865u5TfSo1eNafDg", "review_id": "p7GxHruWifrkukgRrmIiFg", "text": "Love love love this Wholefoods they have the most amazing staff Pete, Adrian, Audry & Claudia Are rock stars!! Organic salad bar yumm & tons of grab & go food options.  I'm really loving the sandwich and pizza station today!! So many unique menu options!!", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 5, "date": "2015-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fEj_XwjnerQDYBMM120zmg", "review_id": "1ECwaI8p55TcOXOWU_yI3w", "text": "Just moved to this area and decided to come here for some grocery shopping. It was one of the smallest unorganized walmart I have been to. 2 people can barely get around one another in the same aisle when going opposite directions. Parking wasn't bad. Clean as any other walmart. Won't be back, luckily there's no shortage of grocery stores", "business_id": "1OigyqVxIfE6AGKNGWZjnw", "stars": 2, "date": "2014-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gJvGrwHEgzQu8VAKptyJiw", "review_id": "_DC-estaaMFE9jj1maALKw", "text": "I happened to find this place near where I work. The food is always fresh and delicious! My favorites are the soups. Each day there is something different and they are all homemade! My favorite is the rice and abondigo and the Pozole. I have had a few different breakfast sammies and the stuffed French toast. They usually have pre made salads to go for someone who is looking for quick and healthy meal. During the holidays they always have a special catering menu that you can order from! The prime rib is amazing! They are also known for their pies too! I have had the pumpkin pie, chocolate pretzel and cherry pie! All of them were delicious! They serve everything from breakfast, lunch and dinner! Every time I go in there they are busy! I wish they had more locations because the food is delicious and fresh! Great service too! The prices are a bit higher than what you would expect for a small place like this, but the food is amazing and worth it.\n\nI just had their southwest chicken sandwich with the stuffed avocado chicken salad! I also ordered their Valentine's Day cherry pie!!! Omg!!! Delicious all around!!!", "business_id": "j5HLcBru7FEirYJPbKFVWA", "stars": 5, "date": "2015-02-08", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "H50yHk8E8MSB54VarKQFtA", "review_id": "Qt0lxMUHcLOTGDVmrxeXvg", "text": "I really don't know what people see in this place. One thing, it does have that old crusty bar feel. We went as a group for drinks and food. The initial drink service was pretty quick and the experience diminished from there. I ordered one of the starred items off the menu, the Reuben. Three words best describe the sandwich ... greasy and tough! Another person at the table ordered chicken fingers, they were so dry she only ate half of one. The last person at our table had a cheese quesadilla, it was cold and looked like it had been microwaved.  The astonishing thing, the waitress actually pocketed my change from my food order.  They do like their regulars though and seem to treat them well. I can't say I would recommend going unless you are dying to find a karaoke bar.  I know I won't be going back any time soon. Actually, the sandwich I ate didn't sit very well with me either.", "business_id": "-xLwGUmmyKgsTtFOOXzjeg", "stars": 1, "date": "2012-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Dh9iKCpQZODMacV6rUgP7A", "review_id": "ckcqQ42fKJK7Nc5_SXt1qQ", "text": "Usually out of bagels by 10:30. Went up the street to Tatum and Shea and even though it was packed they had every flavor bagel. Won't be coming to this one anymore.", "business_id": "IcuPhhH7QCOCT19EDEppEw", "stars": 1, "date": "2014-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pfIthpLdjmllaHfP0ZJAYA", "review_id": "iQEwdvan6t9-E8oGxgUJ-w", "text": "Best donuts in town, the only problem is they run out early!!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 4, "date": "2015-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xXxoYIsbfXFK8BKndCcnZg", "review_id": "QBxyfCtRltL6dpPm61jWZw", "text": "You want fresh? You want healthy? You want great sales?!  THIS is the place!  After being ripped off by the chain grocery stores, and getting inferior products, I now buy ALL my meat and fruits veggies etc. at my local Sprouts. GREAT staff, exceptional food and terrific sales; I am a FAN FOR LIFE. Thanks, Sprouts, for redefining healthy eating AND top of the line products.", "business_id": "hHE4OHAc8dONTV8QsGLbWg", "stars": 5, "date": "2014-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s7NrYz-UVyL4Z_po_mBQsg", "review_id": "rYaLvCrGNgtIfHjeK0UGug", "text": "My favorite ice cream shop, though the prices are a little pricey.  They have seating either inside or outside.  I don't go to often anymore but they always have new and great flavors.  \n\nI usually get sweet cream and butterfingers in it.  Very good!", "business_id": "8WPCqC0Y-yszJi7eqfSllA", "stars": 4, "date": "2009-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ao5NMxuqJ1riZ4oLO6sEhg", "review_id": "-UWi05CmOFsPsavKZ5WB1Q", "text": "OK, I am getting tired of catching the new employees overcharging me. Every time we go there there seems to be a new wave of newbies. We go there enough and always get the same thing so I know exactly how much it is supposed to cost. The last two times there I had to have a manager (also new) cancel and re-ring my purchase. The employees always want to debate with me so I just ask for the manager to double check the total. So far I am batting 1000. Today the guy had a bit of an attitude when I busted him. I always give them my loyalty card which shows them that we have been there well over 300 times. You would think that they would train their employees to pay attention to the customer visit count, especially with super-regular customers. We were wondering how much extra money they make $2 at a time with travelers that don't know any better. I have heard that this is a training location...trial by fire I guess in this always busy shop... but then someone else said it is not. I am still suspicious of all the new employees every couple weeks.\n\nThe cookies and sandwiches are still awesome. The sandwiches may actually be the best of all the locations I go to, probably because they do so much business here that everything is always super fresh. It is hard to give the cookies less than 3 stars but if this problem persists I will be downgrading this location again.", "business_id": "Cm1jT60fxb1DjwpqjWJ8EA", "stars": 3, "date": "2013-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1PIu4nHGeg5UB7PrsC-5_Q", "review_id": "0UVVxA4HClzU79r6dcKaBw", "text": "Love this place for produce. Clean and well stocked. Short wait times in line. Probably wouldn't pick up anything else here. But that's OK.", "business_id": "iyjEqYqSk-mAya95A9hW8w", "stars": 3, "date": "2014-02-20", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 2}, "user_id": "JMzBDe-MWkazzG0BNE8oEA", "review_id": "6ASm96QaZdzPGs2uKixtIg", "text": "I took my out-of-town visitor here based on the rave reviews other yelpers gave it and, let me just say, there was no disappointment!  It was a bit chilly because we had to eat outside in mid-January, but they had heat lamps out to make sure people didn't freeze their arses off (however, it would be wise to bring a jacket depending on how sensitive to cold ya are).\n\nAs soon as we got there, a nice young waitress brought out a basket of scones and muffins in case we wanted to buy any for $2.95.  I had some kind of almond sweet delicious-ness of a muffin and it was well worth the 3 bucks.  I then ordered a la carte and had eggs and rosemary taters.  My friend had a mushroom and tomato omelette.  Boy did we enjoy ourselves.  It was a very pleasant, airy, light-hearted kind of environment, complete with little finches chirping and flitting about here and there as if you were in the movie \"Willow\" or something.  My friend couldn't deny the finches crumbs from her tasty herbed biscuit.  If it were me, I woulda scarfed down the whole thing and said to hell with the finches. \n\nEither way, we both had a wonderful time.  It was a great way to end her visit to Arizona before her flight back to North Carolina.  Although the prices were a little bit on the higher side (hovering around 10 bucks a dish, including bottomless coffee), it was well worth it.  And it's also refreshing to visit a breakfast place that actually attempts to be organic and doesn't deep-fry everything it serves.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 5, "date": "2008-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "JXjU9EVUCJ1rmYKxzDXSlQ", "review_id": "GOyht81lDkcXpqttGdnT2w", "text": "I have wanted to go here for brunch for a long time.  Finally made it there this past weekend.  Great setting -- so pretty and unique and reminds that Phoenix can be awesome.\n\nI arrived at 11:30 and had a 20 minute wait. No big as it gave me time to walk the grounds.  Was seated, odered the ham & cheese omelletee with home fries.  Food took about 30 minutes, again no biggie but something to be aware of if you are hungry and/or with children.\n\nFood was dropped off with not much fan fare.  Immedietly I saw a black hair sticking out of the fries.  Eww and Hello!  Did no one see this?  Ate the omelette, was very good but found two more very long black hairs intertwined in the fries.  It was gross.  One hair falls out --ok its unfortunate, but this...was like someone had pulled these long hairs out in wrapped them up in the fries.\n\nNo thanks.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 2, "date": "2011-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xl6PerjP9NNeB1eznBjCSA", "review_id": "LyXK-_wAjgq2I70TOYtdqw", "text": "Great atmosphere if you enjoy eating outdoors. I'll ditto what other reviewers have said regarding the cost of the food...it's pricey. We've been here for breakfast and lunch and enjoyed it both times however average cost for a sandwich, drink and chips is $20.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 3, "date": "2014-01-26", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 1}, "user_id": "x5TetDaoIsTIDg_JooGv-w", "review_id": "Vfk59opZQco7E8UPDzTB8g", "text": "Really wanted to like this place, but will never be back, recommend you don't waste your time and money.\nMy husband and I decided to try a new place for Valentine's Day, so I went on line and found the Valentine's Day Basket, and thought what a fun experience that would be; romantic and something different.\nThis experience was anything but fun from the beginning.  To start with, the basket advertisement tells you that you get: 2 gourmet sandwiches, 2 sides, tea or lemonade, 1 cupid\"s cupcake to share and a souvenir.   When we called to make our reservation, as suggested, the woman was very short and rude with us.  She wanted to know what sandwiches we wanted, when I told her I would have to look at the menu, which I had pulled up because we just looked at it, she told me to call her back when we knew what we wanted.  Hmmm... knew what we wanted, just had to look at the name again.  Ok, so we call back, get the same \"happy\" lady, she takes our sandwich and drink order, but then tells us that one of the \"sides\" that we selected was not offered, that there were only three sides to choose from.  It would have helped our experience greatly if the web had 1. Told you to select your sandwich prior to calling (and have the name ready so the \"happy\" lady didn't hang up on you), and 2. To list your sides that you could choose from.  \nWrote the ordering off as an employee having a bad day, and decided to make the best of it.  When we showed up at The Farm, had to choose from three lines, there were no signs to direct you, asked people in line and found out that we wanted line two.  When we received our basket and found a place that we wanted to sit, my husband showed me his pasta salad side, there were literally 4 noodles!  It wasn't even half full!  The sandwich was nothing to sing about, it was just a sandwich, DEFINITELY not a gourmet sandwich.  The cupcake was ok, moist but no flavor.  \nThen came our last slap in the face... your souvenir...a $5 coupon to go the their very over priced specialty shop.  Again... Really!?  I shop at specialty shops all the time, and this was a disgrace. The selection was terrible, and looked as if someone who didn't know what they were doing just set things out and WAY over priced them.  Love to support local artist and businesses, but these clearly were not local artist.\nThis entire process left my husband and myself feeling like we were cattle, moving through getting processed... hmmm... it is a farm, I guess.  We were thinking about trying the dinner one night, not now.  For what we paid, we could have gone to many different establishments, and received a better meal, and much better customer service.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 1, "date": "2015-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "SMQuJovLjHzXCzPRq4H2Gg", "review_id": "eftjvaIXJI5EDOb0S33TRQ", "text": "We just happened to be going to play golf at a nearby golf course. We were early and needed breakfast. What a lucky stop for us! The breakfast menu was pretty big. I had the apple chicken sausage scramble. It was delicious! My friend had a bagel breakfast sandwich. Also yummy. Delicious coffee. Friendly staff.  Good prices. It is a order at the counter and they bring your food to your table kind of place. There are several tables inside and a few outside. Their lunch menu looked good, but I can only rate breakfast. It is not too far off of I-10. I will go back the next time I am in town.", "business_id": "8H1DwdAAgSBtwDeb2R-hmA", "stars": 5, "date": "2014-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ukOCzQMy-FSjC1P7PhcdUg", "review_id": "1Ze_JsbELDhFgHb3nYMv3A", "text": "Best bagels and cream cheese I've ever had! I love when the cream cheese is light and fluffy. It tastes a lot better and makes it easier to apply! Their bagels are light and fluffy and absolutely delicious too! Its a definite treat when I get to have Einsteins bagels :)", "business_id": "l4ymgiD1WnsSrwxWWk7a3Q", "stars": 5, "date": "2015-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k8vE4MWAvcAYjQ7EyZGkug", "review_id": "hh5gkDDnL3mOG7gLh8oPbQ", "text": "This 4 Sons location has one of the best car washes in the valley!", "business_id": "R7uXlMl62qWUzXDt38fUJA", "stars": 5, "date": "2010-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KJDymAcoPiW_vuqthGxfpQ", "review_id": "cZIIG2P48ZQ-8ZibGAUr1g", "text": "One of the better Panda locations around town.  The atmosphere is nice due to its location within the shopping plaza and all the things that are easy to walk to before / after eating.  The staff was friendly and offered samples of anything we were interested in trying before choosing what we wanted to eat.  \n\nI ordered my regular two item plate with orange chicken and a chicken egg roll with rice. He tried the new sesame chicken and the orange chicken with rice.  The rice always seems to be off at these locations, just a touch undercooked everytime, but I always want it to be good so I order it.  No lessons ever learned.  Ha!\n\nThe place was very clean and everything was well stocked as far as condiments and the like. \n\nOverall: A\nIt's fast food Chinese, so I know what I'm getting myself into - but as far as the locations go, this one is definitely a good one to hit up when you have that craving.", "business_id": "4DDbIvNtzfhLRwz-EOLFDA", "stars": 4, "date": "2013-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jSfnKukwTr4tfi5DoxW_GQ", "review_id": "BB3C2hVxNvcS25Bd9CCB4Q", "text": "Love the beer, atmosphere and staff. On the downside, do not waste time or money on the shrimp and lobster enchiladas. There is barely any S & L in them. This after complaining to management after the first time ordering them. I was assured this was a mistake and!  they should be full of ingredients. Ordered a second time, on a different night and the same thing, only this time worse. Three enchiladas, each smaller than my thumb, one piece of shrimp, a crumble of what i assume to be lobster meat and a few small pieces of veggies. A total joke if you ask me.", "business_id": "d7V3ykQHqChv0KtXEanKLw", "stars": 4, "date": "2013-01-21", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "pw-k3TMjt1ZNB2-iRVTDlQ", "review_id": "Pmn9_-b4FJZZYGPMqV7ckQ", "text": "STUPID EXPENSIVE !!! not so much a fan as beeing more of a hater!! don't get cought slipping here with an empty gas tank! you WILL cry as the little hateful digits on the gas pump laugh at you!!!!", "business_id": "uPRz5JI11QQpwgNnSZZzaQ", "stars": 1, "date": "2012-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "0oRtnPHtvZIE1UNxCDDTPw", "review_id": "oflv28bY_-roV4kuaJvFPw", "text": "I'm glad they are open till 10pm. It's a typical Safeway with Starbucks, Wells Fargo Bank and a fabulous Signature Deli. I love the fact that they have Kale at this store and  packaged salads. Although they carry Bragg's Apple Cider Vinegar, they do not carry the Nutritional Yeast Seasoning. I was looking for it this evening and couldn't find it. This Safeway is about 3 miles from my house, so it's convenient. I found some Organic Stevia here which is great because I use it a lot. It was on sale even! I love a good deal. Make sure you sign up for a club card! You'll save a lot of money especially when the items are on sale.", "business_id": "N-18zbUr2ueTVyxuEIb6uA", "stars": 4, "date": "2015-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m2S6sQrFpI4rUONCQS_qdg", "review_id": "Mb-vW90dNay82Mkfech3gg", "text": "Ordered some shwarma and kabobs to go. The plates were well balanced and tasty. Definitely will eat here again.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pqnYZy25nEwGAAjShOpJGg", "review_id": "VvL9tRoahJRUfhgheOuj0w", "text": "The grinders & custard are heavenly, but there's too many kids standing around behind he counter & the food is expensive for what you get.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 4, "date": "2011-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DOJM58OkGSsIdk2qCUZnLQ", "review_id": "5gRBX8TdGH3l-fYx2ehntw", "text": "Great store for finding specialty items. They also have the cheapest prices I've seen for the energy bars I like. The only thing I wish they had more of is non-foods. Not a huge selection of soaps, shampoos, etc. Still have to go elsewhere for those. As with most specialty stores they are on the pricey side (other than the energy bars!), so I certainly can't do all my regular shopping there.", "business_id": "4EeLblEpJc2VeBowa94YPQ", "stars": 4, "date": "2011-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "fX2HgiA7nyc6nBCL7082Rw", "review_id": "-wzAfVdqK0Bhumt_z1kBiw", "text": "My principal problem with this place is that the high school kids there clearly don't really care about the customers too much. I don't really think that they even care about anything too much. They're lucky that their job doesn't require a massive knowledge of customer service or their product, or that store would be screwed. \n\nOtherwise, it's a fantastic place with cheap yogurt and a well-maintained atmosphere. My personal favorite so far is the mounds bar flavor. I also like their shortcake and yellow cake. Peanut butter is good, too. Any of their weird flavors are truly where it's at. I work at the teaching supply next door, so I know for a fact that the awful nail salon smell is completely outside of their control, so please, if you smell this, please take it into extreme consideration.\n\nI've also had their pretzels and cheese. It's worth getting, but they microwave them, which is a little creepy. \n\nI really don't think much of their choice not to take credit cards, because I spend maybe $2.00 when I go. In all honesty, if people don't carry cash around with them, it means they clearly don't understand how much the credit card industry ruins the fuck out of local business revenue stream. Let them take cash only, if only because you care.\n\nAll in all, worth going.", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 4, "date": "2012-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F445ZJ5AYl0BBZEede7ADw", "review_id": "dyfudzmBqQICRz8dZl5-Dg", "text": "I hate to reinforce the stereotype, but the best thing about Walmart really is the prices.  Sometimes you'll get lucky and have a nice greeter at the door or a smiling worker at a register or in electronics, but much of the time it seems like the workers don't want to be there.\n\nThey do generally have a pretty good selection and stock, but you have to be willing to fight the crowds.  Not a good option for those with claustrophobia.", "business_id": "OdXjGy_iU6MpbDUmXDU8pw", "stars": 2, "date": "2015-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rvmkSAxqOhETlPPX4Zt0bQ", "review_id": "i1ypJG1uc4YonUN969gsBQ", "text": "Cocos has been around a long time and each location can vary somewhat. It's like anything...  the people make a big difference. My wife and I ate here several times with the most recent being in February 2015. The food has been good and the price fair. Breakfast is pretty standard stuff and the lunch/dinner is very good. This last visit my wife had a tuna melt and I had the \"senior\" Angus sirloin steak served on toasted garlic cheese bread with grilled onions & mushrooms on top, along with a baked potato and veggie's. I have to say it was excellent! Additionally the typical \"more seasoned\" waitresses here are rather nice to see. What else could one ask for. In fact, the meals here were better than many \"upscale\" places we have eaten at.", "business_id": "c3xkboF2p9rfzUFpBBn_tQ", "stars": 4, "date": "2015-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6ZXbTu3isjKoD42_iKOhqA", "review_id": "dT8EOYwZC2-B9vlNiAgcSg", "text": "This place is soooo good.  Nice sour flavors (and others too)  the ice is very very finely shredded, and they really pile on the ice and the flavors.    Customer service is top notch too.  I had a sour cherry with cream in it, and it was absolutely devine.  I would and will go back here in a heartbeat.", "business_id": "KHeM4cO2DWK1C09zWCFLFQ", "stars": 5, "date": "2011-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l9GGMi-zf2ZTbHbW8wrkTw", "review_id": "QPqIST3AgRJxL8Qt6mPj9A", "text": "Stinky, stanky, dirty...but they had the item we needed to exchange so they're upgraded an extra star.", "business_id": "IrncRVjzZzL9OJsRRZXKyA", "stars": 1, "date": "2014-12-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "TESe3g-BJSdZ5H4KC7yr9g", "review_id": "Lm2DugpYWWOlm3kMcrZQog", "text": "This is the best gelato I have had.  Small place, but quality is great.  I get a small size with pistachio on one side and pineapple on the other.  Walk down to zia and check out the cd's while you are eating the best gelato in town.", "business_id": "XWpkTxBLgRXxl7g2Hw62Qg", "stars": 5, "date": "2011-12-30", "type": "review"}
{"votes": {"funny": 5, "useful": 3, "cool": 3}, "user_id": "XBHJCDzNh--mBhJkzyM_iA", "review_id": "-d2ym-41cp-Uj5UeWsB58A", "text": "Why isn't there a 6th star for really amazing things like Thrifty Ice Cream?!\n\nHave you had this before?  I have not been to this actual location-- there used to be Thrifty's all over town but now they are all gone and their ice cream is sold in Water Mart Stores.  Anyhow, back in the day, it was like 10 cents a scoop--- they have the most amazing scooper ever, it's like square shaped and perfect.  I would get the mint and chip and chocolate chip and when I would order I would stutter and get nervous that I would mess up saying: \"Mint and Chip and Chocolate Chip\".  The man (probably was a teenager but to me as a child, anyone over 12 was a man) would hand me the ice cream and I would hand him either 2 dimes or 1 dime and 2 nickles, or 4 nickels or.... well you get the point--- THIS STUFF WAS ONLY 20 CENTS BACK THEN.\n\nNow it is about $1.09 a scoop and worth every red penny.  The best ice cream ever. EVER.", "business_id": "fN3RgiXJMoYcZzn9y8JRQw", "stars": 5, "date": "2008-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_ZJanTGDypTxfm1Ut7IqaQ", "review_id": "3Wy2F--w-3HvoEuMdCp59Q", "text": "I am happy I went to the coffee rush! They got an amazing selection of coffees and drinks. Very chill atmosphere and geek friendly. Will be coming back and becoming a regular. :)\n\n[Update] - I am a regular and thoroughly enjoy Coffee Rush.", "business_id": "l1MZjZK2tLxfFRB62lQmsg", "stars": 5, "date": "2010-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2aKDLY-er3W0ZNGLXbw49w", "review_id": "kBnjPUHWcdoBJt3cLTFR5w", "text": "Fantastic service. Very friendly staff! I love sitting outside next to the lake, very relaxing and great place to meet friends. The only downfall is that the patio is not non-smoking so the air is pretty polluted. Not ideal for those sensitive to the smell or with asthma. The music is also a bit loud for my taste but it's not too bothersome", "business_id": "l1MZjZK2tLxfFRB62lQmsg", "stars": 4, "date": "2014-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6gULsnrmD6fhLXk1DVycOg", "review_id": "bhvvN-3FuXzT-frc0od0xA", "text": "I'll admit it, I'm a trendy Starbucks fanboi. But when I'm feeling something different, Coffee Bean & Tea Leaf is good ol' #2. They have great coffee, the environment is quiet, modern, and very wooden. I usually drink the white chocolate mocha, its light and smooth. I like the ice CB uses - they aren't cubes, and they aren't crush. They're little spheres that chill at the bottom of your cup.", "business_id": "iwzHQ7aBPrxKybarW5q5TA", "stars": 4, "date": "2010-01-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "X0AqSAXMZ62mu7hV0tVa0A", "review_id": "DiXGAkbeAvlSf48ANFZiYw", "text": "Reviews of my adventure in Texas were queuing up for a spare moment.  And before a moment can be spared, I am now hanging in Scottsdale, AZ.  Sadly, I didn't not have a chance to say farewell to such friendly Texan yelpers... with one awesome Elite in mind: Melody L! Thanks for everything Mel!!\n\nAnd now for the review.  This market is fantastic!  The smell?  It wouldn't be an Asian market without it.  It's a relatively clean market and so well organized -- in sections of nationalities for the most part.  You can almost find everything ethnic here and then some.  My first, and only visit thus far, took me about 2+hrs.  I browsed, studied, absorbed and of course, PURCHASED.  I got my Asian necessities, plus packets of goodies to make hush pups, fried catfish, collard greens and the such -- to show you their range of merchandise. (and yes, I miss Big D!)  I haven't discovered an \"Asian community\" and there might not be an accommodating one here.  I asked a Vietnamese cashier for recommendations, but I got the feeling she was trying to tell me not to bother.  With this market, I might have to commune in the comfort of my own home.  Asian cooking anyone?", "business_id": "5KG0A3WlC7K3DAXtrIFFjg", "stars": 4, "date": "2009-02-16", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "J9iQwRUyJtLWM7gkFhy5Qw", "review_id": "O8T9vEGf4jMAV8KkVkNXNQ", "text": "Best supermarket in history!!", "business_id": "5KG0A3WlC7K3DAXtrIFFjg", "stars": 5, "date": "2012-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LN4cXKGPaGMDHm4nP9Idtg", "review_id": "zlTTv_j9JEVznaArh8zSBg", "text": "I come here for the produce. They have fresh turmeric root,  and I like to make turmeric tea. They have some really great fruit and vegetables as well. Things you don't normally see in a Safeway or Fry's. \n\nI agree with another reviewer that a lot of the things are just junk food. I still like to come here once in a while and go up and down every aisle just to see what they have.", "business_id": "5KG0A3WlC7K3DAXtrIFFjg", "stars": 4, "date": "2014-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gkwZPibyAagIpDjqv2mPjQ", "review_id": "fy9UpJiKIqBmLiZOOjshwQ", "text": "I really enjoy shopping at this Target.It's very clean and well designed with it's layout.I don't usually do my grocery shopping here but it sure is nice to grab some groceries when i'm there.The customer service is always great also.", "business_id": "DcML-4f7oib19ed67Ruv6w", "stars": 4, "date": "2015-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "13g5LJ6s_Md9FEvhiuTaqQ", "review_id": "ndQAE3W0xvxSfmxVfxqeAQ", "text": "One of my fave places to come for a sandwich, yummy iced tea and dining al fresco.  This is a wonderful fresh market and upscale food to order place.  And their sushi is top grade and fresh..delish.  \n\nMy one small complaint would be to go back to Boars head deli meats.  No excuse not to use Boar's head.  And get some Real New York type pastrami..not this fake stuff that is way too lean and tasteless.  Other than that, appreciate the great clerks that work the counters..always nice, quick, helpful and knowledgeable about their food.", "business_id": "oOo0xGOVq7cYTP1fORdoFg", "stars": 4, "date": "2013-02-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "hdZ3rlgFXctCOUhzoOebvA", "review_id": "2OGEjFmZLpG48-kNC_NmNA", "text": "I love this place! So much unique stuff! I always find things to buy!", "business_id": "809yQbiyWhniPQEeeqXuHA", "stars": 5, "date": "2013-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sG3_fRCEROn0-9TzlawdlA", "review_id": "1x_V1omXT-LJmpPjyIBjZg", "text": "Evelyn's Favorite Pasta. Enough said.", "business_id": "78IaYCf9ktUep4UhhjXbTg", "stars": 4, "date": "2012-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bmzq_nkjYqp8aWn12RJdhA", "review_id": "ZzUSydtodSN681hliX5ufw", "text": "Had a wait to deal with, but mostly because we had a large party. We ate pretty well and enjoyed our food and drinks. Of course I loved the cheesecake!", "business_id": "78IaYCf9ktUep4UhhjXbTg", "stars": 4, "date": "2015-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oadAHaxRU2NlVzyJCvrjTQ", "review_id": "HBDN3n4sF4S0rKYGukzAug", "text": "Great food at the mall.  Fresh, wholesome ingredients. I had the tuna sandwich and mushroom soup which was incredible.  Maybe the best thing I've had here (and I've eaten here a lot).  The bread is truly amazing here. \n\nSometimes their salads have too much dressing for my tastes so order on the side if that's an issue for you. \n\nIf you go for lunch or brunch on Saturday or Sunday (especially Sunday) be prepared for big crowds (hunting for a free table) and a long wait for your food.  Despite that when the food comes it's still great.", "business_id": "U9iWs_XQ88IEj_Cgawyz4w", "stars": 4, "date": "2015-02-22", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "3gIfcQq5KxAegwCPXc83cQ", "review_id": "3cBOtkeYd4rFd8j4tDoKVw", "text": "This place was surprisingly better than I thought it would be. I went here for lunch with my grandma yesterday and it was alright. The one thing I really didn't like was that their menu had too many different types of food and the lunch specials, although plentiful, didn't look all that good to me. So we decided to share a few apps. We got the spring rolls, lettuce wraps, and the mozz and tomato salad. The salad was pretty good, the balsamic on it was tangy and it was a decent deal at 3$. The spring rolls were also just alright....they were like a tex mex spring roll....the plate has a lot of rolls, but the sauces they serve with it weren't very spicy or flavorful. The lettuce wraps were kind of the same way.... they were a bit bland, not bad, but not good. We ended the meal with the triple chocolate pizookie. This was the best part....super chocolatey and delicious. I'd go back if I were in the area, but for the price, it isn't anything special.", "business_id": "IMGW6y8wHQCfr_6k-YXg_A", "stars": 3, "date": "2011-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "X5yrqZ7dozeV8KkN9FYqBg", "review_id": "EeGl02upzic93huzh1qwYg", "text": "I absolutely love this place! Beers are amazing there, the Piranha Pale Ale is definitively my favorite. \nFood is also great, I tried several things on the menu and I never was disappointed. Their lunch specials are very good deals. Refill soups and salads.", "business_id": "IMGW6y8wHQCfr_6k-YXg_A", "stars": 5, "date": "2014-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gY3bzXneuv3W-7zP2qqfNw", "review_id": "_vf660t90EtVaz3sFkxleA", "text": "Food and beer were good but the atmosphere sucked. I was there watching the NFC Championship game and we were cheering (not obnoxiously mind you) during the game and kept being asked to keep it down. Are you kidding me? Needless to say they were a bit full of themselves there. I won't be going back to that hoidy toidy place again. Went across the walkway to Buffalo Wild Wings and had a much better time there.", "business_id": "IMGW6y8wHQCfr_6k-YXg_A", "stars": 1, "date": "2015-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5Y5SpVupKfweDWUOYiy-_g", "review_id": "PcxAUy-VsgirIVVK1S66Rw", "text": "Gave them another chance, Saturday morning, 9am, they are out of these bagels: 6 cheese, plain. Asiago, and two more, I dont remember the names. That was the last straw. I left and went to another location at Baseline and Gilbert rd. They had a complete selection. I cant go to the Val Vista store anymore!!", "business_id": "BKEvR0umqWp7q8_q4hTpWQ", "stars": 1, "date": "2013-02-10", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "085TP4qzSt6sr2COT4lVCg", "review_id": "DiwXHl9QnIeNghmD5LdGAQ", "text": "I can't really say enough about Liberty Market. The place is beautiful, comfortable, friendly and the service is awesome. I haven't had anything that I didn't like. From the wood fired pizza to the delectable salads, everything on the menu is worth every penny. For me though, it's all about the Cortadito (espresso drink) and the pastries. These are completely off the chart awesome! You simply MUST try them!\n\nAnother great plus to this place is that on just about any given day, you can visit and see Joe (the owner), hanging out, chatting with customers and all around having a great time. Joe is truly one of the nicest and most sincere people I have ever met. Makes Liberty Market all the more worth visiting.\n\nOh! As weird as it sounds, you have to check out the bathrooms, they are the best I have ever seen. (seriously)", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2010-01-20", "type": "review"}
