{"votes": {"funny": 1, "useful": 6, "cool": 1}, "user_id": "HWi8ntFMy81BVjAsgAwbrQ", "review_id": "sTJaROEzpumM9hHUcOZXEw", "text": "Easily my favorite camera store in the Phoenix area. \n\nThey've got a wide selection from compact digitals all the way up to large format view cameras, along with everything you need for your darkroom, and a wide selection of film and paper. Being directly off the freeway also means they can often be faster to get to than other camera stores.\n\nPrices are competitive and the staff is very knowledgeable, friendly, and patient. Whether you're a first-time buyer or a seasoned professional, they can answer your questions and get you what you need. They're also very cognizant of wait times, with staff dropping what they're doing to get you helped or checked out.\n\nThe rentals desk is well-inventoried and the rentals staff are friendly, making it easy to get what you need, often even on short notice. Low equipment deposits also make it easier to get what you need, as you're  required to front only 33%, rather than 50% or even 100% of the replacement cost.\n\nIf you need a camera bag, Photomark has the best selection I'm aware of in the Phoenix area. All the major manufacturers are represented, and there are far more models available than at other camera stores.\n\nThere are a couple things that tend to scare new customers off unnecessarily. First, it's in an older (not \"bad\") part of town, which tends to freak out suburbanites used to newer construction, fewer minorities and homeless (and homeless minorities), and more standard traffic flow. I've never had a problem, nor has anyone I know. You should lock your car, but you don't need to brandish a Taser or wear Kevlar.\n\nSecond, the parking lot is small. Especially if you don't realize Photomark owns the entire center, it seems like there's far too little parking--but they own all three businesses and you're free to park anywhere in the plaza. Still, it's best to avoid going around midday, as it can be difficult to park during the lunch hour rush. It may also be ideal to take a smaller vehicle if you're not intimately comfortable with where your sides and rear and are.\n\nThe biggest downside to shopping at Photomark is that unlike Tempe Camera, they don't break down pro packs of film--if they don't stock or the manufacturers don't make a given film in single-roll packages, you're stuck buying an entire pro pack.", "business_id": "GiElN3AF8N4ZpfH6PNRjdg", "stars": 4, "date": "2007-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oyxFmBxFNii6kvRMKwHSuA", "review_id": "tmIjfJOFd9mdD6HryBojLQ", "text": "OK, after the Thai place at that location closed I began to wonder what will open in its place? At some point this was also some kind of Mediterranean restaurant, but never went there. After almost two months of watching people come in and out of that place, they were ready for business. I was a little hesitant at first, but I walked in for lunch and I really liked what I had, but, I noticed that they a pastry display and began to wonder what kind they had. So, about three weeks after my initial visit I walked in and went straight to the pastry display. I purchased a couple of croissants and two of what the owner described as King's Torte (an Epiphany staple). Although it set me back almost $20.00, I must say it was worth every penny. I haven't returned for lunch, but I make at least one stop a week to get my sweet fix. You have to try it one day.", "business_id": "wftoNIA0Q8nX-Da47psBCA", "stars": 5, "date": "2012-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SHgrPgUa3jUl_M-PaeEHiA", "review_id": "_9XfljKgRs4dT5Xt_ButiA", "text": "Awesome Company. We took the ATV tour with Chad. Chad was very patient with my 13 and 12 year old boys, both beginner riders. He watched them carefully and assessed their riding ability and comfort level before we got on the trail. In addition, once on the trail, he provided them guidance on the upcoming trail technical details. His teaching methodology was perfect for my boys...serious enough to point out the hazards but supportive enough to give them the courage that they could do it. We will be sure to take another tour with Stellar when we visit the area again. The trails that Stellar has access to are technical enough for more experienced riders as well. Best of all, Stellar received excellent reviews from the locals we talked to.", "business_id": "pLIEBQRP9hDG9T2OWDX04w", "stars": 5, "date": "2015-12-24", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "fi5y6-daDzTIQ7wOKaR7xg", "review_id": "lpbcJ0h-Raap6RfzwSPkvg", "text": "This is the single best restaurant in Arizona. I have been here several times and it is consistently delicious. Eating at the chef's island is lots of fun, Chef Marcellino is great. The servers are on the ball. This restaurant is 5 star.", "business_id": "MLVKDbuI2xaOJQ4-NZj2MQ", "stars": 5, "date": "2013-02-20", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 1}, "user_id": "AOSAYR_1rFVVGGY1ajEZ3g", "review_id": "GSf4Px1Z3urbBeErtHwdAg", "text": "I am so surprised that this only have 2.5 stars. I use their service for my car for the past three years. The service is simply great and kind and effective. It's not cheap but it is Lexus. If I call and leave a message they always call back. The service is always done on time. I always get followup calls from the service manager. Compared with other companies, the service definitely stands out with this brand.", "business_id": "1pYcTdg1n7_S867aR4SAvw", "stars": 5, "date": "2013-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "9qrey_kl_L6Jn7o2D67xeQ", "review_id": "H-CPuT4m4FJk6xi58Xku2A", "text": "more like they scare the owners so they get a whole bunch of unneeded procedures, medicines, and tests done. i have two healthy and wonderful kitties. within the first couple of months i spent like close to 2000 going here for a different problem everytime. finally my friend said to me who do you go to, are they scamming u? i realized maybe not all of this is needed. i stopped going and everything has been fine. in fact, i talked to another vet who said the awful sulfur baths i had given to my cats (which they hated and i hated) was not even needed. the other vet also said i didn't need all these shots they said i did since their indoor cats. yes did they clear up my cats original problems coming from the shelter of eye infection and respitary infection sure, but then they continued to say they have this wrong and this wrong and i'm not even sure what was found in their stool, etc.... there is no way i could pay all those vet bills and afford to keep them. They do try to find homes for stray cats and I do applaud that and they are very nice, but that's about it.", "business_id": "fa2_5ccWEYEpIIa-h6EGQQ", "stars": 2, "date": "2012-12-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "5jODkdonMV0HbIIPik1RuA", "review_id": "ExlhHN3qrTY7PfFKXxdl-A", "text": "I went for the first time today. I had fun playing the video games while waiting for the 5:10PM race but oh my gosh, it's SUPER expensive. Mine and my boyfriends total was like $47 for 10 minutes ~ EKKK!!! When I told the girl at the front desk it was our first time, her response was, \"the next race is in an hour.\" I didn't even know it was at certain times, wish everything was explained a bit more.", "business_id": "YO_ngkGvdFKjiQmIP89YZQ", "stars": 3, "date": "2013-12-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XCdwv4WmVRrmoljNADGubw", "review_id": "3_QdidJvEL20w6I2loTXYQ", "text": "How could you not just love this place? Everything about it screams wholesome, clean family fun! \n\nI bring my 4 year old here as often as we can (Going this afternoon as a matter of fact) but the truth of the matter is, I'd go by myself too! \n\nThe trains are fantastic, the carousel is a classic, the model train clubs are loads of fun, the playgrounds are clean and well kept,  the Ice Cream from Hartleys is delicious, and if that weren't enough, there is LOTS of wide open space to fly kites, throw a ball, or just run around. \n\nThank you Scottsdale!", "business_id": "X3icXUyW9vS4UXY6V_MR4w", "stars": 5, "date": "2010-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4VjzytQbNQB1LBoV1qg_CQ", "review_id": "iMVTQVQzAj8Fp4KrXn__GQ", "text": "I came here when I was a kid... And now I borrow my friends kids so I can ride the train! Doesn't get better than this!", "business_id": "X3icXUyW9vS4UXY6V_MR4w", "stars": 5, "date": "2013-02-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TJMWZL2WkeUnhX310nOlJg", "review_id": "68buLcefWzFqz7zK2mmang", "text": "What a great park! My kids love the railroad train ride. I had a great time relaxing, while my daughters played on the monkey bars. It wasn't crowded, which is wonderful, but I imagine it's depends on the day. The little general store is really darling and reminds me of the novelty shops back when I was younger. The icecream wasn't the best, but the kids enjoyed it. There is even an area you can learn about the history of the park. Surprisingly, it has been in Scottsdale for a long time. I would recommend it for birthday parties and weekend BBqs. I gave it 4 stars instead of 5 because of the wait of the railroad train ride, otherwise it is a nice, family spot.", "business_id": "X3icXUyW9vS4UXY6V_MR4w", "stars": 4, "date": "2015-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "xVsZhvozDEgTO_1x4gZTRw", "review_id": "B6yYhveV-XTczm7X4qeqeA", "text": "Since Paulene's is walking distance from my job I went in for a simple eyebrow wax.  What a waste of my time and money.  Technician did not listen to any of my simple request like making the brows a little thinner.  Tried talking to the \"Manager\" who was completely unhelpful and unconcerned.  I walked out of there a complete mess.  Poor service, poor value for the money, poor overall experience.  Skip this place", "business_id": "5IO32LUAX4b-nD13fxKsIw", "stars": 1, "date": "2015-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1zjPzcFdboSqis0Fkhccdg", "review_id": "Zjb-lvIRuAXQIYIiQBXwew", "text": "U Gotta like this place.\nSoups - matzo ball, kreplach, cabbage, borscht - all top notch. \nLove the chopped liver, Kasha Varnishkes. Sandwiches all well done.", "business_id": "TpQMR-JFE5V0UPzTjjuwFQ", "stars": 4, "date": "2011-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uLW2sbW87sCIqxY02tqu8g", "review_id": "tB1ROrhVarYWcgrJrxzBQg", "text": "I love Petco!!! Their groom shop is super clean and really open. They are very careful with our dogs and they love coming to Petco.!!!!!!!!", "business_id": "GIAcSwgHtT-ookKK4-dsLA", "stars": 5, "date": "2014-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "2t8z2r3KYbBpZUH_uq9yFw", "review_id": "pstniiK47KIyb_rwblkhBA", "text": "Not sure where there are so many bad reviews here. I mean this isn't a specialty car wash. It's just like most, fairly inexpensive quick interior/exterior wash. They have a nice facility, nice people & get your car washed pretty quickly. They actually did a much better job than most car washes...Lindstroms in Arcadia will always be my favorite car wash but this place is way better than most car washes & they did a way better job than a Danny's or most others would do.", "business_id": "gnBgJD6LYsYhSneYVFDmhw", "stars": 4, "date": "2015-02-22", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "XgIhw-aWaq_Fx3ZVQGjnuA", "review_id": "kpfYHQVkM3UwPnWBZrkpZg", "text": "Flemings just gets better and better!  I dined at Flemings this week with my family and some good friends from Germany.  We were thrilled with the meal, the service and quite frankly the class shown by Flemings at every turn.\n\nWe all had steak but I can only tell you about mine because I was in heaven.  I had a filet that was bacon wrapped and was just so delicious I do not think I will be able to top it anywhere.  The sides were all delicous and the Flemings potatoes were decadent and tasty.  Everything was served hot and service really truly was impeccable.  \n\nThe wine we enjoyed with our steak was a nice red from Napa called Argus.  It was really really tasty.  \n\n\nThe manager, Scott, came and checked up on our table and exudes all that is good about Flemings.  He acutally cared about our dining experience, made eye contact, and was clearly interested in our happiness with Flemings.  Flemings, learn from Scott!  He is a talent that should be valued.  \n\nOur deserts were also impressive all the way around.  One of our guests was celebrating a birthday and got a packaged gift of chocolate covered strawberrys from Flemings.  It is a small touch that just speaks volumes about their customer service.\n\nAfter this visit to Flemings, I am convinced that they have surpassed Ruth's Chris, and Mortons in my book.  These guys get it, and you get a damn good steak!", "business_id": "9AbyBqGWHYZC73GlyAuTrQ", "stars": 5, "date": "2009-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vs-xPGoRlAxDxmhk6MIXcw", "review_id": "a0lU-TNR_nqPRtD1f0gegg", "text": "This Flemings is one of the best I have enjoyed.  The manager and staff go out of their way to make your meal the most pleasurable experience possible.  You can not go wrong with this restaurant.  We recently celebrated a birthday there on a Saturday night and they made my family feel like they were the most special group in the restaurant.  OH - and the food was excellent.", "business_id": "9AbyBqGWHYZC73GlyAuTrQ", "stars": 5, "date": "2012-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "DfJ8B8T1fgNA6_ZT-aeUlQ", "review_id": "a7u0vhXb3MU51LNO2hT76A", "text": "I don't know what has happened at Flemings tonight, but the place was  totally falling apart.\nTough prime rib, lousy service, and people running all over the place trying to get it together...not a good experience at all.\nWe waited for someone to come to our table to get our dessert selections, drink refills and our check for about 50 minutes.\nI don't know what was going on, but I doubt we'll be back anytime soon...", "business_id": "9AbyBqGWHYZC73GlyAuTrQ", "stars": 3, "date": "2013-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kRwKFiVwxGxVIaiddDNTug", "review_id": "Loo4xFv6tMi8NPdBR4DEhA", "text": "I have been to dinner and HH here.  Both visits were fabulous.  The steak was one of the finest pieces of meat that I have ever had.  The tuna appetizer was delicious.  Tonight I had the HH hamburger for the amazing price of $7 and it was as good as any $15 burger in town.  I'll be back!", "business_id": "9AbyBqGWHYZC73GlyAuTrQ", "stars": 5, "date": "2015-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Gb3bSlWT73CGfslNdR4udw", "review_id": "QQFMA1RypiTBQ-6SufMWPg", "text": "Great pizza, excellent delivery time & if I ever come back again I would definitely go there.", "business_id": "n_HvrTuGUgxXJM0yq39-0g", "stars": 5, "date": "2014-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "BeRKc4TCkWEsZZlxITmRLA", "review_id": "cphBOzbK56QUmsmJHzPN0w", "text": "I was told when ordering my blinds in the store on 12/11/2014. I was told that they would be in on 12/25/2014, I certainly did not expect to pick them up on Christmas day, but assumed maybe a day or two later they would be ready to pick up. However the date came and went and we didn't get a courtesy call to let us know that they would be in later. Instead we called, waited on hold, and got transferred around to multiple people for over 30 minutes to get in touch with a sales associate. She was friendly and have absolutely no problem with her. The problem I have is that I was told the blinds would be in by 01/25/2015, and they are still not in. I understand they don't have control over vendors and the way they do business, but this situation could have been avoided had someone from the company stepped it up and decided to give a call letting us know what was happening. This makes me want to never shop at the store again, and tell everyone I know about this experience. I would give it Zero Stars, if the option was available. I don't remember the last time I've been so dissatisfied with a company, it's no wonder I always go to Home Depot.", "business_id": "xrNL6b5x1W1begCWFDduIw", "stars": 1, "date": "2015-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "2FtCOwNwd6UsBgScSc1_Ug", "review_id": "o55Aj78PKQssZkgpqcI0rg", "text": "Can get a bit crowded -- not uncommon to see a line leading out the door on weekends.  Couple this with the fact that servers are in no rush to seat people... \n\nStill, a great place to grab quality sushi.  And the prices are not outrageous.", "business_id": "Bjt3rB73dvSDe1XEPEWc6w", "stars": 4, "date": "2007-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LaEj3VpQh7bgpAZLzSRRrw", "review_id": "9CWhSIog7c_uG2zVcRgCxg", "text": "I like Sakana! \n\nGreat food, friendly service, and very casual/family-styled atmosphere... I was here twice in the last two weeks, both visits were great! Their price is very affordable compare to any good Japanese restaurants in the valley, and the rolls aren't small at all! \n\nJust come hungry and you'll leave happily satisfied ^.^", "business_id": "Bjt3rB73dvSDe1XEPEWc6w", "stars": 4, "date": "2010-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "q1i41qr-zNBDj42dhB16Ww", "review_id": "GJF1VMRbJsP9Ixdrh-OdKg", "text": "I have been to this sushi place at least a half dozen times. The first couple of times I really liked it, the sushi was inexpensive and had good sized portions. After going a few times, I began to notice how bad the service was. The waitresses are rude and act as though you are wasting their time. They bring out the food in the strangest order as well. Today when I went (which will surely be the last time I go) they brought out miso soup and the sushi I ordered at the same time, followed by my dad's stir fry and followed much later by the sushi my mom ordered. And the edamame came last. Very strange.\n\nOne thing that I noticed today in this particular location was that the entire place smelled like cat pee or a litter box. We sat there for a minute once we sat down trying to decide if we should leave or not because the smell was so terrible. Then, a group sat down at the table next to us and immediately started talking about how terrible it smelled. We gathered that the carpets in the restaurant were a little wet so they had just shampooed the carpets and had not let them air out properly to dry so they started to smell sort of like a wet dog. Which was disgusting.\n\nOf the rolls I ordered today, one was the Vegas roll. I've had many of these at many different sushi places. Traditionally, there is cream cheese, salmon, tuna and yellow tail and some other stuff. The \"vegas roll\" at Sakana was a huge chunk of cream cheese, a huge hunk of salmon and some cucumber. No other types of fish. Eeek. The only flavor that stood out was the salmon. \n\nSo naturally since the roll was no good, I didn't eat it and when the waitress asked if I wanted a box, I said no, the roll wasn't good at all, I didn't like it. Instead of taking it away and asking if she could get me something else to try, she leaves the roll on the table and walks away to get the check, which she left the Vegas roll on. \n\nThe whole thing that irritates me about this place is that I know this review will not make a difference. Even though I have had several bad experiences here, every time I go it is completely packed. There is something about this place that people seem to love and I just don't see it.", "business_id": "Bjt3rB73dvSDe1XEPEWc6w", "stars": 2, "date": "2012-12-20", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 1}, "user_id": "sLfKuyOFXPP8WbqGgsKouA", "review_id": "FbVELQUZjseeiBrVut3RAw", "text": "I'm not much of a golfer. There. That's how I chose to start this review. So take this for what its' worth ... \n\nI've played maybe a dozen times, usually public courses in miami/orlando/atlanta. I was in Scottsdale for business and had a day off so I took advantage of this by making a tee time online for 3:15pm on a Friday the night before. 18 holes and cart included was $30. Free tees, and another $25 for rental clubs and I was on my way. \n\nI got to play by myself (bonus, because I hate slowing people down ... I mean, I shot 110) and enjoyed this 18 more than any other (except for a course I once played in Orlando with my father, for sentimental reasons). \n\nThe course was very well kept, much better than any I've played on in Miami or southern LA. First time playing in Arizona was beautiful and amazing to appreciate the contrast between the red clay and green, green fairways. \n\nNot much water, but just enough for me to lose 3 balls in it (I lost 9 total, again, I'm not that good). Freeways line the start of the back 9.  A little distracting. I think I hit 3 balls into ongoing traffic. Regardless, it only got better from there. \n\nGorgeous 13th and 15th and 16th holes, among the others. Beautiful semi-island par-3 on 18. I played until dark, nailed a 20ft put, almost birdied 3 in a row, and had an awesome time - very memorable - and happy as hell I took the initiative to play 18 on my day off even though its not my sport. \n\nI would recommend it. This course was beautiful.", "business_id": "KHoBFKiWf0pJntUzDQPkgw", "stars": 4, "date": "2008-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "DFQ95g3s1oi-VcDZEO2TOA", "review_id": "M1CkiAJVJkiyGbIpMPqIkA", "text": "I have to agree with this other reviewers and I wonder if the success of Chompie's may have taken on more than they could handle? I think the food is pretty good, really I think the bagels are probably the stars. But like the others, I felt like we waited an awfully long time to get our meal and the waitress never came to check on us once. I would have liked another cup of coffee but she wasn't even the one who brought our food. I really think that the place seems like it is chaotic and just has way too much going on at one time.", "business_id": "IM-9thHqQbBK5tX5MfTzBQ", "stars": 3, "date": "2010-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jO_S-B2GjqekxV4cFgXkzQ", "review_id": "A-AdgHSsTHoVbxyeqvBCcw", "text": "Pastrami is fabulous. Most flavorful and tender we've had. If you want a lean meat then don't go pastrami-ever!  We couldn't believe the generous portions. The matzo ball soup is a must try, unless you're not a fan of a dumpling style soup. We recommend the sweet potato fries and the potato salad. The coleslaw is good but we tend to like it a bit more vinegary than it was. My friend thinks it's a bit pricey, but I willingly pay a few extra bucks for food prepared fresh and not from a bag. And if you want fresh you'll love the garlicky pickles. Yum!", "business_id": "IM-9thHqQbBK5tX5MfTzBQ", "stars": 5, "date": "2012-02-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0Hmez6GVD2c_mGkhCgP9PQ", "review_id": "-oDjjDUsQAIhFRfDy16dbQ", "text": "Very disappointed by Chompie's today, it seems they have gone downhill in their food preparation in the last year or so.  The restaurant is also outdated and needs some fixing up.  The cheese blintzes which used to be authentic are not water down to a real sweet treat rather than what they used to be.  Their bagels, well they are not longer the original bagels they used to make they must be skimping on the flour and not boiling them as real bagels are boiled.  the fruit cup they give with breakfast is small and only about a mouthful when it used to be much bigger and the hashbrowns mixed with onions is way way salty avoid at all costs.  Will not be going back disappointed in the quality of food.  The service was great, but the food was not even 2 stars. Oh yeah they do charge 1.50 if you want real maple syrup with your hotcakes otherwise they give you syrup with high fructose corn syrup in it.", "business_id": "IM-9thHqQbBK5tX5MfTzBQ", "stars": 2, "date": "2014-02-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "z8Hftv5oxJ7RuoeOPHWmbQ", "review_id": "tADe7UfjoH-9Zqi1rALdsg", "text": "Corned beef very bland .Price to high not like Chicago.", "business_id": "IM-9thHqQbBK5tX5MfTzBQ", "stars": 1, "date": "2015-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iVqLdVGkZgftmIdfp6zHHA", "review_id": "RMTeTpSRB-RSIuC6KKDdsA", "text": "Truly a weird place.  I don't think this place knows what type of asian restaurant it wants to be.  The menu is all over the place.  It could be chicken teriyaki place, or could be a thai place, or it could be straight on chinese.  I don't really know.  And so, it's sort of the weakness of this place.  I got the Lite chicken off their menu, which should be their specialty, but it was nothing to write home about.  It was cheap at least.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 2, "date": "2013-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "rLtl8ZkDX5vH5nAx9C3q5Q", "review_id": "SPW5zI4dfZDVrcPLdfTigw", "text": "My wife and I went here with a friend last night.  We had reservations for 7:30 and like always the place is jam-packed.  I have been here 3 or 4 times previously for dinner and it is always the same.  It is almost impossible to find a decent parking spot or be seated in under 20 minutes.  Well I guess good for them for having such a busy/popular restaurant.  Anyway, as per usual we were seated about 20 minutes late.  About 4 waiters/hosts/etc. came up to us to tell us how truly sorry they were so that was kinda nice.  They even gave us a spinach dip appetizer (my wife's absolute fav) on the house so that more than made up for being seated later than we should have.\n\nI ordered the Caesar salad to start and it was excellent as always.  I LOVE the croutons.  For an entree I had the ribs per my wife's recommendation.  My wife is a huge Houston's fan and has been there dozens more times than I so I trusted her opinion on this.  Anyway, she was correct and they were excellent.  They weren't overly sauced and the meat was fall off the bone tender.  The fries that came with were also very good.  My wife got the halibut and it was just ok.  It was very plain but she enjoyed it so that's what counts.  Our friend had the filet and it looked excellent.  The food there is always pretty solid and you always know what you are going to get.\n\nMy only complaint is that because it is so busy, the waiters/waitresses/etc. get a bit overwhelmed and sometimes forget things and take a bit longer than they should.  I guess it isn't their fault but is probably Houston's fault for not hiring more service staff.\n\nAll-in-all it was a very good dinner.", "business_id": "jBb5KHHAj4s8hcXVS6QXDg", "stars": 4, "date": "2010-02-03", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "VgdDYz0-i1kDszfEu5nFdg", "review_id": "nf_TylOFZ8hhBYz8hQnJZg", "text": "Houston's is good but definitely not the caliber that they used to be.  The service was sub-par, the food was good this time but has been hit and miss the past couple of times.  They are missing the consistency that you used to be able to rely on.  Also, when we ordered a birthday brownie, they didn't bring a candle and they billed us for it - SERIOUSLY?! (the waitress knew as she said \"oops, I forgot the candle\")  Between that and charging $3 PER soda, it just seems like they are nickle and diming their customers to death.  J Alexanders has the same food with the same hit and miss service so, why pay more at Houston's.  \n\nThe food we had this time was their spinach/artichoke dip with chips and we each got their chicken salad which seemed to have more peanuty spice to it which we enjoyed.  Their brownie dessert is to die for....probably literally with all that sugar but oh so good.  The total for the food and 2 sodas and tip was $70 (no alcohol!).  You can go to a lot better places for $70 or spend half as much for the same food across the street at J Alexanders.  Houston's no longer offers anything that distinguishes themselves or makes them worth it.", "business_id": "jBb5KHHAj4s8hcXVS6QXDg", "stars": 2, "date": "2013-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kpbhy1zPewGDmdNfNqQp-g", "review_id": "62kZKoemCv2r2RFnwFFr-g", "text": "We've been eating at Houston's as long as we've been in Arizona (15+ years).  I don't know that we've ever had a bad meal.  The burgers are out of this world.  The veggie burgers could win any carnivore's heart.  The ice cream sundae is perfection - chocolate ganache that isn't hot and doesn't turn my decadence into soupiness?  Yes, please.", "business_id": "jBb5KHHAj4s8hcXVS6QXDg", "stars": 5, "date": "2014-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bNdpHGJih60g_ACWVnqPHw", "review_id": "vyLYFw4D9y3EKu0mfinEGw", "text": "While the food is one of our main reasons for coming back, the service is the reason for my review being written. We've been coming to this Houston's for about 15 years and the service has always been reliable and warm but our last server really raised the bar. We had JC(?) at lunch last week and his poise, polish and ease left nothing to be wanted. He has the finesse that you'd expect from fine dining. Serving is not an easy job and he really nails it. First time we've had him and we really enjoyed our experience. Went in after a rough morning and lunch completely turned that around:) Usually we have Amanda and she's the absolute sweetest. Has the warmest demeanor and always delivers a perfect meal anticipating our needs so intuitively while keeping a very smooth service. One goes out to eat to be free of stress and these two definitely achieve that here. We'll definitely be back and we'll be asking for either Amanda or JC:)", "business_id": "jBb5KHHAj4s8hcXVS6QXDg", "stars": 5, "date": "2015-12-02", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "YIiQx-XtRVKWVQ4LCaEuLA", "review_id": "QZmbzPIzjIuT1aI9ddivfA", "text": "Ive been going to Randy's for years, ever since they were at the old place which is now a Safeway.   Needless to say I've had just about everything on their menu. Randy's used to be a reasonably priced restraunt with great food, but it has slowly turned into an over priced restraunt with smaller and smaller portions.  Breakfast is still a pretty good buy, but lunch and dinner are simply not.  I just came from Randy's and had the buffalo chicken salad like I have so many other times.  The salad was $8 and looked like an oversized side salad.  I have noticed this very same thing on many of there other meals.  I ve probably have had my last dinner at Randy's tonight but I may make another breakfast trip.  To end on a good note the servers are usually the best!", "business_id": "68_EJEA9Ibo55EDp3d-nOg", "stars": 2, "date": "2012-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bR2ugy-5Ow7lZURfPxkGUQ", "review_id": "rALB_LRdpls0vsh2J27reQ", "text": "The food here is amazing, and the service is lightening fast!  The food was out within 10 minutes of us ordering, and it tasted fresh.  The prices are very reasonable, but be sure to bring cash!", "business_id": "68_EJEA9Ibo55EDp3d-nOg", "stars": 5, "date": "2014-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EMozBNp8erN8FvzpAWo0jw", "review_id": "RuH0V9gw6AOvH2iz7Z0T3g", "text": "Recently we had our pool remodeled by Corsons. We had a fiberglass pool and they changed it to Pebble Tec. We had the tile replaced, new light, new drain, new vacuum system and of course changed it to Pebble Tec finish. The sales rep. (rick) and the office person (Lindsay) did exactly what they said they would do. Everytime we had the subs out to do a job, rick was there to assure us that the work was being done properly. The subs were great, the sales and office staff were great. Rick told us that the work would be finished in 2-3 weeks and the job was finished in 2 weeks. Lindsay kept us informed by email or by telephone at every phase of the pool remodel. I cannot recommend Corsons enough by this review. We highly recommend to anyone who is having their pool redone to use Corsons remodeling service.", "business_id": "5ExCFur8Gqt1x278DAvJZA", "stars": 5, "date": "2015-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eZTNl3u9ao-8YzGKLBxCGA", "review_id": "KaCs09jAM07y1lw9lQBwfw", "text": "The nail polish chips off less than a day! They don't massage your hands like they do other salon's. Not worth the money.", "business_id": "8gWdTXQKpYZ8YlLGBfGJmQ", "stars": 1, "date": "2012-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "k-PzH1mY7G4jANPeHCNBxA", "review_id": "wFdhxYdvnvUSRNwJRRdJLg", "text": "For the price I'm giving it 4 stars. It's this summer season and it was $67 a night. It's not a fancy resort but it had enough amenities to make me happy while I was taking my son back to school. The rooms are spacious & the beds are triple sheeted and comfy. Two clean swimming pools & a decent fitness center. Skip the buffet it's not worth the price. Over all you get a lot for your money.  I will seek this spot out again.", "business_id": "CD-2yHTSObgvAhW-pYHfMw", "stars": 4, "date": "2012-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lwppVF0Yqkuwt-xaEuugqw", "review_id": "eMM2YxsuCudhj2-pGjBJzw", "text": "I love this speciality running store!  If you're getting into some regular running, want to start, or need a good pair of running shoes definitely come here and get their expert advice.  They'll get you fitted with a great pair of shoes, have you run for them, and really know their stuff.  There's also a great stock of clothing and accessories.  \n\nSRC also offers group runs and put together a great pre race tent for PF Chang's Rock n Roll 1/2 marathon and maration.  It may be hard to find back in that corner, but definitely try them out!", "business_id": "2n3D9CmigVKmj7Jz3zKhnQ", "stars": 5, "date": "2009-01-09", "type": "review"}
{"votes": {"funny": 4, "useful": 2, "cool": 0}, "user_id": "aqp3xf7F7FMeSyWZzJbPug", "review_id": "fgeKxuxq2uWDB7gZrOxWDw", "text": "Nice hotel for for show and decor only. The night manager behind desk not the most friendly and was not willing to put my Hilton Gold number to my room for credit of stay of two nights. He said he could only put in one number and put in my other crew members number!! Walls were also thin and definitely not sound proofed. Both nights there was a couple doing the \"horizontal hoola hoop\" and making all kinds of scary sounds  The next night the headboard in the opposite side room was just slapping my other wall without all the oohs and ahhhs and \"f~*k ya's\" from the night before !!  Now I'm in the bathroom shaving I can hear that very same couple thru the air conditioning vent like they are showering together with me! \n2 stars for the decor and design only, but definitely needs soundproofing.", "business_id": "ZRrIwqIUMII1b2keMI8QRw", "stars": 1, "date": "2014-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XqMkm-DD9VsdcKx2YVGhSA", "review_id": "WSmvU1m7lv_hwuW3Wbc0TA", "text": "I didn't even know this place existed!\n\nIn any case, naturally I ordered a burger since I gather its sports bar and all.  The Arizona burger was actually pretty good and the portions were fair.  I generally order a medium done and they hit the spot.  Love the steak fries that came along with it!  Overall food was real good.\n\nAmbience is my problem; I gathered it was for patrons of the hotel.  However, what kind of patrons; I don't know.  The place seemed outdated and very conservative.  Yawn!  Sports bar?  Did anybody catch that play on the old CRT TV screen....haha okay that was a joke, they had LCDs.  Point being it was a quiet night I attended and since our group was pretty large we sat in the \"bridge\" room I call it.  Since it connected to the next building.  Needless to say too quiet for my taste.\n\nHowever, service was good.  The food came quick and the waitress was extra careful and sensitive to our time.  Kudos!  Overall, if they can just bump it up a notch to make things more exciting this place was be fine. - Enjoy!", "business_id": "bx5Yc7-_E8wz3Lahpq88mQ", "stars": 3, "date": "2011-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_Ly15VDGZwZPjTsd0ZoBVg", "review_id": "bF5IRpdqU7H-vlRYccXHuA", "text": "What an amazing hotel! The complimentary breakfasts rock, the rooms are spacious and just perfect! Our room had an awesome side view of camelback from the balcony and the quiet environment was the best. Though it was quite chilly to go swimming, I do regret not swimming in their heated pools during my stay. I would definitely stay here again!", "business_id": "Xe-zwcsX5EikIK6Ul5bGlw", "stars": 5, "date": "2011-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "la5tJenhwnpfyl5PsEYwqA", "review_id": "iQcbVswntDlZoqycX9VBNg", "text": "Excellent shakes and soda drinks. The atmosphere is authentic 50's and the food is very good.  i have eaten their a few times and enjoyed the burgers and chicken smothered dinner. large servings!", "business_id": "kOh8ZHf8CkFQCwyfDvVJTA", "stars": 4, "date": "2013-12-27", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 6}, "user_id": "kGgAARL2UmvCcTRfiscjug", "review_id": "y0HJHA3WDlg_4nt0IZfbuA", "text": "I needed to get 4 new tires on my car.  After asking around the office, everyone recommended this location.  I made an appointment on their website for 8 am sharp.  I told the guy working the counter that I didn't want to pay for the most expensive set of tires they offered.\n\nHe gave me 3 options:\n\n$950 ($850 w/$100 discount), $800 ($725 w/$75 discount), or $725 ($650 w/$75 discount).  Prices were all-inclusive of tires, installation, balancing, alignment etc.  That was much lower than the $1,350 that the dealership was going to charge me....(RIP OFF).\n\nI went with the $650 option and within 1 hr my car was ready.  One word to describe my experience: Awesome.\n\nReturn Factor - 90% (See you in 60,000 miles)", "business_id": "VrAQFQW17w1PtJx1yx0M8A", "stars": 4, "date": "2013-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Hb49IsEZltm85wLz3uMrmw", "review_id": "Oz3aTO51BWe8zkeTxiix9Q", "text": "This place has been around for years! it is family owned by the Casella's family. They make the best sandwiches in the valley in my opinion. The turkey sub is awesome as well as the Italian beef which is to die for. The only pitfall to this place is that they do not accept debit cards, cash only.", "business_id": "kEyCMHBnohaWc81omLDfYg", "stars": 5, "date": "2011-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "T0Esg9YPuCQCyYucVmhZRw", "review_id": "AbHmzBpRYzIWmDaJJveQfA", "text": "Can't believe the great reviews for this place.. The service was good but my chicken cheesesteak sub was pure salt and not edible. Gross.", "business_id": "kEyCMHBnohaWc81omLDfYg", "stars": 1, "date": "2013-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6R_Bsxy97mYFgD48rEXwlg", "review_id": "IDAnSGxg5bHlZ3lB2xmHjg", "text": "Will Champion & his team have cleaned my windows and my neighbors windows in NE Scottsdale many times.  Never a problem,  workers are quick and thorough.  I'll use them again and again.", "business_id": "wmfaos410_PSPclaR4bkUA", "stars": 5, "date": "2013-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8GEVI2ed2dTW4_qYjYLfGA", "review_id": "TTE4wp-8F8lHf-FUiIFKIg", "text": "Breakfast spoiler totally and I have given them 2 chances btw! \n\nThe food served is usually cold- I think they wait to combine several orders before bringing stuff out to serve....ingredients not so well done, orders get mixed up and the servers are just too slow! \n\nThe least I expect is a good omelette at a joint like this and we have ordered 3 different types only to get more disappointed. They don't have a good variety of pancakes either and the maple syrup served was really bad! NO GO.", "business_id": "GhhpkAkGl4JE_M_Szwegeg", "stars": 2, "date": "2011-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "u5fvb8XW9Eb1Lq8DCLQq1w", "review_id": "VCW_v137tbuWh_nP4kM-SA", "text": "The Egg is Good. \n\nI moved away from Phoenix for a few years and had to come back to The Good Egg. \n\nThey changed the hashbrowns which is a real downer. The portions don't seem as hearty anymore, but the food is still good. \n\nI am really bummed about the hasbrowns though...\n\nAlthough this may seem like a negative review (because it is) I really do like this place...it's best not to go on weekend mornings though because there is always a wait. \n\nBacado Omellette is why I still go there...and my daughter loves the bacon, well, she doesn't care where she gets bacon from as long as she gets it. \n\nCheers", "business_id": "GhhpkAkGl4JE_M_Szwegeg", "stars": 4, "date": "2015-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0Hmez6GVD2c_mGkhCgP9PQ", "review_id": "jBOeWb5klv4LcYI8TQjcXQ", "text": "If you are looking for a healthy alternative to fast food, come try this salad bar. Some ingredients I will not eat like the kidney beans and the corn which come from a can and you need to ask the cooks which soups are actually made from scratch and which are from a can as they are not all from scratch. the menu is the same all day but for dinner the price increase $2.00 so go for a late lunch as dinner begins @ 4pm...you can stay as long as you want and sit in the new section as it is sunny and bright compared to the drabby dark old section.  Good place to a somewhat healthy meal for around $8.00", "business_id": "RbWAL8KYgUp9pNSeLSjXtQ", "stars": 3, "date": "2014-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a1MmFb3SpZCHfnsuztLMgA", "review_id": "iybCSkOHx0cxh2z1a_r8_g", "text": "A great place for great entertainment!  It is very cost effective.  I like attending shows there, but for some reason it is very cold!  I am from NY, and I've gone to Broadway a million times and the theaters were never so cold!  Here, they say it is to keep the actors comfortable.  If these people want to become professionals they have to adapt to everything!  The acting is incredible!, though!  I would tell people to go there, but be dressed properly! Bundle up!!", "business_id": "VlHp9AFc9repIF6braYCCg", "stars": 4, "date": "2015-02-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "V7vbx2h3OXBo-4dgqy0ZPw", "review_id": "rV2-6hPzAguudd1uwbA78g", "text": "Excellent service! I went there yesterday in a rush to get Cardboard pieces for a frame cut in custom sizes, my boss had told me they needed to be done that day. I arrived, explained my situation and the owners there were extremely friendly, helpful and best of all: fast. I recommend this place, and I will be telling my friends about it! Really great, professional looking work.", "business_id": "ntWd0oQ2enhHBXdM0Oei3g", "stars": 5, "date": "2012-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QyT0fE0-VHhSXDM_tAgWGA", "review_id": "M4mY1dC4f5kCIVDSZkVSEw", "text": "This was my first time there, great pricing Lisa was amazing she listened and my hair looks great! I used to work in the industry and tend to be quite picky but everything was nice! Great pricing also", "business_id": "2KGjkCfKeXF5j6rNdoW8LA", "stars": 5, "date": "2014-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tKuu-Rbr-F9gb3qOhNuntQ", "review_id": "MkpltkVUZBDLApUtTW5D6Q", "text": "I like that I can get in nearly whenever I need to. What I dont like is that I hardly ever see the same person because of it. All in all, this place takes good care of me and I have a hard time going anywhere else because of it.", "business_id": "-wSSZ0v9ca0TuXOLQ0TbfQ", "stars": 4, "date": "2011-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9dO5e-uCWNJ5aEtB_thBMA", "review_id": "EUjmPq2-82TG4GxpOxdvKQ", "text": "I have a very special and rare diamond that deserves the upmost care and concern when dealing with this diamond. Anytime I have come into that Shane Co. I am greeted by a professional staff members that are eager to help me and show me exactly what I may be looking for. They are never in a hurry or pushy in trying to make a sale they truly are trying to help you create your luck that you want for your ring.\n\nI chose a wedding ring set that has diamonds and sapphires it has 21 stones between the two bands and the diamond would make the 22nd stone. Because of the nature of the center diamond I did have to go to Farar jeweler to Rod and have him set the diamond. Once the diamond has been set by Rod Shane Co. honors all warranties and will rhodium and take care of the ring as if it was a normal ring.\n\nBecause of the nature of my diamond I don't like to leave it overnight to be rhodium door cleaned every single time I have gone up there the Shane Company has moved heaven and earth to make sure that my ring is done in the afternoon time that I have available the same jeweler takes care of it he knows the ring and takes very good care of it and treat it with the upmost respect that it deserves.\n\nMy center diamond is a red 1.24 carat diamond that was created in St. Petersburg Russia with the ashes of my daughter who died six years ago. Shane Co. treats me and my ring and my diamond with the upmost respect that I could possibly ever ask for. I will never ever shop anyplace else when it comes to the careof the ring", "business_id": "BUsmaloKEZeOvXLrSjKWSQ", "stars": 5, "date": "2015-12-02", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 0}, "user_id": "9Ysj3f3tI3m5QRDxvQAIKw", "review_id": "MGHRg8faCOSZHUr_1bp62g", "text": "Nothing says midlife crisis like this here joint. It just reeks with stale testosterone. And great corporate branding I should add- with hip naming like that your sure to catch all the hot 18 year olds you can get- so long as your back doesn't go out Champ!", "business_id": "kYQxOeJRFYats6cxVFnILw", "stars": 1, "date": "2006-12-20", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "3Hu85Nyx8Kl3SPTy1Kj_xQ", "review_id": "Pic-eT6zaBMjiPXhlqLo7A", "text": "I judge all Chinese joints by their CFR. and today it was good. Very good!  They've been there for about 30 years now and I started going in there in 91. I'm getting older and their grub is getting better.", "business_id": "aI_RzGMU35cFL1St2HgPkw", "stars": 4, "date": "2014-12-30", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "933vMTGkoT6q6dC_HrlGlA", "review_id": "3l5j0i5YVzkdinKncCT8YQ", "text": "Let's start with check-in.  Once you get through the very long process at the front desk, you will be directed to the concierge for your parking pass.  At this time, you will be asked for all of your information once again (this is the 3rd time, btw, because you prepaid for this room online where you gave all your information in the first place), to fill out a survey and solicited to buy a timeshare.  Uncomfortable.  Then you'll be asked to check out the musical instrument museum. When you show zero interest you'll be asked again. You will probably want to get the heck out of there and when you do, Surprise! You get to park... no fewer than 400 steps from your room (yes, we counted). Once you get to the room you will be pleasantly surprised with the space and layout. Upon further review, you'll find all the details that will drive you crazy; a showerhead meant for someone no taller than 5'1\", a tv that's old and small and doesn't pivot off the wall, and even smaller (comically small) tv in the bedroom, and the large cabinet in the bathroom that is literally screwed closed. Turn around and see the towels for at the pool with the pleasant reminder that if you misplace one towel you' be charged $25! PER TOWEL! Good news though, you can rent one from the pool area... for $25. How convenient! While the price for the room is fair, I do not recommend this hotel to anyone who is looking for a quick, efficient, and honest hotel. Our stay at the Days Inn nearby was significantly better with zero hassle and no awkward time share solicitation! The room was equally as nice but just a smidge smaller. Save yourselves while you can!", "business_id": "40B5TbtZbiGV4blFR9S6Dw", "stars": 2, "date": "2015-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EJaoDaba5ew7Pr1r8fT4NQ", "review_id": "KFO4mxH0Dmgr5JelNVWNQQ", "text": "Okay, so I was told by a co-worker, that if you sign up for their Chef's table you'll get a $30 gift certificate send to your e-mail to be used in a certain amount of time. SOunded good and received the certificate. We went to Benihanas last night. We had been there before and the quality of sushi is good, the sake very average.\nSo, we were going to use my certifcate and had a bunch of sushi to share. When she brought the bill, they charged us $9.75 for a large sake each. They same 'average sake' they serve in a bit smaller for $2.\nIn the end we paid just as much as our regular bill going to Benihana's.\nWhat a rip-off that was.", "business_id": "ishjLG3Sc94ZOelXZZhaIw", "stars": 3, "date": "2011-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "fSDXB5MgD2s33wmdi4JC2w", "review_id": "1PrZlUvJmVWfDgMqigk-dA", "text": "Love the owners here. They are great people, and have great food. Very hole in the wall place, but ALWAYS busy. It's great.", "business_id": "FjQWjXvFCdrgdU3Rgi3b3w", "stars": 5, "date": "2013-01-20", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 3}, "user_id": "AvzoWeiZ1yMZKlYU8jB2PA", "review_id": "1is5mY56pRNfKoP3bNpRWg", "text": "I love a good dive and this place fits the bill.  Plus the food is good.  The Egg Drop Soup is a hit and a meal in itself.  It's loaded with healthy veggies.  Most places make boring Egg Drop Soup.  This is actually special.  The Peanut Sauce Chicken is also very tasty - especially if you like peanut butter.  Yum.  Don't take you prissy grandma to this place because it's 'edgie'.  The staff are tattooed and pierced from head to nose.  Lots of hard rock blaring from the speakers.  Bring you nose ring and your chop sticks.", "business_id": "iZR96moKSAWYROyL5-qeuQ", "stars": 4, "date": "2009-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "5LU-21bimh4DgdEthvf8iQ", "review_id": "NsVXLC9iXm12tqkdxWCfgg", "text": "A hotel stay a few years back introduced me to Lather...imagine my surprise to actually discover a store. \n\nI picked up a great baby gift and several of their candles as well. \n\nI love their candles. I gave a few as gifts which were enjoyed and I love my lavender one.  I also bought a lavender oatmeal bar of soap that I loved as well!  Definitely a place I would frequent and recommend.\n\nThey said if you bring in you prior bag or container for recycling you get a small discount..bonus!", "business_id": "mAMeCLoTQUf3Zb808deTYg", "stars": 5, "date": "2011-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b2tynRBuOkKaUgElbNwQEA", "review_id": "PVa2WQV_zznl6DuKzk3kaw", "text": "Great service, very reliable. If you come here ask for Scott Coleman...he's great! I always bring my car to him.", "business_id": "NP06AQ0mbWmgTLNuNqHdCQ", "stars": 5, "date": "2015-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8On_1UieEJZ6F07utqdZ5g", "review_id": "aryc1VaCzSp_3-Hh1MWjkw", "text": "My son's case was one for the teaching hospitals. Dr. Feinberg went out of his way to co ordinate with the oral surgeon who was able to save a tooth in danger of being lost due to a strangled root, and his teeth which were arranged like jigsaw pieces tossed around are now straight and beautiful.\n\nThey were so kind and respectful when dealing with my son's extreme sensory issues as well.\n\nThey are always on time, and they worked with our insurance.\n\nI would give them 10 stars if I could.", "business_id": "P-VUqVXFRZ_8-2e24C6O6w", "stars": 5, "date": "2015-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2xTUqAMJHjfzw6wGwxvTWw", "review_id": "eL3vra55k269EKPfFQI3wg", "text": "Its good pizza....We have  a Rosatis in vegas but it didnt taste the same....maybe i am used to my local Rosatis but the deep dish had too much tomatoes and thin crust was not as crispy...overall the pizza was still better than others we have tried in the Phoenix area.....", "business_id": "3ewMJEnQmtmMYp9hyT690w", "stars": 4, "date": "2013-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7Ztf1LMEz5Zm0njxc46jLw", "review_id": "vo5QTJjRfSHOIUaxAsvL7A", "text": "This replica of a Parisian bistro serves up bistro classics such as the flatiron steak, cassoulet with duck confit, and delicious pommes frites. It's a great place to sit outside at the patio cafe.  Excellent wine list with many reasonably priced French wines.", "business_id": "GIGI8bJfN6HyPzmEW-QqjA", "stars": 5, "date": "2006-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "LVXshh7j6lDfdiPK2PAG2w", "review_id": "zOsGJFI-pEmme9X_2kYVNQ", "text": "I probably would have given it a 3 star rating (very trendy and spendy not a \"bistro\" see review by TT) but my date loved it so I had better give it 4 stars. I had the lamb shank which was more than slightly over done. The scallops were however excellent. The mussel appetizers were good but pretty hard to blow that. Service was solid but a little slow. I had the house french bordeaux wine which was also good. They also have a nice Sancerre by the glass. The bar area looked \"interesting\" and was moderately crowded with elderly Manthers all hooked up with women half there age. Oh that famous Scottsdale bar scene!  I may return for a cocktail or three :-)......", "business_id": "GIGI8bJfN6HyPzmEW-QqjA", "stars": 4, "date": "2010-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "uNQI6O9qtHtmxTWo9PwuQQ", "review_id": "tcIASHgpaGg3eJWxwhhdTQ", "text": "Zinc Bistro -- very French.  Indeed a favorite of mine.  Love the onion soup and the chocolate souffle; good bread and French style butter -- a slab -- not that whipped garbage.  I ask for French slab of butter everywhere I eat and some places say it is not available.  I always say \"ask the chef.\"\nAnd, suddenly it appears.", "business_id": "GIGI8bJfN6HyPzmEW-QqjA", "stars": 5, "date": "2011-01-17", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "UV1_vsxxUdQh3K46FzaFaQ", "review_id": "JkOzn6-a8s6ajhVP0_4Sbg", "text": "The food at Zinc Bistro is absolutely fantastic! I went yesterday for the first time and had the curry chicken sandwich and bites of my family members meals. Everything was great. \n\nThe reason I'm giving Zinc Bistro three stars instead of five is  because the service was horrendous. After looking around, it seemed that it just might have been our waitress as the people around us didn't seem to be getting great service either. \n\nEverything was fine until our food arrived. When it did, I asked for another glass of water and my sister asked for some french fries. Neither came until the end of our meal. We would have asked again, but our waitress didn't come see if we needed anything and it seemed nearly impossible to flag her down. When the fries and water finally came, the waitress put the rim of the pitcher right onto the middle of the glass where my mouth had been! She continued to do this for the rest of my family! This pitcher serves the entire restaurant, it was definitely unsanitary. \n\nHowever, I again stress that it just seemed to be our particular waitress.", "business_id": "GIGI8bJfN6HyPzmEW-QqjA", "stars": 3, "date": "2012-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oG7vEqTDs2ocpf3ljyrYbA", "review_id": "1h7gYwP8xYtFebzwtxfjwA", "text": "Love this place. I have done romantic dinners here as well as drinks and raw bar. Never disappointed.  They craft food... no stove slinging. If you want a romantic evening full of amazing food and lost time, eat in the hidden patio area. Their valentines  day  dinner has always been perfect. For happy hour or hang outs with friend, the sidewalk patio affords good people watching fodder along with the fabulous  food. Don't  forget  to save space for dessert. ... if they are serving their beignets.... do not miss!!!", "business_id": "GIGI8bJfN6HyPzmEW-QqjA", "stars": 4, "date": "2015-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YsPqt0gxG60l0cJvHl_ylw", "review_id": "IZ1xWLcDfk0zwVeBOG1tgA", "text": "The Cheesecake Factory has been a reliable restaurant to me no matter the location.  The menu is diverse, the food is consistently good, and the service is generally solid.  This all rang true for my experience here as well.", "business_id": "ewZlgc22xN5NNQ1H7U6Y7g", "stars": 4, "date": "2011-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XD0H1wZ18gwTjRkzJ1anAA", "review_id": "1XFnOfcY3hLq4NyNHGkhZQ", "text": "Told the server I had a bad allergy, and it still ended up in my food.  Management had the decency to tell me what happened, but comped out just an appetizer and not the whole meal.", "business_id": "ewZlgc22xN5NNQ1H7U6Y7g", "stars": 1, "date": "2014-01-02", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "TTP7l5g4QUVCpQZ9NTAWqw", "review_id": "obepw1bvl90UxfFd5CdEXg", "text": "I am awarding this PetSmart \"3\" Stars because I think if is about average for what a \"pet store\" should be. \n\nMy #1 complaint is: \n- I work in an office where many people have Betta fish on their desk... and this particular store has the WORSE kept Betta fish selection. The little bowls the fish are kept in are atrocious! Petco up the street has such a 1)nicer variety 2) Better kept and maintained environment.\n\nI do like coming here on the weekends when they have a particular animal group bringing dogs for adoption!!! I already have 2 dogs, and can't rescue a third... but I do contribute. But it makes my day to get to spend a little time with all the dogs! Thanks Petsmart for allowing these groups to do what they do at your stores!", "business_id": "_NqBYzBVvnp8jF14cekBLQ", "stars": 3, "date": "2012-02-29", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 1}, "user_id": "LUGzqMjU1p8we9ldBnzVPA", "review_id": "bD_j2Ueq6dWMEnPcsSqBLQ", "text": "Recently went in to buy some suits for all the guys in the family for a special occasion.  Seemed like a no-brainer with all the help they offer there.  Men's Wearhouse is a one-stop shop.  Find the suit. Easy. All price ranges.  They help you accessorize.  Everyone looks like a million bucks.\nSales are good too.  They also offer dressy casual clothes.  Great jeans and fun button-down shirts.", "business_id": "RLwo3ykwR0ZzaU95Tpp97g", "stars": 5, "date": "2011-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "evYAmzE8-gNrPMeun3RlJQ", "review_id": "nmVnNkXmqoxu7YdSJ5R7sQ", "text": "Always a fantastic atmosphere and great barristas! The Mexican Mochas can't be beat.", "business_id": "I2_yeLfTzXHGwi8an0tL4w", "stars": 5, "date": "2013-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "GoymUzKqvET2QOZkIWZi9w", "review_id": "IsmHcAWpB5q-tRx9VzVGgw", "text": "I came in on Valentine's Day to pick up some eyeliner. I bee-lined it for the Smashbox only to find out they were out of the color I wanted. Within seconds a guy stopped over to ask if I needed help with anything, he said he would go check in the back for me. In the time frame I was standing there, three others stopped to ask if I needed any help. None of them were pushy, just willing and able to help. \nLuckily he found my eyeliner and then asked if I've seen how their new eyeliner works and gave me a quick demo. I wish I would have gotten his name, he was so helpful and friendly (he did have a pretty neat tattoo on his neck). \n\n\nKudos to the staff on 2/14/14!!", "business_id": "LMjCZH50S4xjKBuFVl2xEQ", "stars": 5, "date": "2014-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ghgCwCIQkKGNWMymhumnpw", "review_id": "D1LaIRG5VPTRDxtXX7Rb7A", "text": "belly button piercing, very sanitized and quick. will be back for any future work. (:", "business_id": "nb7OvZFB1CoZCj-Yruuk-Q", "stars": 5, "date": "2015-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "03kllIN9ASWGmecQPLPqZA", "review_id": "dYSgJzo67hhGsDc8MTM7tQ", "text": "I went here for the third time the other night and am finally getting around to reviewing it since it has been a while since I last went. (Flo's was the head to destination for food after landing at Sky Harbor when visiting my boyfriend before moving here back in August.)\n\nMy experience with the menu is not that adventurous I will admit. I've stuck with some staples and they have been consistent over the times I've visited. Dinner usually starts with the Garden Green Salad which is fresh tasting with a nice dressing. The menu states a miso dressing but I taste some peanut sauce in it? Regardless... GOOD. I vow to try and replicate it someday. Next staple? The Vietnamese Spring Rolls. Chicken and potato? I know... but they're delicious and one order is never enough it seems. This last time we tried the potstickers. Decent... not the best I've had. They are a little on the chewy side and not quite as crispy as I tend to like them. The flavor lacked a bit too. Dinner consists of the Peanut Chicken which isn't exactly as spicy as I would like it but still pretty good.\n\nI wouldn't say Flo's is the best I've ever had but it's NOT bad in my book. The modern and clean decor makes the atmosphere a nice alternative to little Asian dives I've been to in the past. Service has always been good in my experience.", "business_id": "H7KzlC0-o1wIhlGg-Me5Ag", "stars": 3, "date": "2010-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "29M0XBFALhUlwX-fhXudRw", "review_id": "NjHy9MI4PLca-Sxt5UXWew", "text": "A good friend recommended Flo's for the food. I'm sorry to say that we didn't get a chance to eat the food because the service was so abysmal! Maybe it was because we came towards the end of the lunch rush (1:00 pm). We were seated promptly and they asked about drinks and brought our drinks quickly. After 20 minutes no one had been around to take our order.  Even after attempting to make eye contact and flagging down our waiter, another 10  minutes came and went. We finally gave up, paid for our drinks and left. Not good.", "business_id": "H7KzlC0-o1wIhlGg-Me5Ag", "stars": 1, "date": "2013-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4c8G7Qux_e4E6yCN46FHxg", "review_id": "g3OwN0p1waREIxU6RbkcBQ", "text": "the resort is swanky.  very deluxe.  loads of amenities and nice-ities (if that's how you spell it).  the bar downstairs has some great shuttle board game - some people get waaayyy too into that game btw!  they have great scotch.  and don't miss your opportunity to sit outside by the fireplace and have some drinks when the weather is perfect and the views are excellent.  I didn't go into the \"family pool\" - only the adult pool and it sufficed for my leisurely needs.  i did, however, advantage of the spa - see next review.  the buffet for breakfast was pretty good with it's selection of muffins, pancakes, etc... another added benefit to this resort is that it's walking distance from the mall right across the street with the tommy bahama's and the sushi place, some decent local shopping. although i would try to avoid walking around an outdoor mall in arizona in the summer.  they do their best to blow cold water on you as you walk around outside but sheesh, it does NOT do the trick.  you're plain baking and the shops look a lot less appetizing when you're on fire.  the resort itself though was very good.  4 stars.  location, pool, spa, bars, restaurants, everything you can ask for.  perhaps the only downside (which isn't a downside for some) was the high number of kids walking around everywhere.  if you're a business man on travel, it's torrible but if you're a couple looking for something romantic, it's not ideal .", "business_id": "SYqTY48DJa1cYhglvmgvsQ", "stars": 4, "date": "2010-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "60i9h-gPKH1f0YC_bZXDhg", "review_id": "XdRIzpmbEbsiy-mf5E-N5A", "text": "Excellent service and food with nice rooms\n\nDidn't realize the Westin Kierland had so much going for it.  Staying there, I was surprised how large the resort feels from the inside with the hotel, conference center, spa, restaurants, and golf course.  \n\nCheck in was a tad slow, but staff were very nice and asked questions to make sure the room would fit our family.  Being across the street from Kierland Commons allowed my wife and little girls to have something to do while attended to work events.  My wife, a connoisseur of fine beds, thought the beds were somewhat hard.  I thought it was perfect.  \n\nThe conference center is top notch in terms of a comfortable, classy setting with attentive services people taking care of you.  Caught myself pausing to take in the beauty of the resort's views a couple times.\n\nOne memorable things is the food.  The dinners were truly exceptional and the lamb shank is something I'll remember for a while.  Magnificent!", "business_id": "SYqTY48DJa1cYhglvmgvsQ", "stars": 4, "date": "2013-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "K0euQLFAcKhQPZ6JxGAryg", "review_id": "8RwvaCaBhBioF5RnQ9xISg", "text": "Love this place even more than before.  Best NR in Phoenix area (Been to the ones in Chandler and Phoenix proper).  Helpful staff, lots of clearance and lots of bras and shoes in my size.  Parking is not incredibly desirable as this is a popular shopping area.  \n\nI just signed up for the Nordstrom Debit Card which links to your checking account so that you can earn points towards rewards.  They even went back into my account to make sure I got credit for the points I previously earned before signing up.  I love the employees that walk around the store who you can use to check out.  Incredible solution to unnecessarily long holiday lines!", "business_id": "WowrRUKvjiLX4zT12xU_yw", "stars": 4, "date": "2012-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e4TQFVfepzHf--hnBsjntg", "review_id": "HGy20jLAKs0btHmPm2F2Bg", "text": "I enjoy this store.  It has a nice selection of denim, lots of pretty cocktail dresses, great bridesmaid dress options, and the staff is generally helpful.   Fun stuff for guys too.   My only problem is that it carries a lot of the same stuff you can find at high end department stores and the merchandise does not turn over as fast, so I usually don't feel compelled to come here.  If I do, it is usually because I am headed towards Mahsa and I have some extra time.", "business_id": "oFZyfZds-akl1r6njKvE8Q", "stars": 3, "date": "2006-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7F-DVLnGmC5hHPUVfSfxDw", "review_id": "6OIARCZWyP_NCXRvx1UT6w", "text": "I love this little spot in Scottsdale. For the past few years, we've been catching 'It's A Wonderful Life' on Christmas Eve. Service was the same as always - great. Waiters were always on top of things. After the movie, we enjoyed drinks by the lounge. It was nice to enjoy this with a group of new friends and each left amazed at this experience. We'll definitely have to return more often. Cheers!", "business_id": "-fsCfTYEnJ4s6yStgBnQig", "stars": 5, "date": "2010-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZaTNpjk7-nGwCgAQdraT7Q", "review_id": "CMgxr5NeWq7wDfuo-Y3L3Q", "text": "I had a Brazilian Blowout from Kelly about a week ago and the results are fabulous! Smooth, shiny and easy to style!  The price was very affordable and it is not your typical stuffy scottsdale salon. Everybody here is friendly and the service is wonderful.Also be sure to check out his latest addition, a super cool antique espresso machine!!!", "business_id": "0nUI6eiZ5uT70qD1Ht9VMg", "stars": 5, "date": "2013-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fl6oI21uXoxVMwfR6lFanQ", "review_id": "x24x55H9d0tYl4RhBDn0TA", "text": "Z Gallerie is such a fun home decor store that has reasonably priced items and not so reasonably priced items, either way, when I walk by I always have to check it out. If anything they can give you fun decorating ideas for your house.\n\nThey have really unique furniture and decorative pieces. Everything from dinning tables and chairs, to couches, to decanters, candles, and chandeliers. They also have a really great wall art and mirror selection. It so fun to look around and when they have a sale its so easy to snag a great piece at an awesome price. In addition to home decor they also sell really fun gifts (and gag gifts). They have books about the history of the mustache, mustache cookie cutters, random coffee table books that will make you guests go, \"what the random, this is hilarious\". \n\nYou can easily lose track of time by looking at every little item in this store. Customer service can be hit-or-miss. I've never had anyone ask me if I needed help finding something while I was browsing the store (which is nice, cause I like to do my own thing), but when it comes to checking out it can take a little bit of time despite the extra employee behind the counter not doing anything.", "business_id": "m7uxAxL9L3kuB8XWkoveHQ", "stars": 4, "date": "2011-12-03", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "aoPwLIPKgmar7ZtI9128fA", "review_id": "8kaO6Z0jBx94yfjqCmqc5A", "text": "Disappointed. This wasn't our first time but it will be our last. First, my wife's wine glass had some suck-on food from its previous owner. Then her rigatoni with chicken in pink vodka sauce had bad chicken. She described it as chicken that had been in the refrigerator too long. My food was good. I had the lobster ravioli special.\n\nOur server replaced my wife's glass and promptly ordered a rigatoni without chicken. A manager never visited our table and that ruined the place for us. I understand that mistakes happen. But for the manager to not address the problem or even take the add-on chicken off the bill is unacceptable.", "business_id": "fmWyI5ec05F8PJpx3eNpLg", "stars": 1, "date": "2012-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2A__OJOvNMJPD3rFKJfMqw", "review_id": "BaRy4LDf4Ze227i2DLHiFw", "text": "The customer was absolutely terrible, the front of the house was poor and the server gave us truly bad customer service 1/10. Mary was our server. It was like pulling teeth to ask for chicken cutlets for our 3 yr old Son, and they charged us $7 for 3 of the tiniest chicken cutlets (it was really one cutlet split into smaller pieces) with no side for him. \n\nThe beef carpaccio was awful. The beef was over cured, it was like eating salami, and they drenched the arugula with dressing. Worst carpaccio I have ever had.\n\nEven The pesto for the bread was awful\n\nThe main entrees were ok, we had the eggplant rolled with ricotta and the parradella pasta with sausage. Not bad, but my entree was $21 and the quality of the food did not merit that.\n\nTerrible dining experience, definitely will not go back", "business_id": "fmWyI5ec05F8PJpx3eNpLg", "stars": 1, "date": "2015-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7ciTwLrLdThsOqXmw3B3hw", "review_id": "ZzYJq_7agOlBcYVqWFdtpg", "text": "I have been hesitant to do this review because Tammie and Claudia are so good I might review myself out of appointments!Professional, friendly, and the shop is so clean. They can do anything you want gel, acrylic, Minks, grow out your own nails. Your hands and feet will feel wonderful and your nails look great till your next appointment. I can't say enough good things about these wonderful women.", "business_id": "9SBU0aZbR2Tr3QTklUbbyg", "stars": 5, "date": "2015-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MG3U2TEaGJK_PLYanwfUwg", "review_id": "OCt5OKNTOnmtyLktBvcEnA", "text": "Went in with my girlfriend for food and drinks.  Big bar and plenty of room for dining as well.  There was a jukebox and pool tables as well as off track betting which seemed cool if you're into that sort of thing. The staff were very welcoming and friendly.  We just moved to town and the staff made us feel like we were at home.  We were looking for a friendly neighborhood bar and that's exactly what we got!  Drinks were pretty reasonably priced and the chicken Philly that I ordered blew my mind. We'll definitely be back!", "business_id": "_TWT58PWunYIyPgpz1fuog", "stars": 5, "date": "2015-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "ixcdEEPKh9vx0VZ4IaMHXg", "review_id": "g6fITN_wmj31_3q-zcXJtQ", "text": "Dr. Besemer,  Dr. Kieran, and their entire staff are truly amazing, compassionate animal caregivers. \n\nWhen my two-year-old kitty became extremely ill during this past weekend, we were able to get him examined by Dr. Besemer on Sunday. At that point, we had no idea what the issue was, and all of the blood work and tests came back in the normal range (the doctor took the time to work him in between surgeries and sit down with us for an extremely thorough review of our kitty's test results and examination findings). We took the kitty home for the night with meds to ease his tummy issues, but the next morning it was quite apparent that the little guy was getting worse. \n\nWe took him back in (after calling the staff, who was very willing to get him in ASAP), and he got another thorough exam, this time by Dr. Kieran, as Dr. Besemer was booked in surgeries. All of the kitty's history had been communicated to Dr. Kieran, and she recommended x-rays. (It should be noted at this point that at every step we were given a complete write-up of treatment recommendations and their costs, the pros and cons of each, and given full control over what we thought was the correct thing to do based on all of the facts.) We chose to get the x-rays done, and about 10 minutes later, Dr. Kieran went over the entire picture with us and explaining what we were seeing. There was a suspicious-looking, but not blatantly apparent spot around the kitty's intestinal area. We were given the choice of getting an ultrasound or going in that afternoon for exploratory surgery. Again, both procedures, their associated risks, and costs (very reasonable financing terms are available) were immediately and thoroughly communicated to us. We chose surgery, and Dr. Kieran took him right in. We went home to wait for an update on our beloved kitty's condition. We were told how long to expect the surgery to last, and were told that we could call at any time for a status update. (Never once were we treated like a bother.)\n\nRight around the time they had estimated, we were called by Dr. Kieran, who told us the surgery went well and they had removed an obstruction from our kitty's intestine. We were given a choice whether to pick him up and keep him overnight ourselves or keep him at the clinic for IV fluids and monitoring. (The clinic does not have 24-hour staff, but recommended 24 hour care nearby or what we could do to care for him ourselves throughout the night.) We chose to take him home and bring him back in early the next morning for an all-day stay to make sure he was well-hydrated and get him started eating again. They wrapped up the little catheter on his front paw so they did not have to stick him with another needle the next morning. They gave him all the medications he'd need in the evening before we left and in the morning after we brought him back, except for pain meds to keep him comfortable during the night. We were even able to see the object that was causing the obstruction, which ended up being a large hairball that had dried and hardened in the middle and lodged in there. \n\nThat night was rough sleep wise for me, but it was worth it to see my kitty making a speedy recovery. In the morning I dropped him off, and when I picked him up in the evening, the transformation was amazing. We were given after-care instructions, food, medication, and happily brought him home last night.  \n\nDr. Kieran called this morning to see how the kitty was doing and answer any questions I had. He is making quite a speedy recovery, which is an incredible sight after how sick the little guy was.\n\nI have been a cat owner all my life, and have rarely experienced the level of compassion and knowledge that the doctors and staff at Scottsdale Hills Animal Hospital provided. As long as I live in or around Phoenix, this is where I will be taking my pets from now on. They are true animal lovers, and it shows!", "business_id": "ul28DO_afdK_gWDLqmudeA", "stars": 5, "date": "2014-02-05", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "VsdK3A7VzyC-tMYC3WUC2g", "review_id": "qwEDHDjLwmmHn7thfLfNpA", "text": "What a hidden gem. I really love this place because \n1. it doesn't always seem so busy. \n2. because the staff is really cool and three you don't have to pay a membership fee like you do at Costco or Sam's Club. This place has all restaurant grade items bulk items everything you can look for in one of those places and more and the items are very very inexpensive. \n3. Never a line. \nI wish there were more around but this is close enough to where I live so I'm happy.", "business_id": "GGbUN5KTQWixtpdigPLRBA", "stars": 5, "date": "2015-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-fqDdNd5P-cV3vse1A9jmA", "review_id": "qAZU4ZsaYhTXrRz8zb5qGQ", "text": "I just had my fence installed by Marty.  He is very professional and delivers on his promises.  He showed up at the time he stated and began his work.  We opted for the self latching gate.  Unfortunately, the gate did not arrive at the same time, but he assured us it would arrive the next day and promptly came the next day to install it.  Overall I'm very pleased with the Process and Marty is what sets this company apart!", "business_id": "WV_JBM_2QtRn40WDlQaTKw", "stars": 5, "date": "2014-02-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kpFx1hEnRUg4fk6D1APRjQ", "review_id": "ewzfBzoJDNYA3xXNmGDsVw", "text": "Lov this place.  Italian subs, specialty italian foods, homemade salsicc!  Table service and pizza.  When u want to hear some south side and have great food, go here.", "business_id": "pmIJn8K3offcYUsrFCWAaQ", "stars": 5, "date": "2013-01-20", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "LquMHzZhrIV5WHJMr7rYtw", "review_id": "5uXMMKA5VY9jfMYGZrwCpQ", "text": "Fresh and good but the actual hot dog on the Chicago dog tastes like one from the grocery store. Meets the craving for Chicago but not completely.", "business_id": "AH2pJa2nfvxXkfFP1P-waw", "stars": 2, "date": "2014-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "omuO9FVYAVRTybkSc4a4fw", "review_id": "EQm5biIf6Zu_caV7dsOnnA", "text": "Had to write them another quick review since my first review of Tutti's.  Tutti Santi has become my only Italian restaurant that I'll go to in Phoenix....folks it simply is the best in town.  I've become a regular here, and the entire restaurant treats you like family...its always a joy coming in here.  If I could rate them 10 stars, I would.  Everything I've tried on the menu is outstanding...their pasta's are some of the best I've ever tried.  I could go on and on about this place, but I'll just keep it simple.....GO HERE!  And sit at the bar with Deb....she will take wonderful care of you.", "business_id": "gHKB66up5VluCWT4vuSZpw", "stars": 5, "date": "2012-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Alm5zBTKkzInhjFWQSm7pA", "review_id": "N0T5qp-iKILpvduNlwKcFQ", "text": "The food is okay at this location. I heard it's better at the 16th street location. We've eaten here four times now. They have a great dish that we love. It's called Pipitone something like that. Delicious! We have tried the homemade dishes, the lasagna, ravioli's, but they both were so mushy.   We were disappointed and didn't know if they were just old or not. Their calamari out does every Italian restaurant in the area. That's really great. The atmosphere is intimate and the service is wonderful. If there was something surprisingly negative, I would say it was the bread. For an Italian eatery, the bread is not that great. And if you don't ask for it fresh, they serve old bread. And it should be three stars to describe this place, because for two, you can't get out of there for less than $50 with an appetizer and that's without alcohol.", "business_id": "gHKB66up5VluCWT4vuSZpw", "stars": 4, "date": "2015-12-13", "type": "review"}
