{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "T_wjLgPOPXry7Bea4MzoVQ", "review_id": "XW_RwDoN9StbDt0Y1pc3VA", "text": "I have never seen a restaurant that has a frowning brownie (a.k.a. Frownie) as their icon, mascot, or spokesperson.  King's Family Restaurant has surprised me with this.  I think it might be in direct dialogue with Eat N' Parks smiling cookie -- funny (funny odd, not funny ha-ha).  We were seated rather quickly by the manager.  Very nice people work here, I was happy to find that even though they had closed a section, the server was willing to stay longer to serve us our dinner.\n\nWe chatted with the server a little bit -- she was quite engaging -- and then moved on to order our meal:\n\nTea\nPepsi\nOpen-faced Hot Turkey Sandwich with mashed potatoes and gravy\nBuffalo Chicken strips with mashed potatoes and macaroni n' cheese\n\nOur drinks arrived and our server conversed with us some more about the area.  She would leave every couple of minutes to check on our food and to make certain that her other tables had everything they needed.  Eventually, our entrees arrived -- both piping hot.  I went straight for the macaroni and cheese.  It didn't taste bad, but I swear that it is made by Stouffers.  I didn't feel the need to eat that much knowing that there were other things to eat.  I tried the mashed potatoes and found that they too came from a package; but, again, they didn't taste bad with the brown gravy.  I moved on to the main part of my meal -- the buffalo chicken strips.  At least they were all white meat and the buffalo sauce was more than just mild.  I contented myself with eating them.  \n\nI tried some of the hot turkey sandwich and just left the rest for my friend since it was not fresh cut turkey but instead luncheon meat that had been heated.  I finished off my dinner and was happy in the end.  No, it wasn't the best food in the world, but the service greatly helped the perception and it didn't taste bad.", "business_id": "wJr6kSA5dchdgOdwH6dZ2w", "stars": 3, "date": "2009-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2tsV-MEDg5jmIhJpWE-J6A", "review_id": "pGnPKcPcS7YtwSOfNHxU7g", "text": "FANTASTIC PLACE! New owners make this place warm and family friendly!\n\nThe portion size is worth its weight in gold. I would highly recommend this restaurant to anyone.", "business_id": "r8BwdblCW-ZUES37BL0khw", "stars": 5, "date": "2015-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HC1zr2aBxtgiQXLhfpaRlQ", "review_id": "GaouKQB8B5z1OS5qOE5G4w", "text": "Putting lamb in your burger is not my idea of 'gourmet' burger. Sure it tastes unique, but there are better ways to skin the cat. Good, but after a couple of times I got VERY tired of the 'unique flavor' of their meat.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 2, "date": "2009-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Yg2y9X83gLVtHslus30D8g", "review_id": "7Q9vlxuCfROGxB5JW0REBw", "text": "I've been around the block with burgers. This remains to be the best burger in the world to me. Get a burger with american cheese, some mushrooms, and onions at Medium Rare and you'll love it. \n\nIts a \"good ol' place\" and definitely brings a pang of nostalgia into my side (especially after eating so much!).", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 5, "date": "2011-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "8YtT16y0ns6bynQzcBZllw", "review_id": "vtn40XX0Fr6zNwh3txnitg", "text": "After hearing about how great their burgers are by word of mouth from a few different people, my girl and I happened to be in the Bloomfield area and decided to check the place out. First off, its very old school vibe. I kinda felt like this bar should have been in a scene from the Deer Hunter movie. Dark paneling on the walls, dark ceiling, very low lighting, waiters and waitress's wearing white aprons, that sort of feeling. A nice lil old lady waited on us. We went about dinner time, though there was a snow storm that afternoon the place was pretty much empty so we were served quickly.\n\nOf course we both ordered different burgers with home fries. The burgers were of a nice portion. I got the Cajun burger with some greasy home fries. It was good but honestly, why I gave it a 3 stars was that there is really nothing spectacular about the burger or place in my opinion. It was good but not great. I don't think I'd drive from miles around to quench my burger needs here. I can see this place being a nice lil place to visit from time to time if you live in the neighborhood though. I definitely would go and check the place out if you've never been there before just to say you where there.\n\nHappy eatings my fellow Yelpers!\nYour's Truely, The Shaw...", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 3, "date": "2014-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-TeEGApFB2qlOci1TFeRJw", "review_id": "n1LtmT6xtKMHZQVZ1dnJ1g", "text": "Cozy, cool place with the best burger in the city. I always stop in when in bloomfield.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 5, "date": "2015-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lARSkAyvPCBOl67dZKMYwQ", "review_id": "ejOnJ8AMd6p4rNHgeUXxYg", "text": "Good casual frozen food. Coca Cola freestyle. What else could you want? The new restaurant design also reminds me of the lobby at the ritz carlton.", "business_id": "mXHBxHrAJPnPWnm_OKuZTQ", "stars": 5, "date": "2015-12-11", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "66kGSuUwMTEhnJzDZB5GJg", "review_id": "ba66Aie2UAkBtkGfR7tliA", "text": "I finally found a great roast beef sandwich at Matt's! Give me the roast beef with giardiniera and mozzarella all day. Pretty large sandwich; definitely will leave you feeling satisfied. You can have the beef dipped in au jus or on the side. I had mine dipped, which made the bread a bit soggy. Would go on the side next time. \n\nI guess after all the raving about the roast beef I need to try the hot dogs. It will be hard to ignore that sandwich though.", "business_id": "gpCtDCSXIoQx70cq9itfNA", "stars": 5, "date": "2015-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gVoB7lbnt5fKxojyyHbhpw", "review_id": "AqEuH_ViU-W8_T9G1bq3pQ", "text": "Simply amazing. I was skeptical at first when my coworkers took me here but easily my favorite place to eat in the mall! \n\nI typically order a grilled cheese with bacon and fries on the side. The meal is great and the sandwich is large that I often get half to go! Even though it might be a day old, the grilled cheese is really good reheated. \n\nAnother plus is they are good with my allergies (peanuts, nuts, & shellfish). I didn't think they would be a place that really cared but they made sure my food didn't come in contact with anything I'm allergic too. (Not that they have shellfish at this place but they do have peanut butter.) \n\nThe place is also hidden away so it isn't super loud and busy like the food court. I would recommend this to any shopper at southpark mall.", "business_id": "nkNdTqpv1m5GBKx8xrpluw", "stars": 5, "date": "2015-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uBUGZtTxmaG-8YpUWpU5_Q", "review_id": "_idmLgFnUL3Ih8M97wsbtQ", "text": "I rarely write up fast food places, but this particular location is amazing, not for the food but for the engineering that went into siting this location.\n\nLocated immediately opposite South Park Mall, this two-story McDonald's is a complete operation including drive thru, delivery to your car in waiting parking spaces and even has a piano in the main ordering area.\n\nMy 96 year old dad's doctor is next door so we always get something while there for his monthly check-ups.  Dad LOVES the McDonald's burgers and is happy as a little kid when he gets his order.  Never fails...thanks McDonald's.\n\nIt is tricky to get in, so just trust the signs.  Coming off of always busy Fairview Road you come down a narrow drive and almost immediately make a left into the drive thru/enter entrance.  You circle the building and have to look quickly to find a parking space.  If you dally, you have to re-circle that narrow area.\n\nA masterful siting for the building and the inside reminds me of the giant McDonald's in Asia.  Multistory and all the goodies.  And it is immaculate.  Have never seen a scrap of misplaced paper.\n\nSame consistent food selections done exactly as they are in every other location.", "business_id": "4kM-mP7z1nP015R2Tlz1Tw", "stars": 3, "date": "2015-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oW5gKrJ8Qz9pm3IbchHxCA", "review_id": "XA32smoNuiwGOxhVHE9gjA", "text": "I see why they call their fish sandwich \"The World's Best\". Absolutely delicious!!!!!", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 5, "date": "2015-02-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "VhI6xyylcAxi0wOy2HOX3w", "review_id": "3-pFs5tRWSB48Lzn_EAeaw", "text": "Standard McDonald's with a Playplace, TV's and free WiFi. The parking lot is a bit weird to access. The shift manager who took my order was pleasant and quick. The restaurant was clean and the self-service area was stocked properly. I didn't check the bathrooms.", "business_id": "oP9AEoTeun7L-dPeSxJw_A", "stars": 2, "date": "2012-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "shHWUsjtLgd38SWKFn3JHw", "review_id": "wCS2OFApj96IgU8PvKdy0A", "text": "I came here and ordered the baja burger. It was DISGUSTING. Greasy, with wilted vegetables and absolutely dripping with excess juice. I could barely eat it, but I was so hungry that I just held my nose and forced down a few bites. The sweet potato chips weren't much better; too greasy and stale. My friend had a strawberry daiquiri, which I also tried. It was acceptable, but the taste was off. \n\nThe service wasn't good either. Our waiter neglected us, and we did not feel at all taken care of. I will not be back.", "business_id": "1hBOR97oX5Xph3J8Tdob7w", "stars": 1, "date": "2011-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "MizkRmWjWS8lYuL6uMmjVw", "review_id": "BILtQsYqwnZlIwb5mIM8eA", "text": "Just had the worst tasting greasy cheesburger I have ever had.  Served with about 5 french fries.", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 2, "date": "2013-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "9i-36HhVvgCcjGA2xsCmCw", "review_id": "rIHFsRdlWrqpPVIPD7jVog", "text": "Maybe I am missing what the big draw to Joe's is but I feel like C-U and Campustown have better bars around town. Being a grad student, I think the appeal is usually lost. The only plus is that they have my favorite cider (Strongbow) on tap. The service is okay and I am glad that they at least have their own beer. Their food was typical and not memorable and the beer is only okay. Given the choice, I would choose other bars over Joe's.", "business_id": "1T2rnvl67Gk9Uc0gzsCKQA", "stars": 2, "date": "2011-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UCQNrwN4_hHHTWYa8cqe_Q", "review_id": "8Rrg7Y5GnuOu6MwPseQ5oA", "text": "Family and I brought my mother here before we had to drop her off at the airport! Had a very nice waitress, who was very courteous to us. Wife and I shared a granny apple burger, It was nothing special! Could get a better burger elsewhere! Mother had their twisted mac and cheese. She claimed it was the best she ever had? Wife and daughter agreed it was very good. I don't like mac and cheese so I never tried it. Over all food was OK! Service was very good!", "business_id": "gkv2XvXpFgiq4Bb2XK7YmQ", "stars": 3, "date": "2010-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BFIsRXzgNVz2gwAH80DECA", "review_id": "z4NMY_3xr4PDKwz24nVPyQ", "text": "Our waitress Noelle was awesome!! Ask for her ! Food so so drinks and atmosphere excellent", "business_id": "gkv2XvXpFgiq4Bb2XK7YmQ", "stars": 4, "date": "2015-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "aTi0NVrcPJWbN6jAsJVcAw", "review_id": "r1SaPDIbNVPr2sC81CIdtQ", "text": "I normally don't prefer to eat at chains (though I will on occasion), but this one holds a special place for me. I'd just driven into Phoenix on a Wednesday afternoon, after a long drive across the country. Earlier in the day I'd signed the lease on my apartment and confirmed with the movers when they were coming the next morning. \n\nSo this tired chick hopped on Yelp to find some food -- nearby, familiar, and good enough. I found this Applebee's not too far away and also in the same parking lot as Target (killing two birds with one stone). It was my first meal here, since all of my belongings (read: pots, pans, cooking utensils) were on an 18-wheeler somewhere in the vast Phoenix metropolis. The people here were friendly enough, and I like their \"550\" menu of dishes fewer than 550 calories. \n\nSo while I've grown fond of finding and frequenting locally-owned joints, on occasion I do hit a chain. This one was there for a very tired chick who needed some hot food and a nearby Target!", "business_id": "hzUOqxpcnYYBgLlrgvjQYQ", "stars": 4, "date": "2012-12-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "3VgHutPPmF3TbWwIzlSNCA", "review_id": "ep5qvZ1hSkU0AH6uNAJMCg", "text": "People really need to understand where they are going and the role the place is supposed to fulfill.  I find it funny that all three of the negative reviews mention how the food was great and the environment is chaos.  That is what they do at Harvey's.  Apparently everyone who went got Polly, who is ridiculously hilarious and a lot of fun, not on meth, not drunk, just really interesting from the chemicals produced inside her own head.  Personally, I prefer Monty, he is a sarcastic fifty-something Midwesterner who cooks one of the best burgers I have ever had (sorry, better than Polly), mixes a mean Manhattan, tells awesome stories and will simultaneously insult you, shake your hand and discount your drink.  When the bowling game is functional it promotes awesomely competitive tournaments and if you take over the jukebox the moment you arrive you create your own ambience.  Bring a friend, split the Super Wineburger with Cheese and an order of Chicken Fingers, leave happy.  Wash, Rinse, Repeat as desired. The only reason I would consider bumping it down a star is that I am normally a devout beer drinker and they only have Budweiser and something (I believe coors) light on draft.  Don't care, cheap cocktails and Midwestern bitterness save the day.", "business_id": "ntJAKLAq0cXzzdFgPoo0Iw", "stars": 5, "date": "2009-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "BXmS1GcUQIFTceRhBXDg1A", "review_id": "sIoOyLLB4NVEhFzNdHuQvg", "text": "Love it!\n\nBurgers are awesome. Cheap beer, and whackadoodles everywhere!!\nPrices are spot on and the service is prompt and friendly. \n\nI love dive bars with great food and this place is Great!!", "business_id": "ntJAKLAq0cXzzdFgPoo0Iw", "stars": 4, "date": "2015-02-20", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "nlUIgx4bf0Apgl6aD1xO2w", "review_id": "VBXdq29niXsxCny4klVQjw", "text": "Best bar in Arcadia.\n\nBest wings I have ever tasted.\n\nWorst bathrooms in the Valley.\n\nArcadia, I miss you.", "business_id": "qz4ZOcv-840UjfCEYI4qZg", "stars": 5, "date": "2012-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ujBFcX607swXhq4oNk0R7A", "review_id": "Ns5NN7Mrssb_oIauOl6hHQ", "text": "This place is AWESOME. It's easy to miss and easy to ignore but once you venture in you'll be hooked for life. Parking is scarce during busy times and seating is limited inside, but it's well worth the wait. I regret I never had a chance to make one last visit before I moved out of Arizona.\n\nLove the fries, love the mystery cheese goo they put on their hot dogs, and of course, love the sliders. Better than White Castle and definitely better than that rip off place we have here in Orlando called Krystal.", "business_id": "iNvY0zAlaD_ye7Z6rHu-Ug", "stars": 5, "date": "2009-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "s2TTCqBt93zlnzns5Z0TBg", "review_id": "OQ6ouY6N5SA9BGrH9NxLjw", "text": "Great traditional Chicago hot dogs, italian beef, sliders!  The food is delicious, comfort food at its best.  The fries are great, malts and shakes, you name it, also you will not leave here hungry.", "business_id": "iNvY0zAlaD_ye7Z6rHu-Ug", "stars": 5, "date": "2012-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tq0ZoiyXxEH2JK7TcOqqHg", "review_id": "bMF8VSD_eKad8CvvqUN0VA", "text": "Perfect place to come to for burgers and dogs! Especially if you're from Chicago and miss White Castle ;) they definitely makeup for it with their excellent sliders", "business_id": "iNvY0zAlaD_ye7Z6rHu-Ug", "stars": 5, "date": "2014-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dqmXlUQyDh6d5U2_Zjb-Iw", "review_id": "IclxAoMOyuIEqjZU-1fYow", "text": "It is difficult to get to the drive thru and the parking  lot was  congested. The line was short and the staff was friendly . However  we had to wait for their nuggets. There is only one spot to wait but there were three cars waiting. The person delivering was all confused.  He dropped off the meal then tried to take it out of my car . The fries were cold and hard.", "business_id": "Y_dzA9OHRKa0X1cqcRmsaw", "stars": 3, "date": "2014-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "0g6TyhGJXvLQNr7d7LsDnw", "review_id": "INCx3Ohr7I7KEDBGnXrRug", "text": "OMG! this place is so delicious, reviewing it now just makes me wanna go eat their COMBO (Zucchini & Mushroom) w/Ranch=$ 5.25. When i was there, I had the wings in HONEY HOT BBQ (6) =$ 3.99 as well. Someone at our table had a cheese steak, but i didn't taste it; however i did taste a french fry and it was perfect, not greasy. the service was fast and pleasant. i can't believe the quality of the food for the prices. food is fast and fresh! i can't wait to go back! its always busy around sporting time....so plan accordingly.", "business_id": "lf42gtgq_2_jPvjfp_K1nQ", "stars": 4, "date": "2011-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0GYLQqgu7v_qMZGgflv5Hg", "review_id": "3tzmwuJrqulz1f5PmdSu2w", "text": "Been eating here since I was a kid apprx. 30 years. Undercooked wings have me being no further than 15 ft from a bathroom. Never again.", "business_id": "lf42gtgq_2_jPvjfp_K1nQ", "stars": 1, "date": "2014-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BEe04ziifpSkBdKsCSAUXA", "review_id": "Cri3GIgKs8M3rpnu7pu3EQ", "text": "The coke still has a funny taste. I was hoping after they remodeled that that would be fixed.", "business_id": "41SzC2WJ-RVUpVZ2NJfE-w", "stars": 2, "date": "2012-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aI04l7aCWYTbt2z8S-6yYA", "review_id": "Fp-WRGBIUcPQKBg9cum6LQ", "text": "This location is good for a quick cheap lunch.My usual is a burger,fries and cup of coffee.But whenever I decide to go outside the norm I usually will try the baked potato.Sometimes it's nice and hot with fresh toppings and tastes great.But a few times it was cold and not so good.I could tell it had been sitting out a while.Makes me reluctant to go outside the norm of burger and fries.", "business_id": "NhdIZvpM11d720SskLvRpA", "stars": 3, "date": "2015-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "P_LzcrlVXFdgBq_24UnlUw", "review_id": "fUKRmPZSeIuMuDdvc1i_RQ", "text": "Good consistent quality. Simple business model. They only sell three different burgers and they do it very well.", "business_id": "byFWmwlVSmUj-AmM6NZYvw", "stars": 4, "date": "2010-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "11WMiRoB2sQxo61aJdSg6Q", "review_id": "_rWArizriwu8qr2gjGn_SA", "text": "The service was great and the food was excellent.  If you don't want to wait for a table the counter's are open which was nice.  The decor is great!", "business_id": "iAYzRvyBrSkJDu_XZ-E1zQ", "stars": 5, "date": "2012-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "K46kUag6aS0Vd4JjiaqNsQ", "review_id": "lFV-7X8u2G7m-IJvZRUu3A", "text": "This is no where near the same as the Gilbert location.\n\nI ordered a chicken sandwich, because they didn't have the veggie one I get from the other location.\n\nIt came on a fairly dry crusty hoagie roll, with shredded iceburg lettuce, mayo (that I specifically asked not for), chicken, and some horrible pepper sauce. The sauce was not listed in the ingredients on the menu. It was not just hot, but tasted bad. I asked the person at the counter about it, they said they put it on all their sandwiches. Something they might want to mention on the menu.\n\nIt was pretty loud, and smelled greasy. The menu is not the same as the Gilbert location either. I was fairly disgusted by my food, so we didn't even bother with the custard.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 1, "date": "2012-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "7Ot-v89x44U_VdIPgD3qKg", "review_id": "v98nbq-jmTOabFw3pXoGpg", "text": "Ordered the burger, fries and a large drink. Was about $10.00 per person. Pleasantly filling large portions. The fries looked like Arby's fries. But they are extra large normal tasting fries. Very good tasting food. Might have to try chili or their steak for $5.10 next time. Yummmmmmmm.", "business_id": "AoO0FJyUm01lmIJJTcPWEQ", "stars": 5, "date": "2014-02-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DpwePVP6-ztD92Ja9gzdjA", "review_id": "qVykhxoSRKjohVMxCCHKpA", "text": "As good as it gets for fast food and you can have it however you like. Breakfast is good also.", "business_id": "FKoqqNLG47bl_AjMwg3PjA", "stars": 5, "date": "2014-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "alns0Mn2EgsFOvdo87ISvg", "review_id": "3MbVE_pVo6SlqpoviU0oRQ", "text": "our group of 7 waited for food and never received some of our food.  what we received was good, but we had to ask multiple times for water, more fries and some of our orders.  was very disappointing as this was not our usual experience.", "business_id": "-GYx5GAx_-4XEsn7mFwdkA", "stars": 1, "date": "2015-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Ay1eY5gVFFBUhuhl036vVA", "review_id": "VU8LHv59saLWummncIWxug", "text": "It's ok, quality . Service was below par, although they were really busy. Fries were good and endless I guess that's good.. But, I was looking for a good burger, too bad I didn't find it here.", "business_id": "ASNxwg9dD4-_F4H1uNN2KQ", "stars": 2, "date": "2011-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ghoBw5923PH-03Rly2hRJg", "review_id": "TsyxCWW3X7RoZ8JjoPCTZg", "text": "I love this place when I am looking for something more than just a fast food burger. My personal favorite is the Blue Ribbon Burger its so tasty. It has just the right amount of bleu cheese an steak sauce topped off with crispy onion strings and don't forget to try the parmesan garlic fries with your burger.", "business_id": "zoHCkEiIKfXiLTKUqKEojQ", "stars": 4, "date": "2012-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "d0rWx8pA573dKNFA_XLGoA", "review_id": "YnS2Ss1o2NZ_tSMV1eNxfA", "text": "What can I say... it's a Burger.... but it's decent.", "business_id": "EVRoFKVKbgP-rz9_6enViQ", "stars": 3, "date": "2014-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FU_GKOWF6SB7f-vExtG7Yg", "review_id": "x_ZhbujiCOtV5s_R5gV_gA", "text": "Been eating at this place for over 15 years, regularly... some of the older employees recognize us... and then we get this jerk for a manager. For 15 years on and off I order and they make chicken or beef tacos for me al a carte. So, I order them like usual and the mgr. comes over and says I won't make them for you, not on the menu. OK... I say, just put some ground beef in a tortilla and I am good. He says no! I am so frustrated! This was my favorite dive bar and now, on principle, I refuse to go back. I asked the manager if I could speak to the owner and he said no... boy, I wonder how much business this jerk has lost / is losing for this poor owner!", "business_id": "7-4FxYXhNUS2lhpUb_q5-w", "stars": 1, "date": "2014-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 3}, "user_id": "fpWiDfJVWqDNWbfft22anQ", "review_id": "aicw0vfWucIdRLGAJAZyaQ", "text": "Great Sandwich!\n\nI was treated to \"free lunch\" yesterday after agreeing to an impromptu Sunday afternoon business meeting, and I was happily surprised when I was told that, among my choices strewn on the table, was a Prickly Pear sub from a mystery establishment known as Flancer's.\n\nThe bread was perfect - and this is coming from someone who pretty much altogether stopped eating sandwiches 5 or so years ago due to the consistent let-down of most breads.  The crust was nice and crusty, fresh as can be, and didn't overwhelm the rest of the sandwich.\n\nI wish I knew everything that comprised this Chicken n Prickly Pear concoction, but I don't - I was too busy.  All I know is it tasted great, and it made up for the fact that I was dedicating my Sunday afternoon to a round table discussion that did not include an outdoor activity.\n\nGood work, Flancer's!  You made my first trip to Gilbert a great one!", "business_id": "JMOK_Sy6aSOZwd4qgkX7hg", "stars": 4, "date": "2008-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RWqqD0cqiVRej5Y4p9uV5g", "review_id": "_iyCY-ks6nEiho8MWFnCyA", "text": "Anytime I go to Flancer's Cafe I order the Prickly Pear Chicken Sandwich. The chicken is always very moist and the marinade tastes awesome. What really makes this sandwich great is that it also comes on very soft roll. They also put this New Mexican green chile mayonnaise on it which tastes great. \nThis sandwich keeps me coming back!", "business_id": "JMOK_Sy6aSOZwd4qgkX7hg", "stars": 4, "date": "2011-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_fUMB5rlRLwAiIHLwdfrMw", "review_id": "L0Fha27sCo3-asywOIX0-Q", "text": "Yum yum yum!!  After many years and many visits here at Flancer's, I am finally writing a review!  I Tried the Goat Cheese Bruchetta today for the first time and gobbled it up!!  So tasty!! Their bread is so incredibly fresh and delish!!  The Philly Cheese Steak with the Works is by far my favorite go-to item!!  Along with many other patrons in the restaurant today!! Every table had at least one on their table. The beer battered fries are one of the best French Fries I have ever had!!  Super crunchy and delicious!!  Our server Ben was super prompt and friendly with our order and special requests.  I would definitely recommend this quaint gem of a restaurant right on the north end of Downtown Gilbert.", "business_id": "JMOK_Sy6aSOZwd4qgkX7hg", "stars": 5, "date": "2014-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "GJl1qIvyQEs501rfw0hDBg", "review_id": "OlAMnaqS7taYAejwYflVVw", "text": "Great sports bar!  The place is huge and can be a little loud.  There are TV's everywhere you look so there is no bad seat in the house.  The service is incredible and the food is amazingly great!  They have a thin crust pizza with a sauce that tastes just like Lou Malnati's in Chicago.  Try the vodka pasta too.  Never had a bad meal here.  Ask for Lori - best server EVER!", "business_id": "_TWT58PWunYIyPgpz1fuog", "stars": 4, "date": "2011-12-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PmnXHiOiRqgjzEtYu4_46w", "review_id": "tAYWGXPNjEK-Osgu7CoTvQ", "text": "Oh yeah, i'm definitely a fan. I ordered the sirloin burger with fries. The burger was big and loaded with fresh lettuce, tomato, and red onion. How did they know I love red onion? I will have to pace myself since this location is so close to my house. I don't wanna over do it on a good thing. I'm gonna try What-a-Burger this weekend. We'll see who has the better burger.", "business_id": "KyLmGuB-EjpeliQO-Qu9Kw", "stars": 4, "date": "2012-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "H3NxxYuvH_s_9Y7bbtwvEA", "review_id": "eDm6lWSe0tutIIFFXq6w4A", "text": "Very bad experience using the drive-thru this morning!!\nI used the drive-thru since I was in a hurry to get home and wanted a quick breakfast. I wanted scrambled eggs and pancakes. I was confused with the menu and was not sure how they classified this combination on the menu. I asked the host that I wanted an order which includes pancakes and scrambled eggs. She could not take the order unless I used the specific name for the breakfast as it is shown on the menu. She just said that she could not understand which item I was asking for. Well, I realized that the \"Ultimate Breakfast Platter\" is the choice that includes pancakes and scrambled eggs among other things, so I said that I wanted the \"Ultimate Breakfast Platter\". And here I am, at home eating my pancakes with no biscuit and NO scrambled eggs whatsoever. What is wrong with this people?? Lesson learned! There is other places around, why did I stop here?? Not any more!!", "business_id": "iJDzwfZ7qwRMQq4YIm6ERQ", "stars": 1, "date": "2015-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "90a6z--_CUrl84aCzZyPsg", "review_id": "TUk4K6APQr4ROflE0vWUnw", "text": "As good as a hot dog gets! This place has been around a long time, and for good reason. Char-grilled top-quality meats right from Buffalo NY.\n\nMust try the foot-long-dog (with tons of toppings) and the savory onion rings. The brat and the Italian sausage are also fantastic!\n\nIt can get pretty busy at lunch. I suggest visiting at slightly off-peak hours.", "business_id": "jJhNOhuGpIsJX5SEUFFWYQ", "stars": 5, "date": "2008-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "yomx0u2-NxN8eDKxuoQbDQ", "review_id": "tMh4MRZbyD0inVNvkfWmGQ", "text": "Love the hotdogs awesomely Devine", "business_id": "jJhNOhuGpIsJX5SEUFFWYQ", "stars": 5, "date": "2011-02-23", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "ecvKeutsRaH8Jfb6J_ie3A", "review_id": "1wh-MmRN2-sVYxlMMp7iow", "text": "You go here when you feel like going H.A.M. You order the footlong chili cheese dog and cheese fries and large soda and then like a bad hangover you hate life the next day. Even talking about it makes me feel fatter, but you know I will go back for more! In all seriousness pretty good dogs but I only make it here about once per year.", "business_id": "jJhNOhuGpIsJX5SEUFFWYQ", "stars": 4, "date": "2013-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EPRsyblhYfDZW6FlCRrUbw", "review_id": "gUk-ZdMNUX6ebAjz3D72rg", "text": "Choice of dogs.  Hot dogs have the skin casing which I love.  Onion rings were great.  Quick, Cheap (two dogs for under 6 bucks out the door)  It was exactly what I was looking for.  Fast, yummy, fair priced lunch.", "business_id": "jJhNOhuGpIsJX5SEUFFWYQ", "stars": 5, "date": "2014-12-17", "type": "review"}
