{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "LWbYpcangjBMm4KPxZGOKg", "review_id": "6w6gMZ3iBLGcUM4RBIuifQ", "text": "This place was DELICIOUS!!  My parents saw a recommendation to visit this place from Rick Sebak's \"25 Things I Like About Pittsburgh\" and he's usually pretty accurate.  His recommendations were to try the Reuben, Fish Sandwich and Open-Faced Steak Sandwich.  We went early afternoon for a late lunch today (a Saturday) and were seated right away.  The staff is extremely friendly.  My Mom & I each had the fish sandwich, while my Dad & Brother had a Reuben sandwich.  The fish was very good, but the Reuben was to die for!  Both dishes were massive, and could very easily be shared between two people.  On top of being extremely large portions, it was incredibly affordable.  The giant fish sandwich was $8 and the giant Reuben was $7.50.  Our drinks were always filled and we were checked on several times during the meal.  We will definitely be back!!!  Oh and a bit of advice ahead of time - they take CASH ONLY.  So come prepared, but I'm pretty sure I saw an ATM there as well.  And I do believe they are closed on Sundays & Mondays.", "business_id": "mVHrayjG3uZ_RLHkLj-AMg", "stars": 5, "date": "2012-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NBlxu925qd8II-SwilrI9g", "review_id": "gH9H5iPoFezxmR5B43kFJQ", "text": "Went for my 25th birthday and had a blast! Servers are great, the show was hilarious and had the whole crowd involved. Only bad thing is it can get very expensive!", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww", "stars": 5, "date": "2014-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FAtk38wdEbNgM6rSmP-zew", "review_id": "oHf5jPx25UTX9UK9v_pQKw", "text": "Awful awful. Spent 150.00SERVICE WAS TERRIBLE. Took 27 minutes to even be acknowledged. Really. The only saving grace was the kids had fun and the hostess took AMAZING care of us......", "business_id": "sbW8qHJgzEIH42B0S-3New", "stars": 1, "date": "2015-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W9ZG5q-QIblXYeHgaPS5Uw", "review_id": "Y51cmvYxsChgXbIpSEUVPA", "text": "Boo!  What happened to this location?  It used to be happy and fun!  It just feels depressing and nearly everyone there is just doing the bare minimum to get by?  So sad.", "business_id": "tU-YtoW339PXJmUGSix_AQ", "stars": 1, "date": "2014-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "v9k9CXGkxxZtya4HVsfcng", "review_id": "J67q0B0NtS4zQV04Cj2Zmw", "text": "Not bad atmosphere little cramped in the booths in the bar area. Wings were really good actually and the Boozy Buffalo was yummy.", "business_id": "Ts4xsKPU7FNPPZRj-nRjIg", "stars": 3, "date": "2015-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UyvhshDZ5VWfOWhh_GWsYw", "review_id": "oYjynxN12NFuKOeyYII1Hw", "text": "Part of the same restaurant group as Eleven, which I have eaten at and reviewed here, Casbah is a vibrant restaurant in Pittsburgh's Shadyside district.\n\nWhile the menu changes daily, there are several mainstays available on most evenings.  One of them, the pork chop, is one of the finest I have ever had.  Double cut, juicy and flavorful, it is an absolute winner.  Braised kale and butternut squash risotto accompany this perfect dish.\n\nI managed to sample two other dishes (courtesy of my willing dinner mates) that are also noteworthy.  The short rib ravioli is an excellent combination of tender, richly flavored beef rib and toothy pasta.  The ricotta cavatelli combines fresh, simple ingredients into a well structured dish.\n\nService was a little hit or miss the evening I was there.  Part of that may be because we were a large group and the restaurant was rather busy.  However, for an establishment of this caliber, I do expect more.  Nevertheless, I plan on trying Casbah again on my next trip to Pittsburgh.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 4, "date": "2010-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4cW3iQW6JD1C8VxYP0eyXg", "review_id": "H6vHLMPEolGR1k-rX1WsTA", "text": "For the record, I have returned a few times and still entirely stand by my original review from nearly 3 years ago. I will add that the food portions also seem to be decreasing! We went during happy hour last week and I had the worst tasting rye drink possible - described as rye with fig jam, bitters and lemon, sounded like something that cannot possibly be fucked up, but tasted like nothing but the juice wrenched out of unripe lemons - super dry and gave me a stomach ache. No fig flavor to be detected. To make matters worse, when my partner tried to ask the bartender about the drink, if it was supposed to be sooo god-aweful lemony, she responded with a \"yes, it's got lemon in it.\" When he pressed the issue, she simply repeated, \"yes, it's a lemon and fig drink.\" More frustrating than conversations with the wall. The risotto that we ordered was the size one would expect of a side dish (which is what risotto should be, but this was proposed as an entree...). It had about 5 little pieces of maitake mushroom and 6 hazelnuts in it and was otherwise flavorless. We added lots of salt and pepper. Total waste of $25 bucks. \n\nAlso, their bar seating sucks. The chairs are stationary and far away from each other, and a bit far from the bar for a shorty like me; my feet don't reach the foot bar on the chair either, so my legs fall asleep trying to sit there.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 2, "date": "2012-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "JnKYwlH7_JEBstDXqYkiqA", "review_id": "-VMB1M2T-ZUd-on69ILkkQ", "text": "This is such a fabulous place.  Regardless of the occasion the food and the service are impeccable.  In Pittsburgh trying to find a restaurant that will fit everyone in your parties needs is difficult - Casbah is the spot.  My family had a birthday party for me here on Sunday.  Casbah was accommodating with a cake, with a loud bunch that constantly changed their order, and were extremely patient.  The food was outstanding, as per usual! I ordered the Elysian lamb which was delicious! Cannot wait to return!", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 5, "date": "2014-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BQ1ugiGs7IfwadvqUZFHcw", "review_id": "HeLQOtXkNwis_33VV6RZZQ", "text": "I had my first experience with Casbah on a recent Friday night in a group of 4 without a reservation arriving around 9pm. Here is a summary of our experience: \n\nPROS: \n- Ambiance is nice, upscale, not too loud. \n- We were able to find a low table in the bar within 15 minutes. \n- Drinks were good, generously proportioned. Cocktails were priced as expected for the type of place ($10-$14). Wine list had multiple options by the glass.\n- As for the meal, the meats were good cuts, well prepared. \n\nCONS: \n- Overall the food felt rich with creams, fats, salt without any particular inspiration showing through. The ingredients were all good and well sourced, but the finished products did not seem to elevate them in any particular way. \n- The service was high end of amateur - not what I was expecting from this caliber of restaurant. Our 30 minute wait stretched to 1hr 30min without any meaningful acknowledgement by the staff. Upon sitting we were told that they usually have \"excellent sourdough bread\", but they were out of it for tonight so we had ciabatta (which was fine, but we didnt need to hear what we didn't get to have). \n\nFOOD: (vegetarian options reviewed directly, meat options as reported by dining companions)\n- Cheese plate: Nicely prepared with a good range of cheeses. Only complaint was that the cheeses were served too cold to fully appreciate them. \n- Beet salad: the greens were good, the dressing was a bit too mild to offset the beets, the beets themselves were gritty and not particularly well cooked. \n- Squash soup: Overall very good - quite rich but flavorful. Felt like the salt and cream were taking over the squash \n- Mushroom pasta: Again quite rich and salty. Packed with high quality mushrooms but didn't feel that they were quite given justice due to the salt and butter. Pasta was high quality but again, overshadowed by the salt and butter. \n- Steak: Good cut of meat, cooked well.\n- Ragu pasta: Excellent pasta dish well cooked, reported to be almost as good as Piccolo Forno's. \n\nOVERALL: \nA similar experience at 2/3 the price would have received 3 stars, for the price of the meal this was barely a 2 star event. We won't be going back, even with the lure of 2 for 1 entrees around our birthdays - the food just isn't that good even discounting the service. I'm sure they will continue to do well with a certain crowd, but there are much better dinner options out there.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 2, "date": "2015-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XnkaYmJyHt12_fSgI_9PVA", "review_id": "0wjaHCXHNjVxOcbl0MKHTw", "text": "Awesome place! I go on Wednesdays for bluegrass night and a few beers. They have a great selection on beer and the decor is so cool and interesting. It's a great slice of Pittsburgh history. The environment is friendly, the people are friendly, the staff is friendly, the band is friendly. They have a popcorn machine and a peanut bin for free munchies. Just go!\n\nPeanut allergic people: note the mention of a giant bin of peanuts.", "business_id": "YRDKsBFYP7G0E8BLJKIkvA", "stars": 5, "date": "2015-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AC92mF7zvO1Mq7mUSkEGVg", "review_id": "ecKBGXtxkxqiQIE7o7lmfw", "text": "I love this place.  The atmosphere, the bartenders, the waitresses and most of all the food. The potato pancakes are delicious as are all their soups. I think there is something for everyone here. Their desserts are all delicious. We eat here before most concert or sporting event.", "business_id": "IxQ1ATP_Wg_QujO9nywzcQ", "stars": 5, "date": "2014-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bA_mSbsMGKI0iar76foRFA", "review_id": "TVHuQsdx3H9jCkasB64sEg", "text": "The pizza is great. Other food items might disappoint. They do deliver! Service is hit and miss. There is one rude,  smile-less bartender... I have actually seen him through the window and decided to go somewhere else because I was in the mood for good service.", "business_id": "qemCNgjeYGcFsRwxW9x4xw", "stars": 3, "date": "2011-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Ucu2jUX1r_cc102Lpqq3AQ", "review_id": "hSpfHoaQ-s8YxoonjTRUwQ", "text": "Very very VERY good beer selection. I liked going into the \"beer cave\" and finding a wide selection of Belgian beers including ones that I hadn't seen since studying abroad in Paris. Hot dogs were excellent, and not as messy as I had anticipated; the fries were fantastic. Service was a bit slower than I would've expected for a lazy Monday afternoon. I don't think it takes very long to prepare a hot dog, so that's the only reason for 4 instead of 5 stars.", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 4, "date": "2008-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "lW7fTFAwglpa7i3HPBsKHQ", "review_id": "5jCDzH0lnG0AOkG8Jq0UdQ", "text": "D's is a fantastic place with food! Reasonably priced and a nice atmosphere! Can get crowded but that's because it's soooo good! I love the selection of beer, it always me to try out a new beer without having to buy a whole case!", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 5, "date": "2012-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "byW028BfkDNkEXpINimbmA", "review_id": "zJa9MSQ8xqAVU_t_TdA0Pw", "text": "Best dogs in town!!", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 5, "date": "2013-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "n39GzHIhRAOPDBWg5LKjSQ", "review_id": "VDQ--sFwKP-RR85PcD5nNQ", "text": "This has always been my go to bar on the far East End. Always a great draft selection, you can't beat the bottle selection, and the food is passing for typical bar/pub fare. Location is good, street parking is never a problem, and ambience is slightly better than average. Beer is fresh and kegs are rotated regularly. Highly recommended! Can be crowded at dinner/lunch times.", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 5, "date": "2015-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FixW3C_F5FXggMLZIZMOag", "review_id": "_MiZi09ADNsDNEAj6Y1kCw", "text": "Takeout is a mess at this location. In the past I've had to wait 30 minutes past the time they gave for pickup, and sit on hold for 15+ minutes only to find out it was because they didn't have anyone manning the phone. The last time they didn't include an entree we'd ordered, and a month later have failed to send a gift card to make up for the cost.", "business_id": "h3la53L9-OX_HlfeAySh0Q", "stars": 1, "date": "2015-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "xI73iMf8OhOlG9hGWYNvEA", "review_id": "ZUixmsKgzrAz5eM7FSD7WA", "text": "I get it. It gets busy when you're a bartender/waitress sometimes. I've been there myself. But you can explain why things are late or why it takes nearly half an hour to pour a glass of wine without being incredibly rude and cold, and if you even say it with an apologetic smile, most customers will understand. Food was fine, won't go back for fear of the server.", "business_id": "OxIeMVcop5oxBUWANi-1Rw", "stars": 2, "date": "2012-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HrOQHeRzEm3DzqDLLwmrbw", "review_id": "g2MmOxn9wDXKQr_1xFdkGA", "text": "Great food and tasty cocktails! And if you're out and about later in the evening it's a great atmosphere that's not your average loud bar. The crab cake sandwich was DELICIOUS!", "business_id": "OxIeMVcop5oxBUWANi-1Rw", "stars": 4, "date": "2015-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qUEOyoNQtZjNqV5f7bT37g", "review_id": "R2wq3xtVIr58Ob8sbuGn0Q", "text": "Worst restaurant ever. Only place with openings on a Saturday night. Waited for 25 minutes to be seated when there were multiple tables open with workers walking past us not acknowledging our presence. Finally got seated and waited 20 minutes for waters and then ate mediocre food. Won't be back.", "business_id": "-nfzEVOVvmDSFbxvBsllGQ", "stars": 1, "date": "2015-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_vS9qNQvx8wVUOIkj4qfAg", "review_id": "dPmBR58PoKFWfrsFFbr6Hw", "text": "When I first moved to the city I drove by the Pleasure Bar all the time thinking it was a strip club. Imagine my surprise when JB suggested we go there for dinner one night!\n\nEverything was tasty - we ordered the assorted fried platter that came with mozz sticks (pretty basic but hey! The cheese was still inside all of them!!!), fried zucchini and potato balls (plump little balls fried crispy on the outside and bursting with creamy whipped potato goodness on the inside). Bruschetta was full of flavor as was the rolled eggplant.\n\nPlenty of parking (paid) in the back of the restaurant.\n\nEvery time we are there we have the same server, Jim, which is cool by us because he's pretty top notch .", "business_id": "-Nanlb7SYXObqQ6dZ49UOg", "stars": 4, "date": "2010-12-09", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "o_lcW5EwvmnnLQezh_PYpA", "review_id": "xWAniZ6a7gQp2j76HcF6_w", "text": "I was staying at a hotel nearby and was looking for a place close by for some food and drinks.  The hotel recommended heading down to Walnut street, but that seemed like a long walk.  I checked Yelp and saw that this place had some decent reviews, so thought I would give it a try.  There weren't too many people there when I walked in, so I went right up and sat at the bar.  I was greeted right away by the bartender (Bill).  He told me which three beers he was out of (which unfortunately were the three best ones on draft), then took my order.  I started with some wings and a beer.  I only order a half dozen of the atomic flavored wings which was unfortunate, as they were some of the best wings I've had in quite a while.  As a comparison, they weren't as hot as Buffalo Wild Wings 'hot' wings, but had decent heat and great flavor.  I then had another beer and ordered a meal they had on special.  It's not what I would call bar food by any means, as it was a perfectly cooked baked chicken with vegetables and potatoes.  I got a cup of cheddar and lager soup as part of the meal too which was wonderful.\n\nOverall, I was glad to stumble across this place.  As others mentioned, it seemed to tailor to an older crowd (30-49 seemed to be the median age when I was there).  I would have given it 5 stars had they been fully stocked on their draft beer.  I like to drink unique or uncommon beers when traveling and had to settle for Molson that night.", "business_id": "3zgswf_NfBJpeAoWeTkgMA", "stars": 4, "date": "2015-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YhbFAuwG-R3DH7nVRELVqQ", "review_id": "0XJ-DCPRpn1Igz70yXre3A", "text": "Today my boyfriend and myself went to Lot for brunch. It was delicious and very reasonably priced. I had the 2 eggs, potatoes, toast and bacon and it was delicious. My boyfriend had the breakfast sandwich (I can't remember the exact name) but he stated it was one of the best breakfast sandwiches he has ever had. The Bloody Marys were also on point! I think we have found our new Sunday morning brunch spot.", "business_id": "7XXmky6YYjsvKFwho_eavg", "stars": 5, "date": "2015-12-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_xWn9UN3NTNFMGx6fWehaQ", "review_id": "3Ga7A-v-ppj0VqrKnC-p2Q", "text": "Went out with some friends for a ladies night.  We had a great time in the environment, our server was very friendly.  I had the truly dirty - which was truly delicios!  Our food was good.  I had the falafel and side salad.  They had a drink menu that is pages and pages long.  We all had good food and great drinks.  \n\n\n\n(March 10th Bells Brewery will be there)", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 4, "date": "2010-02-27", "type": "review"}
{"votes": {"funny": 3, "useful": 7, "cool": 4}, "user_id": "UD7Y1CqfY6mDmRwIuCf6nA", "review_id": "nxR06n916LosbbCveFjUkg", "text": "Might I say that this is one of the best places in Pittsburgh to get a late night bite and brew?  Yes, I might and will say this.\n\nAfter a frustratingly long day during a frustratingly long week at work, I decided I needed to stop here and ease my nerves with some comfort food and try out a few brews.  This, my friends, is just what the doctor ordered (no pun intended in relation to my work).\n\nMy friend had beat me there and already had one of each in front of her.  She decided on the Trailerpark Tatchos and I'm not quite sure what she had to drink, but it was interesting in an interesting glass.  The Tatchos were amazing.  Nothing more than nacho toppings on tater tots, but a brilliant idea none the less.  The mixture of tastes on the fried up tater tots was great.  In a single bite you got spicy, hot and cool.  I decided that I needed to order something else myself, as I feared that my friend might end up raising her lip and snarling at me for eating more than I should.  I got myself an order of Cloudy and a Chance of These.  I dare you to take a wild guess as to what this order pertained to.   DING DING DING...you, sir get a prize...not really.  Nothing but an order of meatballs swimming in a big huge potion of their sauce.  Served with a side of bread to sop up what the fork missed.  The right combination of spices mixed with the melted cheese on top was what did it for me.  And that bread made sure I didn't miss a smear of that sauce.\n\nAs for the brews, I tasted three different ones while I was here.  It was kind of hard to choose, but their nifty little binder filled with the choices made it easier.  What also made it easier was the fact that our waitress was able to make suggestions, not just guesses like most places.  \n\nDifferent flavors hitting my palate at just the right time made for a great night here.  I will definitely keep this on my short list when I need to calm myself after a hectic day at work.", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 5, "date": "2014-01-31", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 2}, "user_id": "u1KESST6ATusVrn7F6HUvw", "review_id": "CHIihJaiG8eRN9G5DJ-_bA", "text": "Dr. Jekyll/Mr. Hyde.  \nPreacher Haggard/Twinkie Ted\nWilliam Pen Tavern before 10 p.m. /after 10 p.m.\n\nYes, there are two William Penn Taverns.  Two personalities.  \n\nOne that is a local bar with a cast of characters hanging out, reading the paper, making jokes, all on a first name basis.  Good bar food.  \n\nThe other is hormone fueled meat market kind of place for the under 25 crowd.  \n\nAnyway, both are fine institutions, depending on your flavor.  But make sure you pick the right one.  \n\nI'm personally in bed by 10.  I do like the \"south jersey cheese steak\" an awful lot.", "business_id": "vSZDiKiF8vf9zt_BcDL7GQ", "stars": 4, "date": "2010-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j1JDLZ9Fd61pT6ceJ7FBAg", "review_id": "MT2pgNCmvfPk8cJvlf0pvQ", "text": "I'd give this joint zero stars if it was possible.  This is the worst spot on Walnut St!  I'm not even sure where to start. The bar is small and overpriced. I had a steak fajita wrap that tasted microwaved.  The vegetables weren't even cooked. This is a place no one wants to--or should ever want to go.", "business_id": "DkX3YoxhH4uADsgVgQThew", "stars": 1, "date": "2014-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TbsTHuhppWcWcRVXZcdWiQ", "review_id": "VuPD17gCqEgYLaL8m-QYnQ", "text": "I love this little bar for a couple of reasons. Its a very friendly place full of unpretentious regulars, mostly the 30 plus crowd. Drinks are cheep. I'd almost call it a dive but not quite because the place is always decked out beyond belief from whatever the last holiday might have been. When I say decked out beyond belief, I seriously mean just that. Ya' won't believe it. The bartender's are always nice and actually know how to make drinks. The bar itself is cool; its a rectangular shape  so everybody is facing one another. The food is very top notch although regular bar fair. The only knock I've got on the place is that it gets a little too smokey for my taste and they sometimes have karaoke, which I'm not always in the mood to hear. \n\nIf you're driving through that part of town, stop in for a drink. You'll enjoy it!", "business_id": "9VtaTbTKVK9sQVy4j2RO-w", "stars": 4, "date": "2012-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kxRnhpUgooticN9DimR-CQ", "review_id": "3GnVsJ8hAUtKUXlWc4TtkA", "text": "3.5 stars overall..bumped up to a 4 for being...\"cozy\".. as one of my friends put it.  Solid food and a good place to start out a night.  A good way to get away from all the new and experience something with true Charlotte style.", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 4, "date": "2009-02-23", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "uYOo1cPQYQgr8pI0fiEV0g", "review_id": "e3q_mcCAOWThmyTqV5Ut3Q", "text": "Run to Alexander Michael's this Christmas season for dinner or drinks.  You will thank me.   \n\nTucked away in 4th Ward (which in and of itself is reason enough to head to A.M.) it is quaint and, right now, decorated with lovely garlands and greenery and twinkling lights (I love twinkly things).  It truly looks out of a movie.  And the houses around it are also decorated so sweetly.  A little bit magical.  \n\nI was a 4th Ward resident and kinda lived at A.M. for a few years and had not been in awhile.  We went  last night to meet friends for drinks and dinner before heading to one of my all-time favorite venues (The Fillmore... but I digress...).  Great beer selection.  We all had different meals-- nachos are delish (salsa not so much), my hubs said the burger was good, fried pickles (yum!), veggie pita was great, but you have to get the \"what it is.\"  What it is sustained me for years.  I'm veggie now, so no chicken for me... but, it was good all those nights!\n\nWhile the food is not 5-star worthy, the atmosphere, the bar, the beer selection, the people, and the staff make this a 5-star establishment, for sure.", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 5, "date": "2012-12-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "54S6BWJmWY45KkGjPzHKHw", "review_id": "NqyVsg5uyFbpxiVeBx4Hjw", "text": "Always love this place! Good food, great atmosphere!! Love the spicy crab soup, not to mention the staff is awesome!!", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 4, "date": "2015-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "yjSYAR8-e4d3Ln4sD9qWOQ", "review_id": "S-tjOCHXRjYN4aZ_0gIUAw", "text": "Definitely a great Irish pub!  I was a little disappointed that the downstairs is completely all smoking tables since that seems to be where it is the liveliest but in all reality, it wasn't that smoky so we ended up eating downstairs anyway.  I ordered the Shepherd's Pie which was veryyy good, definitely recommend it!  The decor is very authentic and could definitely see this place getting pretty crowded later on at night since the upstairs and downstairs are really not that big.  However, would recommend it as a place to check out if you are visiting Charlotte!", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 4, "date": "2007-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qxJ3xh_KsprvldlE7_meVw", "review_id": "pxTngfI89IKepxJC0gqyhA", "text": "We ate at Ri Ra on 12/12 and really enjoyed it. It's always a guessing game when you pick a restaurant in a strange city. Even with reviews to check out, you never know what you might get. Ri Ra had good solid reviews, however, and was within walking distance of our hotel, which was a deciding factor!\n\nIt was fairly busy when we got there and there was a trivia round going, which was slightly annoying, since it echoed through the whole restaurant, but we were there early and once the game ended, it was much better.\n\nWe were impressed with the selection of import and local beers. I stuck with Smithwick's but my partner was a little more adventurous and tried several local NC beers, all of which were good. \n\nWe started with the hummus appeitzer, expecting the usual bowl of hummus and sliced pita. We were more than pleasantly surprised when what we got was the hummus, toasted pita, and a selection of roasted red peppers, olives, marinated artichokes, and cucumber and celery for dipping. The hummus itself was excellent, garlicky and spicy. \n\nI had the Irish curried chicken over rice and it was quite good. The curry was sweetish, but still had a nice bite to the finish. The chicken was all white meat and nicely tender, and the peppers and onions that were in the curry were delicious.\n\nMy partner had the Guinness beef and veggie stew, which was also really good. There was lots of beef in the stew and the Guinness added a really different (and delicious) flavor. \n\nOnce the trivia game was over, the atmosphere was great. Music was fun but not too loud for conversation. Our server was friendly and helpful. She made great food and drink suggestions, and even gave us info on places to check out during the rest of our trip. \n\nRi Ra is definitely a solid 4* and we'll be back the next time we're in Charlotte.", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 4, "date": "2012-12-13", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "vlyj0sEDEQk-HEiiLWQh1w", "review_id": "-DUv7bDY2o8rYZJ4yTDFBA", "text": "I give this restaurant a barely made it 3. It was meh.\n\nFirst time here. Just in town for a convention and not a lot of restaurants were open like 9pm. We debated hooters across the street or this. Wanted something new so we picked this restaurant.\n\nWalked in with the party of 7 and the host said if there are more people coming for your party I can't accommodate you more than that coz of limited seating. Understandable but I think he could've said it differently. \n\nRestaurant is very steakhouse cozy. A little bit pub vibe, very small and quite dark. They have a bar. We were seated on high chairs. \n\nMenu personally I didn't think they offered a lot of choices but that's a personal preference. I ordered the calamari, my friends ordered fried fish sandwich, burgers and a chicken fajita.\n\nThe food took forever. I was even looking at other tables who were waiting on their food staring at each other or the ceiling. \n\nWhen we got our food, you would expect it to be hot. It's not. I guess with our big party some of the food was still cooking and some were already sitting out. My friends said the same thing. The temperature of food felt like it has been sitting there.\n\nI liked my calamari a lot though and the waitress said I got more than the usual quantity it comes with. My friends said their food was good. But good as in okay. Nothing too crazy. Price upwards of $10+.\n\nPersonally, I didn't didn't really have a good first time experience. I don't think I will go back either. I definitely would rather have spent my money on hooters. But I will give huge credit to our waitress. I really suck at names. She was very patient and polite. Knew her stuff and accommodated our take pretty well. Other than that, blah.", "business_id": "vIXUw1cLG84-m8LzOg3f-w", "stars": 3, "date": "2015-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ESu6WCQYwQSq0kgB7WHSzQ", "review_id": "Bp8w4dsGsev0PAW4-cTIsA", "text": "The ONLY reason this place gets two stars and not one is because our server was fantastic: he split our bills no problem, didn't screw up water orders, put up with a colleague's silly antics, and got our food to us promptly. \n\nThe food was bad, yo. Like, below Applebee's bad. We split an order of guacamole. For $8.50, you get a tiny dish of it and a bunch of chips in a little bucket. What a crock. The guacamole was fine, but for $8.95, you can go to Vida over at Epicenter and get (as I wrote in a previous review) a veritable fuck-ton of it prepared tableside.\n\nI also ordered the Southwestern Turkey burger. It sounded delightful - peppers mixed in with the meat, jack cheese, fried jalepeños - but tasted like garbage. The meat was tasteless but spicy, the jalepeños were in five tiny bits on top of the burger, the cheese was like plastic. The bun was overly bread-y. I ordered with a side of fruit, which was disappointingly not fresh.\n\nMy colleagues complained that their food sucked too: overly dry burger for $10 and a dried out piece of salmon for $18.50. What the fuck.\n\nPeople, don't go here unless you want to get ripped off and eat shitty food.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 2, "date": "2013-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CKp-Tg0-niMKKz1zf2bJTw", "review_id": "M5b7XphczCNIrcCEyo0QDA", "text": "Had a wonderful experience. My wife got the steak and it came out over done and not very good. We told the waitress and she took care of it with out a second thought. She got my wife a new steak, which was cooked perfect, and a free side. She also took the steak off our bill without us even mentioning anything about it. This was perfect customer service and we will defiantly go back! Also, I had the pepperoni pizza and it was wonderful!", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 5, "date": "2015-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Lx8HsuKahjELb-UZHGagZA", "review_id": "hP5uxG7mzie0pVRQ9i0cSw", "text": "Phil's is a small sports bar just off the beaten path. Had the bacon cheese burger w hand cut chips. Burger was juicy and well seasoned, but didn't taste the applewood bacon nor cheese. Chips were good, but half of them were not fully cooked. Beer and service excellent. Come for drinks. Don't come hungry ;-)", "business_id": "6SxAOEXHzNjWQMQ9Nnos3A", "stars": 3, "date": "2012-01-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "ID-rdph6XTnUkMziOCluEQ", "review_id": "olTK5Vgl2DUkR1ac0Tz5Zg", "text": "I had lunch at Capital Grill and was pleasantly surprised by the menu options that included fish and other non-meat items. The service was impeccable from the moment we stepped into the restaraunt. I was surprised that it wasn't more crowded but there was an ice storm brewing outside, which could have forced people to stay in. Even though I begrudgingly went to Cap Grill because my boyfriend wanted a steak, I enjoyed myself just as much as he did. I had the salmon salad, which our waiter recommended, and was delicious, and my boyfriend had the filet, which he has never been disappointed by at any Cap Gill. The service stands out at Cap Grill and, as long as you're in the mood for deliciously prepared but simple dishes, you won't be disappointed.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 4, "date": "2013-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "14t5tt41XgIbWllIptq8ug", "review_id": "SC4pNdUq7XTAf46C1d3Iew", "text": "Great place to celebrate with your special/loved one!\n\nJan3,2014", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2015-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "AfjBA2MAXUshy_qzk2FmGg", "review_id": "bmv2AMNnRmGjLNEsF_971g", "text": "Where do I start. It was a friend's 30th birthday so we wanted to go somewhere and light up a cigar to celebrate. Given Cutters is one of the few (if not only) indoor cigar smoking bars/options, your hands are kind of tied if you like cigars. I called (at 11pm) before going and was told last call was at 12:30 and the bar closes at 1am. At midnight, the waitress comes around for last call. When I ask what happened to 12:30 for last call, she says that the food and beverage director wants to shut down early - no other reason for the early closing. \n\n20 minutes later, a waitress comes over while we are finishing our cigar and drinks and says, \"Alright guys, you have to leave now\" and opens the door. If this is customer service, I'd hate to see what customer disservice looks like. I guess paying $15 worth of cutting fees for the cigars we brought with us and purchasing several drinks was not enough to buy good customer service. \n\nWe were clearly unhappy about the way we were being treated but left anyway. On the way out, the waitress holding the door makes unnecessary comments about our slowness in leaving the bar at 12:20 (which should be open until 1am). The waitress and the food and beverage director proceed to follow us out of the hotel, ask if we were staying there and threatened to have us kicked off the property. The sad part is we had not spoken with the food and beverage director up until this point so instead of inquiring about our displeasure and what happened, he immediately jumps to conclusions. Needless to say, Marriott Charlotte City Center and Marriott's Corporate Customer Service center will be receiving letters regarding this incident and the customer service of its staff. \n\nI personally hope Cutters gets what it deserves and closes up. It gives Charlotte entertainment options a bad name and the customer service was the worst I've experienced in a long time. \nCutters does not have to worry about my patronage going forward and Marriott should be ashamed to have such poor customer service associated with its brand.", "business_id": "7BVCmaxhvXgEpx7J-SQ4QA", "stars": 1, "date": "2010-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "taYAFnYaPddh2zBTZISdxw", "review_id": "A_tsUzkUu4-JyFD73trhFg", "text": "Had a blast at Connolly's on Fifth.  Was in uptown for work and walked over to the bar with some co-workers.  We visited on a Tuesday and it had a nice size crowd for  a Tuesday night.  We went for a few drinks and ended up staying until the lights came on! Walked in and instantly felt at home.  Its a dark bar with typical Irish bar decor.  Bartenders were very friendly and easy to get their attention.  Great beer selection and everybody was super friendly. \nWill definetely be back.", "business_id": "jmzPbvE_02SzTAjwZCTgYA", "stars": 5, "date": "2014-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "sXULK2ESJKrtoSExmslPkg", "review_id": "-vP8-MCbxXjDCnL_I0mRDg", "text": "Went here for my sister-in-law's birthday party and had a great time.  The staff was super friendly and had everything set up in fairly short order.  No complaints really.", "business_id": "e5J3s-xxs1S6PPHJhldBEA", "stars": 4, "date": "2015-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "I1WILQ2Ok1U8igHUE9iIdQ", "review_id": "Mtm_lXeKfhCjraJrD7ICtQ", "text": "Swanky ambience, great service, great happy hour menu.  Happy hour fan.\n\nWe had 4 appetizers from the happy hour menu - wild mushroom flatbread, calamari, greek plate, & arranici.  \n\nWild mushroom flatbread with truffle oil, goat cheese, & plentiful on the mushrooms was fantastic!  Lots of flavor - the delicate blend of the truffle oil with the mushrooms & the goat cheese was melt in your mouth for a mushroom & goat cheese lover.\n\nCalamari - pretty standard fare here.  Nothing that sets this one apart from any other calamari.\n\nGreek plate - could have had a bit more to it.  It sounds like more when you look at the description of all the items that are served - the dolmas, hummus/flatbread, 6 olives, stuffed peppers, & white bean w/parmesan salad.  The flatbread was crispy like a toast & as thin as a cracker.  We were expecting more the soft bread that we could dip in the hummus.\n\nThe ricotta filled dough balls were good & larger than the ones that can be purchased at Trader Joe's.  My gf & I agreed that they tasted like the ones we could purchase at Trader Joe's.  She loves them as doughy goodness.\n\nOverall a great place for a cheap happy hour.  We agreed we weren't sure that we would come for the full menu but for 2 beers & 2 appetizers or a martini & 2 appetizers for under $20 w/o tip for happy hour it is fantastic.", "business_id": "eaqJQP6bp7rQJQt5KqfvxQ", "stars": 4, "date": "2011-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wLAmP_C2NxhPaWiVMgO7ZQ", "review_id": "rRBT4gCHoHdE3aKr8yPNyw", "text": "We went to Blue last night - haven't been in years. I had the BEST grouper I have ever had in 46 years. The fish was cooked perfectly. It was in a picatta sauce with caper berries. The fish was placed upon two Italian crepes filled with ricotta cheese and spinach. The dish was amazing!! Our waitress was Carrie and she recommended a full-bodied Pinot that was lovely.\nJulie Shaw", "business_id": "eaqJQP6bp7rQJQt5KqfvxQ", "stars": 5, "date": "2014-01-12", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "4JJLPcLxaggBDmCYoN5G7w", "review_id": "Io47TFJVjvr44X4ospYjEg", "text": "\"WHAT \"................................. \"A\" ........................................\"Dump\" ! An insult to the community AND unless your an alcoholic or immature thinking the all u can drink nights are great is Paaaaaathetic!\nNot one to be judgemental but I'm not sure,  going out to drink till u drop, is a reason to think a place is fun.\nAll this said from someone who can indulge from time to time! I just don't leave home w/that agenda ! If I'm feeling like that it's a sign to stay home!\n\nBetty Ford is for quitters .....   If you can't handle it ....  don't do it and a bar pushing getting trashed means it has nothing more to offer! \nN  E  X T ....", "business_id": "COkT6HcVRY8Ur2nRTYY5wg", "stars": 1, "date": "2015-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bEHJzHIIL-mWwVA_aB27Rg", "review_id": "6zIKG-lsi3tDH1NPOcR9xQ", "text": "I feel like sometimes the saucer is over rated but maybe that's because sometimes I just want a Miller Lite", "business_id": "F-e-sWfVd3eCYll3BP1QFA", "stars": 4, "date": "2014-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zUspyQ5CLQh9Gg_gwr9f3Q", "review_id": "ccfgw7SlscRQ5sORSrk1Sg", "text": "Great staff, atmosphere, and food.  My favorite place to take my family!", "business_id": "r-pBY6vR_Iu5XhPRvPnquw", "stars": 5, "date": "2015-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "pasMPMQrqu7bqjx3ok_jeA", "review_id": "jSc8snYsa6DegzAAaV57hw", "text": "They have some great wings here (ask them to make them extra crispy). I literally have tried most of their flavors, except for the insanely hot ones. This time I tried the Pineapple Kicker Wings. I was thinking they would be a little more sweeter with the name \"Pineapple\" and all, instead they are more on the spicer side. The bf had Hot Garlic. They too were on the spicer side instead of really tasting the garlic. All in all the wings were still good and now you can get a basket which comes with six wings and a nice size helping of French Fries for $7.99. Before you would have had to add a side of fries. They also have really good drink specials: $2.50 draft beers and $9.00 pitchers. The appetizers of my choice is the Spinach Artichoke Dip and the Pepperoni Pizza Rolls...I wouldn't recommend the  Fried Jalapeño  b/c when I had them they were kinda mushy and I actually prefer them with cream cheese instead of a nacho cheese filling. Looking for a place with great wings and specials on drinks then head over here...also a great place for sport fan fanatics!", "business_id": "3xdV-7di_YD3MVqs3Pa7-g", "stars": 4, "date": "2012-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kmQE3dj9qLro1DSgGe6ggQ", "review_id": "LgyVBOrT5yP2L3aC8aZwfA", "text": "Nice view! It was a slow day in the restaurant and we had decent service. Slow on the refills but it was fine. Service was friendly, food was average!", "business_id": "Zc2IwSzGY63zkyhfNrr7HA", "stars": 3, "date": "2015-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CH5RheU8pnBg5h8I4XLC8g", "review_id": "Icdd31eZnc1sB6ZmPIMG3A", "text": "Good food, drinks are priced decently, super friendly staff.  We stop in at least once a week.", "business_id": "HaBkx5PwvbBpQ2iNCgHnVQ", "stars": 5, "date": "2014-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-hwN2juKYn-KTxa2WBYLnw", "review_id": "DRrtTDk74hAmnEeswaOsog", "text": "You know I hate to do this but I have to agree with Vickey M.  The Gritty burgers are something of an acquired taste.  They taste good to me because they bring back memories of the 70s.   They do have good flavor but are somewhat messy and there are better burgers than the Gritty.   \nThe bar was more fun when it was small.  We don't go there anymore because often it is so busy that we can't really enjoy the place like we used to.\nBut I would stop by again for the Gritty Burger.\n\nI recently learned that the gritty burger recipe was changed in the 80s sometime?   Correct me if I'm wrong.   We did think the burger was somewhat different from what we remember.  Now we know why.  The old burger that everyone loved was way better than the new one.\nWe think they need to enlarge the place and bring back the original burger if they still have the recipe.   The sauce was the bomb.", "business_id": "6oDZ78JiSKjXVLcurCpnhw", "stars": 3, "date": "2010-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y5pk_6ObwlTC4R8hw-JjVQ", "review_id": "kA1lXDEoElp4L3PRaWK5tA", "text": "Wilson's... 4 stars for what it is... a local sports bar.  There is always parking available, they recently upgraded all of their TV's to new flat screens, and the locals and staff are always welcoming.  The price is right for the food they have to offer, although you're basically only going to get something deep fried or grilled up.  Stick with the burger or grab the fish fry... the wings suck, but they basically always do in the Midwest (sorry, these are facts, just sayin').  The best time to go there is when a Packers, University of Wisconsin Badgers, or Brewers game is on... especially when they're winning.  In other news, there is Karaoke on Friday nights, and a couple of pool tables if you're interested.", "business_id": "zAsxPh3h9xMQnSDGl41kSg", "stars": 4, "date": "2009-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nmDcdE8LvcJ0vFy9jmctOA", "review_id": "rHRJn_uJotlY9pf_iUDTiw", "text": "I have been to Dexter's several times for drinks, food and football.  I love that on Badger saturdays they have a shuttle that will take you down to the stadium for the football game and pick you back up.  Their breakfast is FANTASTIC and very large portions, 2 of us usually share something.  They have a great selection of beer and pour a great drink too!  The wait staff is fantastic as well, extremely friendly and hard working.  They seem short staffed often but they all run their butts off and there is hardly a wait for anything!  Last night I had the Rueben w/ waffle fries and it was delicious!  I would suggest getting a big screen TV for watching the games but what they have works well too!  I love this place, a definitely must go to!  They also have trivia on tuesday which is a blast!  The food is great, prices are cheap, staff is fantastic...what more could you ask for?", "business_id": "HTplzElel_F_U_qhWuDKdg", "stars": 4, "date": "2011-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 3}, "user_id": "omOnbJjKaJUkvYi3reIB9w", "review_id": "tT9MwwmAlOzQCUoKWtWsQg", "text": "If you are craving a massive bar burger from a towny bar, this is the place to go. \nThe burgers are so large that you should plan on cutting it in half and take the other half home. They are excellent!\nIf you order the bacon burger, you can expect at least 6 plus long stripes on bacon on it, I was completely amazed with the quantity and quality of the burger. Amazing. \n\nI have also been to the Eagle Crest on Taco Tuesday. Prepare yourself for the largest taco you will ever see. If you order the taco salad they give you a very large plate stacked high with chips and all the fixings. It's great. More than any one person can eat in one sitting. \n\nThis is a bar people! Don't expect proper waitress service, the bar tenders are serving you most of the time. Just be happy that this particular bar has amazing food. \n\nSince this is a bar, maybe the best Bloody Mary in town. It comes in a large mug with 2 huge shrimp, a beef stick, pickle, and green olives. A meal in itself. \n\nIf your hungry and don't want to spend a lot of money, this is the place I would suggest.\nMy new favorite bar.", "business_id": "QdSGdvZATzejDkSs435Rdw", "stars": 5, "date": "2013-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wKXFKK1a_G96y2WjOAkPHw", "review_id": "oSUeP72riIbvs9RxK46WLw", "text": "We go here all the time. Love the unlimited bread sticks. The food is good and enough so you can have some for lunch tomorrow. And the staff has always been really nice.", "business_id": "PhdMPqSdLZi6IV8SdnpUAQ", "stars": 4, "date": "2014-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "QKgaqFlx5Dz_YMoPUFed4A", "review_id": "7eWu6a4TW3Mde0RFvclDww", "text": "Hidden gem!!!  Friendly bartender and waitstaff- cozy environment.  The food is different than typical bar food, in a great way!!!  We had the special of the day which was a blue gill sandwich with fresh coleslaw on it- it was excellent.  It's going to be our new date night spot!!!", "business_id": "JJFoeKZXgi2_LeECDMkkoQ", "stars": 5, "date": "2015-12-16", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "oOXgY-h-qsjdwToXjOH-VA", "text": "Quick review: very large menu, offers all you can eat fish fry, unusual layout. Decent service, mediocre food, fairly pricey for average bar food.\n\nDetailed review:\n\nAfter taking a small fish fry break, we resumed our quest to find the best fish fry in southern Wisconsin. With the roads in poor shape thanks to the recent snow, we decided to focus our sights on local offerings, and since Tully's is \"around the corner\" from our friend's house, we decided to give it a try.\n\nWe walked in and seated ourselves; we chose a small table that was located in a section \"in front\" of the bar area and adjacent to the pool tables. The salad bar and another small dining area are located on \"the other side\" of the pool table room... Odd layout for certain.\n\nOur waitress took our drink orders and we browsed the menu, which included your typical bar fare: lots of fried appetizers, burgers, sandwiches, and so on. I'll say this - there are a ton of items on the menu; even the Friday night fish fry offered 7 varieties of fish, 4 of which are all you can eat.\n\nOur drinks arrived and we placed our orders: AYCE baked cod with a baked potato, AYCE beer battered cod with cheesy hash browns, and AYCE lake perch with hash browns.\n\nWe were informed that our meals also included a salad bar trip... Too bad we had already ordered cheese curds. \n\nBut, being the troopers we are, we ventured over to the salad bar and built a few plates. It was ok for a bar's salad, but not great by any means. My tomatoes were mushy and tasted \"off\"; broccoli was dry and obviously came from a bag. Coleslaw earned decent reviews.\n\nCurds and fish arrived at the same time. Curds were breaded and typical \"from the freezer bag\" variety. Nothing special, and not worth the $6.79 price tag.\n\nFish plates each had two pieces; baked cod was drenched in buttery water and loaded with dill flake. Hmm... It tasted ok, but wasn't as flaky, tender, or flavorful as I'd prefer. Baked potato was foil-wrapped, and nicely cooked.  \n\nBattered cod had a decent batter that had just a hint of a unique flavor (we couldn't put our finger on it, as it was tasty), but it was fairly greasy and like the baked cod, the actual fish was quite \"lifeless.\"  The cheesy hash browns were good- nice and crispy, with only a hint of grease.\n\nBattered lake perch was just like the cod, only it was more greasy. I shed a small tear as grease oozed out of the piece I tried.\n\nThe bill arrived... $55 for three with one round of beers. Yikes.\n\nTully's = fail.\n\nService = 4 stars (good, prompt, fun)\nFood = 2 stars (based on fish only)\nValue = 2 stars\nMisc = 2 stars (not real exciting)\n\nI'd come here to drink some Miller Lites and to munch on some bar food during a game, but I'd skip the fish fry.", "business_id": "kOXJrbuB1a1Na6sf_WQnDg", "stars": 2, "date": "2009-12-13", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "CBMMaL914v1n08N34yX8UA", "review_id": "yJB3pgrepjQ_Yd4y1iL60Q", "text": "I've had good times at Brothers.  I've had bad times at Brothers.  If you want to know which I've had more of, just look at my rating.\n\nThis place would be remarkably better if it didn't feel like management had only two bartenders working the giant bar on the \"first floor\" every Thursday, Friday and Saturday.  It gets too crowded to play darts.  It seems like every time I'm here someone does what in my olfactory opinion equates to crapping their pants so then you have to go to the other side of the bar just to avoid it.  Guard your jacket unless you want a free drink spilled on it.  Past 11pm the bathroom resembles a slip and slide.\n\nOn the good side, expect cheap drinks... assuming you're able to order them.", "business_id": "RcHfSp2qCW8DFwpmpuNv4A", "stars": 2, "date": "2013-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6nCuP3lx1ibS4sBCdzuGHg", "review_id": "uSdghE644of768MvuyJAhQ", "text": "We got there around 3:15 Saturday told 15 min for a table, more like 35.  AFTER we ordered we were told there was at least a 45 min wait for food.  No apology, nothing.  I had soup & Salad the other person had alfredo.  Not complicated to pour some sauce on the noodles!  Had to ask for drink & salad/bread refils.  Over 2 hours for an average meal.  It's always slow when we go, but that was just insane.", "business_id": "H0D2HYqLd9MRCq68rtbTyQ", "stars": 1, "date": "2012-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rg2o9mNf76rqY7nFByPS5g", "review_id": "59zvxp3xlzHgzEjIPV2ePA", "text": "Good times with friends and cheap beers, and that's pretty much it.\n\nThe food is not bad, but its just bar food, so u cant expect much. The Irish Nachos is good to order with two more people. The other appetizers are just ok (hmm, the spicy cheese bites are good, although small), but there's usually some food special everyday.\n\nBecause of the regular coming, you develop certain bonds with the place, even if the place is not great. If this bar was located anywhere outside Campus, I dont think I would ever go there. \n\nHowever, the memories make the place and thats pretty much how Murphys survives.", "business_id": "MVH3JOKpQvMTP4jxwBUhkA", "stars": 3, "date": "2013-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9-orFNothRnnGHdVIXk2Yg", "review_id": "Lhi7rZrRopY0QnhGjMgaKw", "text": "Despite the fact that I came in second place, two years in a row, in the annual mustache-growing competition, I will give Mike N Molly's 5 stars.\n\nMike N Molly's has an excellent beer selection, an excellent whiskey selection. It is perfect for coming in really any (or every ?) day of the week with friends, with a book, with an able finger to play the Megatouchforce. Their beer garden is excellent. Once many years ago I saw Andrew Bird play in the beer garden and it was magical. Sometimes a dance party happens.\n\nIf you live in Champaign you should make this place your regular bar, probably. It gave me so many really crucial memories and I guarantee it will do so for you as well. I will always stop in here if I am in town. I came of age here in many ways. I blame all the drinking I did here as a 25-year old for keeping me so youthful now that I'm 30.", "business_id": "6X7vAFv-Xj1TPcrJK7H2Eg", "stars": 5, "date": "2012-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "0EfU6vvU7buXmTc3LPsnNw", "review_id": "zFYXsYrx1EiSDlovbKh3qA", "text": "Every Monday, I am reminded of their ranch chicken sandwich they used to serve here only on Mondays. Along with $5 long islands in various flavors. Could lunch get any more divine?! This may not be the fanciest bar, but it has a warm, homey environment. Coupled with a friendly staff and delicious bae food, you can't go wrong. Their loaded fries are bomb and the fish sandwiches are definitely worth the waits. Lent is coming up, people, and this is where you want to spend your Fridays! You can quiet your Catholic guilt by indulging in the fish while drowning your overindulgence in favorite beers.", "business_id": "05FJCAvUFOAk8B_nIOqt7A", "stars": 5, "date": "2015-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZRWDnvo07YZxxtrDYWf02A", "review_id": "k0qcwdgmdX6C8P8stYAx9w", "text": "Best burgers in CU.  The staff are very friendly, and spent time talking to my mom about the wine that they served.  Really hope to go back before I graduate.", "business_id": "IUhO58Il7gUEjl1RMEncHA", "stars": 5, "date": "2011-12-09", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "7MM5lXtbeOO-P5TH0QzJhA", "review_id": "mOC-tJrUgCATpQOhZ-sM6A", "text": "Exceedingly mediocre experience. I've heard numerous rave reviews about this \"hidden gem\" but after eating here I'm truly puzzled. Am I in the right place?\n \nPoor beer, wine and food selection (as in no selection). We tried the fried ravioli which were served on a bed of wilting lettuce. The mediocrity pushed us to ask if they were made in house-- our server told us no with an apologetic smile. Then why exactly am I paying upwards of $9 for this frozen bullshit? \n\nWe had a real good laugh about all the upcharges for our choice of side. Tortilla chips come standard and it's extra for fries?! Cmon. I really should have known something was amiss when our server neglected to ask how we would like our burgers cooked. The bacon on my burger was undercooked and chewy, while the patty was wayyy overcooked. No pink in sight. \n\nBe sure to check out Farrens if you don't have any taste buds or standards for your dining experience!", "business_id": "IUhO58Il7gUEjl1RMEncHA", "stars": 1, "date": "2014-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "-UMxemhI-Co189BNhhuqpg", "review_id": "llto0_uaCyIl2w0d2DjScg", "text": "So, the lady's sister hit a car in a parking lot somewhere. So there's a new bumper for a car being painted in her garage on Sunday. The sister comes inside the house around 5ish, as we are trying to decide where to go to dinner. Name places... all no, finally \"Farrens?\" and it's a yes. We decide to meet there at 6:30. \nDrive from the country into town, and exit at Neil street from 74. As we are exiting, look to the north and see Toys R Us is packed, as is Olive Garden, and most everything else that way. \nDrive down Neil, turn onto Main, and all the restaurants in downtown are relatively empty: 301, Dublin, Big Grove, Guidos, Destihl... everything is relatively vacant. I start to feel sad, not for the empty restaurants, but for the people who decided that it was worth it to eat at Olive Garden. I felt genuinely sorry for people who thought that Olive Garden was a good decision. \nWe park, and walk to Farrens. We go past more restaurants that have seats available, Miga, that Thai place... and still I'm thinking... FRIGGIN OLIVE GARDEN IS FULL!!!\nWe go down the ramp into Farrens. I make eye contact with the server He points to a table. No one else sees him point to the table. I go and sit down, they stand on the ramp, and are like \"You can't just go sit down, they have to seat you\". and i'm like... DO YOU KNOW WHO I AM!!! A little while later, I inform them that yes, he did tell us to sit there. \nWe place our drink order, there's Triptych on tap, so that's nice. (Seems to be a recurring theme, that Triptych stuff is everywhere). I order a beer on draft, the lady orders a beer on draft. The sister asks \"do you only have that craft stuff on draft?\" She gets, I think, a Coors Light. How can you drink mass produced beer with craft food? \nKridz orders the mozzarella sticks. I get the portabella mushroom appetizer. The moz sticks are moz sticks. Nothing too fancy (it seems) about them. The portabella mushroom is the entire cap, cut in half, breaded and fried, served on a salad bed. Hell, this thing is practically a meal to itself. For the actual meal, I order the Russell, you can't go wrong with sautéed mushrooms, bacon, blue cheese sauce and pepperjack cheese. BACON ON EVERYTHING!!! \nAt some point before the burgers came out, we also ordered the mac and cheese. If this is on the menu, get it. The ladies at the table were like.. \"what is this puddle on the top? grease?\" and i'm like \"uh... that's butter\". Then they are like \"who puts butter in their mac an cheese?\" then go into a discussion of how they made their mac and cheese for holidays... this, this, this, butter, this, this... seemingly forgetting that they put in a whole lot of butter. Butter makes everything better, as does bacon. mmm bacon butter. \nI dive into my burger, I also got fries with that, fries are delicious, but unnecessary after eating some of the mac and cheese and the whole mushroom cap. I finish my burger. I have blue cheese sauce throughout my mustache and beard. Thus is the struggle I deal with. A drippy delicious burger, all throughout the beard. \nI have another beer. Everyone else finishes eating. The ladies sit around and wait for the sisters significant other to show up because... she locked her keys in her car when she parked. They wait, she will meet me momentarily...\"where are you going?\"", "business_id": "IUhO58Il7gUEjl1RMEncHA", "stars": 5, "date": "2015-12-22", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "2g4y_xXf_tddha1oS8TcTg", "review_id": "X2o4rnWYSWGZkcC78r4BWA", "text": "Awesome beer selection!\n\nI came here with my boyfriend for trivia night, which was led by Dave. The questions were perfect for our group of 7. I even got to answer some ;)\n\nSince we won that night, we got a gift certificate to the bar and bought rounds of shots. Cannot think of a better way to spend a sunday.", "business_id": "mJxu0USvbwSHcGsmwWh22A", "stars": 5, "date": "2013-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UHgo14XWliFG-hQrhNnSMg", "review_id": "6w-nOvHbCKFfko78vWOO0w", "text": "Bacaro (pronounced bah-kah-roh') is a trendy little ultra-modern wine bar.  The food is largely excellent, though portions are modest.  Bartenders and waiters are generally quite knowledgable about the huge selection of wines they have, which is a great plus.  And prices are rather reasonable, though not great.\n\nPerching yourself at the bar for half-off wine and some dessert on Sunday night is a great way to enjoy the ambiance of this hip little place.", "business_id": "h9xdY1NO4GnNijNChTy-8A", "stars": 3, "date": "2006-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xNq3WgDKAERDbYpg2yF19Q", "review_id": "o5bK-gnKcScI6MQydrku5A", "text": "Our favorite restaurant in Champaign.  Service is great and very friendly (apart from one server we had last fall who has, thankfully, seemed to have left).  Food ranges from very good to amazing.  We've never had a bad meal at bacaro.\n\nYou can throw down a lot of money here, but you don't need to.  The bar is great, they have reasonable and interesting wines by the glass, and you can have a few appetizers or smaller courses and leave without spending too much and but still feeling like you had a special night out.\n\nHighly recommended.", "business_id": "h9xdY1NO4GnNijNChTy-8A", "stars": 5, "date": "2014-01-04", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "ceKoQX0_IJZ6Lr9-9LGcbA", "review_id": "IbhhDt9XZQi_-XSzyk3UIw", "text": "\"Thunder Dan\" lives on in Downtown Phoenix!  \n\nThis is a very good choice if you're looking for a cool sports bar atmosphere before/during/or after a Suns/Dbacks game while in downtown.  The ambiance is great being dimmly lit, having exposed bricks, newer newer flat screens tv's and surround sound that really makes you feel apart of the game.  \n\nI'm only commenting this place as a bar and not on its food.  I don't think this would be in my top twenty of choices to eat at with so many other great dining choices nearby.  Only come here for the scene and the drinks, you really can't go wrong with that at Majerle's!", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 4, "date": "2010-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "llu0xnAghOiQ1y22J-tK1g", "review_id": "FgY_O3aNqfZ5V6oAziuRuA", "text": "It is pretty loud in here, but other than that I like the food. The chicken sandwich and the fries are great.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 4, "date": "2013-01-24", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 4}, "user_id": "6kmu0mYbdpMIOZ6Y0eVsxg", "review_id": "R1pbjiFRTE1wY8YeQKbVeQ", "text": "I have taken my mom here twice and was really pleased with the service each time.\nGet the shrimp wrapped in pancetta.  Yummy!\nI also crave...no...I mean...CRAVE their lobster bisque a few times a year!  It's rich, creamy, with a bit of a kick.  I always order a tub to take home with me.\nMy only gripe?  When the heck is it opened consistently?  Argh!", "business_id": "j8nyAaN_w5t6wYv-ni23sg", "stars": 4, "date": "2008-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hnzx7Q7IWq5EDVe0yjKK8w", "review_id": "4MV7fazeDiLeIy0a7DwVNQ", "text": "\"Quick eats\"\n\nYep, that sums it up. You go to hooters and you kinda know what to expect. I find that hooters centered around campuses have less service then others.. and this locay is no exception. This place is also kinda interesting. They have tables but really low seats and some tables with high stools. The restaurant feels hodge podge in the back.. so opt for a table in the front.\n\nGo for the wings and to watch some games. Worry less about the service and you'll be fine.", "business_id": "qsWxbgQwuomXvMseg23DGg", "stars": 2, "date": "2013-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6mrj3D7ikVUwY14CSQsFDA", "review_id": "AEnNgekOELtVWrSRj63Xng", "text": "I really wanted to like Cheuvront--the idea of having an urbane spot in which to explore a wide range of wines and uncommon cheeses was very appealing.  If I had stuck with that I might have had a very different experience.  Unfortunately, I tried to range farther afield and came away feeling like everything except the wine and cheese came from Costco.\nCheuvront gets predictably high marks for the range of the wine list and the varieties of cheeses--if Wallace and Gromit decided to move to the desert and become social drinkers, here is where they would do it.  I took the menu's advice and paired a Queso Iberico cheese plate with a pinot noir (Cartlidge & Browne '07) and liked both very much.  Actually, I liked the cheese.  The rest of the \"plate\"--almonds, dried cranberries, and a few grapes in their twilight years--evoked no real response at all.  My accomplice in dining chose the Pascual Toso Malbec '07 (accurately described as a full-bodied red) and summer salad.  The wine was great--complex and dry without being acerbic--but the salad tasted like the chef had just given two weeks' notice.  The chicken was bland, the \"mixed field greens\" had clearly just come out of a bag, and the roasted shallot white balsamic vinaigrette was the middle school marching band of dressings: yes, I recognized what was being attempted but still felt bullied by it.  The pumpkin bread pudding was good, but not worth making a trip for.  The latte and cappuccino were fine, but here's a tip for the kitchen: if you want coffee to stay hot, warm the cup first.  By the time our friendly-yet-overwhelmed server came back with the cinnamon, the drinks were lukewarm.  \nSpeaking of service, let's not.  We got menus, we got food, we got the bill.  We also waited a lot, heard several rationalizations for said waiting times, and had to repeat requests.  We spent two hours for a snack-sized meal that required no cooking except for the bread pudding that had obviously been made much earlier.\nIf I could send one message to Mr. Cheuvront, it would be this: It doesn't require any particular talent to sell good wine and good cheese at above-average prices.  It does, however, require talent and skill and desire to create an experience that keeps folks coming back.  If I want to drink good wine in a mediocre setting, I'll buy a bottle at AJ's and smuggle it into Denny's.", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 2, "date": "2009-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u4MQp3zX9RolLtNnp9FxoA", "review_id": "3CeAHoLnPqcp_RHL3zHEyQ", "text": "I can't really think of a metaphor that will really describe this place. My heart is really overwhelmed by the great service that I just had. This restaurant has a lot to offer, whether celebrating an event or not. They have a wide selection of wine and cheese and a unique and eclectic menu. They are here to delight all sorts of palate!", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 5, "date": "2011-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "iEjUBBSkVQ6Ijo-m6b3Kxw", "review_id": "UPVJv8AIJzArw7RSifK58g", "text": "I have eaten here many times before, usually before a D-Backs game or a concert at the arena or Dodge Theater.. I like the Pulled pork  sandwich with baked beans and fries. \n\nSure it seems like a typical sports bar, but the food is nothing like a Chili's, Apple Bees, etc... Its better. Its more real than that factory crap. The drinks are good, I enjoy a Mango Pina Colada on a warm day before I head to park. I hate beer and cant see spending $5.00 for some watered down piss!\n\nI like checking the out sports/music memorabilia.. I can recall a lot of the concerts I have seen everytime I visit Cooperstown..  The staff is always friendly and the food is always prepared properly. I hope to see Alice there sometime..", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 4, "date": "2009-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xB9Yze6uC1mJXEzA8wpWSw", "review_id": "-8UbbUFsCTRqzyboBqdzuA", "text": "Good food. The service was extremely slow and the hostess couldn't get her wait times anywhere near correct. The bartender was slower than a snail.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 2, "date": "2011-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YiCq6m7007oYuXy88-3Llg", "review_id": "eCvQpsqGbCJFC1esakEcgg", "text": "Gross! I ordered a turkey sandwich. Just awful. The bread was falling apart and hard, the meat tasted terrible, like plain ol' lunch meat. Overpriced and definitely not worth it. Don't waste your time or money!", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 1, "date": "2013-01-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "3MBE2Tctlhfm9xmxUBMBoA", "review_id": "SVmGTy0q-N54FXXLH0QaDQ", "text": "I went there today and the food was bad the prices were high and they really screw you on the double platter deal. Do your self a favor and go somewhere else's.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 1, "date": "2015-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "74BsmOZHUUdsvzYtGtlRiw", "review_id": "QWbhu3yMA3fqTDxOh8CwCw", "text": "Teeny tiny bar with a decent selection of wine and beer, and some really unique soda for the non-drinkers.  The kumquat flavored soda was quite interesting~ not overly sweet.  They also carry bubble up!  The place looks like a cozy little house from another era.\n\nThe drinks and the service with a smile will ease your hunger pangs and soothe your eager impatience.  Really friendly service that will actually make you forget for a while that you are waiting to be seated next door.  Our group was actually surprised when we were called.  Cheers!", "business_id": "JR95uaM82xBUIZ-kQ785iA", "stars": 4, "date": "2009-02-03", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 4}, "user_id": "YxRKHhhuWxX96_quP9Tgyg", "review_id": "6e03Zgjp85YI5EJwF2pNGg", "text": "this is probably the coolest diner in downtown phoenix. all organic ingredients, a kickass interior (it's super small, but totally rad), and great people working. say hi to the bearded jewish cook, andy, and he will make your food just the way you want it, and also, with love.\n\nthe food is totally cheap and tastes exquisite. you can also eat outside, if you want. \n\nit's located on a nondescript corner in a residential area, so it's easy to miss, but this place is definitely worth checking out if you're downtown.\n\nalso, the hours up there ^^ say it's open until 5, but i am pretty sure they close at 3.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2009-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "rjlb-7-JcmM6fR64ZpyTug", "review_id": "5IZ9L1a1E16fdI2N0zUv-A", "text": "I just love everything about this place. The location, the outside seating, the vibe, the food ... everything.\n\nThe kitchen is very small. This vintage diner car was meant for one cook. So the two guys in there really have to hustle and work around each other. The food is top quality as well. My boyfriend and I split a PB&B Burger and the Bumblebee chicken sandwich on a biscuit. The chicken was probably my favorite, but it was impossible to eat like a lady. It's stacked so high that in order to get some in your mouth, you have to get some on your face. I gave up and just started stabbing at it with my fork. \n\nThe best part of Welcome Diner is the atmosphere: twinkling lights, picnic style seating, and friendly staff. I'm not sure who was working this last Saturday night, but he was so friendly and knowledgeable. We had a good little conversation about the history of the diner car. \n\nThis would be a great date place ... if that's something you're looking for. This is also a good place for a group of around 6 friends to take over a picnic table.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2014-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "ymLuQ7z4R_5Gr1lpuA5lqg", "review_id": "4NKsD1A4IvKZC1_qQ_Ch4Q", "text": "This diner came well recommended by the nice folks at the Phoenix hostel just a few blocks away. Easy walking distance in this cool little neighborhood from the hostel and the fun stuff to do on 5th street. \n\nThe old diner still has the 50's vibe with classic neon, but the food is non-classical diner fare (in a great way), is healthy and satisfying, and the folks working there are legit - down to earth and friendly. Just chill folks, no pretense, great food. \n\nIt's awesome to be back in the \"south\" and see iced tea on the menu. I kept requesting more, and the cool tattooed chick just brought me out a pitcher, a whole bowl of lemon slices and a smile.  That's hospitality. \n\nI had the \"KOKO\", a hand breaded, fried chicken breast in a homemade biscuit with some kind of homemade remoulade, baby greens, tomato and a side of vinegar-based red coleslaw. Awesome. Friends had a deep fried avocado (vegan) po-boy and the other gad the fish po-boy, both of which looked great. \n\nDefinitely coming back.\n\nEdit:  BTW, just saw on their online menu that they have a beer terrine salad, don't know how I overlooked that last night, but I'm kicking myself. Any place that has beets on the menu gets an automatic A++.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2014-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "QtV-btsFKXQrcNqQAhzaPg", "review_id": "uoo7XSTQxFEPpON-uzc6_w", "text": "This is probably my favorite place to grab a casual dinner in Phoenix.  It is usually pretty busy on the weekends so be prepared to wait a while unless you can find a spot at the 8-10 seats inside.  Unless you are a veg I expect you to try the fries smothered in pork and slaw.  Hands down the best thing I've had there to date.  The PB&B burger is great and so is the Bumble Bee biscuit.  If you live in the downtown area or you hit up RoRo often, stop into this gem of a diner.  The staff is really hip and really friendly.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "le5EJ2--BRGwrmJ-_VD4gQ", "review_id": "Z_8Gj8H-Xv2e4ISmg3_ETQ", "text": "The big Jim and the Carol are both fantastic. It is also a really nice place to sit outside in the evening.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-02-19", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "NajiKyHeMkQrzaCAhVk0wQ", "review_id": "k42R2MI20INeKVDSZYWL9g", "text": "The first reviewer says it all pretty much. The regulars are pretty nice, everyone knows your name here. $1.25 for a beer (bud/bud light/Amber bock) and $6 for a large pitcher, and $3.50 for a small pitcher). They also have a small kitchen in the back where they bake pizza ($2.75 for a pizza that will serve 2! Tehy also have chicken wings, and cheese crisp) They really have it all. Roof leaks when it rains. The A/C works great, though, and all the air comes down out of a slot lining the bar. The tenders know how to mix a drink, and if you tip decent, they'll load up those drinks to the brim.\n\nThey also have a download-capable jukebox, and an ATM. They dont take CC's at the bar. IF you are nice and they know you, they'll cash your paycheck for ya. True service!\n\n...\"TO ALL MY FRIENNNNNNNNNNDS\"", "business_id": "JwjDSrMrKmHUXYqoIvTgUA", "stars": 5, "date": "2009-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UlsgY-HnJngOLC6FvQ1tQA", "review_id": "5GR-AFNF6hb1_1sq6WSyuQ", "text": "cutomer service from staff exceptional but must say my co workers and I had at least three horrible experiences with owners and either managers or supervisors. Food is not the greatest but a heck of a deal for the specials. Would recommend getting specials because of great prices and just drink", "business_id": "IgaruuknYwCr9afeDYQ_yw", "stars": 2, "date": "2015-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E9YXZbCzgeFrH6YsG49TcA", "review_id": "VHz0Ys51gMKs17cRRo8Zzw", "text": "Only been to Applebee's a few times but never this location. Applebee's is always good if it's late and your in a pinch to find a place. My friends and I tried this Applebee's last night. (We usually go to the one on 7th st.) When we first walked in it was kind of a weird feeling. When we sat down my friends and I were making comments on how the staff looks like they hate each other and how it made an awkward work environment. We are all server so we understand a bad night but seriously it was really uncomfortable in the place. All the servers and host giving each other dirty looks. The food took a while to come out which I get sometimes the kitchen is slow. New cook, under staffed whatever not to big of a deal the issue was our server. I don't know if she had a bad case of resting B**** Face or what but she just seemed like she was annoyed with our existence. This is when it really gets bad about half way through eating my burger I got stabbed in the mouth by something sharp when I pulled it out it was a bone! Now I'm not the one to complain about my food and it was really good up till the end so I just ate the fries and was just done with the burger. ( I was to grossed out to finsh.)  I wish I would have said something. I have spend my whole day off from work sick as ever. I got food poisoning. I will never eat here again. I'm just so sick and annoyed I spent money to just get food poisoning.", "business_id": "hzUOqxpcnYYBgLlrgvjQYQ", "stars": 1, "date": "2015-02-11", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "QMXyrLG4oEChhzh4eGks_w", "review_id": "JXIwQWXm1Wgg4AX7bZ2GiQ", "text": "George & Dragon is THE place to start your new year off right!  Me and my friends have a tradition of meeting up at G&D on New Years Eve to begin our new year's celebration!  We show up around 2 PM to get a booth and spend a couple of hours gearing up for the big countdown at 5 PM, which is when the new year begins in England.  Although it is always packed during the celebration, the staff is always super nice and able to keep up with the orders from our table.  Just before the countdown begins the staff passes out champagne and party favors to everyone in the bar!  We've never had a bad experience here and plan to continue our tradition for years to come!!", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 5, "date": "2009-01-13", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "ydMoo9efcLe3j47dedhHDA", "review_id": "yFRX43lkxDFMKKFkLuwTCg", "text": "Came in from Vegas! Love this place. Trivia was a blast on Thursday and Friday is even better. Greatest staff ever.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 5, "date": "2012-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wpdS3F6VQ_ngxOJ0c3Nb-Q", "review_id": "tGv4AD9SrVaRKKTZe-OkGA", "text": "The food was fantastic. Me and my boyfriend went and enjoyed the food greatly. He said, \"I only wish they had more food.\" I'm only giving four stars because although the foods was good and our waitress fantastic, I've been here before and know it can take some time to get your food; other than that this place is great. Divert ask me about their alcohol though, because I don't drink. They did seem to have a large selection available however.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 4, "date": "2014-02-07", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "7bdCfESkLLta4vwxO5tyHw", "review_id": "eN1aYpVPxVZib4srRWDsqg", "text": "Let's just sum it up quickly. Wait was terrible on a late Thursday night. Finally seated, 15 mins before they took our order. Food came out, cold and or overcooked. Only good thing was our waiter, he was doing his best. Will not be returning with all the late night choices down Central.", "business_id": "cjUmPLRT43wN9Z87A9BOpg", "stars": 1, "date": "2014-12-08", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "eBFm-lABQiKpaUcPDfYOgA", "review_id": "zrrgxMVhgqpgpti8A5b6bw", "text": "This place has always seemed to me about as close as you can get to a \"Cheers\" in downtown Phoenix. Except that nobody seems to know my name there in spite of how frequently I come. But then, I'm not part of the 30-something clientle who sets up shop at the bar.\n\nI roll into a booth or a high table that has the best view of the games that are on. It's a great place to come down and see local sports or tie one on after a terrible local sports performance. Not great because of the televisions or presentation of the games in any way(which is just two smaller flat screen TVs with no sound in the main room), but because of the laid-back, true-to-its-locale atmosphere it emits. It just seems perfectly in place and makes it feel natural  to hang out and throw some back more then any other bar around town that tries to force its motif into a Phoenix landscape it just doesn't jive with.\n\nAnd of course the food and beverage there don't hurt its cause at all. I do agree with some people's sentiments about particular beers not being up to snuff compared to other breweries. My particular complaint is with their Pale Ale, which tastes like an IPA, and their IPA, which tastes like a medicinal strength IPA. But in spite of some quibbles with the beers here, they really do have some fantastic stuff. For some reason, the beer that is my standby there is the Light Rail Cream Ale, which is in stark contrast to the Brown and Amber Ales I typically get at other breweries. Its got that perfect taste/refreshment balance that acts as a Siren's call to bring me back here at least once a week.\n\nThe burgers, salads, and pizza's are also fantastic. But the real find here is the bread pudding, which has got to be one of the best bread pudding's in existence. I always try to eat slow to make room for it. Luckily, this is a place that won't care how long you cement yourself to a seat.\n\nWhich again, makes this place perfect for some Suns action or whatever is going on. But I probably remember my trips here best after catastrophic defeats. Last year after the Sun's officially bowed out of the playoffs without a championship for yet another season, and with my brother after ASU (he's an alum) lost to Oregon are the first that come to mind. The classic rock and the atmosphere and the beer (don't forget the beer) seem to breath new life into me during such trying circumstances. I guess just by being a pillar of originality in the desert.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 5, "date": "2008-01-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "P7Zcg73x8FzszGEiC9YPfw", "review_id": "G8OKiIth70IrPLeiNCOHsQ", "text": "I'm not much of a beer drinker so I can't rate on the beer. I did order the Hard Apple Cider (5% alcohol) which was not bad. Something for the ladies. \nI love their appetizers. The food came out very appealing. Their hot wings are just okay. Their jumbo bread shrimp and calamari is the best! Very crispy and crunchy. \nI guess because our group was more than 10 people so there was one order that was taking forever to arrive, so they end up giving it to us for free. Other than that, the service was great.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2011-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LY8X23k164rJxNsUwhDRvA", "review_id": "2Jfyfc_SLw5SIuhyeOKnew", "text": "The place has a cool atmosphere, and the waitress was very friendly. They do a great burger and chips. The root beer is worth a try, too. I'm making this my lunchtime hang-out.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 5, "date": "2013-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "GrSixRnGIxNUJ1Cn5DNX9A", "review_id": "Wl7p3fio2C5MpcvOXtydmw", "text": "If I had to imagine what the dining experience would have been like a couple of decades ago for the first and second generation Italian families living in middle America it would probably look something like Christos.  The place has that ambiance and charm that say's \"You're Family\"....sorry Olive Garden.\n\nThe food is good and while there are other Italian places in town that are arguably better in quality and taste, none of them really beat this place in terms of authentic Italiian-American atmosphere.  The place is up there with Durant's, Monti's, and TeePee's as essential Phoenix dining landmarks.", "business_id": "3CSaqRNvYg7ZdN2zwxwzVw", "stars": 4, "date": "2009-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "61wx9D3lUDHRktvJ4LzMsQ", "review_id": "hbdaVvotGUtOaNB5-A9Mew", "text": "Pomeroy's is, by far, my favorite bar! Now, this is not the place to go if you want to get dressed up and go somewhere swanky or go dancing or anything like that. And don't bring friends that are too cool for dive bars either. Pom's is where you go if you want to wear your jeans and drink for cheap and rock out to the jukebox. Most of the bartenders have been there since I've started going and remembered my drink the second or third time I went in, gotta love that! \nThere are a lot of regulars and is usually pretty low key and chill, but it can also get pretty packed on Saturday nights. They have four pool tables and shuffle board, too. \nThey have a pretty wide selection of beers, most of them on tap. My personal fav is Blue Moon but I once had a  friend get incredibly excited to see they have Mirror Pond and another friend get equally happy over PBR, ha! \nOh, and their food... yum! I mean, it's definitely bar food (fried goodies, sammies, burgers, etc.) but I will say that their club sandwich is just amazing. I know, most food is delicious late at night at the bar... but, for real. It's good!  Also, the bartenders have cooked up food for my friends and I on more than one occasion after the kitched was closed. \nLove me some Pomeroy's!", "business_id": "_GS1R0LTwr6h8rMWY_8U9Q", "stars": 5, "date": "2011-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "7vBc7D_2-umtkEbun699ow", "review_id": "6u5mfug6eufHpA33BJbBUQ", "text": "There is no bar in AZ that compares! Best drinks and food in town.  You can't beat the multitude of TV's, friendly atmosphere, or the daily specials.  Not to mention the jukebox or the great stories you'll take away from here!", "business_id": "s8KRwTTrQDSKrS3hOjwYLw", "stars": 5, "date": "2011-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "4OOmSWs18WidFfHyF-IGaQ", "review_id": "Okzsf3TzxPNcofJ7YZMnUA", "text": "After eating the burger and fries I quickly decided this place will be a regular for us... Love that it's a dive bar as well .. Warning ! The burgers are very greasy but so worth it ! And the buns are grilled with a little grease too :) I usually don't eat my buns but at this place I did and will.  I'm not hungover but this is prob a really good hangover burger too !!", "business_id": "ntJAKLAq0cXzzdFgPoo0Iw", "stars": 4, "date": "2014-01-01", "type": "review"}
{"votes": {"funny": 4, "useful": 4, "cool": 2}, "user_id": "wHg1YkCzdZq9WBJOTRgxHQ", "review_id": "LeDecSQeRPBOOVBRHIPHsA", "text": "My first experience with PCG was at a small, yet fantastic Yelp event.  I've been back twice and have been just as impressed.\n\nThe first time was for brunch, and I recommend the griddled corn cakes.  No, I just don't recommend them, I insist you have them.  Even if you are allergic to corn, take the plunge and try these...unless you might die, then stay away as that might be bad PR for PCG.  Topped with smoked ham (that's what I had), chicken, or bacon and served with maple syrup, it was beyond good.  I could eat this dish every day of my life.  The black beans were okay, but I do think the breakfast potatoes are nothing special and could be improved upon.  I was a big fan of a $4 mimosa, however!  Yep, you read that right...4 bucks!\n\nSecond visit for dinner, and I ordered the cedar planked salmon.  A generous piece of fish perfectly cooked and served with a delicious lemon aioli.  The accompanying roasted beets were not my thing, and the mashed potatoes were okay (maybe I'm picky about potatoes?)  I also tried a bit of my dining companion's beef tenderloin and it was butter-knife tender (that's what I cut it with).  Served with a stuffed potato and mushrooms, I believe, it will most likely be my next entree.  For dessert, we shared the Jack Daniel's croissant bread pudding.  We actually shared half, and I most generously took the other half to my husband who I left at home.  Although, I generally don't care for bread pudding, this is NOT your typical bread pudding and probably the best bread pudding you can imagine (other than that one recipe that uses a dozen Krispy Kreme doughnuts).\n\nAlthough PCG is a little bit of a drive for me (outside my usual 5-mile maximum radius), I will happily make that drive and return again.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 4, "date": "2010-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "60G8tMm0_DDrVe9217dAkg", "review_id": "vAUHzDb0_v_Ydw0OXFawRg", "text": "Love this restaurant! It's our first time in but would definitely come again...our waitress was wonderful. She helped us to choose the bacon wrapped shrimp as our appetizer, the shrimp are huge and absolutely delicious. We also had the crispy eggplant bites very good too. All 4 of us enjoyed our entrees...portions were perfect which left us room for dessert! We shared the bread pudding, the chocolate torte and the buttermilk pie all three were delicious. A perfect night out in a perfect city!", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 5, "date": "2013-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "o61tByJ4UZIUuNI2tW385A", "review_id": "NP0gPAxueaCmhysTtKPgEA", "text": "We went to Phoenix City Grill for Christmas Eve Dinner. It was busy but not rediculously so. The hostess staff were helpful and friendly. We had a reservation for 6 people and we were seated promptly. The waitress was attentive and friendly. We ordered off of the special Christmas Eve menu and off of the regular menu. Everything was cooked as ordered and everyone raved about the food. It was a nice evening and we would go back.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 5, "date": "2014-12-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "NmkgRqMecleZbYcPO3bAdg", "review_id": "0QNtXP7R7uh8IvEOfFfYUg", "text": "Love the sandwiches.  Love that they sometimes have live music outside.  Love that it's called Duck and Decanter.  What the heck is that anyway :)\n\nThey also have the BEST horseradish in the world.  If you like hot, this is hot.", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 5, "date": "2009-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "QLqQ9kqP0EHah-8im_TOgw", "review_id": "uwAqeYX-yZXwwo-RvQHGNg", "text": "\"What's good on the menu?  It's my first time here.\"\n\"Everything. Or it wouldn't be on the menu.\"\n\"Haha, okay.\" Really what I'm thinking, \"Easy there, Tiger.  I'm about to check-in and Yelp! about you.\" \n\nCute store with lots international stuff you can't get at a grocery store. Ordered the The Hot Sandwich, which was just average. Bread was soggy, but meat was tender and tasty.  The second order was a Genoa sandwich, which turned into a tuna salad sandwich.  Took it back and waited almost 10 minutes while my boyfriend ate by himself upstairs.  Sandwich was pretty good.  I liked the aoili sauce and the meat was thick sliced.  Had it at home later hot.  \n\nI was hoping I could get comped with a cookie since they kept staring back at me the whole time, or ask where I was sitting and they would bring it to me.  \nOh well,  we will give it another shot.  I want to buy some goodies in there.", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 3, "date": "2013-02-09", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "K6MrbZeqKG35ZiucFfucvw", "review_id": "sZAyXpaUtd6DpCXvJ6mm4A", "text": "I love 'the Swiz'.  I ended up here on a Saturday night after a concert and we had a great time.  It is a rare feat to find a dive bar with generally pretty good looking people in it!  Also, I only verbally ordered a round of drinks once and the bartender remembered it for the rest of the night...just had to walk up to the the bar and presto, the drinks magically appeared on the counter!  \n\nI noticed the other reviews of old people frequenting the bar... Kind of strange because I don't think there was anyone over 40 at the bar when I was there.  This may also depend on the time of day, we did not show up until around midnight on a Saturday.", "business_id": "mgllPJA6NQXlJurFWAkqQg", "stars": 4, "date": "2011-02-07", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "sIBfPxJNBwhnWlySR0kAhw", "review_id": "vdCoB7U7Q_zyFg1mRucOcA", "text": "My ALL TIME FAVORITE neighborhood tavern and the best neighborhood spot in the Central Corridor/Uptown Phoenix! It's where all the cool people, everybody that's anybody goes because they know they'll find good company, great, low-priced drinks,  great homemade food and the cleanest, best smelling bathrooms this side of the Mississippi!!! (Rated Number 1 in Phx New Times year after year!) The \"Swizz\" is special, not just because it's a family owned business where you're treated like family no matter how long you've been away; but also because they are constantly and continuously finding ways to give back to the community either via golf tournaments, water donation drives and/or feeding those less fortunate. It's ALWAYS about others. How many businesses can you say that about??? There are nights of trivia contests, and all the big sporting events have some kind of \"pool\" going to win cash and/or prizes. Never dull, and someone always has a nice word to say or nice smile to share. Can't top that.", "business_id": "mgllPJA6NQXlJurFWAkqQg", "stars": 5, "date": "2015-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "T3OqI85mcQe8cBT0nEffsw", "review_id": "9JDIa5KYfkerm7gZ4_2HUw", "text": "What a great bar and grill!  Everytime, I would get the Salmon (love the citrus sauce).  It's prepared just right!  The service is always fast and friendly!  \nA must try!", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 4, "date": "2011-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "i8QGfTWz4V9gzDqmH44Hdg", "review_id": "SoxOAHkjjabsVzz48en7_g", "text": "The food was ok but was charged 10.00 a piece for 2 margaritas on the rocks because they used patron without asking if I even wanted to shelf!!! $20.00\nFor two watered down drinks is a rip off!!", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 2, "date": "2015-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mOtox6DgvR7SCV5t25rIDQ", "review_id": "sf7C-taN1iuwq4aDhNwcqQ", "text": "I must say I don't know what the bartenders problem was that night, but he was nothing but attitude and a egotistical punk. I have never been treated so poorly in a nice establishment, so if you go to Merc Bar be sure to avoid BRENT...not worth your time.", "business_id": "peA3F-PnIfijYr8HuG-A-Q", "stars": 1, "date": "2011-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "N-D-d1Z4UybdlkK1HxlNPA", "review_id": "fzhv_XGh6w4Xx0vRSwc_Lg", "text": "Hubby and I decided to have a celebratory (new job) dinner, and were tempted by all the recent Yelp steak house debates to try Mastro's. But while going through a pile of mail I had set aside as junk, I found a $50 off postcard from AM-EX to Capital Grille. We decided to give it a try and save Mastro's for another time.\n\nThe service was fantastic. Our waiter, Reuben, was just the right amount of attentive (I hate being asked after practically every bite if everything is ok), and the other staff was also excellent.\n\nWe got a basket of bread to start, which also held some matzo-like crackers. Don't pass by the dark bread- I thought it was regular pumpernickel at first, but it had a wonderful crust with a soft and slightly fruity center- totally unexpected and delicious. We also received an amuse- a great little bruchetta topped with micro greens.\n\nI ordered the caprese salad which was good, especially the yellow tomato slice, but I have had better mozzarella at Cibo. Hubby had the French Onion soup which came with a ridiculous amount of torch-melted cheese on top. The soup itself had great flavor (one of the best I've had), but could have been a little hotter for my taste. Hubby liked it the way it was.\n\nFor our entrees, Hubby got the Kona crusted sirloin (which was rubbed with a blend of decaf coffee powder, cocoa, and cinnamon) with shallot butter. He really enjoyed the flavor, although about half of his steak was really much more medium than medium rare. To me, the flavor was unexpected- I thought I would taste any one of the rub flavors before I tasted the steak, as they are all strong flavors. That was not the case, however- it was a subtle yet complex addition to the beef. I had the classic Delmonico rib-eye. Mine was perfectly done and quite tasty, although I must say that I have enjoyed my rib-eye at Bobby Q's every bit as much. The sides were fine- we tried the mushroom mix and the lobster mac n' cheese. We have been spoiled by our CraftSteak hen-of-the-woods mushroom ecstasy experience, so all else pales in comparison. I expected more from the mac- it was sort of mild and bland. I'm not sure what it needed- something that wouldn't overwhelm the lobster, but something nonetheless. Because we wanted to try a dessert, we took home plenty of food (the sides are large, and all share-able by 2-4 people).\n\nWe shared the coconut cream pie, which again was more than enough for two. It was in a tart style with a sugar cookie type crust, topped with a layer that we felt had cream cheese in it, then a layer of custard cream, covered by a mountain of fresh whipped barely sweetened cream and toasted coconut flakes. It was really delicious. The house blend coffee was truly outstanding, without even a hint of acidity. Hubby added Frangelico to his, and it was so good and rich that it did not need the cream he would have otherwise added. \n\nAll in all, Capital Grille gave us a very pleasant dining experience (aside from a couple of wasted chicks who were way too loud), and very good food.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 4, "date": "2008-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "i1nj7yZAUypvPJPslhlotQ", "review_id": "Gbq5qZV9XfMkQatQIJuXhw", "text": "Fabulous food, drinks and atmosphere in spite of the sky-high prices.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2012-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SUVectbI0-oCajPAQuDYWA", "review_id": "SQhKg2NrHcb8WpMhPVO_tg", "text": "Sure, it's a chain steak house. But that doesnt stop it from being being one of the best steakhouses you can find in certain cities. This location is excellent.\n\nWe had the calamari to start off, which comes served with hot peppers that give it an usual, but welcome kick. I then had a cup of the lobster bisque, which was excellent and included very generous chunks of lobster meat. They bring you a hot cup of the bisque, and then pour some sherry into it for you after they put it on the table. Many bisques include sherry but I liked how adding it after it is already on the table adds to the presentation.\n\n I had a dry aged, kona crusted, filet for an entree (Bone-in). The steak was prepared medium, as I requested. This was a great steak, the rub gave it a nice flavor, and they brought out a nice shallot butter sauce with it. We ordered the South African lobster tail as a side. This is the best lobster I've had yet, it has a distinct sweetness to it that I hadn't previously experienced. If you get a chance to eat south african lobster, don't pass it up!\n\nService was pretty good, very knowledgeable and attentive. Nice atmosphere.\n\n5/5 all around", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2014-12-04", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "YZHCm5e-d0wu9ssUIipexw", "review_id": "LcjrKF8mQZv6AZMcxKoZYA", "text": "Really enjoyed myself! We went here for dinner and a drinky. Tuesday special is chicken fried steak. It was pretty good, 8 out of 10. Reverse happy hour starts at 8. Half off appetizers and dollar off drafts. Had a house merlot for 2.50 that was pretty dlish. I will definitely be back here!\n\nHappy hour starts at 8 PM... Awesome! Food is Awesome! My new favorite place! Go there...NOW!", "business_id": "rVUEZpHQfWI_3kt0lBwaxQ", "stars": 5, "date": "2010-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WsJo2lfomyGzgIFmVtFgiw", "review_id": "B3e9iMEgkKhrv-JSc8rLfA", "text": "Put simply. I LOVE Avanti. \n\nMy cousin treated me and my fiance to dinner here in celebration of our engagement over the summer and I have been back several times since...would go more often if I could afford it ;) \n\nThis place is seriously a hidden gem, and you would never guess how amazing it is from the outside. Do not be fooled by the ho hum exterior and questionable location, their food is beyond delicious authentic Italian mastery! I brought my very picky Sicilian friend for dinner once and she was impressed. Yes, yes.. the bread basket is lackluster, but the run of the mill rolls in no way reflect on the caliber of the actual food. Try the osso bucco, and definitely ask about the special!\n\nWhat about the service you ask? Oh my....don't get me started, they treat you like their best customer who has been a patron for years (and they have been open for that long too). Each server we've had has been friendly, attentive, knowledgeable and downright charming. \n\nOn a side note, the 80's elegant interior is just a bonus! Black and white floors, mirrors galore, dark, moody and strangely intriguing. If you're lucky you might land on a Friday night with Jersey Joe at the piano belting some Sinatra cover giving the place a definite Copacabana (right out of Goodfellas) mob like feel. \n\nSo, do yourself a favor and make a reservation for an evening at Avanti...and be sure to order a godfather on the rocks while you're at it (It's not like you can get away with it anywhere else in town).\n\nP.S. Dinner is around $18-$30 a plate, drinks and appetizers are priced accordingly... totally worth every penny.", "business_id": "vvA3fbps4F9nGlAEYKk_sA", "stars": 5, "date": "2009-12-23", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "N33O9-INJq0U8svlJSiF3w", "review_id": "Su3sBnMNgKX6iKhbEvb_VQ", "text": "Food was amazing and so was service. We came here for new years eve from out of town and we were a little worried as we drove through the sketchy neighborhood and saw cash and go, etc. It's kind of in the middle of all of this. When you walk in it's a little funky with almost mirrored ceilings and the lighting is too bright. But the food was fantastic. We had chicken parm, scampi, caprese, cheesecake and tiramisu. Service was slow but intentional to let us enjoy the meal - reminded us if really being in Italy.", "business_id": "vvA3fbps4F9nGlAEYKk_sA", "stars": 4, "date": "2015-01-02", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 2}, "user_id": "rMmsDx0VB2onSrAj3qnI5Q", "review_id": "JB0orUwINR1Nr81FHurdWA", "text": "Was a little hard to find on the backside of the shopping center.  This place makes me wish I was more of a hockey fan.  We came here for the comedy show on a wednesday night.  \nThere was plenty of different types of beer to choose from.\nNot really the place to go if you are a little jumpy or get startled easily because of the pucks hitting the plexi-glass. Every time you just about forget about them playing hockey,  WHAM!!  you get reminded.", "business_id": "yb17xHvhDJthJGS10uhFeQ", "stars": 3, "date": "2011-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "ED8rq4vqflssrXbigIhgOQ", "review_id": "iWBb4zgwu7GlvDbmhBTaig", "text": "I can honestly say that you would've never caught me in this place if it hadn't been for my boyfriend suggesting it as one of our first dates.  The things that scared me away: valet parking and an overcrowded parking lot and the assumed pretentious wine snobs that frequent the area.\n\nOf course, I was right about these concerns when I actually tried the place.  However....that doesn't mean that it can't be enjoyed with the right company.  The wine choices are unbeatable and they have a great app menu, of which I highly recommend the bruchetta (you can choose different several different toppings for one order and they were all equally delicious).\n\nIt's a great place to chat with friends, or go on a weeknight to grab some vino.  I'm not dying to go back anytime soon, so it's not a favorite for me.  However, I can see how some people would make this wine bar a regular stop.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2008-02-01", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "sALB8-F04S9VcZMF_GkGUA", "review_id": "GeNCsEtTHR67oVD4NHHc9g", "text": "Postino is still a 5 with me.. Seriously, I havent found anything I love as much in the Valley... Best happy hour for the winos... AND everytime I intro the place to someone.. They love it ! Last Friday I took my fav there.. Hes new to my wine world.. SO this is the place to introduce it to him.. I cant say how friendly I think the staff is.. We stood for quite awhile.. (GUESS the word is out on the bomb Post!).. but the bartender kept checking on us.. the hostess was awesome.. LOVE the bruschettas to this day.. I actually crave them! I love that Postino changes the wine menu... and frequently, by golly! \nI heart the Postino with the mostest!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2009-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "HzBPZcsO6wPTy9_b5s0A5A", "review_id": "LQwpmmK2YcSc25sAJdu4Qw", "text": "Love this place!!!   It is so small and dark and quaint!!!  Huge wine selection...and that bruschetta ......Yum!\n\nI didn't really need to add my review because there are so many and most agree that is place is great.\n\nMy favorite thing about Postino is on Mon and Tue nights .....you can buy a bottle of wine and a board of bruschetta for $20 ..plenty for two!\n\nParking can be hard around here...but they offer valet for $3..", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2010-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Mryy35v-ml0UE3eqF5McwQ", "review_id": "0Ly_ijYp7yF-R2hptu4jcQ", "text": "For starters, our server was definitely \"too cool\" for us.\n\nThat said, the place is a really interesting, urban space with either a social or a cozy vibe depending on which table you get.\n\nThe bruschette is what they are known for and it's pretty good, given that it is not your typical diced up tomatoes with olive oil and balsamic. We had one with ricotta and pistachio and dates (big hit), one with tomato jam and goat cheese (yum), one with spinach and artichoke spread (pass), and one with apple and brie (good combo).\n\nSide note: seems like they use grocery store brand bread (like a vienna loaf) and then just put some toppings on it and make a killing. Nothing uber authentic about what's going on here, just to warn you.\n\nIt seems to me the rest of the menu is just okay.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 3, "date": "2010-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Jtb1UWfOuQosT-Rlf6HlrQ", "review_id": "oHOjdqqaCn24JNLyRUS9DQ", "text": "This is the perfect setting for a girls day on a Sunday afternoon.  Share a bottle of wine while listening to Walt Richardson perform.  Couldn't get any better than this. Also, can be very romantic with the right man.  Gentlemen take your lady's here, they will be very impressed. The food, beverage and ambiance is amazing.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2011-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aFCnJ3zDksFqAk6gvE5kZw", "review_id": "wCJRgTq6Yxv9RBMATsbcTQ", "text": "Every time my wife and I are in Carefree she makes me drive down here at least once for lunch. What can I say that other haven't, wonderful everything. Can I please have one in the North Valley now please.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2012-01-22", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "aTi0NVrcPJWbN6jAsJVcAw", "review_id": "K03CUFhAPz7rR0HaMIBTpg", "text": "I've seen fellow Yelpers mention how much they love Postino's, and I finally got there! Friends and I met here for wine and light bites before heading to the Zoo Lights. Parking is a pain (I'll park my own car, thankyouverymuch) but after that it was all good. It was a chilly Phoenix night, but the open wall seems to somehow work well -- the outside seating melds nicely into the inside. If the forecast calls for cool temps, I recommend that you bring a light jacket.\n\nAll of the staff I encountered were great. The first chick recommended a fabulous red which I enjoyed immensely. When my friends arrived, we had the Pub Board and a couple of Bruschetta boards -- fantastic!!  We had fig and apple, warm artichoke spread, smoked salmon and capers, roasted peppers and goat cheese...just delicious. The pretzels and spicy mustard were the best I've ever had, anywhere. \n\nThe atmosphere and ambiance are close to perfect. I'll definitely bring friends here!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2012-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5m55KNmkpgUk0PhzooJ98w", "review_id": "Ksgi9sBaIBpbILKd0UMpyg", "text": "Can't say anything that's not already been said, just reiterate it.  Fab bruscetta!  Can't go wrong with any of those selections. I've been in the evening when it's super crowded, but my favorite time of day is lunch especially when it's a beautiful day and the garage doors are open, you can't beat this place for ambiance!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2013-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TPOmL9SztAVyjru9IjuaUA", "review_id": "x3CdioL-d4nmph9L_XnlQw", "text": "I love their bruschetta and wine nights - it's always packed, but you can stand outside and have a bottle of wine brought to you while you wait. All of the bruschetta is amazing (that I've tried), and the atmosphere is young and fun. The only reason it gets four stars is because the music inside is really loud and difficult to talk over and the lighting is super low. No, I'm not old.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2014-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kScgPL6p4ZqdVX76c1Vyhg", "review_id": "JPb347xednU4Yxg71L6rMA", "text": "This is the ideal place to go for a relaxing glass of wine & some food without the stuffiness. Great wine, great food, great atmosphere & great staff. What else is could you want ?! :)", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2014-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BtSxkr2CkbLijlPwG6aObw", "review_id": "7hxG8h_17vlJaN_gakscbQ", "text": "So wow. This place was amazing. Food, service, decor, Postino's has everything. I went here with my husband after rock climbing the camel back mountain.  At first this place kind of threw us off. It has a free valet which made us think our dirty hiking gear apparel would get us snubbed, and everything would be super expensive. I'm sure you have gathered based on the five star rating this was not the case. The gold diggers of Scottsdale were in attendance decked out in Lululemon, to class down the dress code. \n\n To the food: We got two plates of bruschetta, and after basically licking the plate clean we got their meat and cheese butcher block plate. All the bruschetta was amazing--super flavorful and used very fresh ingredients.  We also got some wine and a mimosa, fantastic as well. One of our bruschettas was missing an end, the waitress told us that more would be out soon to make up for the missing piece. Soon afterwards, another server brought it with a little extra added, making for no complaints on our end.\n\nI loved the ambiance. Its really cool and classy with lots of character. You can dress up or wear hiking gear. It also has garage doors to hang outside on those warm-weathered days (basically everyday in Scottsdale!). Complete with heater and misters for the summer.  Amazing all around, so chick this place out.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2015-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QfFlLWqQxUVzTLZYe6WWpA", "review_id": "zYQLh4HPuYD1eX75eVrnBg", "text": "Love this spot. Great for a glass of wine and chilling or dinner!  It's a must but on the hot nights expect a wait.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2015-12-10", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "mu0eYmvB5vvU_P2HQxltig", "review_id": "YmyKa5vAHSL_svVDG2Jk_A", "text": "Tiny hole in the wall. Came on a Thursday  after work with four co workers and it was packed. Lucky we got stools at the bar. Very friendly relaxed and neighborhood atmosphere.  \n\nI guess it was taco Thursday. Tacos 1$. The best thing about the tacos besides the price is the homemade salsa. Hands downs best salsa you'll find\n\nI ordered the wings. A dozen for 8$. Bartender said they were meaty. Fried then grilled. You'll wait but it's worth it. I got Suicide flavor. It's suppose to be the hottest but I've had hotter.   Still very good but not any meatier than normal\n\nFried mushrooms were good. I would try anything on their menu which is not too big. Basic bar food that's cooked on a grill behind the bar by Julio, who is also the creator of the amazing salsa\n\nI give five stars for the atmosphere and extremely friendly staff who clearly appear to enjoy their job and the down to earth people who know about this small bar.", "business_id": "qz4ZOcv-840UjfCEYI4qZg", "stars": 5, "date": "2015-02-26", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "jRtdO03kWbReasB_vBlTsQ", "review_id": "5aOISUVczV3wyPNiZVU1NA", "text": "I've been here several times - some days it's packed and other days you'll only see a few regulars. The biker crowd seems to like this place and the sports fans of course. The owners are very nice and friendly and it seems they practically live at this place. \nThe drinks are priced good and they have some nice breakfast specials too. The pizza is really good as well. We ordered the super jumbo pizza for my husbands birthday and it barely fit in the trunk of my car - if you want the WOW factor at a party; order one of these. I posted a pic of my husband holding one of the monster pizza's so you have an idea of what to expect.", "business_id": "rwT9wCyXNATA36yqcb4JSg", "stars": 4, "date": "2012-01-24", "type": "review"}
{"votes": {"funny": 7, "useful": 3, "cool": 4}, "user_id": "1kED3-g-gqnc4JgHe89Xqw", "review_id": "9TVZE8ZOPvN0PuhpCPykpA", "text": "Eh, to be honest, as much fun as I had partying with my fellow Yelpers on Sunday, I can't give this place a sparkling review.  As much as I'd love to give a neighborhood sports bar props, this place just did too many things wrong for me to comply.\n\nWent there with a bunch rowdy Yelpers to watch the NFC Championship game on Sunday and was fairly disappointed.  For starters, as a sports bar and Cardinals viewing destination that had been promoting themselves as \"the place to watch the big game,\" they seemed grossly unprepared for the crowd they got.\n\nFor starters, I sat at my table for about 15 minutes before I gave up on a server coming over to take my drink/food order, and went up to the bar to order and take the middleman out of the equation.  Only when I went up to the bar did I learn that they had run out of glasses!!!\n\nThis is where it gets good though.  Their drink specials that I was interested in were their $2.50 20 oz domestic drafts, pretty good deal if you ask me.  And since they had run out of glasses (definitely not my fault as I am not their barware supplier) and the bartender asked me to get a bottle instead, I naiively assumed they would honor at least a similar deal to the one that they were promoting.\n\nThis is where I was SORELY mistaken.  Not only did they not give me my 12 oz bottle for the same price as the 20 oz draft that they were unable to serve me, they actually had the nerve to upcharge me to $3 per bottle!!!\n\nNeedless to say, I was a bit incensed.  And it had nothing to do with the extra 50 cents per drink, I just thought it was poor business practice...a bit of a bait and switch, if you will.\n\nAfter the initial poor service and swindling of my hard earned $$, the bar ended up being okay.  Of course I will have to attribute at least 75% of this to the wonderful company of my yelp compadres, who I hate to disappoint with my less than stellar review, but I have to keep it real.  The TVs were big and plentiful, the food was fair.  I ordered a Buffalo Chicken Wrap which wasn't bad but my fries were SUPER cold and therefore inedible to me.  But the bar's sorry excuse for a smoking section is what threw me over the edge and made me want to puke on more than one occasion.\n\nWe had the bad luck of being sat in the general vicinity of the door that led outside to the smoking section, and every time the door was opened either by a server or a patron, you could literally see plumes and plumes of smoke wafting into the restaurant.  It was disgusting.  I couldn't stay even 5 minutes longer after the Cards won to celebrate because I was coughing and my eyes were starting to water.\n\nI am willing to give Gallaghers 1 more shot under the parameters that there can be no special event going on because they were terribly ill equipped to handle it, and mainly due to the fact that they had tons of TVs and it is relatively close to my house.\n\nAs long as the don't run out of glasses again of course...", "business_id": "F-ykHfGY9lWr12OJ_Ofy7A", "stars": 2, "date": "2009-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cQEhHWFwQ_1pPM2wkkMUIQ", "review_id": "h6PW9fm1K3ScdzFHJjrjZg", "text": "I haven't been here in quite some time but my daughter got a gift certificate and I decided to try it shin and Unfortunately my experience here was not so good again.. Ordered the Tito's punch & it was watered down with no alcohol taste, ordered the low calorie steak with avocado medium n it cane in medium well I told the waiter and he said well u ate a lot of it (its only a 6 oz with 2 ounces of fat) or else I would've told my manager.. Really! Ya I'm done with chillis all together..!  So many other restaurants to choose from..", "business_id": "_BU867oRCLZnDIRmg7S6Wg", "stars": 1, "date": "2015-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "sGXZZ1l5TGJXOBgsmjVvBA", "review_id": "S_76Lovw28SRg6Jy9UyBLQ", "text": "We went here for a birthday expecting it to be good based on the reviews, the restaurant itself is nice but the food was terrible beyond belief. I got the steak from there and when I cut into it, it looked stringing, rough, and disgusting. I couldn't eat it. \nMy family was completely grossed out with their meals. When we went to tell the lady that our meals were terrible she was being sarcastic and very rude, in my opinion she has no respect for customers what so ever and for as nice as restaurant it is I will never go there again.", "business_id": "jq_YnMQjcArdBWuwRospFg", "stars": 1, "date": "2014-01-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "N1Fuak5n6mjqFoNa_LgrxQ", "review_id": "Eufk6iavkmvE1WhvK7gPvQ", "text": "Every neighborhood should have a tiki/beach themed dive located in the non-descript strip mall on the corner.\n\nA locals place for sure, but as an out of towner I felt totally comfortable here knocking back a few brews and shooting a few games of pool.\n\n2 beers were only $5.50 (I think).", "business_id": "gVgJIBQDXHtgIS7p7uDa6Q", "stars": 4, "date": "2013-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dx8caQLlg6Zo3decSnS4NQ", "review_id": "TwSAYkVSbPFgfa0ZVn2k4Q", "text": "This is a great place for amazing food and an awesome staff. Even the owners take time to say hi and check on their guests. I had the shrimp and grits and I will definitely order it again.", "business_id": "vFJmFFfPVhHkC3bWOeZnNA", "stars": 5, "date": "2015-01-17", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "H50yHk8E8MSB54VarKQFtA", "review_id": "Qt0lxMUHcLOTGDVmrxeXvg", "text": "I really don't know what people see in this place. One thing, it does have that old crusty bar feel. We went as a group for drinks and food. The initial drink service was pretty quick and the experience diminished from there. I ordered one of the starred items off the menu, the Reuben. Three words best describe the sandwich ... greasy and tough! Another person at the table ordered chicken fingers, they were so dry she only ate half of one. The last person at our table had a cheese quesadilla, it was cold and looked like it had been microwaved.  The astonishing thing, the waitress actually pocketed my change from my food order.  They do like their regulars though and seem to treat them well. I can't say I would recommend going unless you are dying to find a karaoke bar.  I know I won't be going back any time soon. Actually, the sandwich I ate didn't sit very well with me either.", "business_id": "-xLwGUmmyKgsTtFOOXzjeg", "stars": 1, "date": "2012-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "qAAANTz5PrJ77oWK85bipQ", "review_id": "2RitvU6jVBeN-WDowme0kg", "text": "Jennifer and Hannah made our night!\n\nI love small neighborhood bars.  Jennifer and Hannah were so accomdating and friendly.  I felt right at home.\n\nA fun time was had by all.  I'll definately be back!", "business_id": "1rOQVIlUlLBcf1EDj_n4Vw", "stars": 5, "date": "2011-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BEe04ziifpSkBdKsCSAUXA", "review_id": "1P8iYon17buxC2isC05mhw", "text": "Food and service was great. It had been awhile since my wife and I had been here. It was clean and bright. \nGoing for the cookie and ice cream.", "business_id": "SgGINtDKQgoXoAnQgrDKDg", "stars": 5, "date": "2013-01-12", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 1}, "user_id": "qABKRj1ggJmtvrL9FMFtuA", "review_id": "gR2iZ9PBgTiqrQlKbrEjVQ", "text": "I have to agree with other Yelpers that this place is unpretentious, but it would only get two stars if I didn't admire its chutzpah for staying in business so many years and I honest to god, have no idea how. \n\nMy friends and I come in here now and again for a post happy hour glass of wine and that's always a two-hour minimum visit. Not that we're trying to get out quickly, but there's a point where it gets absurd. Here's a little example. P and I came in one rainy night around 7:30. It wasn't too busy and we found some nice, comfy seats and waited for a waitress to bring us some menus. And waited. And waited. Don't forget, they're not busy. Twenty minutes later a friendly waitress comes by (they're always friendly, haven't had a knowledgeable one yet, but they're always friendly) with some menus. Another ten or fifteen minutes she comes back to take our order. P had a question about one of the wines so the waitress offered her a taste of it. How nice! Another ten minutes she brought me my glass and P's taste and mentioned that they opened a bottle just for her taste. Unfortunately, P didn't like the wine at all (if I remember right, it was on the list in the wrong place, and P was looking for something much, much different) so instead of waiting again she russion-rouletted it and just ordered something. It came, we chatted and enjoyed our evening and she catches my eye and nods at the next table. it seems they have ordered the wine P didn't like and the waitress stands at the table popping the cork out with great flourish saying, \"here's the bottle of wine you ordered\". Why no one questioned it not needed to be uncorked, I don't know. It's a classy place like that though (underlying sarcasm). My Wine Cellar I mean. Not the poor suckers next to us paying top dollar for an opened bottle of wine with a pour missing from it. \n\nI guess I feel a sort of affection for My Wine Cellar. The same sort of affection you would feel for your \"special\" cousin. The one that can't seem to move out of your aunt and uncle's house and never seems to make smart life decisions. Oh, I know we've all got one. You want to strangle him in one breathe but the next you can't because he's always got such a sweet grin on his face and small animals really seem to take to him. A lot. Anyway, My Wine Cellar is right here in Ahwatukee and they have survived and you can go and have a glass of wine and just hang out. Reasons like that keep bringing me back. Once I'm there I don't know why I came, but I keep coming back.", "business_id": "Our6bzte5W1wlIeOu9luug", "stars": 3, "date": "2010-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "weYT-xJwz8o7mLNWIhD6HA", "review_id": "ZOLst_fYNKgFTzDq3T4qNA", "text": "SUCH a great little place! Nice decor, great service, AMAZING patio and view, 5 stars all the way.  Haven't had their food yet, but I will be back for sure and looking forward to trying the menu (sounds like they have a good variety). Wish I lived closer so I could come here all the time.  Looking forward to stopping in whenever I'm in the area.", "business_id": "Our6bzte5W1wlIeOu9luug", "stars": 5, "date": "2013-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GrLESw12ZeNXw5Z4NQC4Og", "review_id": "HMctriUOBlepAUhkW_3Njw", "text": "Went there for dinner. Had a glass of their Atalon, Merlot, Napa Valley California, 2003 wine and Chicken marsala.Loved it. There was live music on Saturday night and a bunch of oldies were having a great time dancing. Great ambience but a bit pricey. Definitely recommended!", "business_id": "S3FhtwXuiGMlGdBNtmiiSQ", "stars": 4, "date": "2010-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "R4fDKQJxVYfVhHNz70lWVA", "review_id": "4Mwy6BOXpr9hTBFmU8iSYQ", "text": "Surprisingly good. I didn't expect it to be bad but wasn't expecting it to be as good as it was. Reasonable pricing. My burger was good and came exactly how i special ordered it. Also, grabbed a couple mai-tais on Happy hour that came stronger than any normal priced drink...that's a win, win!!", "business_id": "e0vubCKi8KD8zC2C6FdbuQ", "stars": 4, "date": "2015-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "onCVo3jNuKsSk8HcpDE1sQ", "review_id": "KkjeUfCWqO0NgEotxEPUTw", "text": "This AVERAGE review simply is a placeholder for a better review to come along and BUMP it! We have no food to review, because the food we wanted for our Valentine's Day take-away dessert was not available to us! I can't tell you how disappointing it is to finally zero in on what taste we are craving on a holiday, load up the car to first eat mediocre Chinese food at a fast little place so we have money left over for the \"BIG DESSERT IDEA\", drive to Elephant Bar, park the car, and get to the hostess station to order our mud pie......only to be told they've already sold out at 7:15  :(\nIf something's that good, there should be a LOT of it on special days......agreed, yes?\nI trust the next visit will produce more exciting results. May the force be with the Bar", "business_id": "QzXFdjIbFRGhzL83goPPLA", "stars": 3, "date": "2011-02-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0w0ROkqvUU8M0Pl9p-u2sg", "review_id": "kyNj9Q3B7AcYp1rJRggYSg", "text": "OK, I'm not ordinarily a fan of sports bars; they're loud, I'm not interested in watching football nonstop, and usually the food is mediocre. But we're renovating the kitchen and needed to eat - husband was simply hungry, and I was looking for basic low carb food that wouldn't totally blow my diet. We both found what we were looking for. \n\nFor a sports bar, it's amazingly cozy; all the booths enclose you in privacy, with adequate, but not overpowering lighting. \n\nI was hoping for adequate - and found really good food; good enough that I'll be back regularly from here on in. We have tried several burgers, with the mushroom burger being our favorite so far. I went for the grilled salmon entree, which comes with grilled asparagus and broccoli (a perfect  low-carb meal, perfect for anyone watching what they eat, frankly) and it was so good that I've eaten it three times in a row. I just can't get enough of it!\n\n\nThe wine list is pretty good for a sports bar; I'm not a beer drinker so can't comment on that, but the staff is friendly, knowledgeable and will bend over backwards to accommodate your wishes. \n\n\nI only moved to the area from the San Francisco area in July, apparently while Legends was undergoing new management and renovations, so I can't compare it to the old Legends, but so far this is one of only three restaurants in Anthem that I am willing to recommend to my out-of-town friends. Definitely worth a try.", "business_id": "d-rZazFFYvnjRZUhLTEUZg", "stars": 5, "date": "2014-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DYWHSvCAerdSbARwbJlEew", "review_id": "BXeHvgdV8SGj9mzyfbdtlg", "text": "Love to watch the Cards games here Alyssa is the best server good wings cold beer and awesome atmosphere for kids and adults alike", "business_id": "G7-NoraGlmzwO0sgs4fbmQ", "stars": 4, "date": "2015-12-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "hjbTKi3NLAQRc_JeZS-6YA", "review_id": "I0nAKrZyY271JCHWxSZ8Zg", "text": "Bland, overpriced, and nothing special. The best part about my trip to this olive garden was discovering the italian-style interior architecture of the restaurant. I found the veneer quite entertaining, for the Italian walls were just like the Italian breadsticks, minestrone, and salad: superficially appealing. This place is like Madonna--it's all about the image, baby.\n\ntl;dr: Italian Chilis", "business_id": "scVOmQsf5HSY3n9CG06tFA", "stars": 2, "date": "2012-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "nOL1ObdgiEWX4hGKXFDbBg", "review_id": "XFXche-Jzye9QMZwufZfLg", "text": "This bar is in walking distance from our house. It is tucked away in a mostly empty strip mall. The first few times we went it was mostly empty because we went early ( between 7 and 9 pm) It tends to pick up closer to 11 or so. The bartender is great, and the drinks are cheap. They have a ton of different weird flavored vodkas, which I am generally not a fan of, but Chris has some great uses for them. We like chatting with him and getting is opinion on all the flavors. (cilantro= wetnap.)\nIt is a cash only bar, so keep that in mind.  All in all, we like it a lot.", "business_id": "rjjEN8QTMvilB08ImFyMow", "stars": 5, "date": "2015-01-12", "type": "review"}
