{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "305gMnpbklXYqzLEf1FTag", "review_id": "EiXOcwq_9y3NVSESCTcfQA", "text": "I was impressed.  \n\nWent here for lunch.  The seafood gumbo was tremendous.  I wasn't in the mood for more seafood so I had the chicken blt on ciabatta bread.  I'm not sure what type of creamy sauce they put on the bread, but it was delicious.  Will go back again.\n\nThe food was reasonably priced for lunch.  Dinner would obviously be more expensive but I imagine it's worth the $.", "business_id": "usSROUMiAgPcxV3Ym0OxMQ", "stars": 4, "date": "2009-12-28", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "2Ndy3FQAndOopqTa9sBPlQ", "review_id": "IJrKJUbsm6JfNFsj_Lz_Rg", "text": "I've been going to Miller's since I was just a little tyke.  Unfortunately, over the years, this joint has gone downhill.  \n\nI think I really began to notice it when they put a big tv in the dining area.  Now you can imagine that you're home in front of your own tv while you dine.  Holy Hell.  It's a mess.  \n\nThe food isn't nearly as good as it once was.  The pierogi special is good if it's on the menu - they are Pierogi Plus pierogies.  The bread is Bread Work's bread, so that's good.  My favorite thing on the menu used to be the devonshire, but only the brave try it these days.  In the grand scheme of life, this place is a fine local blue collar restaurant, but compared to the days of old the food is just blah.\n\nps. The ladies who wait here are always and have always been the nicest of folk.", "business_id": "YUZVBdGmagwXV-yOhR-1GQ", "stars": 3, "date": "2013-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7rkjF6r76ZtK2FBUqXXKlQ", "review_id": "tzhQtJ30dVeQHHyrnpnUHA", "text": "First time I've eaten here I went during lunch time. Not crowded but service was quite slow so I took off a star. My girlfriend ordered from their sushi lunch special and I ordered the bison burger. You're probably asking why order that when at a fish market. Well I originally planned on fish but I hadn't had bison in a while and it caught my eye. Well the menu is a bit pricey and I don't mind paying for good food so I had high expectations. He bison burger was mediocre (took a star away) The menu said bacon, but none showed up. No worries probably better for me. I felt at $15 for a bison burger this thing should freaking be awesome. Not the case. I would put it at $8.99-$9.99 price range I would pay since they gave me chips as a side. So they lost another star for over priced for the value I received. The girlfriends sushi meal was a bit over priced for a lunch menu. Two basic rolls and miso soup for $16. This would easy go for $14 at other places during lunch. So ultimately would I give it another shot? Yes, but only if it is convenient. I would not go out of my way or tell friends about this place.  \n\nHelpful advice for the OFM.  Actually have lunch specials. If you charge the prices you charge the food needs to be worth the price or you will lose return customers. Two rolls of sushi and a burger shouldn't cost me $33 unless you are going to blow minds!", "business_id": "z4cCguoHdU48pj6sXMIzqg", "stars": 2, "date": "2014-01-31", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "Qs5dcst13DnQJwaBcR4VGg", "review_id": "ul2cWnmKqM7lzoQYlsXm7w", "text": "Stopped in last night because we wanted to 'step out' of our usual places on Carson St.  The place was rather busy and was pleasantly warm on a cold Saturday night.  We found seats at the bar and a friendly bartender greeted us and took our drink order.  The drafts arrived right away and we requested menu's...  \n\nWe ordered 2 shrimp cocktails and a calamari.  The shrimp arrived within 5 minutes and came with a small bowl of cocktail sauce with a dollop of horseradish on top.  I mixed mine as I love horseradish but my friend would have preferred it on the side or in another bowl as he isn't a fan.  The shrimp were big and fresh and delicious.  I mean- can you really mess up cold shrimp...?  The calamari took over a half hour to arrive.  It was pleasing to the eye and smelled delicious.  It had grilled onions & peppers on it with a slight spice dusted on top.  I thought it was delicious but my wife wasn't digging it.  She thought it was overcooked & rubbery.  Our friend isn't a fan of calamari so we didn't have a 3rd opinion to be the deciding factor...\n\nThen things went south...\nMy wife went into the ladies room and came out with a straight up disgusted look on her face.  I saw her stop a waitress and after the 'chat' the waitress turned away and rolled her eyes.  Well, my wife said the bathroom was disgusting- Toilet paper & paper towels all over the floor, 5 stalls with only a half roll of toilet paper to be shared between all 5, no paper towels to dry your hands off after you washed them.  Does the employees have a separate washroom to use or do they use this one also and just don't notice???  The health dept signs say \"Employees must wash & dry hands with soap & hot water\".  Then I visited the Men's room and found almost the same thing- paper all over the floor in the stalls, I didn't notice if they had tp in there, and no paper towels to dry your hands with.  \n\nTo us- the bathrooms must be clean & well stocked or we wonder what the kitchen & other 'back of house' areas look like.  If the bathrooms are in this much need of attention- the kitchen must be worse...  \n\nWe paid our tab and left...", "business_id": "wHi8ODv7TGmeUB02XoX-mA", "stars": 3, "date": "2014-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sWs067aU70gpt7p2224HYA", "review_id": "ihVfosChkBT9qF66pQMlFQ", "text": "I ate here today for lunch and it was good. It is not a 4 Star restaurant by no means. They serve food on foam plates and give you plastic utensils. \n\nThe best thing about this place is the fact that they have good food at a very good price. I dont think you will find a better deal in The Market.", "business_id": "-KQ283hJkBO12u8XOrlCcQ", "stars": 3, "date": "2014-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Hl5uZFY91JZWTk3jgZPapg", "review_id": "4LzTWVLJPUUiFPjFyH45ag", "text": "It all started innocently, take the wife out for a nice dinner for her promotion.  Let's go somewhere new, downtown (uptown as they call it in Charlotte), some place fancy.  The capital grille fits this criteria.  From walking into the place with the dark woods, white linen table cloths, well dressed patrons.  It all works.  The waiter approaches our table and we are ready to start the experience.  He recommends a wine from the extensive wine list.  Lets talk about that.  I am a wanna-be when it comes to choosing a wine.  When I see a list as big as this, my first thought is wow, I think I'll get a beer!  Our waiter was an expert.  After a couple more visits we learned that pretty much everyone there had an excellent grasp on choosing wine and familiarity with the wine selection.  Our selection was a white which was absolutley perfect.  Started with the Lettuce wedge, nice giant piece of iceburg lettuce, ice cold, plenty of blue cheese and bacon and perfectly ripe tomotes.  \nThings were looking good.  We went light on the apps the first time since we had a feeling that the meal was going to be huge and we wanted to survive!  Our steaks came, filet au poivre, of course!  Done perfectly, rare, cream sauce was out of this world.  Meat so juicy and tender you don't need the fancy knife they give you.  We had the mashed potatoes and the au gratin potatoes for sides.  These were to die for.  Low fat I'm sure.  For dessert the recommendation was made to order the cheese cake.  Wow, I had no idea.  So rich and creamy we ate the whole thing.  Uncommon considering how much food was consumed this night.  \nSince that first visit we had been back several times.  I highly recommend the Capital Grille, prices are high as you would expect.  But the food and service are well worth it.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2006-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "qso-MUrwGtZGhKdE0gHPJw", "review_id": "8B4VXQSdnPbnw3JALH-SKg", "text": "I would give this place 2 1/2 stars but that wasn't an option so it got 3 instead.  The only reason it got 3 stars was because the desert, proscuitto wrapped mozarella & lobster mac & cheese were very good.\n\nOne thing to note is that the proscuitto wrapped mozarealla is served hot.  I thought it was going to be cold and one of the reasons I ordered it is that I thought it would be a little lighter.  As it turned out, it was very heavy.  Tasted good, though.  It just wasn't what I expected.\n\nSpeaking of something that wasn't what I expected, if I had to rate this place based on the steaks alone, I would have given it a one.  Frankly, I've gotten a better steak from Whole Foods.  Also, the steak came with a pool of steak sauce on the side.  If I'm paying 47 bucks for a steak, I don't want any sauce near it.  My wife's filet actually had some sauce on top of it.  Personally, I would have asked for one without sauce.  The menu doesn't mention anything about sauce, they should really let you know about it in advance.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 3, "date": "2013-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qLK1Na2Ep0qSyQt6qr2N3A", "review_id": "nFLrWxRB4NTOgi2_YD4LtQ", "text": "Oldie but a goodie. Even for a high end chain, this place always pleases. Choose here over any steakhouse in town.  Fleming's sucks.  I've never had anything less than a great experience here.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2015-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "PM2jXrlVzik1jDwwahLJJQ", "review_id": "RcmlgBt2cPHkHf0L0vg3mw", "text": "I've been wanting to try this place for sometime and Restaurant Week was a perfect time to do it!\n\nMy friends and I made reservations for 7:30, when we arrived they greeted us and said they were just waiting for our table to be cleared and to hang out at the bar until it was ready. So we headed to the bar and were seated about 10 minutes later. \n\nThe first cool thing about this place is the caricatures on the wall, there  famous and some local faces with their names and even some signature everywhere you looked! I thought this was a very cool touch!\n\nOnce seated we were presented with one of the most amazing bread baskets I've seen. But keep in mind, I'm totally a bread lover! There was a white, wheat and whole grain, sweet cinnamon and even breadsticks! It's a bread lovers dream. \n\nThe menu looked absolutely delicious, I ordered the lobster bisque, jumbo lump crab cakes and mango salsa and key lime pie for dessert.\n\nThe lobster bisque was divine! It was creamy and rich. The only thing I wanted was more lobster! Other than that it was one of the best I've tasted! But make sure they add some cracked pepper for more flavor! \n\nThe jumbo lump crab cakes were absolutely amazing.  Literally overwhelmed with crab meat...OH MY GOODNESS. I really don't have another way to describe it, they were outstanding! The mango salsa was really fresh and worked as a great compliment with the meal.\n\nThey key lime pie was great too! A great and refreshing way to end the meal. \n\nThis place was really great! Our server was wonderful and we had a lovely time. Look forward to returning!", "business_id": "1gKBusJMk66ypwEKF0vOAA", "stars": 4, "date": "2013-01-24", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "sfDosXP55J_0VAXjbO70SQ", "review_id": "CWRDcOm0ZZMc-VNm07wQBg", "text": "Glad we tried this at restaurant week prices.  Didn't realize it was  a \"corporate\" place until we got our leftovers in  a bag advertising the network of places it was part of.  We had just said the food was decent but soulless, like you'd expect of a corporate restaurant when that bag arrived to our \"oh, that explains it.\"\nTypical South side snob crap.  High prices and low quality and originality  for people who want to be seen and spend alot and have the palettes of a 6 year old.  For more of the same you can buy $25 olive oil that's really canola at  Dean and Deluca next door.  \nLike the reviewer here  with one unsalted and one over salted selection, I will add that the duck was under cooked and the salmon over cooked.\nDISAPPOINTING", "business_id": "BOp3jcpYy31M85H1DLnEEw", "stars": 2, "date": "2012-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "5IDPuBUitRmeRaIXvXv5wg", "review_id": "Ks5tXe4afd6xFBjIebvySw", "text": "Great service and I enjoyed the decor and atmosphere, but the food was just good, not great or spectacular. If they would drop their prices 20-30% on all items I would be willing to come back.", "business_id": "BOp3jcpYy31M85H1DLnEEw", "stars": 3, "date": "2015-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8tnlkhMohEPBz2_340_DFQ", "review_id": "HX8SuA-ss6kFraRe3eiHZQ", "text": "Just ok because my bar for New Orleans food is quite insurmountable!  But I give honest reviews.  Whoever is in the kitchen can season food like nobody's business!  It is great food.  Seafood was not fresh though and they really do not have Bread Pudding on the menu!  That tells me that the chef is not from Louisiana at all.  Prices are too high, way to high!  Jambalaya for $20!  Ridiculous really.  A pot of that for 10 people cost $20.   But if you want great atmosphere and good food that is just seasoned well, go.  Drinks are reasonable and service is fantastic.", "business_id": "koRLvzIl-4fCybOIdk56jA", "stars": 3, "date": "2013-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QCpN-JljUnaIlPoNVoagCw", "review_id": "LMDDlCd5Q4B5JxrQ5r0OyQ", "text": "The prices are obscene they cook in nasty old grease we had the fish and shrimp both were awful and not enough a two year old could prepare better food! We were Very disappointed and will not be going back.", "business_id": "cpGv6ES2hzPCtCUQgipwXw", "stars": 1, "date": "2014-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "FWOMdItlF6t4eiN3U5DImw", "review_id": "AZ8A5cPkz5N9RQYRSDYLNw", "text": "Wow, from the street it looks a little rough. But I noticed that the parking lot had been freshly hosed down and was spotless. As soon as we entered I knew we were in for a treat. A wonderful friendly atmosphere and all of the chairs and tables were hand painted in Mexican folk art. The place was immaculate. \nWe had called for a reservation for 12 people and our table was ready for us and we were immediately offered chips, 2 types of salsa and waters. \nThere were so many wonderful things to try on the menu that we all ordered something different. After we ordered we were given some of the best cevichi I have ever as an appetizer (no charge)! \nEven though the kitchen had to prepare 12 different plates, they all came out together. \nEVERYTHING was very carefully made and delicious. By far some of the finest Mexican food in the valley. We travel in Mexico often and have had many wonderful meals there. Imagine going to 16th street and Roosevelt for something even better. \nThe service was VERY friendly and timely. It felt like we were eating at my Grandmother's house! \nHands down, my new favorite Mexican Restaurant", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2010-12-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "maUtMEgvC87VZvoUMbmDLQ", "review_id": "yusWil77xE1Jv1bLYuwuBQ", "text": "This place is awesome!  Truly one of the best Seafood Mexican restaurants I have ever been to.  The ambience, food, customer service is all top notch.  I have been  at MPH over 5 times and always been impressed.  I have tried various dishes from fish, fajitas, and tacos.  They have great sauces and everything is homemade.  I highly recommend this establishment for a good meal and truly authetic.  A+ all across the board.", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2013-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lOPJFN7LAlAWoZkDpclZVg", "review_id": "iuD9aY7cutWHCf6jxyuuHA", "text": "Excellent food & friendly service! We will definitely be back! The guac is amazing by the way, definitely a must try starter.", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2014-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "GrSixRnGIxNUJ1Cn5DNX9A", "review_id": "Wl7p3fio2C5MpcvOXtydmw", "text": "If I had to imagine what the dining experience would have been like a couple of decades ago for the first and second generation Italian families living in middle America it would probably look something like Christos.  The place has that ambiance and charm that say's \"You're Family\"....sorry Olive Garden.\n\nThe food is good and while there are other Italian places in town that are arguably better in quality and taste, none of them really beat this place in terms of authentic Italiian-American atmosphere.  The place is up there with Durant's, Monti's, and TeePee's as essential Phoenix dining landmarks.", "business_id": "3CSaqRNvYg7ZdN2zwxwzVw", "stars": 4, "date": "2009-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G_Qup54owJRH-lmkhs4bOw", "review_id": "_8PHxkD2qshjr84rnskcZQ", "text": "Great food and great staff! Our waitress was awesome, checked in when we needed her but didnt hound the table. The manager and gm checked with us as well. I reccomend the bacon cheddar mashed potatoes!", "business_id": "gQjTs4BDNYSu9oJhkEsssw", "stars": 5, "date": "2010-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "CAlxnkAuqNetlUmWtCQ_eQ", "review_id": "HEkjFwTankdQTr5tDDigmw", "text": "I have only been here once, but the food was really good. The fish tasted fresh, was well prepared and the portions were large and the service was good. The place is big, decorated with lots of sea-faring items, as you would expect, with sort of a rustic feel. The menu has a lot of options, something for everyone, lots of fish and other seafood.\nIf you like seafood, give it a try.", "business_id": "SOHp2b8quJEitFeuO58Syw", "stars": 3, "date": "2008-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "_IfgQ8wABCdRxvTt36TZ2Q", "review_id": "nPUZU2bompoKogdaWX0Y-Q", "text": "McCormick & Schmicks is one of those restaurants that serves a very real purpose by providing a place to wine & dine clients, colleagues, & co-workers. The environment is really nice. If you need privacy or quiet for a more serious discussion, there are little alcoves that seat six comfortably where the curtains can be drawn to provide privacy. The service is polite, attentive, & everything service should be. \n\nMy hesitation with McCormick & Schmicks is that for the price, the food is ok. It is enjoyable but not memorable & while it is not a really expensive restaurant, it is expensive enough that I expect a tad more.", "business_id": "MU3i2uEyUBntebU6pEyMbw", "stars": 3, "date": "2009-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "z0OdAENLL18A_u0yeq1kaw", "review_id": "n6Kn2k95So7-cHqci8vljg", "text": "For some strange reason, my mom wanted steak for her birthday dinner, and the good kind, not the kind I can get at Taco Bell for $2.99. \n\nSo off to The Capital Grille we went. \n\nAnd we weren't disappointed... by the food at least. The food was blissful. From the perfectly cooked filet mignons, to the incredibly fresh shrimp cocktail, to the creamy and utterly delicious mashed potatoes with the right amount of lumpiness... it was 5* worthy. \n\nHowever, the service did disappoint. Our server, an older gent who still had spring in his step, was kept so busy by his other tables at different corners of the restaurant, left us neglected for more than 25 minutes between service of the appetizers and checking in to see if we had finished. We had, and we'd finished our waters and sodas as well. \n\nTo the chefs at The Capital Grille... well done! To the waitstaff... sigh... just... sigh.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 4, "date": "2012-01-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "D5J4mKahKvUBJUTWanZwdA", "review_id": "JH5tamaDOrGODQhccoyn9Q", "text": "Kettle One Martini's with Blue Cheese Olives, Medium Rare Steak and a dark bar! Yeah, there is a pretty good chance you will find me in a place like this. I am drooling as I write this review. The Capital Grille at the Biltmore is the perfect place to take a break from shopping. Sit at the bar and have a couple cocktails and some calamari and you will be ready for some more shopping with the gf. Could be dangerous shopping if you have one too many FYI.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 4, "date": "2013-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oT6XHjvPHmQ0EdQpuOHrPQ", "review_id": "3VIasH4KYAMhkNzmyK28SQ", "text": "Service is great, but the steaks did not leave such an impression. The sirloin steak, Porterhouse, and the rib-eye like Delmonico were just OK. The steaks seem to not hold their juice, and they don't have that steak taste to them. We all ordered them medium cooked as well.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 3, "date": "2015-02-01", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "fev0iI-XDrteD4SYRKjiUw", "review_id": "1YulcnzoV7G6iENjs8nMdg", "text": "This is possibly the weirdest place in Phx.  It is in a strange location, in a strange building that seems to have a drivethu menu but no window, and um...no lobster on the menu.  I ordered the shrimp with a side of hush puppies.  The shrimp had been sliced in half to the tail so that they could be fried as long sticks.  This was a little odd for me and left me with quite a few bites that were more breading than shrimp.  The hush puppies were pretty good though.  I don't think I'll be going back here but I'm glad I tried it.  It was quite an experience.", "business_id": "YxMnfznT3eYya0YV37tE8w", "stars": 3, "date": "2010-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WaprnliOW0YoLlhExXGb0A", "review_id": "taLSQLCCp65pVgzMAGoz4w", "text": "We love this place!!! We only eat at this location. We have tried others and they just don't compare. We always get the shrimp and an extra cup of sauce. I feed my family just under 20 dollars and we always have left overs. We can truly say that we are ADDICTED TO PETE'S FISH AND CHIPS!", "business_id": "NXPuaH5R8rMfYqnnP5s1WA", "stars": 5, "date": "2014-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SBWTjWSI0vD0tpAt0cALpA", "review_id": "F6okNpN7pyZ_JHM8t_xMtg", "text": "I will just say that when you find a good Sushi place, stick too it! I am not a big fan of trying new places when you already have been somewhere amazing! I will also not return, the best thing I had was the deep-fried crunchy eel roll....when they can't get a spicy tuna roll right...it can't be good!\nIf you are looking for an amazing place, and are in the north scottsdale area, check out Fusion Sushi: http://www.yelp.com/biz/fusion-sushi-and-china-bistro-scottsdale", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 1, "date": "2009-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "IdX3Z5CVwwQ0d75Y5-gPnQ", "review_id": "8J2M1Tu-HqW9yKLmR9tJ5Q", "text": "It's is the place for sushi in Tempe and south Phoenix. It's priced fair and the fish is so fresh. This is the only place I suggest for sushi in this corner of phoenix.", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 5, "date": "2012-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j5ZxaxAI3xf38-QtreuBfg", "review_id": "DbSS_U4q5-kDVQIQ1dVoOQ", "text": "I've been here a few times and loved their sushi. We decided to come here for my boyfriend's son 7th birthday. This was what the birthday boy wanted to do with the rest of the kids for his birthday.  They always wanted to go to a Teppan so we picked this place. We were seated right away. We had the whole Teppan table to ourselves since there were 8 of us. Our waiter, Josh, took our orders right away but once he did, he was MIA for most of the evening. We barely could get a hold of him. A friend and I had to help ourselves to getting napkins, utensils, emptying the table when we were done with our soup and salad and getting to go boxes for our leftover food. He forgot to bring my bf's Kirin so we had to hunt him down for that. But he, also, forgot to bring us our appetizers which was included in the Teppan Special. We were busy with the kids and watching Moonie, our Teppan chef that we didn't get a chance to hunt him down for our appetizers. I understand that he got busy but it is uncalled for when we barely saw him nor came to our table to make sure everything was good or if we needed anything else. He should have had the manager assist him. I had to hunt him down to get our 4th sushi roll. Our Teppan chef, on the other hand, was awesome! Moonie totally entertained the kids so that helped make our dinner somewhat special. Overall, I wasn't happy with the service but the food was good. If it wasn't for Monnie, I would have told my bf to not tip Josh but we felt it would be unfair to Moonie...good thing we gave him a little tip earlier after he cooked for us. Every adult in our table have been in that kind of industry - we've all waited tables so we know how it is when you get swamped. A good waiter should have asked for help. We were appalled with the kind of service we got. I know we weren't the only one because the table behind us were griping about Josh's service as well. He forgot to bring the rest of their sushi and they waited a long time as well.", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 3, "date": "2014-12-29", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "nP_vZUqkoajeBC4qTV0Mlg", "review_id": "t0yg-oP8ozleXNp7Q5f0dw", "text": "Even all menus are regular, common, & ordinary menus, The flavors of each foods that I tried tonight was great. I ate mushrooms with chicken, green beans, seaweeds, fried rice. The kimchi was just OK. \n\nThe price was about $20-ish. For the same price I can get a lot more options at 'other place' buffet such as more dim sum options, big  lobster, sweet pork belly, etc.", "business_id": "-Ogv7rpcgUHkFaSy3vD8Sw", "stars": 4, "date": "2013-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4O9TIazlg6LGm1XynQSklw", "review_id": "zXLH5zEMBP6pDLDfND4EqQ", "text": "and that's it!!!! Nothing Gourmet meal about this place:-/  it's just a regular Chinese food taste less, cold, the pig knuckles is very tough not cook enough and no taste, ribs are dry.  Service is poor!!! Ambiance is nice the rest need help!!", "business_id": "-Ogv7rpcgUHkFaSy3vD8Sw", "stars": 2, "date": "2015-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Im8aRwRl7kchgmocHsvaMQ", "review_id": "hWX8BWoaGgRn4f3Gjwpuxw", "text": "Always original and wonderful. Be sure to have the chocolate dessert!!", "business_id": "corPOxxIBRJ7DSpryYvorw", "stars": 5, "date": "2013-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "i3JNq17dt9gPY8g_0CZibQ", "review_id": "_sSO6o7L3S8gRsiNhItOzg", "text": "This used to be the best, a little pricey, but delicious when they were located by Fiesta Mall.  But, now it's just overpriced small portions which are still very good tasting.  You pretty much need to order 2 fish and chip dinners to get 1 good meal which makes the price absolutely ridiculous.  Another great classic food joint that moved into an expensive lease and now can't remember what made them successful.  Too bad.", "business_id": "kG_-Ce7HH_RH2Rmcp3GMvw", "stars": 2, "date": "2013-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dYcoPnm7J-oHD8SDC1XiWw", "review_id": "TiC3xCG-hSOv5pKSYPyJnw", "text": "I'm giving five stars for our server, Heather. She's a little brunette who should probably get a raise. My boyfriend and I dined at this location the other night and were thoroughly impressed by Heather's friendliness, knowledge and experienced nature during our meal.\n\nThe food was pleasant, especially given we sat down an hour and a half before the closing time and everything went very smoothly. We enjoyed the atmosphere and meal tremendously and were lucky to have had Heather as our server that night. My only regret is leaving her tip on my card instead of in cash!", "business_id": "k8q3ypIoIzchdp3RoRUsJw", "stars": 5, "date": "2015-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zJ7Rvp193kl9L0ue-rDxyw", "review_id": "I9OjDR_fAsZLgDRV90uJWA", "text": "I decided to check this place out after having driven by it numerous times and had a few friend say that they liked the place a fair deal.  I was hungry and craving chinese, so why not I figured.\n\nCalled in to see if they were open and they were, but hearing that they had an hour wait, I elected to carry out.  15-20 minutes is about average so I didn't say boo.  25 minute prep time isn't too far outside of the estimate and they were busy after all.\n\nThe barbecue pork lo-mein was not the best ever.  Pork had a fatty texture, and the dish as a whole was okay though a bit bland.  The duck won ton soup was pretty good....Right until I got to the meat.  Almost every piece had either bones or bone chips in it.  I am not sure if that is a normal part of how it's made, but I have never experienced the like before and it was a put off.\n\nThe experience over the phone and waiting was fair.  The place was packed due to being one of the rare places open Christmas night  and I understand the pressure of being a host or hostess in this situation, but I saw this girl loose her composure a few times in the 15 minutes I was there, once pretty majorly.\n\nWith the bones, fatty flavor and other worries, I managed a few bites overall before my $20 meal went into the garbage disposal or trash.  I'm stunned with the overwhelming good reviews, as my experience was so weak as I had pretty much a poor experience overall and a lot of disappointment.\n\nI may or may not give them another shot in the future.  At the moment, I doubt it.", "business_id": "z4KFTJQsAdxqMZA7Fx0A9A", "stars": 1, "date": "2011-12-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gcVDt5m7jjWFHJCOP3lcdA", "review_id": "XX-4YEE0uV6h2b7nxBXBdQ", "text": "Have been enjoying this restaurant for many years, tonight was no exception. We warmed ourselves with hot tea and the savory broth of the Sizzling House Rice soup. Then we devoured the delicious General Chicken, enhanced by flavorful sauce & veggies, had both steamed and brown rice, and Beef Asparagus, which was just okay (first time we tried it). Never a bad meal!", "business_id": "z4KFTJQsAdxqMZA7Fx0A9A", "stars": 4, "date": "2014-12-31", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "EabJsW5sDkfUx0WIhqlJeg", "review_id": "jgNWcOqmPYlaXNbLKLXsSg", "text": "It's extremely doubtful we'll ever go back!  Nope - Not - Decided!  What was wrong?  A bit of everything!  First off, my seat had a \"butt crater!\"  Normally I would have asked for a different booth, butt (ha,ha) we had waited the better part of 40 minutes, we were hungry, and there were no available tables in sight.  So then I had to make a decision, sit \"in\" the crater or balance myself on the \"high part.\"  As if that wasn't bad enough (it was,) the downward spiral continued: the smallest salad you've ever seen served in a \"papa bear's\" size bowl, the up-charge for a cup of soup when substituting for the salad (nearly full price,) and then it's watery and tasteless, an appetizer that looked much better in pictures, and entrees without taste and texture!  For the two of us, it was an $80 disappointment.", "business_id": "txCJurIIrE9ZoHu3gZUvnQ", "stars": 1, "date": "2013-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "7bdCfESkLLta4vwxO5tyHw", "review_id": "jLbxcr6ST-N9Q9oXbdjiGw", "text": "The wait was a little long, and it really seemed like they went out of order when they started seating. I went up and expressed my concern, and then we were immediately seated. \n\nThe waitress was very personable and friendly. She quickly got our drinks and orders. She appreciated that we were ready to go with our orders as soon as we sat. \n\nWe were able to share a dish and salad, and we still got stuffed! \n\nThe food was better than Olive Garden, and even tasted more legit and fresh.", "business_id": "cKxXBvOithS-Ic5KnhEKrg", "stars": 4, "date": "2014-01-30", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "0OOkrmIt4shzLyLcEUNwhA", "review_id": "7mrQdvM6PF1UY8TX-xW4EQ", "text": "The Keg is a fairly large chain restaurant but I've only been to the one located in Chandler. It looks like they have locations throughout the US and Canada.\n\nI've been here a couple of times now and have found that the steaks are much better than the prime rib. The last time I went, I had the 20 oz rib eye. It was pretty awesome and cooked perfectly medium-rare. The prime ribs are decent....but pales in comparison to House of Prime Rib in SF.\n\nI recommend getting the baked potato as a side dish and ask for the triple cheese butter. In fact, ask for extra triple cheese butter. It's that good.", "business_id": "xMK01ZbVUYLLoyqoeWAIVw", "stars": 4, "date": "2011-01-28", "type": "review"}
