{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Iseb_IvqOEfY_p1m9OwTrw", "review_id": "Bk8rZYrBNISt35f3QEzSng", "text": "A nice warm escape from the Strip on a cold day. They make good hot Vietnamese soups. \n\nThe real star of this place is the hoagies you get outside the restaurant though. Delicious marinaded grilled chicken stuffed in a sub that has perfectly pickled onions, jalapenos, and other toppings.\n\nI've only been by here during the day where this place has earned a following for its outdoor sandwich service.\n\nThe folks who work there don't have the best grasp of English, but they sure do get a kick when you try to pronounce their Vietnamese words.", "business_id": "GQloL8yRHymE0SGZq-B0zQ", "stars": 3, "date": "2009-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ht--WF85eksNdCDjd6D7PA", "review_id": "8RglP0Gdej0casNGQwZXfw", "text": "I go here as often as I can!!  I love it.  The Pho is the best in Pittsburgh and is always served with the correct sides ;-) The service is attentive without being overbearing and the prices are great! Stop reading and GO!!!!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2010-02-07", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 1}, "user_id": "So32N7bSbUd1RwhFtI6jTQ", "review_id": "-iU3CYJ5ewtWyl--DvIL-g", "text": "I again had the spicy prawns but this time I noticed the chili sauce tasted a lot like ketchup. I am not a fan of ketchup but hell I can understand using it as a base for a chili sauce it just doesn't set well with me for Vietnamese food but I guess I can undertand it for Pittsburgh Vietnamese...it make sense.\n\nI like this resturant , but forgot it was cash only and I swear the owner blocked my way from the exit while I withdrew cash from the atm...Yeah I didn't like that feeling too much. \n\nYes I would dine here agian in fact  I plan on doing so tomorrow evening, but I'll make sure I have cash on hand so as not to be made to feel like some sort of sneak thief!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2012-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rOs5ezqPyecAHV3WM-c9Jg", "review_id": "sw1F-o9GP72L1ydx9vlScg", "text": "Tram's is one of the best options for quick and healthy vegetarian/vegan food in the Lawrenceville area.  I am obsessed with the \"tofu and veggies\" (same item on the appetizer list and the noodle entree section)-- it is a cold dish with a piquant, vinegar-based sauce and lots of fresh herb leaves with julienned veggies and a well-cooked tofu with an excellent texture.  I crave this stuff.  It tastes so good that it's shocking how healthful it actually must be.  Other favorites are the spring rolls, the vermicelli with tofu and vegetables (hot dish with a different sauce and vegetables), and the pho soup.  The complaints in other reviews are spot-on: it is cash only and BYOB, a bit cranky and rushed service-wise at times, and not the most restful decor and interior (noise from tv and staff's children and dated plastic tablecloths/decor).  Don't let that stop you from going.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2015-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KIGb2wKx2DsrW3-g-zyeOg", "review_id": "amitvBEnS2rJiEUSzSIxVw", "text": "I had heard good things about this place from friends and now I am really questioning their palettes! The Pho was very sub par. Not a large portion at all for a $7.95 price tag. They served it with wilted old cilantro and about 12 bean sprouts...no basil. The manager said they were all out of basil in the state of Arizona. The shrimp and pork fried eggrolls for $5.95? Horrible. 3 pieces cut into half served with two small pieces of lettuce and old cilantro and 1 sprig of mint. It's like they don't keep their veggies in a cooler. There is much better Vietnamese food in the city, try Pho Tanh and Maxim, both in central Phoenix.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 2, "date": "2011-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "oHujm5z3frB-9BL3i3KIKg", "text": "May not be \"authentic\" Vietnamese, but that doesn't mean it's not terrific. Went back today and had the Tealight Special - a good size bowl of Chicken Pho, a spring roll (shrimp, noodles and veggies in a rice wrapper) and two small pork & veggie eggrolls. Dipping sauces add just the right balance of sweet, sour and salty. The fresh basil is the perfect addition to the Pho -- love to rip it up and add it all into the bowl. So fragrant. Good, good stuff. A big, tasty change-of-pace lunch for about $9.00. All good.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2013-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qsHDUkLVwJ5PbUdgao43gg", "review_id": "Rlkd_R_uzGzaVJBY6I21eQ", "text": "Great pho, great service, everyone is always smiling!! I make a trip at least once a week-even when it's hot-to satisfy my pho cravings. And the egg rolls are to die for!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2015-12-23", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "mUUy72UfqmFj_krWclKELw", "review_id": "CnKGe9BoRbDykoPI9pK1GA", "text": "A Newly Found Treasure and I came here last night to try it out. I was not disappointed.\n\nIt was the first time I've ever eaten Vietnamese food and first time i had Pho. I thought the food was good. I like the Spring Roll. It was fresh and savory. The mint that was inside the roll gave it that zing taste and and burst of surprise. The #10 Pho I ordered was delightful. I finished everything except for the soup!!!\n\nThe people were also friendly. Our server made sure we knew what we were ordering and told us the ingredients in the soup. I eat anything and everything!! \n\nNice atmosphere and a homey feel. I'll definitely come back here again. \n\nThe place is located in the Iguana Macks plaza just after Knox.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2009-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "r8xfTpifZ7gP5Cd5CSQaIQ", "review_id": "gE1bdO2Q680DipR5s-w-1Q", "text": "Average pho shop on Alma School. Cheap, quick and friendly service. All dishes are ~$7. Menu also offers vermicelli bowls and plenty of over-rice options.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2012-12-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5NCwhoG7xWmxfR3ciWr-RA", "review_id": "Vl7q_vBNPCEc8ZDxilFWcg", "text": "I have only had the pho here and this place is good in comparison to the rest of the pho places around, but definitely not the best pho I've had because I moved here from LA.  One of my complaints about this place is that it inconsistent.  I've come here before and had great pho and then on other days I've come and the noodles were too soggy and I would get more of one meat than another in my soup.  Also, I think they overcook their tendon so it's a little too mushy for my liking.  The veggies that come on the side are often not fresh, with the jalapenos looking a little old and withered, and the waitresses are always a little off-putting when you ask them for extra sides.  If you want some authentic pho this is a good place to try, but I just don't think the quality is all there.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2014-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EVN484M7GZxhVpp61JgQBA", "review_id": "JcZG2-yERDp2unZ3xztNzQ", "text": "I'm surprise there aren't more reviews for Cyclo.  Bonus points if you pronounce it correctly (See-Klo).  I love this place.  The owner, Justina, is a hoot and really keeps the place running smoothly.  And if you're there more than once, chances are she'll remember you.\n\nCyclo is a haul for me from Central Phoenix, so it's not a super regular stop for me, maybe once every 6-8 weeks.  But, Justina remembers me and chats with me.  That's great service.\n\nCyclo is another BYOB and, Lord knows, I love that.  No corking fee.  Now, this isn't fancy.  Paper napkins and plastic cups, but dang, it's good.  \n\nFaves include:\nGreen beans.  These aren't your ordinary green beans, they're chili and garlic green beans and they make me want to be a vegetarian.\nTamarind ribs.  On the app menu, they are so tasty and tender and tangy.  I wanna lick the plate, but that's not lady like.\nLemongrass Chicken.  Lil' nuggets of lemongrassy love.  Chicken deep fried and infused with lemongrass.  So simple and delicious.\n\nEverything we've had here is wonderful and calling it reasonable is a laugh, it's downright cheap.  We were four for dinner with apps and entrees and tea for $50.  That's a deal!\n\nThey are now open for lunch, but no lunch menu.  It's the same menu all day long.  \n\nNo reservations and the wait can be long.  I suggest going at lunch time or for an early dinner or be prepared for wait for a bit.  On the same note, this isn't a place that you sit and linger after you've eaten.  Be considerate of those is line, pay your check and get outta there!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2007-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6I03vCK7mi0wVEoMyEl9WQ", "review_id": "SBhmez4K93RFp9dKjCxePQ", "text": "My wife and I just had lunch today at Cyclo on a recommendation from one of the best restaurants in Chandler.  It is a small restaurant right next to the wall greens.  A perfect example of don't judge a book by its cover.  We got there about 1:30 and place was surprisingly busy for a late lunch.  We were immediately greeted by Justina, which is either the owner or manager, either way very friendly.  I ordered the pad thai and my wife ordered the mint chicken.  The food was incredible.  Best of all Justina came by to check on us and informed us that they allow you to BYOB!  As soon as we got in our car she was on the phone with some friends of ours planning our next trip back.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2011-01-27", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 1}, "user_id": "ljgsne36Z7SqMDDCgt5edA", "review_id": "nwD0QV6rn4OAKbXqjUWtgA", "text": "Great pho! The service is excellent and you are well taken care of. However the owner swears more than most sailors I know, so don't bring anyone here with any hope of a formal or decent atmosphere.\n\nThis place definitely does not meet the standard Vietnamese restaurant stereotype: VERY trendy (looks like an Ikea truck threw up in there). Can't take dates or family here due to the atmosphere. Pho is worth the trip, however and Justina -- whom I like to call Sailor Mouth -- is the price of admission!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 3, "date": "2015-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "X2usPhxSB9LOcZ5ecorWfA", "review_id": "3cftvCWZEw9pk8-li2Zyow", "text": "This place looks sooooo different in the daytime than at night. Maybe its my hennessey/beer goggles.  It serves its purpose.....healing my body after a hard night of drinking.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2008-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DmiDcia2XZNmdkf7Wl_ffw", "review_id": "Hvdb87RH4L4h7izMg-Pxyw", "text": "I really like the food at this place. I go there all the time, but the service is poor. And I hate to say it but, while they will help you (after asking them for something 3 times before they do it), unless you're Asian, don't expect to be waited on promptly. \n\nTheir food is amazing and the Salt & Pepper Calamari is the BOMB!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-01-05", "type": "review"}
