{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-Tjv2E_WAFsdVxjS5hzuyA", "review_id": "xRx_Kwq5Rx6oGWL6VargYA", "text": "We stopped here for a quick dinner before an appointment. I had a gyro and it was good. I personally preferred Mike & Tony's to this one, but would eat here again. \nMy wife really enjoyed the buffalo chicken gyro and is the reason I am giving 4 stars. I was going to go with 3 but changed to 4 based on her and my daughters opinion of this place.\n\nThe servive was so friendly here.", "business_id": "PSlOtPIo28BvWOzdLmRRRQ", "stars": 4, "date": "2015-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "f-x7PUeSyF63yL-AIwL7bw", "review_id": "BNalzEs-ypDB-3JatwxqPA", "text": "I use to work on the North Shore and walked  over here for lunch regularly.  I like the gyro salad, hummus and stuffed peppers.  The food is made fresh every day by the owner.  Nothing is frozen.  My wife and I always eat here on Light Up Night and before shows in the theater district.  It's always busy, and the staff has always been generous and friendly.  One of my favorite small-eats places in the city.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 4, "date": "2011-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "So32N7bSbUd1RwhFtI6jTQ", "review_id": "EQCqkRXGTyY0S4poGxFoOg", "text": "I would never get another gyro from Salonika's the meat on my gyros are always cold...however I do enjoy thier bar, I go to salonika's 3 nights a week for an after work drink.  The staff is very friendly and they keep the place clean.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 3, "date": "2012-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RlTZiUpqWey6VlAyRfd8RA", "review_id": "L9Sq4YCnBT4I3LhiHtw0JA", "text": "Fairly decent gyro for the price. The other reviewers are spot on with the pita being too small...I appreciate the amount of meat and filling, but it was impossible to eat by hand. Tzatiki sauce was tasty and the added onions and peppers were a nice touch. Nothing mind blowing but it hit the spot when I stopped for a quick snack.\n\nDid not investigate the bathroom here.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 3, "date": "2012-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "wcxEz9R_dkyrBjpzRRM5mQ", "review_id": "tQnbJLIk-Dz07zNMbAZt1A", "text": "I go here almost weekly. You can get a huge grilled chicken salad with bread and tzatiki for $6.25. Absolutely worth it for the money.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 4, "date": "2012-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "KSS6v5fcZNoelu4eEZCFcw", "review_id": "fGvmqiWAEMEPn1ecbLzHLA", "text": "We were in the mood for gyros and decided to try a place we had never been to. The restaurant has been there for years but we normally go to Mike & Tony's for gyros. We both ordered the Gyro Special for $8.88. You get a gyro, fries, and a drink. \nThe portions were smaller than we normally get at other gyro places. The fries could have been cooked a minute or two longer. We had to add salt. The pita on the gyro was small and soft. I was worried it was going to tear or break but it didn't. The gyro meat was okay but not as flavorful as other places I've eaten. The sauce didn't hold much flavor either and was a little watery. \nThough I wasn't impressed, nor would I go back for the gyros, I would go back to try some of the other items on their menu. They had a baked Greek chicken with lemon potatoes that seemed to be selling more than the gyros were. I think I need to take a group there and have everyone order something different so we could try more of their menu.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 3, "date": "2014-12-03", "type": "review"}
{"votes": {"funny": 8, "useful": 11, "cool": 11}, "user_id": "9OZH1Ecw-qUkCW5MS0NefA", "review_id": "xL3gw7OZpzGjrJI1TpafRQ", "text": "I stopped by last night for dinner with CM after we'd spent the afternoon at Duquesne University, since I had a City Dining Card for Salonika, and it'd been awhile since CM and I had had Greek food. The first thing to note that surprised me a bit is that Salonika doesn't provide table service--orders and payment are accepted up front, and food is provided on trays that you take to a table in the dining area.  The staff bus the tables, which clearly needed doing at the time of my visit.\n\nBased on other Yelpers' recommendations, I ordered the rosemary half chicken with lemon potatoes ($7.39), and CM did the same.  While the flavor of this entree was decent, I found it extremely greasy, and I suspect the chicken wasn't of the best quality, since pieces of bone kept breaking off and ending up in my mouth.  As for the lemon potatoes, again, the flavor was on point, but the texture was off, such that they were mushy in some places and so hard as to prevent chewing in others. The sauce on the plate from the potatoes had a great flavor, which I used to dip the chicken and complimentary pita bread that came with the entrees into, but it was also quite greasy from the chicken.\n\nCM and I also decided to order dessert, with him ordering the baklava and me ordering the chocolate cake, which looked super-tempting in the case.  I'm happy to report that the cake didn't disappoint--it was substantial and moist with thick, fudgy icing and a pleasant, though unexpected, tinge of anise flavor.  I tried a piece of CM's baklava, and enjoyed it as well--it had a generous coating of honey, and plenty of chopped nuts.\n\nOverall, I found the food at Salonika to be inexpensive (at least, for entrees and the Cultural District) and flavorful, but to be lacking somewhat in execution.  I'd consider returning the next time I'm downtown and have a craving for Greek food, since I believe Salonika is one of the few gyro places downtown that stays open beyond lunch hours.  If I'm looking for a nicer sit-down dinner, however, I'll pass Salonika up for one of the many other restaurants in the vicinity. 3.5 stars.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 3, "date": "2015-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cqWHSAMZJxB00Wh1G8GOlg", "review_id": "QDPyUFcjjLZszQjA93rV0A", "text": "It was very cold inside the restaurant. I had the posieden salmon and the filo dough was so tough I couldn't cut it my plastic fork. My husbands pork was a small portion. It was very inexpensive and I understand why. Won't go back or recommend it.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 1, "date": "2015-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Og0qmIEebohJLhrDoWEAfQ", "review_id": "BY2cjGYEAagdgF71smDJzw", "text": "Gyros are delicious,  all the  toppings nice and crisp .  Homemade pierogies scrumptious.  Waitress always friendly", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 4, "date": "2015-12-15", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "EcJiDfkjgErhCx8KnRitSg", "review_id": "13ay7_ovvsWzqsUStHdZIA", "text": "One of my absolute favorite places to eat in Pittsburgh.  The meals are a little bit more expensive than you normally want to eat as a student (I probably spend $20-25 with appetizer and dessert), but the food makes this hole-in-the-wall truly worth a trip.\n\nChristo is the owner of the restaurant and was at one time employed upon the Onassis yacht.  Years ago when I first came to his restaurant, he was the head waiter on a staff of one.  More recently when I have gone, there have been other hired waiters.  The service isn't great, but it's not terrible either.\n\nThe food offerings include standard middle eastern fare: hummus, baba ghanouj, phyllo-dough wrapped pockets, and kabobs.  The desserts also include standard middle eastern desserts like baklava and strong coffees, but the signature dessert is the Onassis dessert, a syrup-soaked cake topped with custard and whipped cream, dusted with cinnamon.  The last time I was there, he had added a chocolate Onassis dessert, which was also excellent.\n\nMy normal meal there consists of baba ghanouj (which is about the best I've ever had....it's a real hit-or-miss dish, and Christo's knocks it out of the park), a combination (lamb & chicken) kabob, and the Onassis dessert.\n\nIt's out of the way, but well worth a trip!", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 5, "date": "2006-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eDu0R2K8bCHoXDXfSSL_wQ", "review_id": "Su4ZwflgvgMhQbkjdrS5iA", "text": "I hated it! \nFirst, when I reach there the server showed me a table at the door. I asked for another location because it was cold... His answer.... Why? followed with an arrogant face!!! \nOK!!!! We finally sited in another place.... The salad came... It was ok... Nothing special... The entree... Please.... I can cook better... The lamb was sooo ordinary... \n\nSince I was in Pittsburgh for a meeting, I ask to the same old \"gentleman\" that was serving us for a itemized ticket ( to be reimbursed by university). Whole sh....!!!! \nHis answer: this is the receipt, I can give you nothing else! You can write by yourself what you ate and show to them.... The only restaurant that gave me so rude, unprofessional answer ever!!!! \nIt is not everything... I just took my things and I was moving out when the same \"gentleman\" say loud: THE TIP WAS NOT INCLUDE!!!! Oh my god.... Should I really tell him how much he deserved? But, I took a deep breath and some bucks from my pocket, and give to him... Saying sorry with my mouth, but shov.... it!!!! With my eyes!!!! \n\nPlease, if you go to there... Cross the street, you find a nice Indian cuisine. Five steps ahead, Cambodian. Three steps back, a nice cafe. Better, Six Penn at the corner...", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2010-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4PN_b6vu5WAlQuaM7kBnXw", "review_id": "zViMi8v2qk_O3NqxAzgYvg", "text": "By far, my favorite place to eat either before or after a show downtown (factoring in both price and food). \n\nThe food is great and the atmosphere is very relaxed. Like the Moussaka and the Greek salad with gyro meat (or grilled lamb, but you have to ask special since it is not on menu). The homemade wine is great, as is the Jackie O. desert.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 4, "date": "2010-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f-x7PUeSyF63yL-AIwL7bw", "review_id": "9bH9FljCESzbQ0QT7POFRw", "text": "Light Up Night.  Food has good flavor but doesn't look so hot.  If I hear about the Jackie O desert one more time I'm gonna barf.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 2, "date": "2011-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "h03KMK7xSP8UMnCLglyq1w", "review_id": "UPMw_lbZEkzDC4NKwa83Pg", "text": "3.5 Stars\n\nChristos is a sort of charmingly run-down sort of place, particularly given that many of the other offerings in the Cultural District are pretty new joints.  The food is better than average.  Having just eaten at DC's supposedly cheapest and best Greek restaurant the week I was in Pittsburgh, I found the food to be more authentic, better seasoned, fresher and definitely cheaper.\n\nWe had a group of 10 on a Sunday night.  The restaurant owner/manager/old Greek guy came out onto the sidewalk as we were walking by and practically begged us to come in.\n\nI had a grilled fish dish that was nicely cooked along with a glass of the house red wine.  At the end of our meals we decided we had to try the famous \"Jackie O cake,\" which was, sad to say, nothing particularly special.\n\nBest of all, we had no problems splitting the check multiple ways when it came time to leave.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 4, "date": "2011-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "_DWxIyqYSAlBCm53xx1LKw", "review_id": "zLBAONpX3El-y6gUcixdsw", "text": "I loved the food. The salad was delicious and I had a fantastic lamb kebab and cheese pastry for the main course.\n\nThe ambiance was a little strange but ultimately charming and nice. We were there right before the symphony and ballet were starting (reservations at 6 before shows at 8) and it was super crowded. The main floor was at capacity but we were told to go back through the kitchen and downstairs into the basement. It was utilitarian, to be sure (cinder blocks, plastic deck furniture) but not really a problem.\n\nThe terrible aspect of it--and the reason this wasn't more stars--was the service. Our waitress was either dealing with all the tables upstairs as well or just didn't know what was going on, because she seemed totally and utterly bewildered (beyond the usual frazzled state of a busy waitress). Totally in over her head. We were there sitting down to order at 6:15 and our main course wasn't there until around 7:20, by which time we needed to be finishing up so we didn't miss our 8:00 events.\n\nI know some of this has to do with the kitchen being busy and it wasn't her fault, but that was still problematic. A half dozen times she came by and said it'll just be a few more minutes. We ordered a hummus appetizer and she brought too few pita bread pieces, and then took forever to get more.\n\nThis is a nice down home place and at any time other than the pre-theater rush, is probably a great restaurant. But if you're in a rush to get to an event, give yourself at least two hours.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2011-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Nx9C8-vNZ-k-JJZ-XW5Hmw", "review_id": "bkRLOg8dkGYqdvjPIlRTjw", "text": "We love eating at Christos and have many times in the past............however, I can't help feeling taken advantage of this summer on more than one occasion.  We love the simpleness of the place -- in fact it reminds me of Nana's kitchen growing up - NO frills - lots of love and yummy things to eat.\n\nThere is a particular st lye that I do not enjoy and that is the constant offers of this and that and they make it look like hummus and pita are complimentary as well as salads being included.  By the time one receives the bill -- EEKE! I could have eaten at a more upscale place.\n\nThat's all I have to say -- don't enjoy feeling hustled -- not sure if we will continue to dine there when there is a place right across the street with less charm but yummy food.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2012-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 7, "cool": 0}, "user_id": "So32N7bSbUd1RwhFtI6jTQ", "review_id": "q7QkQsfS6zK7-CDVIoiFww", "text": "Dirty, unclean, my friend and I went to lunch here.  She went to go to the bathroom. Upon returning to the table had the following story to tell.  \n\nTo get to the bathroom she had to go through the kitchen and down a flight a stairs.\n\n When passing through the kitchen she saw raw chicken left out in the heat congealing in it's own blood. \n\n Christos you get no second chances after a stunt like that.  The food was tasty, but come on now chicken chillen on the counter is a no go in anyone's kitchen.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2012-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "SqJ3xHEcHpH1ylOQvkfXcA", "review_id": "QJVYrSRQW9b7ZUPXE67GGw", "text": "This can be summed up as follows: For Greek food, go to Salonika directly across the street. \nThis place is below par in just about every way. The prices are not high, but the servers seem more like salesmen in pressuring you to add dessert, etc. (At lunch?). I haven't been impressed by the food after numerous tries, and the atmosphere is dated and dingy. \nI would much rather go across the street at a place with no pretensions (counter service) and pay for honest food that I can see being prepared.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 2, "date": "2012-02-09", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "YPrGskgm9mjmwz2l_7hTuQ", "review_id": "LIt181buOmj6wM2rpPa7vw", "text": "Descriptive phrase: classic Greek.\n\nChristos is unassuming, but good. Katie K., her sister, and I were wandering around downtown Pittsburgh on a Sunday night and many other things were closed. We stopped briefly to look at the menu that was laid on a table outside, and a nice old man came right out and invited us in. So we followed him.\n\nIt's a cramped little space, made even more so by the insane amount of Greek relics/touristy items everywhere. Even on a Sunday night, though, the place had a good and varied crowd ranging from teens to families to old men hanging around.\n\nOur waiter, who I found out later was the owner, was odd in a fantastic way. He just was bright and quick, and obviously loved his lot in life.\n\nWe started with the Hummus ($4) which came with fresh, hot pita bread. The bread was great, but I didn't enjoy the hummus (too bland). We each had a glass of the house wine (red and white) (~$3?) which were delicious. I ordered the Lamb Kebab ($12.95) which came with some grilled veggies and rice pilaf on the plate but also included a soup/salad. I loved the soup. LOVED it. It was a milky broth with rice. Sounds odd, but perfect for me as I was getting over a cold, and went well with the pita bread from before. The grilled veggies were good, and I really liked the rice pilaf. The lamb kebab was not bad, but Katie K's was so tough she didn't eat much of it. I did not have the same problem, though we'd order the chicken next time.\n\nWe finished the night with Baklava ($3) and the famous Onassis Dessert ($3). The owner regaled the entire place with the story of how he worked on the Jackie O yacht for years and this was her favorite dessert. Goodness, I can understand why. It looks like a simple slice of vanilla cake but it's so much more, with a honey syrup and whipped cream with cinnamon. I want it. I want it now.\n\nOverall, it was a 3-star kind of place. Good but not great. The dessert and wine were top notch, but it lost points on the main entree and the price (which I thought would be reasonable but topped out at $25 a person with tip!). Christos' saving grace is its ambience and staff. Check it out if you have the time.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2013-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "11Ydte1VfE85UHK24d4QRQ", "review_id": "TvNhyMcMsdj0flsdDqEGUg", "text": "Christos reminds me of the ethnic restaurants you'd see throughout Europe or large American cities.  The owner or one of the staff is often outside encouraging patrons to check out the menu and come inside.  It may seem odd in Pittsburgh since most other places don't do that,  but it is fairly typical in other cities.\n\nI've been to Christos several times now and been happy with each visit.  The biggest down side for me is that they can be very pushy, especially if the owner is waiting on you.  Also, they will ask if you want hummus and pita when you first sit down.  While it is absolutely worth getting (I love the flavor of the hummus) note that it is NOT a free item like getting bread at another restaurant might be.  Just be aware so you aren't surprised when you see it on your bill.\n\nThey have a red and a white house made wine.  They are both pretty sweet, but tasty.  I just wish the glasses were larger.  They are in pretty tiny glasses.\n\nTry the Saganaki!  You can't go wrong with flaming, gooey tasty cheese.  Just be aware that when they bring it to your table, they will scream 'Opa!\" and either whistle or bang.  That really caught us by surprise.\n\nThe food is by no means gourmet, especially in presentation, but it is tasty and home made.  That has positives and negatives.  For example, I had the ground beef/noodle dish (can't remember the name and don't want to butcher it).  It was very tasty, but usually it has bechemel sauce over the top of it.  It was a little dry without it and I was told they don't have any to add on since it is baked right into the dish.   \n\nMost meals come with soup or salad, rice and roasted veggies.  The salads have a nice mix of veggies (tomatoes, green and red peppers and cucumbers) olives and even apples.  There is feta cheese and a nice and light dressing.  A perfect way to start your meal.\n\nTheir \"famous\" dessert is the Jackie O.  My husband tried it and loved it but I wasn't overly impressed.  They do offer several dessert selections including the staple baklava.\n\nIf you are in the cultural district and enjoy greek/comfort food, I suggest a visit to Christos.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 4, "date": "2014-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MbEuHx-tEC9YEFY9z9yPKw", "review_id": "sAB588mFGxKOliakXWs1bQ", "text": "texts to a friend who didn't join us.....\n\nYou should have been here.  Had a great day.  Ended the day at Christo's instead of butcher in the rye.  Food was AWESOME!!!   Best Greek food ever.  And, Cristo remembered us and gave us all hugs when we left.   *winning*  Food better, more kid friendly, and MUCH less expensive than Butcher.\n\nI had navy bean soup, hummus, and something called Greek shepherds pie - roasted lamb chunks, peppers, brown sauce, in phyllo dough.  Soooo. Good.   Kids got roasted lamb.   Lentil soup always a winner.  Greek lemon and chicken soup was so light and flavorful!!  If you haven't been there, make it a priority and go.  Plus, his 101 year old father makes the wine and it's AMAZING!!", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 4, "date": "2015-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vzgMOOCg4O6fVHpo-i-jSQ", "review_id": "jTcvcq9HVVxxDu7OJ4MxAA", "text": "This place was fantastic. I stayed at a nearby hotel while in town for business and ate at this place most nights. Delivery straight to my room, fast service, very reasonable prices and portions and the food was delicious.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 5, "date": "2015-12-13", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 0}, "user_id": "fwsJGulnozT2U6FefsLiFw", "review_id": "tjOdUbXxgCVFKvQAYd7vDA", "text": "Hands down the best Gyros in Pittsburgh! There are four types of gyros to choose from: Lamb & beef, chicken, steak and vegetarian.\n\nThere are long lines at lunch time but, they move quick. Seating is hard to come by as well. You best bet is to get it to go.\n\nThey offer all types of different things like burgers, wings, shrimp, salads, tuna melts, steak hoagies and much more.\n\nThey offer Daily Specials as well.\n\nMonday  - Free Fries with any sandwich\nTuesday  - Chicken Gyro with fries\nWednesday  - Shish Ka Bob Salad\nThursday  - Gyro and fries\nFriday  - Fish Sandwich and fries\n\nThe only things that I don't like is that they close at 3pm daily and they're not open on the weekend.\n\nIf God made gyros this is what they would taste like!", "business_id": "AH1PrZQDIdjpKgy1z8XxUg", "stars": 5, "date": "2010-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "So32N7bSbUd1RwhFtI6jTQ", "review_id": "nILLSY41ziI83XV33vDUAA", "text": "Best  grilled salmon salad in the burgh! With a price tag of less than $10.00\n\n Even better then what you would pay twice as much for in fancier resturants. \n\n I like to think of myself as some what of a salmon salad connoisseur lol\n\nBut really I have gone to places where the size of the salmon is more of a small nugget than a fillet of fish. \n\nI always order the grilled salmon salad here and the only time I am dissappointed is when they are sold out. \n\nThey grill the salmon with skin on it's so flavor and a little charred in the best way.\n\nI always have mine made with extra feta cheese. Zorba's does salmon right. \n\nThe resturant is bright and light and fun to hang out at for lunch.", "business_id": "AH1PrZQDIdjpKgy1z8XxUg", "stars": 4, "date": "2012-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "E62SZVU_FsbCYaVnMRs4TA", "review_id": "9R2FW0KZkQ0vLCP2wTsXDA", "text": "We ran into here after trying to find this sandwich shop called Sammies. Yelp said it was on smithfield near 4th but It must have closed because all we found was a 7/11 and subway. We found Zorba's on the corner and considering how cold it was neither of us felt like walking to search for food.  \n\nWe stumbled in here after reading the outdoor menu mentioning specials. The hubby  ordered the buffalo chicken salad which is the special on Wednesdays. I went with the gyro salad which came with a side of pita bread. The hubby's salad was huge, topped with fries and plenty of chicken, not to mention lettuce. He choose balsamic dressing which I thought was weird but he enjoyed it. The fries were great, nice and hot while the chicken was mildly spicy but a little bit dry.\n\nMy salad was just as big but it was mostly lettuce. At first I thought they were a little scant on the lamb meat but  almost like the loaves of bread that Jesus fed to the hungry, it just kept showing up. I was a little disappointed at the quality of lettuce. I hate those big crunchy chunks that you find close the root, they are so bitter no matter how much dressing you use. \n\nSo the reason I give this place only 3 stars is because of my salad. Crunchy bitter lettuce, gyro meat was a luke warm instead of hot which after 5 minutes made it cold because of the chilled dressing. Not to mention the dressing was rather bland and they didn't add enough to my huge salad so i ended up ordering more which cost 75 cents. The fact that I had to order more dressing even though it had little to no flavor was disappointing. \n\nThere is enough seating in here but just some simple tables and chairs spread out, nothing fancy or worth taking pictures for. It's almost like a cheap cafeteria which I don't mind if the foods good but I wasn't impressed with my gyro meat or with the chicken on the salad. Sometimes places have an off day so I won't count this place out just yet. \n\nP.S bring cash only!!", "business_id": "AH1PrZQDIdjpKgy1z8XxUg", "stars": 3, "date": "2014-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SLierwYJc62TIZG-CCokSg", "review_id": "3G4oWVaId_t0MUw86ZkRtA", "text": "This place is delicious!  They have the best chicken salads and amazing salad dressing.  The only downfall are the high prices that continue to go up but besides that this place is great!!!", "business_id": "AH1PrZQDIdjpKgy1z8XxUg", "stars": 4, "date": "2015-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1xo7janbcIsuszGeaGsYrQ", "review_id": "fuz7_XmZlShKTTtJiJto_A", "text": "Disappointing experience after almost a year since the last time I was here. Ingredients weren't fresh and the gyro was heavy on the spices.", "business_id": "AH1PrZQDIdjpKgy1z8XxUg", "stars": 2, "date": "2015-12-14", "type": "review"}
{"votes": {"funny": 6, "useful": 7, "cool": 3}, "user_id": "BOcojc9Sjk5p8MIcU681eQ", "review_id": "rffgbDvD_-ZBJWfuqkN1SQ", "text": "so i'm greek and every time i go here, i get yelled at for not coming in all the time.  honestly, when i want greek food, either i make it myself or i go to mom's house and just have to say, \"ma, i'm hungry.\" and boom, there's a plate in front of me.\n\nthat aside, this place is about as family style greek cooking as it gets.  it does taste like what i grew up eating.  the spanakopita is flaky, buttery and moist as it should be.  melts in your mouth.  the dolmathes are very rich and with a good splash of lemon juice taste great.  \n\ni havent been there in some time so i'm not sure if he's still serving falafel but when he did, damn it was good.  some of the best i've had, period.  but the gyros are where it's at.  i can only have one of these every so often or i think my heart may come to an arresting halt.  there's just a ton of lamb falling out of the pita and there is no sexy way to eat it so you end up looking like a bulldog eating a jar of mayonnaise.\n\nhit this place if your an ethnic foodie.  you wont be disappointed.  even when the owner yells at you for not coming in all the time.", "business_id": "cH8I7JgPXcrcutT1a3YrjQ", "stars": 5, "date": "2011-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XevizAKvBiX_mTMe7QbeyA", "review_id": "3jy6RMsZIS_-vPMu1Ozeiw", "text": "Best Greek food I've ever had--and no wonder, as the husband/owner/cook is from Cyprus. This is family-owned and operated, and in the winter when the husband heads to Cyprus, his wife and daughter hold things down.\n\nBest gyro I've ever had--massive in size, especially considering what you pay for it--and the spices in it are much better than your typical Americanized gyro.\nThe fries are from fresh-cut potatoes, and you can definitely tell. My stomach felt close to bursting when we left, but I still had to grab a few more fries on my way out.\n\nThe group of us--there were 6--ate for probably ~$30-$40.\n\nWe chatted for a while with the daughter, and then for a while more with the wife, so overall it was a great evening with great food, and meeting new people.\n\nAnd they do takeout ;)", "business_id": "cH8I7JgPXcrcutT1a3YrjQ", "stars": 5, "date": "2013-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DLu1Bum8EXNE62xno-v0VA", "review_id": "F9tMjpvRrscdC7C8ibCLsg", "text": "Not to sound like a broken record, but I am yet another reviewer who has to give this place the coveted 5-star rating. I returned to this place for the first time in many, many years (I used to have violin lessons near this shop and ate here often), and boy am I glad I did. \n\nI got a gyro to-go and have to say, wow. Firstly, it's a well-proportioned gyro - not small but not gigantic in size, either. Yes, this is a big deal to me; I like a gyro that I can eat in one sitting since gyros are so messy that the leftovers don't do well during a trip home. Secondly, it's an affordable gyro; it cost me all of $5. Thirdly, as others have mentioned, the seasoning used here is perfect and different, probably because the owner really is from Cyprus and knows how to make authentic Greek food.\n\nYep, that's a lot to be wowed about. The whole thing is so awesome that I wish I had a better vocabulary to describe it, and I'm too satisfied after my meal to get a thesaurus to try to come up with anything.\n\nI didn't get any sides and whatnot this time around, but I'll be back - hopefully for a sit-down meal so I can explore the rest of the menu. Gyros are good and all, especially ones that obviously haven't fallen prey to American cooking styles (i.e. size, oils and seasonings or lack thereof used, ect.), but I really want to see what else the owner can do!", "business_id": "cH8I7JgPXcrcutT1a3YrjQ", "stars": 5, "date": "2013-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gfOjOy3dby4ea4bltVb_Ug", "review_id": "c_l29gJDtt0l0dHxCHprkA", "text": "I ran in here with a few friends for lunch.  I got the gyro lunch special.  The food was made to order, fresh, hot, and the portions are great.  They have hand cut fries and the sauce was awesome on the gyro.  Add to the fact the prices are very reasonable.", "business_id": "cH8I7JgPXcrcutT1a3YrjQ", "stars": 4, "date": "2014-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TWAr3VT5Wl-3hODvNL6TjQ", "review_id": "M62uJcJIxiMI7N3d5MxryQ", "text": "Not sure how this place received so many good reviews..the gyros are good and the ppl are very nice..the rice was tasteless along with the Greek salad dressing..it was my 1st time trying this place and would not go back", "business_id": "cH8I7JgPXcrcutT1a3YrjQ", "stars": 2, "date": "2014-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jMYQlrIWcx8ercQ-WYmSag", "review_id": "0jjSCgyXnYL_yg71fui7ZQ", "text": "This small, family owned place is a great place to go for lunch. The gyros are very good, the hand - cut fries go into the fryer when you order them.  The family that works there are very nice, pleasant people, and the Greek iced tea is tremendous!  You can easily eat a full meal for less than $10, but there are plates for bigger appetites, as well. Dine in isn't glamorous, don't bring a first date, but come for lunch or quick serve dinner!", "business_id": "cH8I7JgPXcrcutT1a3YrjQ", "stars": 4, "date": "2015-02-03", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "CLmgCLKP95JKhf4kV5vP2A", "review_id": "QKIlqcboiWw943xjIfTdKQ", "text": "So much for me not reviewing chains, but I felt a little shout-out to this Shomar's was in order.  I'll note from the outset that I have ordered the same thing every time I've been here, so the scope of my review is slightly limited.\n\nI have worked near this place for over 2 1/2 years but always thought it looked a little dodgy and never went in. Decided to give this place a shot the other day. Turns out, it is quite nice inside although it has a slightly 80s feel to it.  I've only gotten take-out at this location, but it was pretty fast both times.  I ordered the grilled chicken pita with a side of green beans.  Both were delicious--so much so, that I went back the next day and ordered the same thing.  The pita is a little soggy (at least, it is when you get it to-go), but the chicken is nicely grilled and the tzatziki sauce is also tasty.  And while green beans sound super-boring, they must jazz it up with some spices because they were quite delicious.  \n\nIf I ever venture off this recipe for success, I'll update accordingly.", "business_id": "ASwN3Ih0Eh1oH0npLbzVjA", "stars": 4, "date": "2011-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "U0HTp--HcAgNdrUc9BpRNg", "review_id": "pwg-6gv4VAAFjenfVKKq_w", "text": "Solid diner. Good omelette, nothing fancy  , but does not need to be. One star off for coffee that could be better. Otherwise solid food, well made.", "business_id": "ASwN3Ih0Eh1oH0npLbzVjA", "stars": 4, "date": "2014-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "JMsDXE5LixY2dqwnqgYkjQ", "review_id": "pHCiMrndG4edWc7EN8zssA", "text": "Good gone Bad.\n\nThis showmars used to be awesome.  I would have given it 5 stars.  Unfortunately\nthis Showmars is under new management and it sucks!  They are extremely slow and have messed up my to go orders on multiple occasions.  Also, the portions are not as big.  I think I'll be going to a different Showmars.  Bring the old crew back!", "business_id": "ASwN3Ih0Eh1oH0npLbzVjA", "stars": 1, "date": "2015-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "X36p3mD4oqBE53sASc_Ykw", "review_id": "_V2qSYVgJE6moqz7pI_jPQ", "text": "The reason I like Showmars is that you pretty much always know what you're going to get...and that is good home cooked food, and quickly. No different here at this location. I've read some recently negative reviews for this location....but I had a really good experience.\n\nFirst off, this place gets VERY busy before most businesses starting work time....lots of banking folks sitting around me. I grabbed a seat at the counter to watch the chaos in the Kitchen, and to watch the ONE waitress bust her tail in order to make her customers happy. I also find it amazing how very hard Latino cooks work back in the kitchen, and how quickly they can switch from getting their orders in English yet speak Spanish back there among each other. Their head cook was about as hard working an Expeditor as I've seen, repeating every order and making sure his line cooks get it done right.\n\nMy little blonde waitress was filling in for someone who apparently called in sick, and she was uber busy yet kept me happy with coffee and getting my order in and to me very quickly (like 5 minutes). \n\nSo I'd say the STAFF here easily gets 5 STARS. Very hard working and efficient.\n\nNow that I've painted the picture on how this place operates, let me tell you about my Greek Omelet. I got it with Gyro meat and grilled onions, and it was very good! Hash browns and English Muffin were acceptable and average. But the Greek Omelet was filled with tomatoes, feta cheese, gyro meat, grilled onions and some Greek spices. Not overcooked and quite tasty overall. Good size too.\n\nI got about the most expensive thing on the menu and had a coffee and it came out to just over $10. They have MANY breakfast items that hover around $5 if you didn't want to get one of their \"signature\" dishes.\n\nSo if you're Uptown and want a good, home cooked meal, come to Showmars....just don't expect Dean and Deluca quality (nor their prices).", "business_id": "ASwN3Ih0Eh1oH0npLbzVjA", "stars": 4, "date": "2015-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "-_1ctLaz3jhPYc12hKXsEQ", "review_id": "yr5s4AjjCouUYh0wLd8z9A", "text": "This was the first time I'd tried breakfast at Showmars.  Not sure how many of them are serving breakfast.  It might just be this location because of where they are located.\n\nI definitely agree that Showmars may have been better when they are smaller - what are they up to now, some 30 locations?  I'm happy for them and all, but they just lose something when they are no longer trying as hard.\n\nThe staff is friendly enough, but it's not that much different from your typical breakfast service at any diner.", "business_id": "8PsQqhrAH5uqJ7HODOmXYg", "stars": 3, "date": "2008-12-20", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "OXzYyZSHo9Dl6Qd0s_o2Ig", "review_id": "OknOtkCS5Wuo7bPHdA-Flg", "text": "I have been to this location for breakfast for a few times.  Always super quick and friendly service.  There is a large parking lot for the restaurant and it gets hopping!\n\nI usually have eggs and turkey sausage or the biscuits and gravy.  Everything is always cooked well and comes out fast and hot.  The coffee is what you would expect - nothing fancy but does the trick.\n\nThe prices are always reasonable and I have never had a bad breakfast here.  Thanks guys!", "business_id": "8PsQqhrAH5uqJ7HODOmXYg", "stars": 3, "date": "2013-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1SQWUxGZTcu-Py1lH581SQ", "review_id": "_6FXqPpDLJKwuaG9YzQtFg", "text": "I order a Greek salad with chicken and when I picked it up the chicken was not there and it was very little lettuce for the salad cost almost $10 it should have been a nice portion it was not. I called and let the manager know that my chicken was missing and that the salad was skipping. I received a mediocre apology and they were more concerned with me having my receipt then trying to correct the issue. I was able to return in a couple of hours to get another salad. The salad that was given to me the second time did have chicken but everything was still skimpy and portions. I don't think that I will return back to this location I will go to the location on East Boulevard where the customer service is better and you get your money's worth with food.", "business_id": "8PsQqhrAH5uqJ7HODOmXYg", "stars": 3, "date": "2015-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4Q8rohxKQBWlS9ps6J6sPg", "review_id": "OIyqXfzNwoB7yCyLqO0qJQ", "text": "I've lived down the street from Mr Gs for almost six years. Good gyros and cheap. Sadly, I would go much more, especially in the morning, if the coffee was better. My daughter lives down the street as well. When she worked next to Pressley Park Restaurant  on Pressley Road, she would drive all the way back over to eat lunch at Mr Gs!  Lol", "business_id": "M89wkxqAcXuVMtWh91BIjg", "stars": 3, "date": "2012-12-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w5OirozTMHMrawh2bLPmPQ", "review_id": "KjP4xwexVozEAN1OLWqZjA", "text": "My favorite spot to grab lunch in CLT. EVERYTHING is good here. Very consistent. I've been probably a hundred times or more in the last 9 years or so. Very good and very cheep!", "business_id": "M89wkxqAcXuVMtWh91BIjg", "stars": 5, "date": "2014-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cO2RyCOOVTpA0QOUg8yyjg", "review_id": "tZ0Yl1IKurVoOog5MK8Kog", "text": "Great casual fast food type place.  I like the chicken filet sandwich.   Very reasonable pricing.  Lost of airline employees here, kinda thier secret little place.", "business_id": "M89wkxqAcXuVMtWh91BIjg", "stars": 4, "date": "2015-02-26", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "cxTh9xxqbs-m8Paq6jAumg", "review_id": "Cs7rOLoCx1wOw9S_cI3E5w", "text": "Holy nice Showmizzle Batman! I stopped by this Showmars tonight while waiting for a prescription to be filled at CVS next store. When I drove up, I was taken aback because I've never seen a Showmars with a drive thru--very nice!  It was hopping for a Tuesday night in south Charlotte. The interior is very soothing with orange hues and modern light fixtures. They have the same menu as all the other Showmars plus the specials of the day which you can't go wrong with a cheeseburger, fries and a drink for under $7. Lots of big booths in this place so seating wasn't an issue at all and they have a few flat screen tv's strategically placed around the restaurant so I was able to watch some ESPN while having my Super C. Score! Pun intended. \n\nPepsi only up in this piece....I miss the days when Showmars served Coke. Super friendly employees as well, I didn't even have to get up to get a box or a refill!", "business_id": "Lw-01HQDswygHvAZfwkpxA", "stars": 5, "date": "2011-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vE4TIv-AEsFalZ4faTRH-g", "review_id": "_qVyhJGUiStm-cVzI-n3QQ", "text": "Inexpensive, fast, consistently good food - I love Showmars!  This location has a drive-thru which makes picking up dinner on the way home from work even more convenient.  \n\nMy favorites are the chicken salad pita (the chicken salad is simple, which is perfect!), calabash shrimp dinner (lightly breaded, good sized shrimp served with the best tartar sauce I have ever had), the gyro (either pita sandwich or dinner platter) and the All American Jr. Pita Burger (the regular pita burger is 2 beef patties, the Jr. is only one and is plenty).  The fries are always hot and crispy.  The salads served in flour tortilla bowls are very good (either the grilled chicken or the ham & Turkey chef).  The ranch dressing is home-made and delicious.  \n\nI have never had a bad meal from here, everything tastes fresh and delicious.  The prices can't be beat for the quality and the speed of pick-up makes for an easy evening after a long day of work.  I love Showmars!", "business_id": "Lw-01HQDswygHvAZfwkpxA", "stars": 5, "date": "2012-12-24", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 1}, "user_id": "qskitOGNOB6ZYCOv-mGUqA", "review_id": "OJuG2EvI-tSZXbu8KowI9A", "text": "I've been going to Cluckers for years. Every time I'm back home in Charlotte I find myself here frequently.\nIt's a solid restaurant with good food. Best thing to do (when with friends) is order the family meal. You get salad, rice, fries, pita bread and loads of chicken. I leave stuffed and happy. Just be careful when adding coca-cola to the mix as you'll want to be near a toilet.\nI'll always remember going to Cluckers ages ago and changing the \"Welcome\" sign when you walked in. It took lots of careful effort and hard labor but after many visits we had successfully changed the sign from \"Welcome to Cluckers!\" to \"Welcome you F**kers!\"\nThey didn't notice for a week till someone complained.", "business_id": "6-jlUgqp0Mv3PUzMGjrb0A", "stars": 4, "date": "2010-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jp5lBxgdCpDRhSeEuRK_kA", "review_id": "0k2zbu091JLXgxxieCutcA", "text": "When you're craving a good fish plate for lunch.....Showmars is always on standby and they never disappoint. The flounder is their specialty which includes regular fries(or sweet potato), slaw, and hush puppies for $7 bucks. What's not to love?", "business_id": "bffCUYaQ4FejTfu_xFwjyQ", "stars": 4, "date": "2011-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BD8b2Vxz7GDDk8PvcjU8iQ", "review_id": "edMi_HMLnLYWxjXfyiDrRA", "text": "I always passed this place never thought of going in until now! Glad I did their fried flounder, fried okra and coleslaw is to die for. Staff was super friendly. I will be making another trip there!", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 4, "date": "2011-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mTKWYLN9PmqF7UflA7tnPQ", "review_id": "QJKhIi2uguOS-Gm2r_C4zw", "text": "I came here for lunch with my brother to take a break from studying. While I was here I ordered the old fashioned pita burger and to my surprise it was pretty good. I was thinking of ordering the seafood platter, but instead felt in the mood for something of a burger. The service was good and I had absolutely no problem. Food came promptly and well, Showmars is Showmars. Nothing new, place is clean with plenty of parking. \n\nShowmars for me is a once in a while kind of restaurant, not my daily hang out place. Anyways, this one is not badly located. Close to school, I can come by when I'm craving for some seafood or some Greek.", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 4, "date": "2012-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "21s0EBLKz7YxHbHBJImYRg", "review_id": "vtOx2xc6fbOD_q2zRwB66A", "text": "I probably am not best experienced to review because I rarely venture restaurant chains.  In fact, I avoid it.  Example, if ordering delivery pizza - I will search for a local pizza joint than a common chain like Domino's or Papa Johns.  I did, however, eat at Showmar's to meet up with a friend and it was my first time eating there.  \n\nPro's:  convenience and speedy-quick in getting our meal; large selection of menu items/dinners; reasonable prices; large portions, so good quantity for the price.\n\nCon's:  the food quality was what brings the rating down...  my friend ordered his \"regular\" a lamb gyro dinner.  Sorry... the lamb did not look appetizing.  It look liked dried processed meat.  Reminds me of the movie \"Bridesmaids\", LOL.  I ordered the seafood platter and I knew it was fried but I didn't experience the sea-smell so I was quite confident that that the fish was not spoiled.  I believe the fish was flounder but it was quite thin - well, actually VERY thin.  At least they didn't overcook it.  And baby shrimp.  OK, I'll accept it.  But I would have been more impressed if the shrimp was larger.  Coleslaw was questionable... not sure how old it was... the mayo seemed kinda \"sticky\".  Husband ordered the tenderloin dinner.  We were advised that it was not beef but pork.  I recommend that they specify that on the menu.  It was \"ok\", but quite tasteless (not marinated).\n\nOverall, for a quick/convenient inexpensive meal, it \"filled the hole\".", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 3, "date": "2012-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M_fxV_d1i6Uu9FlmFf9BcA", "review_id": "4Kso2xBSn2zpVjl6MPwmqQ", "text": "Love the fact you can't find this store anywhere but Charlotte...... (Sarcasm). \n\nI usually hate going out of town craving this type of food. It is definitely one of a kind. The Greek-american cuisine of Showmars is fantastic. From great salads, pitas, and fish plates, you will more than likely find something that more than suites your needs.\n\nThe food is great. The prices are modest. Service is generally pretty decent but this place will get crowded at times. I would love this place more if they didn't charge you for ranch dressing. I swear that stuff is like an addiction. If you are a fan of ranch- BEST RANCH I'VE EVER TASTED. But only good at SHOWMARS RESTAURANTS, not in the mall. For whatever reason they dilute the dressing in the mall. Burger pitas and fries are awesome! \n\nOverall, I can appreciate a lot about Showmars, and can ALWAYS count on a good meal there. Free drink refills are always good too.", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 4, "date": "2012-12-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x5Ql0VdXCCKtixSZTp8v3A", "review_id": "f-1d7TFy-keC6Pz4oIRiiw", "text": "The food was good and the waitress was nice. But this restaurant was not clean. We were the first and only people in the restaurant on a Saturday morning and the tables were nasty. The floors had trash all over them. There was dust around the windows and possible old ketchup. I won't come back to this location. The one on east blvd is much cleaner.", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 2, "date": "2013-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RYkCobCYYZ2HqL6TdEqoqQ", "review_id": "hTBUTIl7Ix7qX3fojoeZbw", "text": "Tasty fried flounder. GYROS! Multiple order lines. Adequate service. Crowded.", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 4, "date": "2013-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "v-A39xliED8mtlxKjWXp5Q", "review_id": "G4n4hZ16z-gzCm47z8cFBw", "text": "Fast food meets \"Greek\" food.\n\nIf you want to enjoy Mediterranean food then this is not the place.  This is the fast food equivalent of Olive Garden doing Italian, Olive Garden isn't fast food but it also isn't Italian.  Showmars is fast food but its take on Greek isn't really Greek.\n\nI still eat here because it is cheap and close enough.  Don't expect to rave about the tzatziki sauce.  That is what keeps this place from being a 4, and almost got it a 2.  The tzatziki  misses all the flavor notes I really want.\n\nI only ever go here for carryout lunch.  It was a huge hit at the doctor's office I used to work at.  The people were blessed Southern folk but had no idea what Greek food could or should taste like so they found it happy.\n\nIf you haven't ever really had great Greek food then this place will work just fine.  I haven't had great Greek food anywhere outside of Europe and New York City . . . yet.  I want to find my Charlotte Greek place and until I do I will pretend Showmars is Greek as a way to keep me from losing hope.", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 3, "date": "2015-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oW5gKrJ8Qz9pm3IbchHxCA", "review_id": "XA32smoNuiwGOxhVHE9gjA", "text": "I see why they call their fish sandwich \"The World's Best\". Absolutely delicious!!!!!", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 5, "date": "2015-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "eFxX1tSNLmVkAP9kNv2--Q", "review_id": "yF1Od9LaIf1skhICMCzOmA", "text": "Dont' get me wrong, the chicken is good, but when I go to a straight up fried chicken place right near the hood, I want EPIC.  5 stars compared to KFC.\n\nIts on the edge of a strip mall next to a gas station right on sugar creek.  Great location for a drive through window type place, but thats not the case.\n\nI went in to buy a BUNCH of chicken for all the wonderful people that had just helped me move.  It took a lot longer than I expected but that was some good fried chicken.  Lots of batter, really crunchy, and juicy chicken inside.\n\nHad some cole slaw as a side and yet again, good, but nothing truly special.", "business_id": "_naNO-mZQjTav4iLf5TFmA", "stars": 3, "date": "2013-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 3}, "user_id": "igrgFZl9wDohSem0UyoP6A", "review_id": "uwVQIvoQbqEqnQgi-s9xaA", "text": "Cool place for lunch on campus... It's right next door to Za's, where I've going a bit too often, so I'm glad I finally gave it a try. They're specialty is gyros sandwiches (on pita bread): pick your meat (lamb or chicken), size (small, medium, large), and sides (get the combo which comes with fries and a drink). I tried the chicken, and it was good, although I wish the meat had been a little more grilled (it wasn't crispy at all). Their fries are great! They also have a few other things on the menu (regular sandwiches etc), and they're open late most nights. I'll be back for sure.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2008-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jFB4m2Na8fTIhc3TAYoeYw", "review_id": "NYOzkqo5DW82DpARjYQ1dA", "text": "Mmmm... gyro.  I know that Zorba's isn't authentic Greek food-- I go to Chicago for that, but for what it is, it's excellent.  The service is always very friendly and speedy, and they have a fairly large menu and is inexpensive.  They also have Killians on tap and a fairly large bottle selection.  Zorba's is probably my favorite green street eatery.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2009-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uB_SdM3xfIDjWsZlXhV5tA", "review_id": "S5i3P1vCJCEdfoeP3ooiCQ", "text": "I don't know if it's my love of Zorba's or my love of gyros that's compelling me to write this review. Either way, when I'm down at U of I, I try to stop here. Zorba's has spits of chicken and lamb, as well as sauces to complement them. I've been happy with both kinds of gyros. Now, I only wish there were a Zorba's in my college town.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2010-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MLeLne_YECGkZAiCdhh65w", "review_id": "6py4D3isSLS3txsvu9bv3Q", "text": "I am incredibly sad that I did not discover this place until my fourth semester at the University of Illinois. I made something of a ritual out of going there every Tuesday for their reduced vegee gyros and fries, and always left satisfied. They have incredibly fast service, the place is always clean, and I *love* all the sauce choices! The salad always came fresh and crisp with the dressing automatically on the side, which was great too. I think the world could definitely use more Zorba's locations..until then, I'll have to make sure to swing by every time I head back to the U-C.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2010-12-26", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "9LZXJu6RZ6UpIXYGSZWB7Q", "review_id": "7GQ4fVQAPqmJYmD1V_-B9Q", "text": "I am going to be the dissenting voice on this place, but I don't think it isn very good.  Everything it does, Niro's Gyros does both better and cheaper.  I honestly think Zorba's has kind of a privileged place due to nostalgia - it is an institution and one of the few places on Green Street that hasn't changed in the last decade (and beyond).\n\nSo maybe I am not the target audience.  But the thing is, I love gyros!  They're greasy enough that I don't get them too often, but I do love them.  This brings us to the main problem: Zorba's gyros are not very good.  I have been used to the gyros in my hometown (gigantic), the ones in Naperville (huge), and the ones from Niro's (also huge).  The ones at Zorba's are comparatively small.  This is not a deal-breaker - I don't need the mountains of meat all the time.  The problem is that the meat is not very good.  It has kind of a gritty texture and an off flavor.  It reminds me of the frozen gyro meat you can get at grocery stores.  They offer an array of sauces, but the tzatziki is key and it's not very good either.  \n\nI see rave reviews of the fries, and while they are good, they aren't exceptional.  Even on a discount day, the fry and gyro meal is more than other places in town and I just did not like it as much.  I thought the first time might've been an unfair representation, but on the next visit I could not finish the gyro - the texture of the meat got to me.  \n\nDecor is old-fashioned as fits a local institution.  There is sort of a grease-haze that hangs in the air.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 2, "date": "2011-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BQ-2i_EZ3EzYjuUrZkq4fQ", "review_id": "Vzx1S-_NczcpDhN567RlBg", "text": "One of the regular spots on Green street, every time I make the painful decision not to eat at Antonio's and instead eat here, I'm a little surprised as how much I like Zorba's. I see a review saying Niro's is better and cheaper - Zorba's isn't that expensive - but I've never been to Niro's, so I can't compare. I will say that Zorba's has great fries - crinkle cut. \n\nNot much else to say - it's standard gyro stuff, for a pretty reasonable price (huge portion, fries and drink for like $7), and it's definitely one of the few places on that first block of Green that hasn't changes in I think 35+ years.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 3, "date": "2011-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9i-36HhVvgCcjGA2xsCmCw", "review_id": "LGzmzgLWHyArP_neBE3DyA", "text": "I never was really bold enough to try gyros until I landed in Chambana and was told Zorbas was worth a go. I do like their classic gyro and the price is good and it always goes well with the crinkle fries. The location is great for students on campus but often you need to work around the busy lunch hour or wait until summer when all the undergrads are gone. Watching the sports on television or listening to jazz on Thursday is also a draw in case you decide to come alone for lunch/dinner.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 3, "date": "2011-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SKhnKL9P9-LrUWzsw9oYNA", "review_id": "8FGMTFVk3Nr4EhammdSMHg", "text": "Have only been there once but was a big fan of the gyros. Had an large original gyro with fries and was a pretty good deal for $7.50. Very tasty", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2012-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "pTtnH9Z7QByngCXpuQd22Q", "review_id": "moMUGfZ7Xaw4NYKpjYB2fg", "text": "My goto spot in Champaign. Great gyros, awesome Jerusalem salad! I'm so happy they re-opened after the fire. I've been a customer for 30 years", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2013-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FE8MaLc2qM7sZvXvoRsSnA", "review_id": "g2NcPedZiMulo3f17og4_A", "text": "I have been here multiple times and it is truly the best place for food on Green Street. I have gone with the gyros both times and have not been disappointed. The food is delicious and the prices are very reasonable. On top of it, the atmosphere gives you a feel to what our culture at U of I is like. Pass up the chains and go to Zorba's. Take it from an ILLINI - you won't be disappointed.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2013-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WGK7ejWVp4omzygiMzqbHA", "review_id": "8QegRBcGP1wICYNXxc0aOw", "text": "Zorbas is amazing and an important part of my UIUC experience! After a hard work out and swim at the ARC, there's nothing like a zorbas's gyro and their iced tea. Will be missed greatly once I graduate!", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2013-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qR6jQSCWN94STCjsnTU8vQ", "review_id": "BsAxHBooHKE-8pjX8fNXsA", "text": "It's pretty good. Nothing too special; I normally get the grilled chicken sandwich, which has been dry a few too many times for my taste. It's also a bit expensive compared to some of the other Campustown locations, but a nice change of pace every once in a while. I'm never unhappy at Zorba's. \n\nI will say that I wish the place hadn't caught fire- the memorabilia collection they have is nice, and I would have loved to see the old one.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 3, "date": "2013-12-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "AttSWPB137v7Om8V1inovA", "review_id": "DT7-BU7ipdSlF6hsOF59vg", "text": "A Champaign Institution, great gyros, with even better service.  Definitely a can't miss when you are on Illinois' campus.  Check their daily specials before you go in some of them are great.  The fact that you can order a small, medium. or large gyro and customize it however you want make it good for any size appetite.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2014-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "IIRBF6_xbWYPbP_mjGI8RA", "review_id": "TSAInWApREu4Rv1sMPT23A", "text": "Not a bad lunch spot. Don't think the food is anything to write home about but will do in a pinch. Cool that they do jazz on some nights.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 3, "date": "2015-02-27", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "BX9K5JMU-NnjxJaNKxImpQ", "review_id": "Ttfgl0KneiUkpZEuYo94eA", "text": "I have been to the Matador for both lunch (it's short walk from the courthouse when you have jury duty) and at night when it becomes a latin club, all I can say is... \n\n*holds hand out and wiggles it in a 'so-so' motion*\n\nWith both the food and the club, it's nothing bad, but nothing to write home about.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 3, "date": "2008-01-25", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 5}, "user_id": "vF4B6eFdoDmyV_l7MLHMzw", "review_id": "eCuFfFfoWQRhBtmXWVX0NA", "text": "My family have been going to Matador since before my parents were born! LOL! it's the truth! It used be the smallest little hole in the wall and is now a great place to eat when downtown.\n\nIt can be a bee-yotch in a half to find a parking space on the street so I always head straight for the garage. When you enter the doors, it's a large place from another time.\n\nAnd this is so because this place hasn't been redecorated since before I was born! I admit it's not the chicist place, but then again, pretentious places suck! But if you go, I insist on a booth near the window! It's a great feeling, so just sit and relax in the indirect light and munch on the free chips and salsa (which is BEST when the two salsas are mixed together with a light dash of salt! I prefer two parts mild to one part hot!)  cuz well... it might be a while before your server will come to take ur order!\n\nThe service isn't the greatest and I don't recommend going when in a rush. I particularlly like the combination dinner. You can any three out of several items with rice & beans. My fav is two beef tacos, cheese enchilada w/ rice & beans. :) Sometimes when i'm the mood for something different, I get the Greek Gyro platter! it's AMAZING!! I've only had gyros in two places, so i'm no inficianado, but it's still good!! \n\nI'd go in the late afternoon and early evening when it's not so busy. Avoid the lunchtime rush. Mix ur salsas and enjoy!!", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 3, "date": "2008-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "MwJVSTsUB-htphNZaIC43g", "review_id": "h1KeHuMV0_qlVX66PmYakw", "text": "I went here awhile ago and have been meaning to write a review ever since. I went with my family when they were in town. \n\nI'm a sucker for a strong margarita and good guacamole and I was fairly unimpressed by both at the Matador. The ambiance was kinda nice. It had a weird feel for a Mexican restaurant, but I'm into variety so that was ok.\n\nBasically, it was average. Not spectacular. The fact that (I hear) it's a family place that's been around forever does definitely lend some cred to it (for me at least). But I would say it didn't wow me by any means.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 3, "date": "2008-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 3}, "user_id": "meuqHEjGCmrO3zDlr6OU7w", "review_id": "81Ibc-UbsUV83z4vusqhxA", "text": "I go here often for just one thing---The Menudo!  It is a Mexican version of Vietnamese Fau(sp?) Soup.  I get all the fixin's with it: red pepper flakes, oregano, lemon wedges, chopped onions, and cilantro!  \n\nMixed all together and spoon away!  They ask you if you want corn or four tortillas...I get the corn, which adds more flavor to the experience, then a bland flour tortilla will.  Menudo at this restaurant, is served all through the week, though typically at other Mexican food restaurants, it is served primarily on Saturday and Sunday...Not sure why?\nThe seating can hold large parties of up to thirty or more or a comfy couple....The setting is strangely old, and on Sundays there is a Mariachi band that comes around and woos you to another time and space in Mexicana Latin Style and flair!\nParking is a pain, so be ready to walk a distance from the parking garage.  Service is so-so....You have to sometimes hunt down the waiter for coke refills....", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 3, "date": "2008-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4mRx2noRJ1FFRPlzSVEEdQ", "review_id": "hqRx6z05mrlmUcWe6vb7Mg", "text": "This place has the weirdest fish tacos I've ever had... they were good.\n\nThe grilled cod was ground up and mixed with cilantro and green onions (kind of like taco meat). It was well spiced and pretty good.\n\nOther than that, the most remarkable thing about this place is how long it has survived downtown. It's fine in a pinch, but definitely not a destination.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 2, "date": "2008-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "7GC9fVWKa4a1ZmBGLH6Uww", "review_id": "aYYq2UkoiSKQRRFXV-PT3g", "text": "the bf and finally decided to brave the LR to go downtown...well to get out of the house. i tried recommending some places i liked along the rail to hit up for lunch, but he was set on trying something new for our \"journey of personal discovery\" as we had began referring to our LR adventure.\ngot off at jefferson/washington and central/first ave since there's plenty of lunch spots. right away i honed in on thai elephant, a place i wanted to try out, but since we were in that off between lunch and happy hour time downtown, it was closed for another hour. continued to meander til we found matador. $9 enchiladas isn't normally my take on mexican food, but the $10 pitcher of margaritas sold us.\nfor quite possibly the first time in my life, i was not in the mood for mexican food. i can't explain. fortunately this place has alternatives, but more than like the usual one burger on every mexican menu (i always wondered who goes to a mexican restaurant and orders a burger - damn, i was gonna be one of those people? i wasn't sure how i felt about this) but they also had like french dips, and tuna sandwiches and gyros?!?! i guess since it's downtown they're going for a \"catch-all\" crowd of lunchers. i braved the gyro - a risky move, but i banked on \"homemade cucumber dressing\" that came with it.\nshocking - it was delicious. the pita was toasty golden, with plenty of thinly sliced, bacon shaped pieces of gyro, along with onion, tomato, pickle (weird) and fries. the food came out literally two minutes after we ordered, so it was HOT and good. the BF got the colorado burrito (when he asked the server, who seemed out of sorts and older - maybe the manager called in to replace a no show?, she seemed confused by his calling it exactly as it appeared on the menu, then said \"oh, the burro.\" look lady, a burrito and a burro is the same goddamn thing, condensend me, man...)\nanyway, he ate the whole damn plate of enormous burrito and said it was good, but the \"chili\"-like filing she described he compared to dinty moore. ouch. well, my gyro from a mexican place was delicious, so we'll call it at wash at2.5 stars? was three, knocked a star because the margaritas had little to no tequila and was a waste of $10, got another half a star back bc that was seriously a delicious gyro sandwich.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 3, "date": "2009-01-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "wPOuPcb9CKjrC078m-LObQ", "review_id": "3oQnJ7jgVW2I-IVzqpLyqA", "text": "UPDATE:  The El Matador closed its doors in March 2012 http://www.azfamily.com/news/Matadors-Restarant-Closing-Down-144045526.html\n\nI remember the old rival El Matador / Nogales restaurants from the 70's (and much earlier) and lament the urban renewal that destroyed the best and cheapest mexican food in town.  They were neighboring, competitor businesses owned by branches of the same family.  They had separate entrances but you could go from one to another through a doorway toward the back.\n\nAlas, the Matador family-branch took the buyout money and rebuilt across the street from the also-rebuilt  Adams Hotel downtown.  It fancied up, raised the prices, and went all to hell.  The decor is nice and the music soundtrack is excellent. \n\nI only go there anymore on Sundays, from 10am to 1pm, for the free mariachi show.  It is a very good group, Mariachi Tierra del Sol, of seven or eight musicians (hence the extra star).  I get the overpriced, blah breakfast just to enjoy the tunes.  I must say that they serve a pretty good cocido, only on Sundays, that is not on the menu...ask for it.\n\nIf it were not for the, downtown-captive businessmen and conventioneers, this place would have closed long ago.  The mariachi bring in a crowd on Sundays, after church, especially around Mexican national holidays.  It is probably a nice place for drinking, the bar is quite attractive.  \n\nMaybe they have to keep prices up to stay open in the iffy downtown market and \"americanize\" the mexican food for the damyankee business visitors, transplants and snowbirds.   \n\nI suppose the Nogales Restaurant branch of the family just took the money and retired.\n\nWith the economy crash and the impact of SB1070 this is one of only three places left in the Valley with a regularly scheduled mariachi show.   Go on Sunday for the show", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 3, "date": "2010-02-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "caELu3OqZm8LkdikpmEB4w", "review_id": "cOke8cT6rIkHKo7rOCPN3w", "text": "I have been here for lunch and dinner. Nothing fantastic, but i always left full and satisfied. I enjoy the chips and salsa and the mexican food is ok. I've had better and worse. I haven't tried the greek food there (yeah wierd..greek and mexican on the same menu) but my buddy tried the gyro and enjoyed it. The service has always been good and the food is relatively inexpensive. Its also walking distance to any event in downtown Phoenix and they have a full bar so if you want drinks before a concert of game they got you covered.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 3, "date": "2010-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IgMhM28GtVdkg7qwM-auLQ", "review_id": "utI9J3am7E07WjBoYdVGrw", "text": "Tried this place for lunch, had the chicken burro and have to agree with the other reviewers. I wouldn't recommend Matador and am still baffled that it was packed at lunchtime.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 2, "date": "2010-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x_jctQMurasS5-4WdZcCVw", "review_id": "4wIvHZ2EVL3Q98FpqlHOyA", "text": "Service was slow. Waiter knew little about what they served. They didn't even offer sangria. My meat on my enchilada wad tough and flavorless. It's hard to do Mexican this bad, but they pulled it off.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 1, "date": "2010-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uET8BynASJOcUVMZuHQqOQ", "review_id": "zmuTYs0KXivbo9OhaHGChg", "text": "Service was not good, they forgot about us after our dinner was served. Chips tasted stale.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 1, "date": "2012-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jj1W2oVyet8ISMKzdhBHDg", "review_id": "Z9v5_RCkjOurQMQGMQuMDg", "text": "No Bueno on the green corn tamales and the service was terrible for lunch.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 2, "date": "2012-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "1cR5-LZcSYcACxhGe3DEVA", "review_id": "SosomHbzS4si_f4mIptMfQ", "text": "Good.....Bands playing on Frirst Friday...\nGreat Eclectic Decore....Looks like a old car shop...rumur it was a pet doctor place.......litte homes in back are really cool and going to be converted into shops....fREE WI FI!!! open late on the friday I was there....\n\nphotos on the walls are a nice touch too....\n\nBAD: had a blended drink with way too much Ice....and just not that good....\n\nso over all great little late night place great in every way but the drink.....", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2007-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 5}, "user_id": "oIVsVM8H273aoT1JUmsDIg", "review_id": "Mh64-1tUn6Q2IX9_317Ffg", "text": "Quirky and comfortable, the Paisley Violin is like a non-conformist's hideaway. An unassuming building in a slightly questionable but slowly emerging art district encloses a cafe/gallery/artists-haven that serves unique sandwiches with daily specials, a full-service coffee bar, free wifi and live music. The space is quite small, especially on nights when there are musicians performing, but that just adds to the intimate and welcoming atmosphere.  The staff is extremely nice, friendly and very accommodating, and the clientele are the same.  \n\nOn my first visit there I had the olive bowl (watch out for the olive pits!), the paprika turkey sandwich and their unique daily soup special-- chipotle salmon chowder.  The turkey sandwich was delicious and the soup was a bit spicy (duh, it had chipotle in it!) but very interesting, with flavors I've never experienced.  I ended the meal with a cafe mocha, and I must say what a way to end a meal.  This was the BEST mocha I've ever had (that is why I am giving this place 5 stars!!!) Overall, a delicious meal and a wonderful time enjoying some great indie and local musicians.  I'll definitely be going back again real soon!", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 5, "date": "2008-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "CAlxnkAuqNetlUmWtCQ_eQ", "review_id": "qgmIM59ysvt3Xe-uqHZtpw", "text": "I have been going to the Paisley Violin for years, since it was on Roosevelt. It has always been a neighborhood favorite.\nEverything is fresh, homemade and delicious. From the daily soups to the sandwiches, the coffee and espresso, you can't go wrong.\nThe service is always great, everyone is warm and wonderful.\nDon't be shy about the area, despite what you may think or hear, it is a nice neighborhood (I live blocks away) and things are changing fast. \nAnd it is always great to patronize a wonderful, independent neighborhood business.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2008-02-01", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "N7lSh49zQ13sG3Jpa9E6cw", "review_id": "okJb7V825hFAfpFlX3315w", "text": "Big scary Grand Avenue has the best kept secret ever- the Paisley Violin. \nI've been visiting the Paisley since it's days on Roosevelt street, and it's easily one of my favorite spots in the city. \n\nEverything about the place is just good- the people, the atmosphere, the food. The International Eggwiches- egg sandwiches on a bagel- are great for breakfast; any of them will hit the spot nicely. Lunch is always a tougher choice because there are just too many good things on the menu. I am particularly fond of the Hummus plate and the Paprika turkey sandwich, but most everything else has been amazing as well. (I'd stay away from the Champs d'Elysses sandwich though, it's much too heavy on the brie) The daily iced tea is always unusual but usually good, and the soup of the day is never subpar. The last time I was there, the not-so-traditional potato soup was heavenly. \n\nThe coffee and espresso are great, although I can't say too much about the frou frou drinks because I don't drink them. I imagine they'd be great too, with as good as the coffee is. \n\nGo...eat...you won't regret it...and on your way out, pay a visit to the Paisley pigs in the back. That's right, there are two little pigs residing at the Paisley, and they're pretty cute- for pigs.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 5, "date": "2008-02-01", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 4}, "user_id": "PMNbT3Y8KDt7E979AJMyng", "review_id": "XNQGFkEvhCRDAfwiVUXa6g", "text": "Paisley......love paisley prints.! Can't tell u how many neck ties I have with a kool ass paisely print.  This also happens to be a kool ass coffee shop with a kool ass name....in a world of corporate coffee beans and corporate starbucks coffee joints on every other corner....this kool ass PAISELY VIOLIN coffee shop is a great place to kick back, listen to music, grab a sandwich , and YES, sip a latte.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2008-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "AnH84g9V10x41CXmCvcaFg", "review_id": "Vk6pDAtzUYFGBXAmX7v8KQ", "text": "I'll write more later... at this moment, I just want to add that Paisley Violin also has FREE WIFI in addition to all the other wonderful things that other reviewers have said.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 5, "date": "2008-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 3}, "user_id": "jqVeTSin5GeRm0ceSg-PBA", "review_id": "0os6OwuDRanjLUGaZyC3dg", "text": "Paisley Violin has been on my list of places to try for lunch for awhile and finally I made it there last week with some co-workers. Like many places in Phoenix, it is small with limited parking. However, there is ample street parking and from the looks of it, tables and chairs on a patio which my group would have been fine with had it not been a yucky day out. As soon as we walked in, I knew I was going to love Paisley Violin. The exposed brick walls, the random pieces for sale, a small bar, and posters for live music and movie nights all give Paisley Violin a cute atmosphere and vibe.\n\nWe had the pesto brie as an appetizer and I was shocked to learn that one of my dining companions had never had such a combination before! The bread had seasoning on it which gave the cheese and pesto a nice kick when all three combined in your mouth. The portion size was perfect for the four of us to share and left us plenty of room for our lunch. As my main meal, I had the Mediterranean eggwich which was tasty; however the only disappointing factor was that I had asked for no red onions and when my sandwich came out, it had red onions on it. Two of my other dining companions both had the BLT with a side of potato salad and they both were raving over the sandwich and potato salad when we left. As one of my coworkers said, the chipotle mayo took what would have been an ordinary BLT to another level. Drinks are served in plastic cups and remind me of the glasses my parents would have bought when we were kids. It was quirky and an interesting touch. If you order a soda, it comes out in an old fashioned bottle, so there are no free refills. That is fine with me because it actually limits how much I drink!\n\nOur bill was approximately $10-12 per person (before tip) which is pretty much on par with most places we frequent for lunch. Future trips to Paisley Violin are definitely in store!", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2008-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "5G-6WKQ7VHcLsvRt6kqKvQ", "review_id": "juyhrJ27zpf7knaBRwsz6Q", "text": "Been to the Paisley a couple times now and really enjoy the atmosphere and food. They have a large beer and wine selection, and their food items are all unique. If you're a vegetarian, a good portion of the menu is devoted to delivering compatible foods. Some nights they have live music or DJs. Both times I have gone I dined inside, but there appears to be a large outdoor patio that looks perfect to chill on some spring or fall afternoon.\n\nIt is always encouraging to see businesses like the Paisley operate in the downtown Phoenix area. I will continue to support the Paisley and highly recommend it to others looking for some uniqueness in Phoenix.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2008-12-24", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "1RJORk4w9jxxWBKzOvOptw", "review_id": "xQtvW7xq5NGJoqwDxVwWMA", "text": "Atmosphere good.  Food...not so much.  I recently ate here for the first time and, unfortunately, I can't say anything good about the food.  I ordered a chicken shwarma sandwich and expected a hot middle eastern sandwich filled with flavorful chicken sauteed with onions and spices and accompanied with crisp fresh veggies.  What I got was FAR from what I expected.  The pita bread was your typical crappy faux Wendy's style doughy flat bread 'pita', not a regular pita pocket.  Inside was some flavorless, cold, unseasoned chicken (and when I say flavorless I mean indistinguisable from a mouthful of cardboard).  They didn't even bother to put basic salt and pepper on this sorry meat.  The remainder of the sandwich consisted of raw zuchinni (WTF?!), chopped tomatoes, 3 leaves of romaine lettuce, and some bits of red onion.  None of the veggies had been dressed or seasoned.  Oh, there was also some hummus/tahini 'sauce' mixed in there (presumably for flavor), but I have never tasted anything so flavorless.  I imagine that wall spackle has more flavor and pizazz than this 'sauce'.  Come on Paisley, does your cook even TASTE what comes out of the kitchen?  Add some flavor to your food.  You could start with salt, fresh lemon juice, garlic, pepper, and high quality olive oil.  It's really not that hard.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 2, "date": "2009-01-03", "type": "review"}
{"votes": {"funny": 1, "useful": 8, "cool": 5}, "user_id": "f_YFU2h9rM0ZPrPJD6eCsg", "review_id": "jZwji1twRDXcQFWIa8emPA", "text": "I know a lot of my friends really like this place, but I just can't get over the bad service and the food really isn't that great. It's really close to my house, so I go a lot to hang out and listen to the music that they have come through. Seriously though, I have stopped eating there because I realized after the 4th time that I have had \"digestive issues\" EVERY time I eat there. No joke. \n\nWhen I did eat there, the food really wasn't that great. Usually a bite or two is good, then it just gets really gross. I've tried about every side item that they offer with there entree's and they are all pretty gross to me as well. The potato salad was the only thing that I actually thought was okay. And one time I went there and she listed off my choices for sides, I said \"chips\" her: \"oh, we're actually out of chips\" me: \"soup\" her: \"we're out of that too now\" me: \"so really, what are my actual choices?\" her: \"salad\". \n\nSorry to all my friends who like it, but it's really not that great. I think people come in and are charmed by the homey, inner-city art dive feel it has.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 2, "date": "2009-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HP_xZYNC5XK-VyNrnHbtRQ", "review_id": "l-KMsdBbUdam52ancUBFKg", "text": "I've only been here a few times to sit and grab a beer. I really enjoy the atmosphere of the place and the outside area is great when the weather is nice.\n\nEach time I've been here it was a Friday night and the place is pretty much dead, which is too bad because this is a great spot to sit and hang with friends. \n\nI can't comment on the food as I haven't eaten here. The alcohol selection is a bit sparse, but the bottled beer they have is good. \n\nI'm not big on crowds and I like to be comfortable when I go out, so for me the Paisly Violin is a perfect place to meet up with friends and grab some drinks.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2009-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7-ly4LI9XWLXkFiM2vHxrw", "review_id": "_XhNXVgxpVEu1qV6e1VPHw", "text": "Mediocre food the night we went, but it was busy and late so I didn't mind terribly.  Wine was tasty and reasonably priced, and the place had a fun atmosphere rolling.  There was a fire pit and band out back, and house-y tunes inside after the band shut down.  Cute atmosphere--a comfy little shack on Grand with moderately high ceilings and a neat looking bar.\n\nThe staff was great and posssibly psychic--they comped one of my glasses of wine in apology for the so-so food that night.  Near closing time, everyone got out on the dance floor and shook it a lil... a fun crowd and a few tunes I'd never heard before.  Probably a ton of fun there if/when they have a good DJ.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 3, "date": "2009-02-03", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "EXBOkXWPNYZk5HFBg5NbTQ", "review_id": "fGr2XJZ-k2EejuAG0MLQxQ", "text": "I ate here a few times when I was working on the phoenix fringe festival earlier this year, and it was always delicious, but I went in one day for lunch, asked if I could place a to-go order, and the response I got was: \"sure, but my cook isn't here, I'll have to call her. it'll be about 20-30 minutes.\"\n\num, what?", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 3, "date": "2009-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Mni9JweXitsJ2Wlw7jy25g", "review_id": "r7NtsuayoHuueoET9TcMbQ", "text": "Thank you Laurel L. for turning me on to the Paisley! This place is definitely not a place that you would find just by walking or driving by. It looks like it's closed when you see it from the street. Once you're inside, everything changes. The decor is great and the food is even better. I had the lamb gyro and green salad. The gyro was as good or better than I've had anywhere else and the salad was very good. I read some other reviews about the service being slow, but I did not experience that at all.\nThe inside portion of the Paisley is hard to describe. I guess ecclectic is the most fitting description. Brick wall, varying art, rot iron chairs, a very small stage (seemingly for someone playing a guitar) etc.\nCheck it out. You won't be disappointed.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2010-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7F-DVLnGmC5hHPUVfSfxDw", "review_id": "YAeRgBRmknOU3767H26E0Q", "text": "I've been a fan and lover of the Paisley Violin for almost 4 years. Love this charming little place nestled on Grand Ave. It's out of the way but yet it has a downtown feel. Gina, owner and cook, makes the best hummus in town. I had one of the best Hummus pizza specials ever prepared by Gina. Since then, every time I return to PV, Gina always makes a special pizza filled with the ingredients that I love. Best cafe mochas in town! If ever I do take in First Friday, this is usually our last stop of that night. It's perfect for gatherings with friends. Check out their websites for daily specials.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2010-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Wp0fK5noASGF1-6PnKVMLA", "review_id": "OEBsmWfadMvDmPvSE1zPiQ", "text": "I went to the Paisley Violin sometime last week. Walking in we were greeted by terrible music. I mean there are tons of great Jazz musicians in AZ and some how they have found the worst. The server was an older gentleman who was nice. We ordered the sampler app that they have to start 2 min later the server tells us that they are out of pita bread. For entrees I ordered the Lamb which comes on a pita but i opted to get it on a croissant which he suggested they had. 2 min later he says they are out of that to. My friend ordered the Lox 2 min later he says they are out of that as well. So she takes his suggestion in ordering a cuban sandwich which you wont belive 2 min later he comes out and says they dont have all the ingredients for that either. This happened about two more times until we ordered what had seemed to be the only 2 things on the menu. Its called an 86 board, servers write down what you don't have or in your case what u do have, which is less. The server must have been embarrassed I would have been. Once we got our food, it was mediocre at best, cold and not fresh looking. I will never go here again, which is disappointing such a great space and no potential when it comes to the food.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 1, "date": "2010-12-19", "type": "review"}
{"votes": {"funny": 4, "useful": 6, "cool": 3}, "user_id": "33vUIil_GCaT92aUaZhRXA", "review_id": "KN5PElUDh4oD_MQ7ypOItw", "text": "I came here for lunch yesterday with my mama. This place is tiny but it definitely has character. There were 2 people sitting outside & 3 people inside, so they weren't exactly busy. We sat close to the bar & listened to a couple guys playing guitars & a woman sang a couple songs. My mom put $5 in their tip jar & one of the guys came over to give us a flyer & chat, he was so sweet. For our meals: mama ordered the panini italiano & I ordered the pesto chicken sandwich, for sides she chose the house salad & I chose the potato salad. Mom enjoyed her meal, as did I, but I had to salt the potato salad & even that didn't help-it was pretty blah. I took half of mine & half of my mama's sandwich home for hubby, he liked both but said mom's was better. Total for both meals including drinks was $22. One thing that was a lil annoying was how slow the service was. Our server was very nice but it took 30 minutes just to get our food, which seemed way too long for a place that only had 7 customers total. It was pretty good food though, so I'd probably return.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 3, "date": "2011-01-27", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "DJIwm4UCnM-SOxXbARjPsQ", "review_id": "MSLKYSRl1DGedknacnqhCw", "text": "I like Zoe's Kitchen. I even tried to put the umlaut above the O in \"Zoe\" but alas, I lack that sort of NASA-grade training. \n\nAn assortment of sandwiches, sides and salads are on hand for the taking. Well, you can't just take them... you have to pay, of course. I don't want to be blamed when a rash of sandwich robberies breaks out along the McDowell corridor... but I've gotten off on a tangent again.\n\nI've only ever tried the Gruben. I think I need an umlaut there too. No? We're good? Good. Like a Reuben but with fresh cabbage and turkey. Much healthier, and with a tangy kick. A good quick place to grab a sandwich during your lunch break.\n\nZoe's sides are available by the pound (chicken, potato, pasta, tuna and egg salads). They will cater your next event and if you've ever seen those Honda Elements running around Phoenix with Zoe's name plastered along the sides, you know that they deliver. Or maybe you're under the impression that those cars are actually mobile kitchens. Well, that's just silly.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2007-01-26", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "9N7Ok6AGYpjedcmNW7mQ0Q", "review_id": "JKoFjAR0SVWRnEvZAvBljg", "text": "So I have this terrible addiction. Every time I go anywhere near downtown, I have to go to Zoe's. \nI LOVE their limeade and have often wished I could just order the whole pitcher and leave the place with it. \nI'm a big fan of the chicken pita with loads of Feta, caramelized onions and chicken. \nI know I should probably branch out and try something new, but nothing beats the limeade and chicken pita with pasta salad. \nOh, and don't even get me started on the chocolate cake!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 5, "date": "2008-02-15", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "YwISM44nNmOSeXdsL-qZYw", "review_id": "Hx5cfbFcJ9tw1DFTbGmf3w", "text": "I like Zoes. However, my GF does not. so I am only able to go when she is out of town. I understand this place is not for all. Dry chicken seems to be a big issue, as my girl has also complained about it. But I could eat a bucket of the slaw, with an IV of limeade, and a bed of chocolate cake to recline on.....oh yeah....wait. sorry...\nAnyhow, I always get the protein plate or the kabobs.\nBeen a tad dry once, but I doused with dresing on table, and it was yum. Rice is good, the aforementioned cake and limeade. Really no desire to try anything else. With this place, I like what I like, and it will do.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2008-02-15", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "fev0iI-XDrteD4SYRKjiUw", "review_id": "ze7gW0EHERAGDdRmCLpLEA", "text": "Zoe's is probably not a place to go if you are a Vegan. Actually, it's probably not a place to go if you are a T-rex either. When it comes down to it, this chain is no better than Chik-fil-a in what it offers. At least with Chik-Fil-A I get my food quickly and a nice side of cross-cut fries.\n\nZoe's Kitchen sits across the street from My Florist which, when you really think about it, was a dumb move on corporate's part. Both look to provide healthy food options in a market of fast food and grease. The problem is that, despite My Florist's problems, it is local, more diverse, and doesn't make you feel like you are eating in an Ikea showroom.\n\nThe food is just bad. My chicken sandwich was dry. Drier than the Mohave dry. I'm trying not to dive into other forms of hyperbole but this chicken was born and raised inside a Popiel Food Dehydrator. The least they could do would be to provide me with some mayo to fix things up a bit.\n\nThere's another one of these over on Camelback, it may or may not be better, but as far as our downtown one goes, this place will never see me or my money again.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 1, "date": "2008-12-15", "type": "review"}
{"votes": {"funny": 5, "useful": 5, "cool": 2}, "user_id": "5mnhUiRWi-q6nX7TkicE2A", "review_id": "ts_AFOdE6cMr9I8DnzqrxA", "text": "I don't know how this place stays in business. The menu is so limited. Would you like chicken or chicken? Chicken in a pita? Chicken on some lettuce? Chicken rolled in a tortilla? And the pita chips are bland! Yuck! And  the potato salad has something in it that is way too tangy. I've only been twice and tried different dishes both times but I just don't get anything greek about this place.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 2, "date": "2008-12-23", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "f_YFU2h9rM0ZPrPJD6eCsg", "review_id": "4H2yGsu2enakkAIJ-D3t1A", "text": "I like the idea of Zoes, but they just don't really execute it properly. Everything is pretty bland, and I think their only flavor profile is Feta cheese. Don't get me wrong, I like Feta...but on everything? I've been there 3 times, always hoping for the best, but I always end up having to load everything with salt and pepper to even taste it. It's overpriced for just getting a simple sandwich on store bought bread with a bag of potato chips.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 2, "date": "2009-01-11", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "bDPFpoB-Uaf_nPBS5tF6Jg", "review_id": "2gDeSz2UaO5dnlN0fQ5IsQ", "text": "A frequent spot for lunch when I worked around 7 Ave and McDowell. My favorite is the chicken pita #2 which is a pita jammed with chicken breasts, feta, grilled onions and fresh veggies. Sure there are sandwiches and salads but I can make those at home. Let there be meat!\n\nTips:\nChoose fruit or pasta.\nAsk very politely for pita chips instead.\nIf you are retarded and can't build a sandwich, try Sack's.\nPlace cake into mouth, not onto face.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2009-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "g2mozOU_F1nzpjLDY4CfzQ", "review_id": "rn_vwTsRsWgNmIUmu5hfGQ", "text": "Sure, their branding is nice. It has that feel of something hip and youthful, which helps for a chain that tries to pass itself off as a local. Pretty colors and shiny things however don't impress my palate.\n\nI can't explain how much I detest food from Zoe's. Fresh vegetables, grilled meats -- it should be a slam dunk. Instead, their food is BLAND. It is the inverse of food, it is anti-food, annihilating the satisfaction of eating with every bite.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 1, "date": "2009-02-08", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 2}, "user_id": "jqVeTSin5GeRm0ceSg-PBA", "review_id": "xVdeGs0lSP2TWb3rtuSEuQ", "text": "I am in love...with Zoe's grilled feta sandwich. Everytime my co-workers and I go for lunch, I always tell myself I am going to try something else on the menu...and then I don't because I don't want to cheat on the grilled feta. My sandwich is always toasted perfectly and the tomato on the sandwich helps tone down the feta just a touch. The pasta salad is my favorite of the sides to get. I tried the potato salad once and was not wowed by it at all. For almost $9 which buys a drink, sandwich, side and chips, I always leave contently full.\n\nAs a warning, if you don't like feta cheese, this may not be the place for you. About 99% of the items on the menu contain it.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2009-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZsqSDOeYGb-DinY6x3-YgQ", "review_id": "WxKGeuuHPoCOVPJqBCLPIw", "text": "Went to lunch with a colleague. Looking for something relatively healthy and not too heavy. Was very satisfied with my meal of 2 chicken kabobs, rice and side salad accompanied with a couple of pieces of pita . Very simple, fresh tasting meal. The tables are stocked with a bottle of what appears to be their homemade vinaigrette dressing, also very tasty. I will be back.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2009-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QzA6ZW1NFid32_g_fsapIg", "review_id": "mrQ2HUaYLzarMPvHyWm0qg", "text": "LOVE this place! I meet my husband here for lunch as often as I can. It is a bit pricey for being a fast food place but the food is so good. I always get the pita pizza and the pasta salad. Excellent place to eat. The decor is funky but the staff is usually really nice and again, the food is great!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2010-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BGzYj1GQ1gwIhd5cYIfU8A", "review_id": "_i02sLIathtaW-rfsi9udw", "text": "We pulled over to grab lunch here this weekend based solely on the appearance... It looked like it would be great!\nTheir menu didn't seem that unique, but the girl who took our order was extremely friendly and offered some advice on her favorites, which included a pita and for both of us to get sides of the pasta salad. For 2 people to have lunch, I though $19 was a little steep, but we tried to stay optimistic as we found a place to sit. The environment was great- roomy, clean, bright, colorful. When our food was brought to us, my pita already was torn all the way down, so there was no way I was going to be able to manuever eating it with my hands. I probably should have said something, but instead just went up and asked for a fork and a knife. \nFlavors were good, nothing special. Chicken was dry, and the pasta salad was nothing I would write home about. \nWe left full, somewhat pleased, but could have had the same experience for half the price.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 2, "date": "2010-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vhxFLqRok6r-D_aQz0s-JQ", "review_id": "fqY1EvmljZdpLXhaGqOLUw", "text": "The food isn't great.  I really only like the chocolate cake which is strangely sweet but does not have much chocolate flavor.  (Still I'm strangely addicted to it).  The food is rather bland, the main flavoring ingredient seems to be salt and oregano and that's about it.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 2, "date": "2010-12-26", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "33vUIil_GCaT92aUaZhRXA", "review_id": "ZSQTjhY7_YdmfPgurz9hsw", "text": "Came here for the 1st time today with my dad for lunch. The entrance door is huge! It's a bright & modern space, I dug it. The chairs weren't the comfiest, but eh whatever most modern furniture isn't. Any way, my dad got a cup of the chicken + orzo soup & I got the chicken roll-ups that came with chips & I chose the pasta salad for my side. Dad said his soup was pretty good & ate 1 of my roll-ups, said it was pretty good but kinda bland in flavor. I thought the roll-ups were pretty good too & agree that they needed a lil extra somethin. I didn't eat the chips but the pasta salad was very yummy. For both meals & 2 drinks, I think it was less than $20. I'd probably come back again for lunch if I was trying to eat on the lighter/healthy side.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2011-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "N-0qJ-03xPg2t5lYu0z6BQ", "review_id": "Q-3jVoDgkYVrD6tlmNimZw", "text": "Anytime I can get out of the office to get lunch, I go to Zoe's.  Great array of fresh and mostly healthy meals.  LOVE the chicken salad and the (not so healthy) chocolate cake.  Staff are friendly, service is quick, food is consistent which is the best recipe for an successful work lunch.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2011-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "7W4egS-WyR0hRHMfQtPEOQ", "review_id": "0i054yWQmMUb27B5tSSYmw", "text": "After several negative experiences, I was given several free lunch passes to Zoes, so I figured, what the hey? Might as well enjoy a free meal and see if there have been improvements made. I called and placed a to-go order, which was the same item I always get, the tuna salad sampler. When you call Zoes, they have your phone number in their computer, which tells the person answering what you typically order. So I go into the restaurant, impressed by the new look of Zoes. The floors and tables were clean (Awesome!) and they have new furniture, which has created a warmer feeling in the dining room. The girl who took my order and cashed me out was pleasant and very excited about my free lunch coupon. She was endearing. I left the restaurant with a smile on my face! I get back to work and open the box and...it was the wrong menu item. SNAP. I was so excited. I call back and let them know I was returning to get the correct menu item. When I returned to Zoes, the women who I believe to be the manager, barely grunted at me while handing me my food. No sorry, no please excuse the inconvenience, no nothing. So, A-OK.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2013-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tMkKUGwABdGWKwnLXaCYUg", "review_id": "_YKEyGQNH8APn3a5USCrsw", "text": "I would like one of these in NY please!\n\nUp until the day I came here I had never had a pimento cheese sandwich before. Let alone a grilled pimento cheese sandwich. So, you must excuse my inability to comment on this pimento cheese sandwich in relation to others. But,  holy fscking god, was this food good!\n\nSo good I came back the next day to get spinach rolls. Which were like spinach pie but in a crispy tortilla style roll served with some tomato based salsa. T'was fabulous!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 5, "date": "2013-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kk05snSafuIFK0lsxoMNzA", "review_id": "amEtOT4JuHnY164Ru26wHA", "text": "I have this catered at work often.  Always fresh and delicious.  I especially enjoy the chicken kabob platter with brown rice and fresh salad with Pita.  Very consistent in taste and quality.   I always wonder why this location is not busier.  It is certainly a well kept secret.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 5, "date": "2013-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ryQi6BqqWb9qqVTAXpRbIw", "review_id": "1IIZFbkneveZFhANFcyQPw", "text": "I enjoy the chicken salad - very good!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2013-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "sMZ-Rlmp_gHU5a3mN30Tog", "review_id": "MZaSs5twId0sndjVTe2Gxg", "text": "Overpriced for what you get.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 2, "date": "2014-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GaEgffsHIfYkO621i0MMDQ", "review_id": "Jif7tDTPrme-G3BdDHVgHg", "text": "Went here for dinner last night for the first time. The desserts and packaged foods looked DELICIOUS. \n\nI am picky about meat (like I don't like biting into tendons and things I don't want to eat) so the chicken kabobs were a little iffy (I bit into things I didn't want to eat), but they were seasoned well. \n\nThe rest of the food was very fresh. The greek salad that I got as a side was great!! A ton of feta cheese on mine, really clean lettuce. The side of rice was great, too. \n\nI am gluten-free, so I had to pass on the pita bread, but that looked really good, too. \n\nThe food was a little simple for my taste, but not bad. I'm not sure if I would go back, just because of my food preferences, but others may love it. \n\nThey serve you on disposable plates and cups with plastic silverware, so it's a very simple restaurant. \n\nAnother person in my party got a chicken pita, but it looked like it was only a half pita stuffed with chicken. I personally would have wanted two halves, but I guess I eat a lot...\n\nWorth a try once if you like fresh food, pitas, veggies and kabobs. It's a good place to stop in to try something quick and new.\n\nOverall, good, but I prefer the restaurants around the area though- there is a Habit Burger, Five Guys, etc that I would prefer.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2014-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "adpJKMursiVi5vw05LjXrA", "review_id": "LWP4BE8N3etnjuWJT0HNRw", "text": "Was driving thru town looking for a hole in the wall, but instead found this Mediterranean cuisine. I was tempted to keep driving, but figured screw it, let's try it out. \n\nFirst impression - very commercial. Opposite of what I was looking for. Kind of depreciated my experience, since I prefer ma and pa types. Very clean and geometric, yet almost uncomfortable. Prices are average, and so is the food. Although, the people were friendly and quickly got my order to me. \n\nProbably won't come back :(", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2014-12-10", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "_p9EnnLQg6KDlIRU2fYEJA", "review_id": "iV4vfY0j1K1JUfeQxFh7Ag", "text": "At McDowell, near 7th Avenue, we always like to get their Greek Salad with Grilled Chicken added. It's pretty hearty & we love their Greek Salad Dressing....yummy!  ....Kinda don't like sitting on their hard plastic chairs though.  :(", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2014-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y1PelgD3NvDHNoFuSM4aMA", "review_id": "4ouxLc7iu8v5NektVAYMVg", "text": "The food is always good and I Dont feel like I am ever eating bad here. Its always clean and the staff is friendly.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2015-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9JlDd_uNpKQwT9JI4Bikdw", "review_id": "3NXyAFQSEhJgigHMb3ePfw", "text": "Had the best first experience here. I decided to try Zoe's Kitchen out for my first time and ordered the Chicken Pita Pizza. I informed the cashier that I had never been here and she certainly was friendly and welcoming. In fact, the entire staff were just was warm. My pita pizza was pretty darn good, and upon giving me my to-go order I was handed a complementary cookie for the wait. Which that too was absolutely delicious. They are good people over at this location. I will be returning next time I am back on this end of town!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 5, "date": "2015-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DP-ZeMS81oTQBPHeKkhw1A", "review_id": "BoGZ_h_bGKVp8UlYqWdang", "text": "This a great spot.  Get here before the lunch rush or after.  If not parking is a disaster.  The chicken pita pizza is amazing.  It comes with a salad and it is a great deal.  It's my favorite here.  I cannot give it 5 stars due to the debacle that is the parking situation.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2015-02-26", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "DJIwm4UCnM-SOxXbARjPsQ", "review_id": "TF-uBhhNsw3AFtJfx9uVRg", "text": "#2 in an ongoing series of restaurants I frequent without actually setting foot in them.*\n\nAthenian Express is a staple for sustenance where I work. They are just down the street, they're good and they're fast at delivering. I've sampled many of their menu items in the past, but once I discovered their fresh chicken salad served on a freshly made pita, I was hooked. I don't even need the menu anymore. Before I became a chicken salad fanatic, I had tried their gyros and hamburgers. Fan of Feta? This is your place. I ordered the Feta Burger once... once. The patty was obviously from a frozen pack of processed burgers that one could easily buy at Costco, but that's not a major gripe. I just like fresh beef if I am ordering a burger from a restaurant. \n\nThe spanakopita is great, but it's rich. The tiropita is tasty as well, but without the addition of spinach it's a bit too rich. For a \"Greek\" restaurant, there is a varied selection of food. Reubens and patty melts, french fries and fresh fruit. Of course, a staple of any great Greek place; baklava. My colleagues and I ordered so much food from Athenian Express over the last year that they recently gave us an entire tray of baklava as a thank you and an invite to their employee Christmas party. I'd say that's a testament to how much we like Athenian Express.\n\n\n\n\n*I totally just said \"#2\".", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2007-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "4dnDsoHuxUtzhaumxbpR5w", "review_id": "cRHdx0CZ0Yd_YhAUbuPrFQ", "text": "This is one of my all-time favorite places to grab a quick (and casual) bite downtown. The service is consistently excellent, and the owners are extremely friendly. They are flexible with their menu, too - they do their best to get you exactly what you want. \n\nI recommend the stuffed avocado salad. It's a special, and boy is it amazing. The fruit here is also superb - always so fresh! My friends and I swear they have someone designated to just cut fruit all day, it's so fresh. The hummus is the best hummus in town. Get it with extra veggies!\n\nThe only downfall Athenian has is it's hours. Monday thru Friday til 5, closed on the weekends. No fun for those of us who live in the area. But other than the short hours, this is one of my favorite places in the area - I would recommend it to anyone.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 5, "date": "2008-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 5}, "user_id": "oIVsVM8H273aoT1JUmsDIg", "review_id": "6TVpJEQ-CzfdX0z1HpMD8Q", "text": "I just learned that they are now open on Saturday's. YEAH! My Mom and I stopped there for lunch today (Saturday), and it was empty. As we ate, a few more people stopped in. I don't think everyone knows they are open on Saturday's yet, but hopefully the business will pick up. \n\nI discovered this place thanks to some friends at work. Since my first visit, I've never been disappointed. I always order the Chicken Picado Pita and it is always so delicious! Just the right chicken to pepper and onion ratio. The pitas are fresh, the tzatziki sauce superb and their french fries are magnificent -- crispy outside and melt-in-your-mouth buttery inside. Although I've yet to venture outside my own menu choices, they have plenty of items to choose from and I'm sure just as delicious.\n\nThe staff is friendly and accommodating. The parking is limited if you get there on a busy day, but otherwise it isn't too hard to find a spot. Like others have mentioned, it is right on the light-rail route so the location is great too.  They even have a small patio out front where you can enjoy your food and the Phoenix weather (when permitting). \n\nIf you are out and about in the downtown area during the week or Saturday, definitely give Athenian Express a try. It is one of those affordable, quality food gems that you shouldn't miss out on.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 5, "date": "2009-02-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SAPt3B0CXxM2MxkApnbWyQ", "review_id": "AI8FVLgPHa5Iktq5Fk3zKw", "text": "You can tell when you're about to have a good meal when the place is jamming right around lunch time. I haven't gotten any thing other than their pita sandwhiches, but judging by how delicious they are I don't doubt that everything else is as good. I love that they have a great selection of hot sauce. You walk out fully satisfied and mentally ready to comeback soon. I don't give it 5 stars because it's not flawless. i.e. their iced tea tastes like water... So go with the soda Instead and you're good. Oh and the lady that runs the place is just lovely.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2009-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gcyEUr4DXcbjnGRAWFtfAQ", "review_id": "iNOZ7aKKrJRaCiMjxnTETw", "text": "Glad to have found a dope local spot for a Gyro. I finally checked this spot out for lunch and am happy as a clam. Caled in my order and was ready in about 10 minute. I got the gyro pita with feta, onions and tomato. It comes with a side, so I went with fries. Next time, I think I'll try the salad or potato salad. The Gyro was perfect. Great grilled pita, super good Tzatziki (sp?) and just the right amount of flavorful gyro meat/veggies. The fries were bland and soggy, but that didn't bother me that much. I saw a ton of other stuff on the menu that I can't wait to try. Can't wait to go back.\n\n***Parking*** I found it super easy to park on the East side of Central on Garfield and pop a quarter in the meter to just walk across, that's probably the easiest way to handle it", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2011-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9IZ4Q_BdXwlVPAwf1EkZFA", "review_id": "Ntaj7ZCmzgf0N95Bwff_pA", "text": "My favorite lunch spot. Fresh food, amazing fruit, great fries and friendly service!", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 5, "date": "2012-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "ESrdXpT1yF7KZX52bPpnJg", "review_id": "U3UMqXxwYh0imnDpDb7Ojw", "text": "Athenian Express has a HUGE selection of things to chose from. They have salads, burgers, gyros, pasta, subs, and pitas! There are also LOTS of vegetarian items.\nTheir hummus is out of this world. They make it fresh every morning and it comes with a generous helping of their pita that they get flown in from chicago because it's some of the best pita in the country.\nI've had lots of different things on their menu and I liked each and every thing I've tried. Sometimes their fries are a little over cooked and under salted but whatever, I don't go there for the fries.\nThe gyros are great, so are their pitas. My favorite pita is the chicken picado. The chicken is always very juicy and fresh and the grilled vegetables are well cooked and pair well with the chicken.\nI know they're also doing breakfast now, which I have had once. I don't remember what I got because it was some years ago, but I remember leaving satisfied and full.\n\nI think for the price and quality, you just can't beat Athenian express. For a year, I worked right next door to them. I would stop in almost every day and get lunch and talk with the owner and his wife. They are very friendly and funny, as is their staff. I always felt welcomed. Even with phones ringing off the hook and lines out the door, they always have a smile on their faces.\nI stop in maybe once every 3 months or so and the only thing that's changed since I worked next to them is that they've renovated and made the place bigger. Some people might not like that, but they generate way too much business and they really needed the extra seating area.\n\nI love Athenian Express, and their employees. It's a hidden gem that I'm glad I found.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2012-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ZZFCchKyoC2hcSznw79rzA", "review_id": "IrC3pGhHlTAhOq6FvoJLmQ", "text": "Food is fresh and delicious. Atmosphere is comfortable and welcoming. I loved it.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 5, "date": "2012-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hkQmJujqYZW6wsxtpO_UZA", "review_id": "BbM5y38y-6Z_7JA-Mhw8SQ", "text": "A co-worker recommended the place. The food is inexpensive, bland and the restaurant has the decor of a double-wide. Never again, especially with all of the other great options on the area.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 1, "date": "2014-01-11", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Jsj_4S-Jee7gKanYIuMSBQ", "review_id": "CwcSwl5gx11WYHxQtG2rrg", "text": "Origin of GYRO: Modern Greek gyros turn, from Greek; from the rotation of the meat on a spit..... Not here, 3 pieces of pre-cut delivered frozed gyro meat with 6 thick slices of tomato on a super thick pita, the kind that would be well paired with a mountain of freshly shaved and grilled cone meat topped with a nice scoop of sauce.  Could not taste the meat over the bread and tomatoes, sauce was bland and boring.  They may have other, better items on the menu but when you call out for the ol' #1 at a Greek/Med. restaurant and it is a huge flop I will not be back to explore.  \n\n2 stars because the service was wonderful and I saw a salad that I wished I had ordered.....", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 2, "date": "2014-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zkrw1RTEQmofcEHc_9v2ag", "review_id": "JM7JpqBtb6afcPYDQBLYMQ", "text": "This place is great! Use to eat at it maybe 4 times a week! I use to work at the record store next door and me and the guys would always order breakfast & lunch. George, the owner was a great friendly guy always took care of us next door. It's a great family operated business with great service and delicious food.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 5, "date": "2014-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "rMkQzwPkMVUnDzsvLJ3h8g", "review_id": "FK_hp71tg1MiIH2aYHUYAg", "text": "This is another place we order food from and have it delivered to work.\nI am hooked on the Chef's Julienne Salad. Sliced ham, turkey, american & swiss cheese, boiled egg, peppers, onion, tomato & cucumbers on lettuce..........................................................................................................$7.35\nHow i order mine...No Peppers, Add Bacon and a Pickle spear.\nComes with pita bread and a cookie, both i cannot eat because of my Gluten Intolerance issue. \nWe order from Athenians Express a few times a month and generally speaking, i think that everyone is pretty happy with their orders. Salads are huge, but i manage to eat it all!\n\nI suggest getting some gluten free cookies :) \nI recommend Athenians Express! :)", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2015-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EVN484M7GZxhVpp61JgQBA", "review_id": "SCvmDmmlZG_nta-ulVTVcg", "text": "I'm giving up another local fave of mine here! \n\nThis place is a hoot!  It's a Mediterranean place owned by three Asian women.  Toni, Suki & Felice do a great job.  They bought the place from a Mediterranean family in 89 or 90 and have being doing it up ever since.\n\nNow, I don't know how authentic all of the dishes are, but they are super tasty!  The hummus is wonderful and creamy with the warm pita.  The lentil soup is delish, creamy and full of flavor.  I love the rosemary chicken & pasta dish too.  Greek salads are always fresh and crispy.  The chicken shushka is my absolute favorite -- shredded chicken cooked in a tomatoey broth over rice.  It's spicy and warm in your tummy!  I also always get a side of grilled veggies -- carrots and zucchini, I don't know how them make them taste so good.\n\nThe atmosphere is really casual, but the service is great.  If you're in here more than two or three times, the ladies will remember you.  Especially Suki -- she's the real character of the bunch.  Nothing fancy here -- paper napkins and no tablecloths.   It's almost like being at your crazy Asian auntie's house when she's having Mediterranean night.  \n\nThe wine list is just ok, so stick to Athenian beer and you'll be good to go.  Special orders are no problem and take out is easy too.\n\nParking can be a bit of a problem, as Med House is in the same strip mall at Richardson's and Dick's Hideaway.  Best bet is to park in the back and enter through the back door.", "business_id": "FltN1Hnw4n7BORXJH1kaeg", "stars": 4, "date": "2007-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "Dphi7UucZ8dJTVWAmFJlJg", "review_id": "fJWe58_0AiPPpQ_2U8YxaA", "text": "This happens occasionally, too. Heidi E. and I are friends, but sometimes friends don't agree. Maybe it's a matter of different tastes, or even different experiences, who knows, but I have a very different take on Med House.\n\nI've been eating at Mediterranean House regularly for the last 6 or 7 years. Started with a group of business friends for occasional lunches, then for dinners with my partner, and now it's a couple times a month for take out. (Have to say I prefer take-out for a few reasons: convenient, neighborhood spot; food travels well; only beer + wine when dining in.)\n\nI find the food here to generally be great - though not always consistent, have had one or two just so-so dinners. That said, when the kitchen is on, the food can be spectacular. We usually order the same few dishes - one of the chicken plates and the gyros platter. \n\nMy favorite chicken plate is the Olympic Chicken, which is grilled chicken breast with a really delicious black olive sauce. The Moroccan Chicken is also really good, and maybe a little healthier with it's herbed breasts, honey-yogurt sauce and side of carrots, apple and spinach (which is not cooked, just shredded, but surprisingly good.) If you want rich flavor, go for the Egyptian Chicken, which is pan-fried in parmesan cheese and herbs. If you want spicy, go for the Chicken Shushka, which is more stew-like, flavored with lots of paprika. \n\nThe Gyros platter is a standard favorite, though Med House does it a little different. No shredded lamb here - instead, you get 4 long pieces of juicy, tender meat. I think the quality is better this way, and it makes for a nice dinner presentation. Pita and house-made yogurt-cucumber sauce are still the perfect accompaniments, and If you like spicy, ask for the spicy green sauce - some kind of minced hot green peppers - the flavors match the gyros meat perfectly.\n\nHummus and Baba Ganouj appetizers are just OK, I suggest the Lentil soup instead - vegetarian, made from scratch, delicious and hearty. Salad is OK as well - dressing can be a little too citrus-y or vinegar-y for my taste, but always fresh feta and crisp veggies. Love the rice pilaf, with almonds and apricots, and the 2 pasta sides - fettucine with creamed spinach or angel hair pasta with sundried tomato and feta - both are rich with flavor.\n\nIf you're interested in trying Mediterranean House, I suggest sooner rather than later, as the strip mall where they're located may be seeing some major changes. The building owner has told tenants he'll not be guaranteeing any leases, and most tenants are already gone. Unfortunately, if Med House loses their lease, they may not reopen at all. I'm pretty sad about that, and a couple nights a month I'm sure my stomach and taste buds will be, too.", "business_id": "FltN1Hnw4n7BORXJH1kaeg", "stars": 4, "date": "2008-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "cZxY3BVSjkUmKcoAVJH9tA", "review_id": "43heasgqjRriIvx6xUq5jA", "text": "I've been here once, and it was a fantastic time. This place is an easy 4 1/2 stars. I feel as though I'm shorting them with 4, but that I'm being too generous to award a solid 5.\n\nI arrived with my date to find we were the only patrons to arrive for dinner, and it was 6:30! A bit surprised to find it so barren, we were seated by an older man, very talkative and bursting with personality. He took care of the basics, then proceeded to chat with us about this and that. I could tell he was attempting to make us feel welcome...keep in mind this large, banquet-style room was empty, the only soul in it perched at the bar, solo. My girlfriend went with his suggestion of a Greek red wine (I can't recall the name, however she loved it). I ordered a great-tasting Greek lager, Marathon IIRC.\n\nAfter our drinks arrived, presented to us by the hilariously entertaining host, we browsed over the ample menu to find our entree. As soon as he described the 'family secret' recipe to me, Lamb Capama, I was sold. He had this matter-of-fact attitude when describing it as if to say \"This is the dish you want, sir\", so I ordered it with the quickness. I'm so happy he made this suggestion. This lamb was so juicy, so tender, and so flavorful! It's almost so good it's bad, as I know the next time I return to Bacchanal I'll probably get the same thing and not try the others! My girlfriend went with a feta-stuffed chicken dish of sorts, I don't recall the name, however she was praising it after almost every bite.\n\nOur entrees were delivered by a younger man with black, spiky hair. He was, I'm going out on a limb here, unmistakably Grecian. I certainly don't mean this in a bad way, as he was a fantastic waiter, almost as enjoyable as the host who entertained us prior. I mention this because every person who waited on us during our visit was memorable at LEAST.\n\nAbout halfway through our dinner, a group of 12-18 came in and sat in the middle of the room, nearest the 'stage' area. There were a few more couples who came in, and were seated, scattered throughout the front-stage area. My girlfriend & I were enjoying a quiet, romantic dinner when all this ruckus came through the front door, but we didn't mind much. More waitstaff surrounded the tables, no more noticeable ambient noise as the group's chatter dominated the acoustics, and a belly-dancer entered stage right....what a change. the must've been waiting for the evening rush or something because this happened almost on queue. The staff tried to get everyone involved with dancing and singing and whatnot. This was okay with me, but on that particular night I was not into it.\n\nAnyways, the food was fan-damn-tastic, and worth the price. Drinks were more than satisfactory. The waitstaff was superb; with their service & suggestions. It was more than 2 months ago since this experience and I'm VERY surprised I've not been back for a follow-up visit.\n\nGREAT joint.", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 4, "date": "2011-01-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "YZHCm5e-d0wu9ssUIipexw", "review_id": "Lp5a7KI44Trmnu7IbP1waw", "text": "HAD A BLAST AT BACCHANAL!!!!! If you want to have a really good time, decent drinks and food, and BREAK SOME PLATES  go here!!!  The belly dancers got a lot of people active in the dancing! OPA!", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 5, "date": "2011-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YroNL98cYvWyezzxtIWMDw", "review_id": "uVvm6pGHFoKvZxdIVyPfaw", "text": "So fun and so yummy!  We had a blast with our big group and the food was fantastic.", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 4, "date": "2011-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f-_7wdkiXOc9TEfa4ZJEwA", "review_id": "3W1chqVhi_ubxqQ06LSClw", "text": "Fun atmosphere, delicious food, good prices.", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 5, "date": "2011-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "df-yTh0TyCCsAc6lop_Dig", "review_id": "hLsq5o83UXRP4ImUDkHpsg", "text": "Ate there for Valentine's dinner.  Too expensive.  Portions very tiny.  No bread.  Salad was tasty enough but consisted of about two tablespoons of mixed Greek salad.---I'm not kidding.\n\n  My dish was salmon.  The fish was cold and the sauce was congealing.  Had to send it back for reheat.  My Valentine's was sword fish, which consisted of about 3 one inch square pieces. Also cold. \nNo bread, no Pita bread.  The sword fish was about $24, and the salmon, about that much, too.  The wine list was all Greek wine, and the glasses the wine was served in were like little toy glasses, not real wine glasses.  Our waiter was kind of lackadaisical.  \nThere were food splatters on the white wall next to the table.\n\nWhen a short woman made rounds about the tables to ask how we liked our food, we didn't  trust ourselves to even get started, and mumbled, \"thank you.\"  All the \"Best of Phoenix\" favorable reviews were at least 10- 20 years old.\nThe bathroom had toilet paper stuck to the wet floor of one stall, and the toilet installed inches from the side wall in the other stall.  Weird.  There was a table with chairs outside the bathroom, like they seated overflow guests there.  Weird.\nWe vowed never to go back, and remembered maybe that's why we hadn't been there for years.  Better to eat at Crazy Jim's or Greek Town. \nSave your money.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 2, "date": "2008-02-16", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "2KyJLMY3jmASmwtnmlBuvw", "review_id": "HOWWD-nOkYn2d9cNN50cJQ", "text": "Best Greek food in the whole Phoenix area!\n\nI have friends from Greece who won't eat at any other Greek restaurant in town -- ONLY Greekfest!\n\nWhen the natives tell me it's the absolute best, and my mouth agrees with them, who am I to argue - either with my friends or with my mouth???", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2008-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 3}, "user_id": "2BzcoI6Kiq-2RQ9EUFR5Tw", "review_id": "fZmKrbC0hLu3WLUu1cPoiw", "text": "Greekfest is the best Greek restaurant in the Metropolitan area of Phoenix, hands down. We've been to them all - and we keep coming back to Greekfest on Camelback. Tony and Sue have been there forever - and there's a reason for that - the food is the best.  \n\nBy the way - my wife is Greek - related to John Stamos the actor. We have eaten Greek food in Greece including her home town near Argos, and Greekfest is one of the few restaurants we've been to in the US that recreates the atmosphere and flavor of our times there. Some may find the food challenging - but that's because Tony makes it authentic - with sharp garlic tasting Skordalia and other delicacies that taste different from American food.  If you know Greek food - you will love Greekfest.\n\nWhere does one start when it's all so good?  The dips, the octopus, the lamb...all excellent. The mixed dip appetizer is a work of art that includes all your favorites including dolmades to die for. My favorite is the fried smelts - which are cooked to perfection - but they are not available in every season. Everything with lamb is spectacular. The lamb meatballs have an intricate yet overwhelming taste that reminds me of that old saying...there are two kinds of people in the world, Greeks and those who want to be Greek. After tasting the meatballs, the sausage saganaki, the lamb...you'll wish you were Greek, too. Second best is eating at Greekfest Opa! Highly recommended.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2009-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "Hm8mxRyPSQqTPq0JVWNSpw", "review_id": "jA0HiokujOfyHycVruX_TA", "text": "My first and only experience there was excellent. The service was exemplary - the server knew the menu, was enthusiastic about it, and assisted us in choosing our items without being pushy. The food was exceptionally prepared and tasted excellent. The tzatziki was the best I've had. Nice and thick, with cucumber and spiced well with herbs and garlic. The spanikopita was also exceptionally with fresh clean tasting spinach and delicately textured phyllo dough. The pan fried calamari reminded me of Europe, fresh tasting, delicately fried in olive oil and not in the least bit chewy. The pita bread was warm and fresh and for dessert, the baklava had a complex flavor and tasted home made. \n\nThe environment was tasteful, old world European and exceptionally clean and organized. I will be back!", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2010-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oxFTtEpExyCtLJMg_S6Yvw", "review_id": "tJFHTGcTRsxnip-eSZx4og", "text": "Christmas party at Greekfest. I had the steak and my wife had the salmon. I suppose it is possible that they were having a bad night but everything seemed nearly flavorless.\n\nNone of it was good.\n\nThe desert was about the only thing worth having.\n\nThe atmosphere was great and the staff was helpful but they need to rework the kitchen if they want to stay in business.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 1, "date": "2010-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "pEVf8GRshP9HUkSpizc9LA", "review_id": "U0JnlmQGQpzybrHD4VscUg", "text": "Extremely friendly staff, very comfortable decor, and delicious food!  I enjoyed a sampling of a few different mezes and a greek salad - just wonderful!", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 4, "date": "2011-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wBi0I2QcqZtNOh21WlBVKA", "review_id": "0LlHrwJfjfqoIHpj7uV1zA", "text": "Wonderful Greek Food offered with Excellent Service in an authentic setting, unfortunately very overpriced.  Difficult to enjoy a proper meal for under $100 for two people.  We may be back, but only on special occasions.  We'd be regulars if prices were reasonable.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 3, "date": "2012-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_ju0P_eGbCYI43Pj3BTckQ", "review_id": "fABaoVQ7dgv0WJvkvSmWLA", "text": "Z's is better and cheaper", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 2, "date": "2012-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rUwygE51ygFerNvGy4Slpg", "review_id": "QgmEJMCV9TXT3zjL49d2zA", "text": "Maybe I caught this restaurant on a bad night, but my experience was terrible. Having no experience with Greek food, I expected my waiter to be knowledgeable and be able to speak English to recommend a dish. However, our server spoke broken English, was extremely touhcy feely and overly attentive. When we arrived there was not a soul to be found in this restaurant. When I asked what certain things were on the menu, I couldn't understand his responses and ended up randomly picking something. My meal was awful. I couldn't tell you what it was, but all I know is I will not be returning.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 1, "date": "2013-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yJiH4gdWo4YR9VSAqKiinw", "review_id": "yHPLCjv-PJvrllIrc_2_Lw", "text": "I don't know how this is the best Greek in Phoenix.   This place is horrid.  I'm so use to fantastic Greek food in Chicago.   Everything didn't taste like it should.   Will not be coming back here.  Ever!  Don't wast your time.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 1, "date": "2015-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5mUDAQScsfN4YU7HQ0YRYQ", "review_id": "kOirRbMP9UmqTZNTwuINbw", "text": "So,  overall great food BUT VERY MISLEADING.\n\nWe sat down got offered bread- with dinner were offered a salad or soup- bill came... And found out that we were surprisingly charged for all of above. \n\nThe server made it seem that everything (like a normal restaurant) was included...\n\nWe were very disappointed with that- so restaurant goers BEWARE.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 3, "date": "2015-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7E4kwOgsH4aKKRhdbtwJqw", "review_id": "3NqLaiT10bTLGiIFYiYY0w", "text": "Awesome Gyros! Big portions. I definitely recommend Olympic if you like Gyros!", "business_id": "bxpzP73A7gauvxFEyd_8xA", "stars": 4, "date": "2011-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "AUaOkqlvu6QB4OquKfp9Ng", "review_id": "LJ957UZzEd5pjOhF0P5hMg", "text": "OK.  I am a Greek food afficionado and I can say that this place has the best Greek/Cypriot food I have ever tried.  This place was introduced to me by my Cypriot and Greek friends and I can't try anything else without comparing it to CPG.  \n\nI would pay ten times the amount for the hummus and pita bread.  Both are the best I've ever had (including homemade)! Their lamb and chicken souvlaki is TO DIE FOR.  And the prices are ridiculously low.  I did takeout here at least once a week when I lived in PHX.  And the owner Christos is a sweetie.  It's such a great atmosphere for a casual dinner with a date or friends - you must go!\n\nI have to add that I have eaten the souvlaki dishes at Evvia in the California Bay Area (the sister restaurant to Kokkari Estiatorio, which is ranked the #1 Greek restaurant in California).  The $7 souvlaki at Cyprus Pita Grill is BETTER.  Yeah.  Run, don't walk here.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2008-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-VAF4FC-WKd39_t_RV8XdA", "review_id": "4IOmedONANXJqmSeGYxnmQ", "text": "This place was my regular lunch spot for years. Once because I moved further away did I forget about it, but now that I'm closer, it's making it back into the rotation of places to eat. \n\nPost peak hours, there is almost always ample seating. It's traditionally seat yourself during non-lunch hours, and the place is small enough where the server staff finds you quickly., \n\nThey offer two types of iced teas, regular and Passion Fruit, served in large tumblers. \n\nI always get started with the Greek Fries. They are smothered in melted feta, lemon juice, and oregano, It's a good sized portion for the price. \n\nThen I always get a Gyro Pita. I have never deviated past that. But it's consistent service and good food.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2008-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "O6JwI9Ide_fIn_t_6k5IQg", "review_id": "S0THziLpZcFSQ8HbRQvj6Q", "text": "Really a nice little find. Four stars for the gyro dinner, veggie plate and greek salad. They were all really good and the price is definitely right. i will definitely be back here again!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2008-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "WJkmgkrSPMHTfDTD3VgqqA", "review_id": "5S8ps74LOatxjfk1NgKwjQ", "text": "I have to admit that I started going to Cyprus because they are part of the Lunchclub and offered a coupon. After that, I was pretty much hooked on the Spartan Club. \n\nI got burnt out quick though. Since it was closer to work than Pita Jungle, my coworkers and I went there a lot. I've ordered the chicken salad, kabob plate, salmon salad, pesto fries and I need to space out my visits now.\n\nThe staff is quick and friendly, especially during the crowded lunch hour. The guys at work also don't mind coming here because the girls who work there are good looking too, otherwise known as \"talent.\"\n\nSo if you're not coming for their awesome food, at least come check out the chicks. Just kidding- they are actually a nice crew of people.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2009-12-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "ZKuevUayT2eqkGNrJm2nAg", "review_id": "ilqvNe0mvUO9zWvz9QDiKA", "text": "Stopped in here for a late lunch right in the middle of the storm that was blowing through on Tuesday. It was late afternoon and nasty outside so the restaurant was empty except for my friend and I. \n\nCute, small cafe with the usual wall murals and decorative touches that are pretty much the standard in restaurants like this. \n\nWe both completely enjoyed our food. And there was LOTS of it. \n\nBut what REALLY made our meal was the mushroom brie bisque they were serving. Yummy, yummy, yummy. Can't even tell you how good it was. Served with some pita triangles on the side....it just hit the spot. I'm usually not a 'soup person'...but with the nasty weather...and I was pretty wet and cold from running to the restaurant from the car...and just the name alone....MUSHROOM....BRIE...BISQUE....well, I just had to have some. And it TOTALLY lived up to expectations. \n\nFast, friendly service. Great food. I'll be back....even if they aren't serving the mushroom brie bisque that day. But it would DEFINITELY help.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2009-12-23", "type": "review"}
{"votes": {"funny": 6, "useful": 7, "cool": 7}, "user_id": "wHg1YkCzdZq9WBJOTRgxHQ", "review_id": "iv55_sKZiEd6hTqxgxgmAA", "text": "My first experience with Cyprus was about 4 years ago.  My husband was living in the neighborhood, but I was still in denial about moving to the Valley.  It was like a little vacation to come to \"the city\" and stay in our Biltmore apartment.  The novelty wore off quick once I moved here, but I still enjoy Cyprus.  It makes a nice precursor to a movie at AMC.  At Cyprus, my husband and I can both get get pitas, hummus, and drinks...or we can share the water fountain and 7 kernels of popcorn at the movies for the same price.\n\nMy favorite part about Cyprus is the pita bread.  It's thick cushy pita, not the flavored cardboard pita they somehow manage to split open to make a pocket.  I'm a little partial to the chicken souvlaki with it's tangy tzatziki sauce, crunchy cucumbers, fresh lettuce and tomato.  The hummus is always tasty, although I seem to remember it being just a little better in the old days.  Not sure if they changed the recipe, or its just me remembering it differently.\n\nThe only downside, the last two times I've been in we have been waited on by girls.  What happened to the Greek Gods?  Minus a star for that!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2009-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "fAiVqZv7P_oc5CzGMX_G9w", "review_id": "8_913se_SrKwUjE_GXaOwA", "text": "I have been here twice now, and had different things both times (Gyro Pita and Falafel Wrap), but as much as I love a good Gyro lunch, Cyprus Grill just didn't quite do it for me.  \n\nI do like that you order at the counter, and the food comes out pretty quick, but I wasn't blown away by either the gyro meat or the falafels.  I thought the gyro meat was a tad dry, and they really skimped on the tzatki sauce, which didn't help the dry meat situation.  The falafels were decent, they had a bit of a kick to them, but the wrap that they were served in was a downer. \n\nI will probably end up eating here again since they are near my office, but once you have had a really good gyro (like the ones at Haji-Baba) this one just doesn't quite make the grade.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 3, "date": "2010-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7o7MF9B9lxcWupE8jiLOaQ", "review_id": "dbYWrXPJ7bj46zBn837nSg", "text": "This is a great lunch place, I go here frequently. The food is always good, and as long as you go at lunch, you don't have to pay tip! My favorite order is the spartan club and the pesto fries, yum!\n\nThe staff is nice enough, have never had any problems (including the time I spilled a whole glass of water on the table/floor). The atmosphere is ok, not exactly my taste but very typical for a Greek restaurant. The seating outside is awesome on a cool day.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2010-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M6oU3OBf_E6gqlfkLGlStQ", "review_id": "Dh-lqjbkbozqpyanaW2Apg", "text": "There falafel here is sick! At least it may make you sick. \n\nI have been here several times and have always gotten one my my favorite foods, falafel. The basic order here just included a pita filled with falafel, lettuce, tomatoes and some tahinni sauce. You can opt to add fries for a bit more. The falafel always seemed a bit dry to me, however it was crispy. Getting both is a tough act outside of Israel apparently. \n\nWhat does concern me about this place is their very spotty health record as seen here. http://tinyurl.com/yzuutaj  As of late they have improved but I still have some doubts.\n\nHere you order a counter and they bring you your food, drinks are at a soda fountain and self serve. There is siracha sauce available to spice up your meal.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 3, "date": "2010-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mfUs6cSN06po2GCjfLlxfg", "review_id": "oLdxOG4zMDoEefJblD_rlA", "text": "A favorite everytime I am in town...lemony feta fries are AWESOME.  Gyro salad never disappoints.  I highly recommend this place for fresh, delicious food.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2010-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Shrx_7HCsJRav2hqU5U0gw", "review_id": "-rmvhipAXFQId5RRXamfyA", "text": "I have lunched here before...gyros are fabulous and the hummus is delightful.  This is a solid spot for good, fast and Greek.  Today, thankfully, I had a bowl of the Mushroom Brie Bisque and I was stopped in my snooty food tracks.  Lots of mushrooms that actually looked like mushrooms in a lovely creamed broth that had the tangy brie finish that let you know this wasn't just your everyday soup.  It has been a long time since lunch has surprised me, but today I am so glad it did.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2011-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "vhxFLqRok6r-D_aQz0s-JQ", "review_id": "RnibIj9txPZqZyGp8QuYaQ", "text": "This place is just okay.  The soup was a little salty, and the hummus which I generally adore wasn't awesome.  I think it was home made but it didn't have enough olive oil or tahini.  If I can't get good hummus I might as well eat at the Arby's next door, or run into TJ's.  The place is clean and a quick lunch which is nice.  Not the best place, but probably not a bad idea to introduce a picky eater to the joys of garlic and Mediterranean food.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 2, "date": "2011-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SSnu5ne1UUAf1ULpVw9faw", "review_id": "hMWWzjCLmqAK2EtaltqzFQ", "text": "I have been meaning to start reviewing the MANY places I go to every week and have just procrastinated. What a great place to finally begin my review ritual. THIS PLACE IS AMAZING.\n\nFirst, when we walked in, there was nowhere to sit. A nice gentleman in the corner waived us down and said he would be leaving soon and to have a seat at his table...which we did. He introduced himself as George and apparently is a regular here and had nothing but great things to say in a strong greek accent. I thought that he may be a little biased based on his obvious background, but entertained the pleasant conversation because he was quite the riot. \n\nHe then introduced us to the owner. The nicest 80 something year old man you will ever meet that truly cares about his place, his food, and his customers. We decided to each start with a soup on the recommendation of George. I had the tomato basil and my friend had the egg and lemon(because I don't know how to say it or spell it in Greek) soup. Both were amazing. the tomato basil was a rich, heartier texture and you could literally taste each ingredient that created such a wonderful aroma and combo of flavor. It is really great to be able to taste freshness.\n\nWe decided to share a sandwich as we weren't super hungry and chose the Spartan Club. Again, what a great combo of flavors that made this Pita-style sandwich taste so great. The pitas themselves just have this fresh feel to them that makes all the difference in the world. We also decided to experiment with something new and have the greek fries to go along with it. Not the healthiest choice, but oh so worth it. If you like cheese...and I don't mean fake, melted, orange stuff... I'm talking real cheese and real flavor, order these...you won't be disappointed. \n\nAll in all, a wonderful first time for me. I love finding a neighborhood place that is owned by the \"little guy\" and will support this place over and over again. Go there, show your support, and say hello to the very nice older gentleman pouring your wine....he will be the one with the smile on his face. \n\nThanks to everyone at Cyprus", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2011-02-07", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "DcQERx2GW3CB6cfP_4xblw", "review_id": "sfdacCcbTGphVVekVUrPDg", "text": "I love Cyprus Grill because I love lemon.  My 3 favorite things are:\n\nGreek Fries - French Fries with feta cheese, lemon sauce, and seasonings.  They're freaking spectacular.\n\nFried Calamari - You can get it by itself or on a salad.  The calamari is fried light and crispy.  Never gummy/rubbery.  And of course you get to squeeze fresh lemon on it :)\n\nAvgolemono Soup - A lemon and rice cream soup.  It's scrumptious.\n\nSo if you're in the mood for a little citrus zest with your meal, I highly recommend you make a trip to Cyprus!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2011-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YR__roMWzPmAq8bi4a5zWA", "review_id": "L7iFu7jIEopLE2rjsyFK_g", "text": "Excellent, fresh mediterranean food.  Not your typical heavy Chicago gyro style of place.  I always opt for the Chicken Souvlaki plate w/ a Greek Salad.\n\nThis location and the one in Tempe (now known as Oliveo...owners falling out or something) are both fantastic.  However, I still prefer the Tempe location for the price and the chicken tends to be cooked perfectly, i.e. it is never dried out, but you have to be willing to deal with the college crowd ;)", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2011-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "40-dPni2cbqyYZ21OHN63w", "review_id": "E_GcSxL8scK7UlSEXH-FcA", "text": "My dining buddy and I had an early-evening meal here last Friday on a Groupon 3-course-dinner coupon and could not have been treated better.  We had helpful, attentive service and were not at all rushed, despite lingering into the more crowded hours.  The food was very good, generously portioned, and nicely presented.  We will definitely return.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2011-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2LCrT_BOJvGV4xi_lmoRcA", "review_id": "e5VvVWGU0N8W8qZmCHGElg", "text": "I am SERIOUSLY ADDICTED to the Greek fries.  I go most weekends and eat at Cyprus Grill before I do my grocery shopping @ Trader Joe's.  Service is low-key, the seating is comfortable, and I can lock my bike at the rack in front of Trader Joe's.   I can always find a table, and they don't rush me.  I read the paper and savor my lemoney, olive oily, feta cheesey Greek fries.  YUM!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2012-01-09", "type": "review"}
{"votes": {"funny": 17, "useful": 23, "cool": 18}, "user_id": "cRyNICH0mhjxagvSyVr60Q", "review_id": "LaPHeH54bvJOWWB8lqKzyg", "text": "How many bites does it take to get to the lamb filled center of a gyros-pop?\n\nI'd say one, cause if you can't find gyros on the first bite, there's probably something wrong with your order ;-) ... are you sure you didn't order the chicken?\n\nAnd you thought I was going to say something deep and meaningful, you obviously don't know me that well.\n\nCypress Grill is my favorite place for a gyros in Central Phoenix. There's a handful of them around (gyros spots that is), but if you're looking for a gyros and within a few miles of this place, I'd say skip all the rest. I've tried at least five or so spots that serve em nearby. You'll spend a couple bucks more here than at the other places, with a gyro running you about $8, but I'm happy to conclude that Cypress is my favorite gyro in town.\n\nThe hummus here is good, so is the spanikopita and dolmades. For those of you who are carb counting, you can get your gyros in a salad too. I've done that a few times myself. All in all a solid choice for medditeranean dining - one of the better spots in the area. \n\nHappy Yelping Phoenix!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2012-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4gAxr3H9L9AUKT3kz1czYw", "review_id": "I-1Io0I5Ww6_C97VfIbRAA", "text": "Always a great place to dine at. Great food, great prices, and a very friendly staff.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2012-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vx7sGIg26g3sBKkCyzq3vw", "review_id": "xR5c0OqOP6SzfKej24Dhew", "text": "Great restaurant! From the food to service Cypress Grill is one of my favorite places to eat. Date night, quick bite, or to-go order this place is an ideal choice! Highly recommended!!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2013-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SDwNym_yVoAhIbmqkgNVuw", "review_id": "TT9j2_JcVnrgxEN6AXkj4g", "text": "YUMMY! Nothing fancy but some really good Greek food!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2013-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "X8hjnv-PSuJ0ASItdwpzqg", "review_id": "eNnTY6E4cTBJ4Mqs0yD79A", "text": "The Gyro was decent, had some fresh veggies and the meat was tasty. It was cold though, and I've always had mine hot. \n\nFries were thin and kind of soggy, but I did like the cheese fries. Plenty of feta, and delicious seasonings.\n\nNot bad, but I'll stick with Z's Greek down the road.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 3, "date": "2013-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qj69lMpV7lMH7o9wqt3z_w", "review_id": "cayuUX-QDYftyjfdQuLu1Q", "text": "The wait staff was excellent. They accommodated special requests beautifully. The Greek Salad was excellent, and the Portobello Pita was outstanding.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2013-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "myqNiZDq6XzJerk8uXkw1A", "review_id": "SAJgfeHBviArnmIHAZ_Oew", "text": "I have to say, since I wrote my last review in late 2011, Cyprus Grill has made significant improvements to their service and consistency. We stopped in the other day for lunch on the way to do some shopping, and it was busy, but not crazy. It was too chilly to sit on the patio, but we found a seat with plenty of natural light. Our server was extremely polite and cheerful; she didn't hover, nor was she difficult to find when we needed her. The atmosphere was simple and relaxed, and they had a few TVs on (muted). \n\nWe split an appetizer of Greek fries - which are a MUST order, and an excellent hangover delicacy - and since we weren't heading straight home, we also asked if we could split a chicken souvlaki dinner. The waitress didn't miss a beat, and the entree - Greek salad with lots of delightful feta, dirty rice with herbs and carrots, tzatziki, and a single kabob each - came out neatly plated separately. We asked her to hold the pita because my hubby is on a strict GF diet.\n\nI was pleasantly surprised to see no split plate charge when I got the bill, so I tipped them a couple of extra bucks. Before tip, two soft drinks, Greek fries, and entree came to $23. Not bad - but if the Middle Eastern Bakery is open down the street, that'll still be my #1.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2014-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lBMCBwbAhfgb5oKqilA7CA", "review_id": "u53HL1fHLG_Y9Bq7MrCPtA", "text": "I shop almost weekly at Trader Joes and had never noticed that next door was a Greek restaurant. I'm not sure how I passed it each time but i'm happy to have finally found it!  I came here with my book club and was able to quickly find a table that would fit our group. We ordered drinks and appetizers right away. For apps we had the hummus platter and the greek fries. The hummus was very good but I couldn't keep my hands off the Greek firies. They were delicious. A mixture of fries, cheese, spices, and a sprinkling of lemon. All the flavors were perfect and I couldn't stop popping them in my mouth. \n\nFor dinner I had the Gyro with a side greek salad for dinner. I nearly licked my plate clean. One of the better Gyros I've had since moving to Phoenix and the salad was perfect. My group had a mixture of different things but the salads stuck out the most to me. They had very generous portions amd everyone seemed to be very happy with how they tasted.\n\nIt only lost a star from me because the service was pretty slow. Lucky we were enjoying our conversation that we didn't mind waiting around, but if you're in a hurry be warned. They definitely take their time here. \n\nOverall it's a great little restaurant! There's plenty of outdoor seating and the prices are very reasonable. I can't wait to go back!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2014-01-30", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "frEtELnTATd1BOD6Ndh0CQ", "review_id": "fkAW-PkCC3KzeuBxPw-SKA", "text": "I've passed by this place, ignoring it on several occasions. It's awfully hard to see scrunched into the corner of the strip mall and it doesn't draw you in with it's signage. I've seen it's poorly designed website and it's lack of reviews by people. Most of the time when I've glanced over I haven't seen anyone eating there either, so I shrugged it off. What a loss to me!\nIt was a Friday night and I was craving lamb so I cajoled my partner to at least go look at the prices posted on the door. Walking over to it I was drawn to the outside babbling fountain and greenery, simple, calming. They nodded form the door that the prices were within tolerance and we could head in. The seating area was light and elegant, folded napkins, music playing soft ballads. The mirrored area seemed to make such a tiny place truly expand, but we were comfortable not squeezed in. The proprietor, Frank was smiling and came over immediately. A lovely welcome, a drop of menus, a discussion of drinks. He showed my daughter how to make a folding napkin shape and asked some personal questions, but he spoke to us individually, including my child.  He took stock of us and volunteered his insight outloud, that we seemed to be happy, good people. While it would have seemed strange and disconcerting in many venues for some reason it didn't feel intrusive here. It was ... pleasant.\nWe chose hot teas and enjoyed having a broader selection than in most places and he left the whole box right at the table in case we wanted others.  We selected the Greek Combo appetizer with spanikopita, dolmodes and pita with tzaziki. It was simple fare, but a good indicator of the pita quality we would see later ~ fresh, not greasy. The dolmades were wrapped tight and flavorful. The grape leaves were properly seasoned so they just melted in your mouth. They were the best dolmades I have ever had. It did what an appetizer should do though and we got excited for the next foods to come.\n\nI knew immediately that I was going to order lamb, but I wasn't sure which way. I ended up selecting the shank because the restaurant said it was their specialty, my child ordered the Keftedes appetizer as her main meal, and my partner the gyro platter. When the meals came everything was plated nicely. The keftedes were resting beneath a beautiful bechamel sauce that wasn't skimped on at all surrounded by more pita triangles.  I had to steal one of her greek meatballs to cut in half and share with my partner. These were juicy and perfectly browned, no grease, no burned edges, no dryness. The texture was smooth and we were very impressed. But would the meatball connoisseur be happy? My talkative daughter didn't interrupt us so much as she was busy saying mmmm and yum and mmmm again. Smiling. Spooning some of the sauce onto the pitas when my daughter got full, was an added treat for the grown-ups.\nMy lamb shank was perfection, in seasoning, in cooking, even the bone marrow required sucking out. While the rice was nice and the kernals moist and fluffed, I didn't find any seasoning to it really. I'm not sure if that's traditional, but I liked it for it's simplicity against the lambs more savory parts. \nMy partners Gyro platter, was as standard as could be, but the serving was large, the rice was the same as mine. For them the real standout was the Pita itself which was fresh, warmed and easily folded into a it's implied role. We'd been to so many places where the pita's were terrible that I think we were extra happy about this. Although I think they were wistfully wishing for keftedes of their own.\nDessert was definately an option when I saw the chocolate mousse cake. I've been hunting for a mousse cake done right for awhile now. So many times these mousses disappoint me. This one came chilled and smooth drizzled with chocolate sauce, but not buried in it.. It had a fine layer of mocha, which normally my daughter would balk at, but she couldn't get enough. I would be happy coming here for some coffee and mousse cake alone! I think I found a new source of joy.\nFortunately other patrons came in and we got to see presentations of the the saganaki appetizer, baked kasseri cheese flamed with brandy and the seafood entree's which I must return to try. I noticed that Frank was equally personable with them and when he left the room the lady gushed over their food and whispered across to me, \"Why is this place so empty, it's fabulous!\"  Why indeed? Give this place a shot if you're nearby.", "business_id": "cvb__rYMkj4BMhC3p_FB3Q", "stars": 4, "date": "2008-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B0QZQX-RVoub4d1HUYAiLw", "review_id": "Y_ch8ovaOtfZzvlwOaAkoQ", "text": "After reading high reviews about this place we came down. The place is nice inside. The owner is asian, nice guy as well but can he master greek food? I asked what they are known for which was the lamb dish so i wanted to try it but they didnt have it available. And the asian guy is the only one here cooking and taking orders. The cheese dish was brought out in flame (looked cool) but when we ate it you can taste the alcohol he used to make the flame, it was gross. The place was dead and quiet so we can hear the guy microwaving the food in the back kitchen. I've tried much better greek food but i give the asian guy 2stars for being the only one there trying really hard.", "business_id": "cvb__rYMkj4BMhC3p_FB3Q", "stars": 2, "date": "2012-02-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "M6Wi9pKDx-W6rGgmf9GVMw", "review_id": "GMGII2y8jxbD-3ZV-j80wA", "text": "Newsflash!!  After 10 years of living in the East Central Phoenix area, I have FINALLY found my \"go-to\" Greek place.   It's like comfort food, but it's the entire restaurant.  \n\nMy cousin and I stumbled into this place --- the location is a bit difficult to find otherwise.  We were waiting for our nail appointment at Andy's salon a few doors down and decided to grab dinner since we had time to kill.  Little did we know what happy customers we soon would be!   An affordable, local, delicious Greek restaurant which quickly earned a #1 rating in my book!  Can't wait to go back and try more!  \n\nThe woman who took our orders and cooked the food was just so wonderful!  She recommended the Spicy Chicken pita to me, so I took her word  (see my Humble Pie review, where I learned my lesson for not following restaurant recommendations!).  It was a great choice!!   My cousin had the gyro pita, which was melt in your mouth delicious too.  We also shared a spanekopita, which was just so fresh and well made.  It was piping hot food, she cooked to order (hold the onions for me!), and the flavors were perfect. \n\nThe portions were great, the hummus was tasty, the pita so soft and perfectly grilled.  The Olympic Flame has even mastered the use of garlic, which many restaurants seem not to be able to manage.  The only downside to this place is that I guess I won't scare vampires off at night after eating here (see my previous review of Eden's Garlic Grill if you are looking to keep the vampires away), but I will sleep well with a fully belly and leftovers in the fridge for tomorrow!", "business_id": "cvb__rYMkj4BMhC3p_FB3Q", "stars": 5, "date": "2012-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 3}, "user_id": "9Z05mtXrXJ-22PElwp1ahA", "review_id": "WpAaSD-pRVIr2r-zKgPN2w", "text": "Strip mall mediterranean. Unbelievably clean place with unbelievably sweet owners. The chicken gyros, falafel, and baba ganouj are excellent. Great for take-out.", "business_id": "ejfy33R1avFm7oygL34uQg", "stars": 4, "date": "2006-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GO-bjH-pQSPiyPgj4zKwVw", "review_id": "T4tQ81z4kEfCwTFcDuqxUQ", "text": "Elie's is a small, unassuming place that gets busy during the lunch rush.\n\nI like their hummas quite a bit and their chicken plate is very tasty.\n\nMy wife found their falafel to be unpleasant for some reason.\n\nThis is the kind of mom and pop business I like supporting. They are very nice.", "business_id": "ejfy33R1avFm7oygL34uQg", "stars": 3, "date": "2007-12-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Txbs1MSnXsd8s7XsxaCTJA", "review_id": "RwfOl6EsZZaM_Kwn5Evvhw", "text": "Definitely best gyros in Phoenix", "business_id": "ejfy33R1avFm7oygL34uQg", "stars": 5, "date": "2013-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IFhyhyRsLPlKSclaovJTAw", "review_id": "jvcoOGKY6aUSoW9E-wI3og", "text": "I pass this place all the time, and decided to stop in today. Glad I did! I got the classic gyro with fries, and it was one of the best I've had. \n\nThe service is very friendly, and they are attentive. You could tell the ingredients are high quality, and my food was very fresh. \n\nThe establishment was very clean, with friendly service and good food. You should check it out!", "business_id": "ejfy33R1avFm7oygL34uQg", "stars": 5, "date": "2013-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ajGI2oSB7VFNVHLYvHs5zQ", "review_id": "hxd4x9LnFlqAvQ1NE0YhjQ", "text": "sitting in elie's right now and i have nothing but good things to say. the food is delicious, the owners are friendly, your order comes out FAST (i got my hummus and falafel pita within minutes of ordering--i barely had time to sit down!).  this is a little hole in the wall deli off 44th and thomas but well worth a visit. i haven't tried the famed gyro yet but i'm looking forward to it!", "business_id": "ejfy33R1avFm7oygL34uQg", "stars": 5, "date": "2013-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "fczQCSmaWF78toLEmb0Zsw", "review_id": "Bac49RYtPtv81ozFidBEwg", "text": "3 stars... I really wanted to give more stars, but the food was just ok and the strip mall location doesn't add anything to the experience either.  \n\nI went to dinner here the other night with my boyfriend on HIS SUGGESTION.  Since I had never been before, I was up for the new adventure.  I like that it is just a casual little place and the pictures of Greece on the walls had me thinking it may impress me.  Unfortunately, not the case.\n\nI will say that our waitress, Anna, was really sweet and knowledgeable.  You could tell she's been working there for years.  We started with the red lentil soup which was delicious and Anna brought us a taste of the spinach curry soup as well - it was spicy but tasty and had me excited for what was to come.\n\nWe went with the Sleepy Gyro Salad and the 'Vegetarian Plate II\" which was more than enough food for us to share.  Too bad none of it was that great.  The vegetarian plate came with hummus, baba, falafel, dolmas, tabbouleh, spanikopita and yogurt sauce for $12.45.  Not such a deal.  The hummus is better at Pita Jungle, the baba ghannouj was ok but really smokey, the falafel just eh, the dolmas and tabbouleh both mediocre, and the spanikopita was dry instead of moist and flaky...\n\nThe 'sleepy gyro' salad is filled with too many onions and has a ridiculous amount of garlic... If you like onions, garlic, and gyro though, this is a good deal at $8.55!\n\nSorry, Saba's - even though Anna was a great waitress, I will not be coming back to visit you anytime soon... instead, I'll be on the hunt for Greek / Middle Eastern Cuisine that compares to that I grew up with in Detroit!", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 3, "date": "2007-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TgXQJsWCTVE4BFijf0kM8g", "review_id": "PbrijE55hqRTv-9GDXVyeg", "text": "I forgot my lunch at home on this day and had passed by Saba's on the way to work so I thought I'd give it a whirl.  I ordered the Gyros dinner plate with a side of hummus.  Everything was tasty and served in a reasonable amount of time.  In general I'd try it again.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 4, "date": "2010-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IrwWKJ6hfDfcblSv2VKrpA", "review_id": "L4ZWjKpdgeCEEfwuOocVmA", "text": "We stopped by this place for dinner because we were stuck in that part of town with an Entertainment Guide and hunger pangs.  I was a little hesitant at first, because the restaurant is sandwiched in a row of restaurants that either are fast food or appear to be.  Anyways, I am glad that we did not turn away.  I had the falafel platter with grilled veggies and baba ganoush.  The griled veggies were very good as was the falafel (honestly, though I can't really tell a good falafel from a bad falafel unless it is total crap).  The baba ganoush was a little less smoky tasting than I have had at other places, but still good.  We also had the spicy feta fries (fries with feta, bleu cheese dressing and wing sauce), which were good, but would not hold up to the Gaelic Nachos at the BOP.  The waitstaff was very friendly and it was a good experience. I would go back, but I would get the sandwich for about half the price as the entree.  The flaming cheese also looked very good as well.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 3, "date": "2010-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6ts41fCsDKHbFZaKOMNmVQ", "review_id": "MIhZ289c21AWtwroU6WA0Q", "text": "Meh. \nIts good. I have been here before...its just not the best. \n\nI had a bad craving for a falafel sandwich, only pita jungle is a bit more of a drive from my work. So I called up Saba's and placed a pick up order. \n\nWhen I got there, I was promptly ignored and not greeted even though there were 2 people behind the cash register. The old man grunted at me and pointed at the order I just watched him bag up (I had placed an order for 4 people, nothing crazy by any measure) I asked if I could give him half cash and the rest on my card...I get another grunt (more of a disapproving grunt), this clearly put him in a bad mood. I said thank you I don't know how many times, but that wasn't enough. \n\nWhen i got back to work I was a bit disappointed. I ordered a side salad with my falafel and the house dressing was some really weird dressing I have never had, though the lettuce was very fresh and crisp...My falafel its self was ok. The patties were good, the pita bread got super soggy really fast and I was sad to see no onions or cucumber or hummus in it like pita jungle does. \n\nIf my co workers wanted to go here again, I would most likely order something else and give it another try, but wouldn't suggest it if it was up to me.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 3, "date": "2010-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jGsPOCaHCiBUJhBdFOe9-A", "review_id": "YqKhzBn60UW2YP_TlqbUEg", "text": "I absolutely love this place!  You won't find a better baba ghanoush in the valley!  You have to LOVE garlic to like the baba!  I'm just warning you, your significant other and/or friends must really LOVE you too, because it sticks around for awhile!  The must have is the Flaming Cheese!  What a show stopper!  It's soo cheesey, greasy and lemony! You must also get the lemon rice soup, so good!  Their gyro meat is meatier than most gyro's I've had and has a little bit different seasoning as well.  I recommend the Sleepy Gyro if you want a salad!  Just try this place out and you won't be disappointed!", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 4, "date": "2010-12-01", "type": "review"}
{"votes": {"funny": 7, "useful": 9, "cool": 7}, "user_id": "n9Zg0jlOGtxfIrvoPm6Hhw", "review_id": "ozcatqlRtOU_kyJOvXwOag", "text": "Ick.\n\nIt was one of those evenings when you toss dinner options back and forth, but nothing really sticks.  \n\nIn retrospect, we should have stayed home.  Even in the barren, food-less space that is my kitchen, I could have done better.  However, lured by an ad boasting a \"World Famous Gyro\" for the bargain price of $5, off we went.\n\nUpon arrival, we were quickly greeted by a man I assume is the owner, shown to a table, and given menus.  A few minutes later, he came back to tell us he would send someone over to take our order.  Great.  Strangely, the waitress that arrived to ask us what we would like to drink couldn't/wouldn't take our food order, as someone else was actually our waiter.  Huh?  Well, we finally were able to order from our real waiter (who was very nice, by the way and the ONLY reason for 2 stars vs 1) and our World Famous Gyros arrived shortly.  \n\nUh, no.  What I found on my plate was a pile of sauce wrapped in paper.  The entire gyro was drowning in tzatziki.  Now I happen to really like tzatziki, but but not to the point that I cannot even identify what I am supposed to be eating.  I scraped off as much as I could, but then only tasted overly salty meat, soggy lettuce and yes, sauce.  After a few bites, I waved the white flag of surrender - I just couldn't do it.\n\nGuess you get what you pay for....", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 2, "date": "2011-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "8XkdCS3agBUCycI5-1C5HQ", "review_id": "PW4iiYeqtpYSdlONqHxe0g", "text": "For anyone who lives in the valley, Saba's is a name everyone is familiar with.  My husband introduced me to this mom and pop joint and I even make sure that any visitors that we have from out of state experience this restaurant.\n\nThe marvelous deal they have right now with their $5 gyro makes it extremely affordable.  For about another dollar you can add soup, salad, or fries.  I always opt for the house salad that is drizzled with a lemon vinaigrette which is rather enjoyable!  The gyro is one of the best I've ever tasted and The Chicago is even better, which has all crispy meat.  The adventurous side of myself tried Kibbeh, an appetizer that is made of ground beef, pinenuts, cinnamon and then fried.  The presentation reminded me of falafel, but the taste was very different.  Don't let yourself be scared by the cinnamon; it's subtle and remarkably delicious!  \n\nAnother all time favorite everyone needs to try is their flaming baklava.  The infamous \"fire\" show you get will impress any kid or grownup alike and eating it will be even more enjoyable.  Crispy, nutty, and honeylicious with a bit of an added zing from the burned off liquor.  Mmm, mmm, Mm.\n\nI honestly cannot praise this place enough.  It's the right price at a great location with reliable service.  The staff is always friendly and will go out of their way to make sure all of your questions are answered.  Also, if you enjoy a beer with your meal, they have a wide range to choose from without the overly-priced sticker tag.  Who can beat that?", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 4, "date": "2011-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "oy6fdscGSXY2gzRqF9pZxg", "review_id": "CfPfAfUygaVBWMhEGCZrAg", "text": "A decent place to get gyros, hummus, etc, plus friendly service. My boyfriend is a fan, so I've been a few times. We usually get the triad of hummus, which is obviously freshly made. They have plain hummus along with pesto, chipotle, and buffalo flavors. Their lemon rice soup is very good - I've never had anything quite like it before. If you've never had it before, I recommend trying a cup. My favorite entree order has been the gyro salad, that way I get more greens and I can make my own little gyros with pita. \n\nFinal verdict is if you're in the neighborhood and in the mood for Greek food, stop by.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 3, "date": "2011-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "V0VOe-7Hlt6AQfVLF9EwTg", "review_id": "huH78p_xE08jeQoTAlWUcw", "text": "This is a nice, locally owned place with some pretty delish food.  The meat is exceedingly tasty and veggies fresh and crisp.  Sauces are pretty bold and garlic forward.  My hubby and I share the three meat meal and it's more than enough for both of us and the two kids.  One minus, our takeout order came with only one pita.  I called and let them know that I thought it was odd.  Apparently you're supposed to order additional pita.  This seems a bit chintzy to me.  At the very least, let the to-go orders know.  I'm happy to pay for more but once you're home, it's not like you'll go back out.  \n\nOverall, the food is tasty and healthy - grilled meats, veggies & salad.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 4, "date": "2011-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "f4_0MTexPnmvuWwjTsR_mQ", "review_id": "IZizizReAaS0f6SwWrHasQ", "text": "Went here for the first time about a month ago and have developed quite the obsession.  after trying many a gyro( it's pronounced euro not guy-row ;) )and being in a mediocre haze from them all, I FINALLY met my match for pita cuisine. They were absolutely packed and now I see why. I honestly read through some of the negative reviews on here and thought..  \"are you high???\"  \n\nSo let me break it down.  The pita bread is delicious and moist as if it was made that morning. I got the chicken schwarma and the chicken was so moist and tender it fell apart. It was layered with some sort of special sauce and rightfully so it WAS special. It was deelish. My fiance got the beef gyro and for someone who doesn't like trying any ethnic foods (meaning anything thats main ingredients aren't meat and cheese)  he was in LOVE. it was awesome. He also ordered the bachlava (sp?) Which was out of this world. They don't use honey in the bachlava so it doesn't have that sticky effect makes for a much more melt in your mouth treat.  So excited to have this place right around the corner. Service was great, food was exceptional and it has a nice mom & pop feel. (Buy local my friends!). Highly recommend it! I Also saw they have a happy hour from 3-6 5.50 gyros and drink specials. The owners are so nice i never feel guilty about spending money on lunch here!", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2012-12-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "HRa6ZeUJM7A3yvjZEGykuQ", "review_id": "ElmUjPGAEcFiBvR3m5ftrg", "text": "Great food. Great service. Small Greek salad is huge. Buffalo hummus and baba ganoish were tasty.  Baklava was good end. I will be back.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2012-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nW8ZMWKE4OK3dxYhP8WsNg", "review_id": "R5jsn9o7D5G5cWXMBLBqeA", "text": "This is our go to place for Mediterranean food.  They have great hummus and baba  ganoush.  I love the build your own appetizer plate.  We have been going here for almost 10 years now and wont stop anytime soon.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 4, "date": "2013-01-05", "type": "review"}
