{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2d5HeDvZTDUNVog_WuUpSg", "review_id": "Ieh3kfZ-5J9pLju4JiQDvQ", "text": "I highly recommend this place. The mechanics are really honest and I'm usually in and out with no issues.", "business_id": "3eu6MEFlq2Dg7bQh8QbdOg", "stars": 5, "date": "2014-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "fFoRIzbwpMiv3BvfdtdlXQ", "review_id": "bBC-YgumkcGTgI9Fmavx2w", "text": "Best car repair spot in town.  Tim is honest, hard-working, and knows his sh*t.  I've been in burgh for 3 years now.  I was driving a 2000 Nissan Maxima and it had 170K miles on it.  Now, I loved that car and whenever something went wrong I brought it in to Walter's.  Last time I brought it in I asked him if I should put more money into the car- the alternator was out and a new battery was needed.  The car would not start.  He told me it is a good time to get a new car because he wan't sure how much more this car could take.  He even gave me a couple of numbers of guys who buy cars \"as is.\"  I called these guys and sold this beater maxima for $1000 as is!  \n\nNow, I drive a 2011 Malibu and I'm a happy girl.  Thank you Tim- I appreciate you looking out!  Other car repair shops would have fixed my car charged me out the azz only for my car to break down again.  Tim really does have your best interest.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2012-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oUT7j-qbQdCqC-QKMh1dsg", "review_id": "sbGU-kQ0sDFxX--31HC5ew", "text": "I've gone to this place twice with rear end accidents and they have gone out of their way to turn such a crappy situation into a pleasant experience. Both times, they set up really cool rental cars for me, and this time, they had my car done a day early. Everyone who works there is super nice and I literally have nothing but good things to say about them. They even offer lifetime warranties on their work. Just a great place! Highly recommend.", "business_id": "FXj0ZOHbyV5n_0S_QZOOuQ", "stars": 5, "date": "2013-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "RYkCobCYYZ2HqL6TdEqoqQ", "review_id": "Ee83vy_OiNz1bsIkAFhcfA", "text": "Michelins. Their service writers are competent and courteous. Free rotations.", "business_id": "mnOTw4P5NaLbzFp2bTsm9g", "stars": 4, "date": "2013-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "DvXTIIHGCW04aHd7NwGqbw", "review_id": "LaMGnNc6oeNFQEe-pJcwjw", "text": "We took my wife's Sorento into for service on her A/C for the first time in March. They told us it was her compressor and they replaced it. Luckily we had a extended warranty and they covered most of it. That didn't work so we took it back. They said it was a bad control unit and wanted $600+ to replace it. I found it online for just over $400 and I replaced it myself. That didn't fix it so we took it back again. They said it was a bad control module and that they were going to replace it. They charged us for the replacement but didn't replace it and then determined it was a bad replacement control unit. They ordered a warranty replacement and I picked it up (much to their disappointment) and put it in myself. That didn't work either and after spending over $1000 and wasting two plus months with them we took it to Dale Jarrett Kia in Monroe. They determined it was a different module that determines the temperature was bad from the beginning and had most likely been the culprit the whole time. They were able to get Kia to warranty TWO new control units that were damaged because the module had burned the other two out. They had it two weeks straight but were able to finally diagnose the cause and origin of the problem. Folger Kia has got to be the worse dealership in the Charlotte area. We spoke directly with Kia corporate and they apologized for how horrible Folger Kia was and how badly they treated us. My wife went in when we were finished dealing with Folger to get a receipt to give to Dale Jarrett and Mike Melton treated her horribly. I will NEVER use or recommend Folger Kia to anyone. They are dishonest and their customer service is terrible. If you have to use a Kia dealer go to Dale Jarrett. It isn't that far but your experience will be so much better.", "business_id": "zpNqsFrhLJlxAtPrSkbImg", "stars": 1, "date": "2013-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IXCvIoV5TKZo0ox46gSZFA", "review_id": "Q3F9hDmEUvpjmOdKMs-0rw", "text": "Chuck G, I have had my 09 Jeep Wrangler and my 99 Tahoe into j and l they have always done a awesome job on either one of them hats off to chuck and the boys keep up the great work!!!!!", "business_id": "XCfRPJ9UCgd1dPkzXRsjPw", "stars": 5, "date": "2015-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-ZSPer3Fb79GxWLUIq7Dfw", "review_id": "2aS7aifPvZmM5hb2ajCh-w", "text": "Dave was fabulous. He explained every thing he did to my car every step of the way to ensure I understood before he did any work. He was extremely accommodating and very friendly.", "business_id": "IlE4UouTsBEGiJ_bNrb5ug", "stars": 5, "date": "2014-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OohrOrBd6NVFJJp-kVXrBg", "review_id": "Vz2PDLNpT2WI10n6eY4jAg", "text": "Farm and Fleet is fantastic.  The things that stick out to me is when they've helped me out with problems that they weren't even supposed to and did so for free. There are some really good people working there.", "business_id": "vA8ed8BFvQxz4HFt8cHd9Q", "stars": 5, "date": "2013-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "vwn9o1Cwc1eTmYY-y4UBsw", "review_id": "-JVhHDZqwyEXSyZRAkxXYA", "text": "First time customer.   Great service.   Accurately diagnosed the problem which was a different and more expensive problem than my regular garage wanted to work on.  Saved me a few hundred dollars. Accommodating with drop off to work with Burgie.  And when a part could not be located in time provided a loaner car.  Great customer service.  Will be back.", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 5, "date": "2014-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Iycf9KNRhxvR187Qu2zZHg", "review_id": "iPrE6SqXwBqbHnlW01983A", "text": "I took a car in for a pre-purchase inspection and was glad to know i have a reasonable Mercedes service center 20 blocks from my house. They did a very good job at scoping out the whole car to make sure I wasn't buying something I may soon regret.  They also do the type A and type B services here at a cheaper than dealer rate as well.  \n\nWhen I stopped in I noticed several classic Mercedes in the stalls getting serviced and I know if people that trust them to work on those beauties I could trust them in the future with my car.  I will be back as I bought the car and I'll feel that my car is in great hands.", "business_id": "0Xnduj9w6aYHOtN_RlHUng", "stars": 5, "date": "2010-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Br9mpMhkVunsp8Un5GpYWA", "review_id": "mYsydfbtA3LgFtp5WkxOlQ", "text": "If you are looking for a good spot to get a great oil change.. this is your spot.  They are super friendly, have never tried to \"sell\" me all the extras that you sometimes get when you take your car in for an oil change.  Their oil change is very extensive as well.  You can usually grab a coupon online for $22 for the complete oil change.", "business_id": "QiI73966zZ0H6-ojFdbcOw", "stars": 5, "date": "2012-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "4sIK_74UwkKU9YQXIfgCdg", "review_id": "3FqwQGcqDHwDRW0WJEzFpg", "text": "I believe this is my 101st review and I am glad to share it with you.\n\nThree years ago, I wrote what I considered a glowing report about Ton's Auto Service.  I can continue saying good things.  They still have good service and are friendly and helpful.  I know they are not the cheapest place to go to but you get what you pay for.  When I go in there, I expect to find out what I have to do to get the problem resolved.   I don't have the patience to have to keep working with something to figure out eventually what the problem is.  To expensiv in the long run and to time consuming.  Been there, done that.   I also know I am probably paying a little extra for the van that will take me where I need to go while the work is being done and come and get me when it's done.  I can live with that, thank you.  Depends on what kind of service you want.  I have a neighbor who is tight as a turnip when it comes to money which he has plenty of!  If he's been there going for years, I am of the opinion that in the long run staying with Tony's has been worth it for me.\n\nLet's face it, you take your chances if you don't get something fixed that might need it. They aren't the place that are going to push you to get the work done.  I did notice David N's review.   If I got a bid from somewhere else that was that much lower, I'd have no problem going back to Tony's and asking the why the difference? Depends on the individual as to how to handle those things.  \n\nOne thing I do appreciate is what they did for me the last time I was in there.  I was driving the car and it seemed to chug as I took it through the gears-it's a manual..  Then it was fine as I took it up the 51.  the next day it did the same thing and I just barely got it to Tony's.  Probably should have had it towed and was thankful I didn't get stuck in the fast lane of the 51 the day before!  Since money means nothing to me, LOL,  I about passed out when they showed me what was wrong and how much it would cost to repair.  The problem was definitely there.  I didn't have the money to pay for it.  It's not every place that I would ask the owner if he was willing to work with me to pay it off over the next four months.  He didn't charge me extra.  I really appreciate him working with me as I do need my vehicle for work and he made that possible.\n\nMy car is getting 30 mpg + again.  I'm happy.", "business_id": "2fXVpii6fawN7qCL_M2Urw", "stars": 5, "date": "2012-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QOnm4v0KJzC6Q0rR8P2Dvw", "review_id": "kmGw_F-fvJrXYSWR8HhJog", "text": "After seeing the reviews here, I made an appointment at Jack's for my '87 Coupe DeVille. Ken checked it out, rotated my tires for free and showed me a CV boot that is starting to leak. Ken was excellent to work with and took the time to let me know where I started and how he adjusted my alignment. I will recommend and certainly use Jack's again when I need a service they provide.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2011-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J6znf7lizfUyLtwb-46PEg", "review_id": "l1oGr2cnxDu0_J78yVaSpQ", "text": "Complete and utter rip off!  I bought tires from them, had a flat and they were going to charge my $25 to fix it!  I called Discount Tire and they fixed it for free.  Imagine that, a company that will fix another company's problem and for no charge!  \n\nThe other problem I had with this place was that they wanted to charge me $125 to read the fault codes off of my truck when your local auto parts dealer will do this for free!  \n\nEverything about this place irks me and they prey on people who are not auto savvy and they have gotten away with it for so long.  Please stay away from this place as they are way too expensive and will probably be the place to sell you something you do not need if they have the chance.", "business_id": "Q_ntUL08gNFpCHhJALwQFA", "stars": 1, "date": "2009-01-14", "type": "review"}
