{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l-KVyeKBFWpAttOKBcM07A", "review_id": "hTRtkwuO8wEPhQfob-kh5w", "text": "The biggest breakfast in Pittsburgh, as far as I can tell - and delicious and cheap too. I ordered some mix of eggs, bacon and pancakes - and got 2 dinner-sized plates, one loaded with pancakes and the other stuffed with eggs, bacon, and home fries. Oh, and a side of toast. For under $5, if I recall.\n\nHUGE portions, all well-executed; as good as DeLuca's.\n\nI've not had anything besides breakfast, so can't comment on the burger or anything else.\n\nCramped quarters, and you'll have to wait, but when nothing but monster morning food will do, this is the destination.", "business_id": "b9WZJp5L1RZr4F1nxclOoQ", "stars": 4, "date": "2008-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KSS6v5fcZNoelu4eEZCFcw", "review_id": "EYzgB4Ok77qw5QMmIaPnlw", "text": "Sometimes I use Panera as a lunch place and sometimes I use it as an office. Either way I tend to spend a lot of time at Panera. If I am meeting someone I prefer to sit in a booth for more privacy. I like the homey feel of Panera and love it when I get to sit by the fireplace. \nThe bakery items are always fresh. It's nice that they keep the chocolate chip cookies warm. Yum!\nThe food is unpredictable. Sometimes it's good and sometimes it's not so good. The serving sizes on their soups and salads have shrunk considerably in the last year. They do have a good selection of food. They keep adding healthier options. Their recent addition is Soba Noodle Bowls. They look good but I sense a lot of sodium hides in them. \nIf you need a place to meet someone to chat or get some work done it is a good place. Food wise there are many other choices to consider around the city for better food at the same prices.", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 3, "date": "2015-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "bvu13GyOUwhEjPum2xjiqQ", "review_id": "iEbNxrS8U9uRwSJmw1kJDQ", "text": "With Pittsburgh's lack of Bagel places, Panera fits the bill perfectly. Asiago Cheese bagels are some of the best i've ever eaten. Try toasting them under the broiler then rubbing them with a little raw garlic and dip into a good extra virgin olive oil.\n\nGreat soups and sandwiches. Good people at the counter!", "business_id": "sNmQJQWEVGheCnw5Tf4Phg", "stars": 5, "date": "2012-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6cdtxncZ3th0Ip0pNcTN-g", "review_id": "hIaHQg_uAwJZmO6jag0mYQ", "text": "Pretty good.  Not food network worthy.  I would be critical of the cleanliness of the restaurant at market square, but I enjoyed the food enough to ignore it.", "business_id": "NeUf9FyCCIN4MEseNyqkXQ", "stars": 4, "date": "2010-12-16", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "miEKS-4n7WaucB9lr6ewBw", "review_id": "wECOspVU33--ULAFenTfew", "text": "Mmmmmm, so much deliciousness. Cole slaw and fries on top of food that will elicit a chorus à la Handel's Messiah from any drunkard worth her salt. \n\nGlasses of beer that won't stop urging you to take a gander at their naked bottoms.  \n\nAll the goodness of tasty food that compels writers to make exclusive use of fragmented sentences.\n\nI wanted to have an orgy with all the Primanti Brothers as a token of my gratitude, but since I almost fainted due to claustrophobia in the narrow stairwell on my way to the pissah, I suppose a thank you will just need to suffice.", "business_id": "NeUf9FyCCIN4MEseNyqkXQ", "stars": 4, "date": "2012-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "AMuyuG7KFWJ7RcbT-eLWrQ", "review_id": "-BVaT6-Oh74bU_EsTgHo_Q", "text": "My partner wanted to try a Pittsburgh cheesesteak sandwich and we read this was the best place to go. I don't like fries and I don't eat cheese, but I still loved my sandwich! I ordered the chicken sans cheese and fries, of course. The cole slaw was very good; I loved that it didn't have mayo in it and the flavor was great. Our waitress recommended that we try their hot sauce on the sandwiches and so glad we did because it really spiced it up and made the sandwich even better. My partner ordered the real deal and said it was delicious as well! We also ordered a \"small\" beer, which is a full 12 oz glass, pretty sweet deal. \n\nHighly recommend this place", "business_id": "NeUf9FyCCIN4MEseNyqkXQ", "stars": 4, "date": "2014-02-23", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "5h8l-jqqDS2Cc8pFy3vMOQ", "review_id": "v5pwSjaihEUNH2cV6Nn8Hw", "text": "Peppi's 2, Pep Boys 0.\n\nPersonal Experience: This was the second Peppi's I ever visited, back in the old days.\n\nI absolutely loved it! It took about 10 mins to make my Roethlisberger, and the whole time, the guy was telling me about the shop, about the sandwich, and asking where I was from and how I heard about it. He was fun and interesting and interested in me. It felt like I had a friend. That's the kind of service which is hard to come by these days.\n\nWhat's more, the sandwich was spectacular. It always is, but he seemed to make it extra greasy, and he put 2 eggs on there instead of 1 for me even though I only asked for 1. Some of the best service I've had anywhere, actually.\n\nI would come back to this location, or the Strip District one, over all the others. I love it. Best service. Miles better than Primanti's.\n\nAnd more info:\n\nThis place has some of the best subs in Western PA, especially the delicious and appropriately named Roethlisburger, my favourite! Yum!\n\nWell, well, well. Long before I was ever officially into food and having friends and local fans of my music pick out where I was supposed to eat in any given town I was visiting, I knew about Peppi's. That was because I was once watching the Steelers on a given Sunday (during their famous Cowher Superbowl Winning Run I think), and I saw a special on this little sandwich place making a Roethlisburger. It seemed like they put everthing imaginable on it \"plus an egg\". The \"plus an egg\" thing intrigued me, so when I finally made it to Pitt, I gave it a try.\n\nPlus an egg indeed! My word! It's actually spicy minced sausage (greasy as hell) with all sorts of goodies on it.... er... \"plus an egg\". It helps that these folks are some of the friendliest people you'll find. The Strip District folks asked for a signed CD and gave me a free Roethlisburger in return. The Downtown location gave me a free portion of fries because I had to wait about 30 seconds longer than they said I would have to wait. So really, whether you're looking for good service or good sub sandwiches (is that really a choice?), Peppi's is a great selection. I'm sure a lot of their other food is good too, but anyone that names a sandwich after the local hero and my favourite (joint) QB, is going to get my business, and since that sandwich is so delicious, it's the only thing I've ever ordered since I started going there.", "business_id": "pvGT62T6Ci1LKOS9DL42pg", "stars": 5, "date": "2011-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Fo16fiQu2ueM2v_FO819Nw", "review_id": "XtUBYDWxqT0I8rWjNIvizA", "text": "After reading all the 5 star ratings on Carhops, we decided to give it a try. My hubby is from the East Coast; therefore, he is very particular about his subs. Carhops inside looks more like an old bar with few tables for dinners. We ordered Z28 and Carhops special. Z28 is nothing but cheesesteak sandwich with almost minced meat and few onion pieces. The steaks are thin and minced. The sandwich is tasteless.   The Carhops special consists of thinly sliced Italian meats, cheese, lettuce and hot pickled peppers. The seeds from the pickled peppers over taken sandwich, which leaves a taste of vinegar and pulps of peppers after each bite. After the meal, we miss Charley's Philly cheesesteak sandwich, which is a chain restaurant. Big disappointment!", "business_id": "aIzx9R8MN9VgSSJt1jy5TA", "stars": 3, "date": "2011-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "xQs52Mg9CfccwDjZ2oxAOA", "review_id": "Eg2KPPkT5_uKFBoXwjEO8g", "text": "This place is a great place to get NY style pizza. I myself am not a huge fan of thin pizza but my husband loves it. This place offers a pretty good menu selection. They have pasta dishes, cold sandwhiches as well as hot subs. Their chicken wings are not traditional in the sense they are battered, but they are huge and tasty.\nThey don't have a website so you can check out their menu, but this third party site has one for you to review if you are calling to do a take out order.\n\nhttp://www.foodiebytes.com/menu/nc/huntersville/tonys-pizza.html\n\nAll and all for what you spend, it is a good value and the food is not bad.", "business_id": "sJtGRBWYUj013nkFA4Hrdg", "stars": 4, "date": "2011-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "nHsj0cHOiroAsmDfF50BtA", "review_id": "bx8OGQoe3MWORaVfFE9F2g", "text": "I was in Uptown for an all-day meeting and looking for someplace to go on my lunch break.  I decided to give Matt's Chicago Dog a try because I've always noticed the crowds, I love hot dogs, and I love Chicago (I'm a sucker for marketing).  \n\nThe menu was a lot more extensive than I was expecting and I felt a bit overwhelmed, like being the new kid coming into a school halfway through the year.  Everyone walking in knew what they wanted and how to order.  I, on the other hand, felt like I had to go back to Ordering Food 101.  The guy behind the counter was very friendly and accommodating, though, and walked me through the process.  I still felt stupid, but at least I got to order.  \n\nFinding a place to sit was the biggest challenge.  The place fills up during lunch.  Luckily, hot dogs (and other similar items) are usually quick to eat, so people don't stay seated for very long.  The atmosphere doesn't pretend to be a place for \"hanging out\" and talking anyway, so you want to eat and go.  \n\nThe people working there definitely have a good process, but you still have to wait a little while for your food, as everything's freshly made.  And with the menu and the list of toppings being so extensive, no two things coming out are probably alike.  \n\nI got my polish sausage and fries in good time, though, and enjoyed them immensely.  I just wish we had someplace like Matt's near MY workplace, as I'd like to try a lot more on the cheaply priced menu!", "business_id": "gpCtDCSXIoQx70cq9itfNA", "stars": 4, "date": "2008-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "xrPtS7uo5r_VJB5g3pDzTg", "review_id": "a9-3JUijpvz3x80IR3-BrQ", "text": "I always forget about Jersey Mikes in uptown because it's not in the over street mall area. This location is found in the Citizen bank building. It's super busy on Tuesdays because they run their $6.59 lunch special (regular sub, chips & drink), but the service has always been super fast. \n\nMy go to choice the the #7- turkey and cheese all the way with banana peppers added. Wondering what 'all the way' means? Well it's lettuce, onion, tomato, pepper, salt, oil,vinegar and special seasoning. It tastes awesome. They also have a bunch of different sandwiches to pick from. \n\nAdditionally, Jersey Mike's doesn't skimp on the toppings. Every time I've been here they load up the meat. There's a good amount on your sub so you won't leave disappointed.", "business_id": "6ICGve6UyGPuLaGrKQBVuw", "stars": 4, "date": "2015-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HaWkwok-Oc5H4N9dHgJP5A", "review_id": "neBmh27bFVqgYp-8QpdNgw", "text": "The woman working was far from friendly, and the bread felt and tasted like it was 3 days old. Even with this place being just blocks from my house, I don't see myself going back. BLAH.", "business_id": "c9D0yUos-jGOZaUv7SgCFw", "stars": 1, "date": "2015-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mTKWYLN9PmqF7UflA7tnPQ", "review_id": "QJKhIi2uguOS-Gm2r_C4zw", "text": "I came here for lunch with my brother to take a break from studying. While I was here I ordered the old fashioned pita burger and to my surprise it was pretty good. I was thinking of ordering the seafood platter, but instead felt in the mood for something of a burger. The service was good and I had absolutely no problem. Food came promptly and well, Showmars is Showmars. Nothing new, place is clean with plenty of parking. \n\nShowmars for me is a once in a while kind of restaurant, not my daily hang out place. Anyways, this one is not badly located. Close to school, I can come by when I'm craving for some seafood or some Greek.", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 4, "date": "2012-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "RooAxyyHr6qzJaiwMYWXag", "review_id": "l0mgfbeoE34F40r4X2Z-5w", "text": "Jumpin Java and Bistro 160 are part of each other. The breakfast there is your average breakfast. Eggs, bacon or sausage etc. They really have good french toast and waffles. \nI can't speak for the coffee since they carry one of my favorite sodas (Dr. Bowns Black Cherry.. try it, youl like it) and I tend to order that over coffee. \n\nThey also have sandwiches for lunch and a case full of chocolates that rotate seasonally. Its a charming little spot with friendly staff and a relaxed atmosphere.", "business_id": "rPQsep_POg0YATvt-6MEfg", "stars": 4, "date": "2011-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0cLhHMSrQzzBWLHVXtmIGg", "review_id": "vEoDsbeoaeFe0N6tmoVYVQ", "text": "Good shrimp jambalaya but great cornbread in a developing neighborhood.  A future spot on Food Network's Diners, Drive-ins and Dives show.", "business_id": "cpGv6ES2hzPCtCUQgipwXw", "stars": 3, "date": "2012-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sdk6OOrj9nZ8z6Ob0jcpDw", "review_id": "F7Q4b2LbKY_AVI0EyERk0Q", "text": "Now known as Milio's....different name, same sandwiches.  Yummy...and they deliver!  I dont' like pizza....so this is definitely my choice convenience food!  It sucks that they only includ lettuce and tomato...but the bread is great, which is key.  I love the Pilgrim's Pride.  They are pretty heavy on the mayo...so watch out.", "business_id": "r5S_wYdu1vKRW1k-7_yOIA", "stars": 4, "date": "2006-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OZ54qBXxuBZpTEci_u23LQ", "review_id": "xwa5oT6mQENwNwL2Iu9lxg", "text": "you cannot beat the their Ride The Rail or School of Beer nights they are awesome. When i went to school there i did them all the time and it was 2 dollars for a pint glass of anything on tap! little dissapointed it goes up each time i visit, kinda loosing the appeal of it. \n\nTheir food is actually pretty decent. Not overly amazing but pretty good as far as bar food goes. \n\nGO EARLY. If you try to go on a ride the rail night and you get there late the line is insane and it takes forever to get a drink. The worst is when its all beer specials and you have to wait for someone to get their Margaritta or fruity mixed drinks. Come on its beer specials thats why everyone is here, move out of the way!!! this is def a day drinking bar.", "business_id": "05FJCAvUFOAk8B_nIOqt7A", "stars": 4, "date": "2013-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DtTuVmtooVyMnGhwPrzLww", "review_id": "rhIX66QIrwRmpROoMzlUtQ", "text": "Was in the office a couple of days ago and a group of us went to this restaurant especially for their pastrami sandwich. For $10, I order the pastrami on marbled rye, no cheese, fries and a pickle wedge. My buddy ordered the Skyscraper, which is a stack of corn beef and pastrami. YUMMY!\nThe pastrami is cut thinly and is pretty tasty. The whole sandwich is so fresh that when you bite down, it just melts in your mouth. \nThis is definitely one of my favorite lunch time restaurants.", "business_id": "9BH18avE46LlHMvJn67MaA", "stars": 4, "date": "2009-12-09", "type": "review"}
{"votes": {"funny": 5, "useful": 5, "cool": 2}, "user_id": "5mnhUiRWi-q6nX7TkicE2A", "review_id": "ts_AFOdE6cMr9I8DnzqrxA", "text": "I don't know how this place stays in business. The menu is so limited. Would you like chicken or chicken? Chicken in a pita? Chicken on some lettuce? Chicken rolled in a tortilla? And the pita chips are bland! Yuck! And  the potato salad has something in it that is way too tangy. I've only been twice and tried different dishes both times but I just don't get anything greek about this place.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 2, "date": "2008-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y1PelgD3NvDHNoFuSM4aMA", "review_id": "4ouxLc7iu8v5NektVAYMVg", "text": "The food is always good and I Dont feel like I am ever eating bad here. Its always clean and the staff is friendly.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2015-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "urgnk_UY_T3nn0aqdeM6mw", "review_id": "O3xM8txviA3mgYjCFl_7Gw", "text": "My longtime love affair with Duck and Decanter may finally be over! I went into the downtown location for a muffin. After waiting some time and being stared at by employees, one finally decided to help me. I picked out a medium-sized muffin and at the register was asked for over $4.00. I know prices go up, but that is ridiculous. I told the employee no thanks, and she actually said to me \"No skin off my nose!!\" What has happened to what was once a very classy place?", "business_id": "wki-Qlp3OWgH0XtZ-Jz_WQ", "stars": 1, "date": "2015-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "ESrdXpT1yF7KZX52bPpnJg", "review_id": "U3UMqXxwYh0imnDpDb7Ojw", "text": "Athenian Express has a HUGE selection of things to chose from. They have salads, burgers, gyros, pasta, subs, and pitas! There are also LOTS of vegetarian items.\nTheir hummus is out of this world. They make it fresh every morning and it comes with a generous helping of their pita that they get flown in from chicago because it's some of the best pita in the country.\nI've had lots of different things on their menu and I liked each and every thing I've tried. Sometimes their fries are a little over cooked and under salted but whatever, I don't go there for the fries.\nThe gyros are great, so are their pitas. My favorite pita is the chicken picado. The chicken is always very juicy and fresh and the grilled vegetables are well cooked and pair well with the chicken.\nI know they're also doing breakfast now, which I have had once. I don't remember what I got because it was some years ago, but I remember leaving satisfied and full.\n\nI think for the price and quality, you just can't beat Athenian express. For a year, I worked right next door to them. I would stop in almost every day and get lunch and talk with the owner and his wife. They are very friendly and funny, as is their staff. I always felt welcomed. Even with phones ringing off the hook and lines out the door, they always have a smile on their faces.\nI stop in maybe once every 3 months or so and the only thing that's changed since I worked next to them is that they've renovated and made the place bigger. Some people might not like that, but they generate way too much business and they really needed the extra seating area.\n\nI love Athenian Express, and their employees. It's a hidden gem that I'm glad I found.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2012-01-25", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "M6oU3OBf_E6gqlfkLGlStQ", "review_id": "y4bscEdaOD0wThbVw62JXg", "text": "I showed up to this little place today with my co-worker. I was wearing business clothes, pressed wool pants' long sleeve shirt etc. I did not fit in or match the decor, but that did not matter. \n\nI read over the menu atop their cast concrete counter full of fun inclusions like a fork. Surprisingly there were several vegetarian options. Even the soup of the day was meat free. \n\nI had \"The Fin\" it was a tuna wrap, but not canned tuna, cooked tuna full of marinated flavor, accompanying it was a mango salsa, purple cabbage slaw and garlic white rice in a red tortilla. I opted for the jalapeno cabbage soup of the day as my included side. For $7.25 \n\nThe tuna was great despite looking over cooked, the soup was truly great. I do not like soup but I liked this soup, it was creamy without cream and had a great spice note. \n\nThe service was fast and friendly. Moreover, our food came in a neat little bread loaf tin. \n\nThere is a small patio both front and back and indoor tables and high tops. Parking is a bit tight. \n\nThis is what a lunch place should be. I will be returning", "business_id": "ZoQAOnEFnyHjSpomtfqesA", "stars": 5, "date": "2010-02-11", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "4hIgSKVFrstym0E2SEzL-g", "review_id": "X_7S9m1YlApyYe7GjvB9gg", "text": "Every time I drive by Phoenix,  I try to stop by and get me some Streets of New York pizza.  Love me some of that.  So  good.  I wish there was one in LA and I wish there was one in El Paso.  \n\nI could just see it now.  Get a few pitchers of beer, have some of their bangin wings and finish it off with a large pizza (pepperoni & sundried tomatoes and extra sauce please).  Then again, I'd probably be 400 lbs.  by now if it was here.\n\nI wonder what their other food items are like?  I've had their pasta once too.  I dont remember what it was, maybe some sort of alfredo,  I just remember really liking that as well.  \n\nI'm  not sure what it is, that I love about their pizza.  I think it's just a good combination of bread sauce and cheese.  Maybe,  it's part of my psychosis where when I first lived in Phoenix,  I was generally too poor to eat there often so it became this sort of luxury and a symbol of success every time I eat it.\n\nIt can't be that bad.  There's a shit load of them now since I've returned to phoenix.  Before, I only knew about only one or two.  I hope they haven't gotten so big that they have to cut corners on their recipes to keep up on the profits.  That would suck and I think a lot of franchises yield to that practice and just get shittier through the years.  \nWell, the last time I had it was over xmas break and it was still bangin so keep it up, Streets of New York.  You'll be seeing me again next road trip home.", "business_id": "JN2qXIuDXnV2d8WnSqd28A", "stars": 5, "date": "2010-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "DJIwm4UCnM-SOxXbARjPsQ", "review_id": "mDFp0jePGKZy9P4Fab6Nyg", "text": "Pane Bianco doesn't offer a crazy-big menu, but you won't care about a huge selection after you take the first bite of your sandwich or salad. A brick oven in the center of the restaurant ensures fresh bread on a daily basis. It's crispy, chewy and delicious. \n\nThe Market Sandwich varies on availability and price depending on what's fresh for whatever time of year you choose to dine there. You can purchase entire loaves of their famous sandwich bread to share with others or greedily scarf it down in a dark corner somewhere in a manner not unlike that of a starving badger.\n\nBe prepared for a bit of a wait during the lunch time hours of the Monday - Friday white collar work week. The secret is out, but it's definitely worth the wait.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2007-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "LaEj3VpQh7bgpAZLzSRRrw", "review_id": "_V3ZRqqPQr6kQFa47CjT2A", "text": "This place is very simple, take-out only, three kinds of regular sandwiches with another special market sandwich, several kinds of salads, a few types of Italian soda or alike, that's all! It's that simple and quick, yet always packed. \n\nMy favorite is the mozzarella, tomato and basil sandwich. Freshly baked bread from the on-site brick oven with the home made mozzarella, fresh local tomato and basil, it's that simple and delicious!!! Trust me, $8 for a big and high-quality sandwich, you'll be very satisfied!\n\nOnly drawback is that it only opens for lunch, 11am-3pm, and only Tuesday - Saturday. Maybe that's why people keep going back!", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2010-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "D5J4mKahKvUBJUTWanZwdA", "review_id": "qkzBLb5lCMl20dGIcJ93kw", "text": "Not your ordinary sandwich! \nNow I have read some of the comments that the sandwiches are over priced, or should I say more expensive than most sandwiches. Well, this isn't your typical deli. First off, if you can finish the whole sandwich I am impressed. I have a hearty appetite and I am perfect with just half a sandwich. That is another half for another meal. Talking dollars here. Now let's break down the Pane Bianco creation:\n\nFresh Ingredients: There is nothing more important than fresh vegetables, cheese and meats. Pane Bianco hits the mark on this qualification. \n\nSeasoning: Love the dressing they used on my Soppressata sandwich. \n\nBread: Good luck finding a better bread for your sandwich. Delicious and right out of the oven.\n\nAtmosphere: I like it. I know some people had issue with it, but this place is about a simple menu with a simple process to get you seated and eating ASAP. \n\nMy favorite place for a $5 sandwich. Yeah, there is enough for two meals!!", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2011-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5FwkuR5Lz9M0kPMInMZ_PQ", "review_id": "30_98le2nthq0HqWN2YdRg", "text": "This place in fantastic they pay attention to every detail from ingredient selection, perpetration, food pairings and customer service. I have food allergies and the head chef will take time to discuss any of the dishes with me. Several time they know the ingrdients as well as the name of the farm the ingredients come from.\n\nAnd Let me say all of this show up in the food. The sandwiches are some of the best I have had anywhere certainly the best in Arizona.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2012-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "u9QCaamnGl7T5lGshpsG9g", "review_id": "6y3FIX_noIZLfBAncfc-sg", "text": "Pros: cool atmosphere, good service, good location, quality ingredients\n\nCons: limited menu (3 salads, only 4 sandwiches at a place called bread), very frufru\n\nMore pros than cons on the list, but I didn't like my chicken salad sandwich even though the ingredients were of good quality. There wasn't much chicken but a lot of arugula and apples. I'm okay with some diced apple as a garnishment but there were so many that it overpowered the sandwich and made it too sweet. Not the savory taste I'm looking for with a chicken salad sandwich. Cool atmposhere, but not cool enough to go to and not be satisfied with the food.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 2, "date": "2013-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MOpA9Bs8tb_sFgGJCX72qQ", "review_id": "pmYKIhz1N-inYc1J0Kmyjg", "text": "First impressions: super hip decor. Noticed right away they had some interesting beer on tap, so I broke my \"no beer before 3pm\" rule and had a dark IPA. I had the housemade mozzarella salad, and my mother got the sandwich. Both were incredibly delicious, and I could tell the cheese was freshly-made. The basil was pungent and pristine (no holes in the leaves or discoloring), and the EVO they used was obviously fairly high quality. Yes, it's a very simple dish, but the quality of the ingredients is what counts. I give them full marks on both quality and presentation. And for the price, they gave me enough food to completely fill myself up. I left a bit bloated, but I would have definitely ate more had they set another plate of that delicious mozzarella in front of me. I seriously can't overstate how fantastic the cheese was. And they had fresh (not dried or old) whole black peppercorns on the table to grind onto the salad! They tasted almost as good as the pepper we used to get fresh right off the trees in our backyard.\n\nReally impressed with the quality of the ingredients here. It's too bad I don't find myself in downtown Phoenix more often, because I'd love to try the rest of the menu.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2015-01-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "F21azNBoXB8c6zorMz0jaw", "review_id": "FJsDlN1lHDvEId1M8QT4fw", "text": "Remember the Cheers theme song \"Where Everybody Knows Your Name\" ????\nMaking your way in the world today\nTakes everything you got\nTaking a break from all your worries\nSure would help a lot\n\nThis is THE ONLY place I go in Phoenix and they remember my name and ask about my husband by name. Now, THAT is impressive!\n\nStan is a wonderful guy and runs a fabulous business! We have ordered many platters for business events and they have been done perfectly and on time EVERY SINGLE TIME! It's hard to find anyone that consistently good.\n\nThe meat is fabulous, the sandwiches outstanding and the prices are wonderful. For instance, the cheesecake is $1.69. I told Stan he could double that price and no one would flinch about paying more. He said, he makes a profit at $1.69 and he is happy with that. WOW!\n\nI can't rave enough about this place! Try it, you will love it!!", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 5, "date": "2012-12-30", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 1}, "user_id": "gq_G5VCDziyEV2-bzGuqzw", "review_id": "rOCtltpYSLCm-oP0A-d0Ug", "text": "I feel basically the same way as Stevey; one problem, we had a roach crawl across the table and behind the picture frame on the wall (although, it wasn't too bad... the picture was of a heavily mulleted Italian man circa 1981, though I see that being insult to injury to those less appreciative of bad 80's fashion) last time. BIG turn off. The man won't go there with me anymore. I can't find a better chocolate egg cream though...", "business_id": "PxeX1M8WtyPxX1MuuGIh-g", "stars": 3, "date": "2007-12-11", "type": "review"}
{"votes": {"funny": 8, "useful": 9, "cool": 8}, "user_id": "fYuX1PTENpzA7uMyFQzOsA", "review_id": "pblBx31sJw5CXf5jKugyLA", "text": "A Jewish girl walks into a (oh, wait, I am writing a restaurant review and not a J.A.P. joke)....\n\nWhen Scott's first opened many years ago, it was really good and had a lot more competition than it does now. In those days, there was Katz Deli, several Miracle Mile locations, Chompie's and a few other ill fated places (anyone remember Hollywood Deli?). I currently live in one of the best food meccas of the West Coast and can't get really good Jewish deli (Saul's is not great folks, and no, I have not tried Miller's yet). \n\nWhen Mom and Grandma picked me up from the airport, I had suggested we stop at Scott's to give them a try on the way to Sun City. None of us had been there in several years and I was really excited at a prospect for a delicious hot pastrami sandwich on rye. We got there, walked in and I noticed that the place itself looked a bit run down and dare I say, a little dirty? The owners are the same but the guy behind the counter who used to be friendly and Hamish just sat there like a schlub. We were directed to a table, and I immediately noticed how large their menu was. I ordered my sandwich sadly assuming that my regular hot pastrami would be (a) HOT and (b) on Karsh's rye since Karsh's is right next door. Neither was the case when my sandwich arrived and the pastrami was not delicious and I asked the waitress if I was mistakenly given the \"lean\" type of pastrami and she said I was not. Mom had a tongue sandwich and thought it was \"okay\" but she is not as picky (bitchy) as I am and Grandma had blintzes which did not look homemade but that of the frozen variety (I hope I am wrong here). Service was fair. Not warm and not quite the NY attitude that passes in these types of establishments.\n\nAfter our experience I will no longer suggest Scott's and will have them drive directly to Chompie's.", "business_id": "PxeX1M8WtyPxX1MuuGIh-g", "stars": 2, "date": "2011-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f6AFwpSdfYMLnEHHJRHd6g", "review_id": "3rP93BXX68tZKVA9XqUVWQ", "text": "One of my favorite sandwhich shops EVER. OMG yum come in with an appetite, empty stomach, and loose clothing bc the portions are incredible. Reminds me of back east. Be starving you leave satisfied.  The cooks in the back are amazing and are always curteous!  Try the Philly.  My favorite is Scotts rueben.", "business_id": "PxeX1M8WtyPxX1MuuGIh-g", "stars": 5, "date": "2015-02-05", "type": "review"}
{"votes": {"funny": 8, "useful": 10, "cool": 8}, "user_id": "_uL7OiQSfNsCd60DrAf7qQ", "review_id": "DclFMxC5h-Iv7l2kUIXQDQ", "text": "I must say I can't believe I have not yet written a review on The Duck yet. As literally one of my favorite places in town one would think it would be at the top of my to do list. Maybe it is my secret desire to keep it a secret, as best as I can, so that it does not turn into a zoo everyday and I can't get my yummy sammies. \n\nIt is also extremely surprising to me that some have gone to lengths of posting a negative review of The Duck. It seems that in those cases they are wanting The Duck to be something it's clearly not; a mainstream-mass production-delivary running-squeeky clean-just-like-every-there kinda place. If that's what you are looking for then I would suggest going to AJ's, they might be a better fit for you.\n\nDuck and Decanter has been around for longer than I have been around. They have won award after award for the best sandwich in town. I am surprised Kanye hasn't busted in on a subway commercial and told Jared that he would let him finish, but Duck and Decanter has the best stuff EVER! It has a homey feel, that makes you almost say (as Jeff L. put it) \"Am I still in Phoenix?\" \n\nThey have daily soups and special sandwiches. Their cheese is out of this world, the best provolone I have ever had for sure. They slice all their meat in house and very thin, perfect! I would tell you what sammy is my favorite, but that list would go on way too long. Turkey on a croissant, bree with roasted red peppers and prosciutto, garlic chicken salad, BLT.... \n\nThe Duck is the perfect spot to have lunch out on the patio on a sunny Saturday or Sunday. They have a musician playing music most of the time and sometimes even have cute little farmers markets and art fests. It is perfectly tucked back in the shopping center with Sports Authority shielding you from the hustle and bustle. There is a fun grass area for pets and children to run around on. They also have some great knickknack shopping available to pa-ruse while you wait for your food. They have all kinds of coffee, tea, dishware, cookware, marinades, candy, drinks, wind chimes, magnets, jewelry, specialty gifts, and so on and so on. You can also call ahead and reorder to avoid the sometimes very long line. \n\nHave fun!", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 5, "date": "2010-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HsFO3PZT6MVty56IJ8lDIg", "review_id": "fLd_V1N_Qb051-tvjzxWPQ", "text": "I was a fan of this place 10 years ago and moved out of state. I recently moved back and was excited to take my partner and out of town guests to this eatery!  It was awful, long wait, skimpy sandwich, loud music on patio, so loud and somewhat abrasive when the singer talked to the audience. I couldn't hear or talk to the person sitting right next to me.   This was the 29th and a Sunday brunch.  Disappointed, will not go back, especially since there are so many new and fantastic eateries in Phoenix!  You can't rely on a name, Duck and Decanter, your poor service, etc will catch up and you will not survive.  My advice to all who ask,  where is a good place to eat, I will say not Duck and Decanter!", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 1, "date": "2014-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x7QYSYyc_x63-61Z9SB8jA", "review_id": "WeLCViRDjtZuFdM1juKC8Q", "text": "I love this Pizza place!!!!!I had the white pizza and it is amazing!!!The only set back is its kinda pricey compared to other pizza joints but it is worth it for the quality of the pizza!!!", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 4, "date": "2011-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dqmXlUQyDh6d5U2_Zjb-Iw", "review_id": "OaDfd0h8Oi03aRuVV7mK5g", "text": "I ordered a sausage pizza. It was delivered on time . However the pizza was cold and  I struggled on eat the dough even with a knife.  Very disappointed.  We order from them quite frequently", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 3, "date": "2014-12-23", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "2aP_nyjm4f4rw-vOOippHQ", "review_id": "r1xA3y_yNjEYBl2yqDT5IQ", "text": "I am one of the not so \"rare\" anymore born and raised in Phoenix, Az.  My favorite place to eat has always been the Miracle Mile.  This is one of those places where I always vow to try something new, but upon entering-go right for my favorite (the pastrami on french).   Other family members swear by the \"straw'.  I have been eating here for 30+ yrs. and the product has NEVER changed.  Truly amazing!  My husband, from New York City, loves this deli and says it reminds him of home.   A huge thumbs up!", "business_id": "fmuj7u1gflmEjW-h0v9bwg", "stars": 5, "date": "2008-02-27", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "YPwFl3RCRwr-kyN-890STA", "review_id": "dVcUya_VPJE6VmOAv9Nb2Q", "text": "Decided to stop in for lunch today since I wasn't totally sure what I was wanting and knew I'd find something here. I decided on 1/2 of a pastrami sandwich with mac & cheese (it was a special today) and fries since my 1/2 of my sandwich comes with two sides. It was still a bit to much food but that's ok. Service is always great and it is always very clean. The staff is always friendly as well. Will certainly keep this spot in mind again for lunch soon.", "business_id": "fmuj7u1gflmEjW-h0v9bwg", "stars": 4, "date": "2015-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FxxYCRPcpd__yhRRmmtyMQ", "review_id": "0debsLoqxfz8MfByyV6rCw", "text": "One thing about Phoenix is that it's near impossible to find French food, and good French food at that. Well, look no further than Au Petit Four. I'm French, so I've got to admit that I've got a bias for eating at a French place that serves real French food by French people. The owner is really cool and makes sure that everything is tip-top while you're eating. To be honest, everything is pretty pricey but it's totally worth it and I don't think that there's such a thing as cheap French food anyway.\n\nBe sure to check out the quiche lorraine and to try one of the eclairs. The only thing that is painfully missing from this place is having a stock of Orangina in the fridge, but c'est la vie, non?", "business_id": "wftoNIA0Q8nX-Da47psBCA", "stars": 5, "date": "2009-02-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "sNfkI6qnPQ0ZYRRbMeQm8w", "review_id": "w0vg4vK7x0Hg9DsPE5hmxw", "text": "The pizza has really never been any good but at one time it was a pizza and wings combo at a decent price. At this point, it's just overpriced greasy food. Bummer.", "business_id": "VWcaFOSFcDwmFquycBzFyQ", "stars": 1, "date": "2013-01-08", "type": "review"}
{"votes": {"funny": 5, "useful": 2, "cool": 1}, "user_id": "dfprRWlHx_GRUyCY5vmCbQ", "review_id": "AyyxxZW3gN4mdI2IBmqz-w", "text": "There is one simple reason to go to Slice of Sicily besides the fact that the pizza is better than Mamma Mia's: the waitress is awesome.\n\nA brassy skinned, raspy voiced spitfire of a straight-shit-bitch server will unhappily take your order, and bring it to your promptly.  You'll listen to her answer the phone with a sound that is a medley of Kathleen Turner, Diane Rehm with a touch of one of those women with a hole in their throat from smoking.  \n\n\"GOOD AFTERNOON SLICE OF SICILY\"\n\nIt's comical in the best way, and I both admire and respect this woman for running the tiny, four topped gem seemingly on her own and without regard for the comfort of her customers.  She is, in my eyes, sort of a bad ass. \n\nAlso, the pizza is not bad, the prices are fair, the salads taste fresh and the place is bright and welcoming with comfy hotel room art and a steady flow of people getting their orders to-go (perhaps to avoid my hero server).\n\nI pay attention to the service, I do, and while normally I might scoff at her unpleasant attitude and smoker's voice, for some reason I find her, and this place, a fascinating destination for a cheap pizza lunch and an interesting experience.", "business_id": "j0Uc-GuOe-x9_N_IK1KPpA", "stars": 3, "date": "2011-01-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Dw6wrTR7pcorzTPzOzbYow", "review_id": "CfjWasfkFqzBcSsLaYFgYQ", "text": "I was having a total freak-out-fest bitch-fit because I had skipped breakfast and taken medication on an empty stomach on my way to go rock climbing.  I needed to eat something, anything, now!\n\nI saw Einstein Bagels and pulled in.  I had never eaten at any Einstein Bros. before but I was super happy with my decision.  I got a egg and cheese everything bagel.  It hit the spot, the staff was friendly and quick.  Everyone working on Friday morning took care of business and were hustling out food to customers and just getting it done.", "business_id": "5Js9G0axfWhbYlB9UgXLww", "stars": 4, "date": "2015-12-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "pa5gsr0WKtGNooP51HaUlQ", "review_id": "3iZDMajAA-lliLRwWC1gbA", "text": "I have been eyeing this place for a while and finally decided to stop in. I stood there for about 5 minutes while the two employees were talking to each other and just thought they were finishing an order or something-  finally I asked can I order-  the woman said  go upstairs for food-  I said ok  I thought weird but let's go upstairs-  it was a different place upstairs and it was a bar- when I came back down stairs- they turned off the lights and locked the door- \n\nThis was to say the least a crappy way to tell someone you are closed,  lights on, door unlocked, and I was inside the establishment.  Obviously they have enough customers because they didn't need or want my business-  \nJust say we are closed, better yet lock the door and turn off the lights before someone can go inside !", "business_id": "S8R5c7-plWe3NtmijYAJvg", "stars": 1, "date": "2015-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "m1JyW1cYh3IPVUT-dkAJnA", "review_id": "TNtfzWDn0hM365xieLdlcQ", "text": "Nice guys, but that doesn't help the pizza taste any better. The slices are reheated in their oven before being served to you, the crust is rock-hard and has a bit of a cardboard taste and their sauce and cheese lack flavor. The portion size is decent, but large portions of subpar food is just more subpar food. Disappointed in the quality, and the fact that they charge you for refills of your drink and nickel and dime you for a small, pre-measured, and awful tasting side of ranch dressing, or other condiment. Not impressed, nor a fan. :-(", "business_id": "GvwDppcJLm9lso9iS2hSIw", "stars": 2, "date": "2012-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nl4s4jCbuLTl2hL2dL1sKg", "review_id": "YqRhTRE8PYnWlYwfkeOzNg", "text": "One of the best 'za joints in the PHX. \n\nNo corkage and BYOB so the pizza wont be the only thing that is deliciously sauced... cheesy... my pun not the pizza... well the pizza too. \n\nBoth the thick crust and thin crust are amazing, i prefer the thin. Large sausage, onions, and shrooms with a few cheap bottles from Safeway across the street = a night of fun for all your friends.  I have NO idea what people are hattin' on the 'nato's for, it is nearly perfect pizza. They also have great huge grilled sandwiches and fresh salads.", "business_id": "YldXB1hRpnE1CWLF3mvgpQ", "stars": 5, "date": "2008-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "jnhnClOy9H2_MUOK59MFsw", "review_id": "mm_n2V1xybSUbCNaQ6iF9Q", "text": "Pretty damn good. Recommended by our hotel's bartender, and you know that's good advice!\n\nPizza toppings were fresh and tasty. Thin-ish crust, cooked to be a little crunchy with lightly browned cheese. Zesty, hearty homemade marinara sauce may be the X factor.", "business_id": "YldXB1hRpnE1CWLF3mvgpQ", "stars": 5, "date": "2012-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b2XPhXPQ41qWysIK6RTsFw", "review_id": "J6ce9XMIMVcmT7eu4yjtDQ", "text": "I had a dark roast over ice with light soy milk because I am on a no sugar or sweets fast and it was pretty good.  I really wanted to try their banana cream latte, but could not have the sugar. Oh well, I will try to go back when I can enjoy some sweets and try their flavored lattes and pastries. \n\nThe customer service was stellar and the inside of the coffee shop was filled with unique trinkets, etc.", "business_id": "4eFIVmbeCvJGCrhzmd-VYA", "stars": 4, "date": "2013-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "aHKSvKzfpwfTlu2dMJkzSA", "review_id": "cd0ieN_I8RgK-E106qF9xQ", "text": "Stumpy's is awesome. I used to go here a lot more often when my boyfriend lived just up the road. He's moved to the south end of Phoenix so it's no longer convenient to go to Stumpy's, but I crave it all the time and hope to go back soon.\n\nLove their pizzas! The only pizza I've eaten from there that I didn't completely love was the Philly Cheese Steak pizza. An interesting idea that suffered a bit in reality, I thought. Their other pizzas are great though! If you're not in a pizza mood, their hot sandwiches are amazing as is their chicken salad. Definitely get it with the house dressing, this was the best chicken salad I've ever had!!\n\nThe guys that work there are very friendly and always remember the regulars and treat them like old friends. Check this place out if you're in the area, or make a special trip if you're not nearby. It's worth it!", "business_id": "kxDGexkbP30fBvxVI0CzFQ", "stars": 5, "date": "2011-01-26", "type": "review"}
