{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-foPKYD1M8fNEeFgDdWdQA", "review_id": "Fb_Joz19QQvkQwoyldrzEg", "text": "It is a rude place, my doctor is Labove, she speaks very little, \nafter I told her that I want to get a Rigid gas permeable lens, she told me that I would hate them, but she would still get me a pair if I want. \n\nI insisted and was told that I have to pay $75 for eye exam and $125  for contact fitting fee.\n\nAfter I paid all of these, she told me that I will not get a prescription even after I get my contact lenses, which means I have to buy lenses from her from now on! \n\nIt is absurd! \n\nPatients have the rights to get their prescription, I may move to other places and my future doctor may needs to know my previous data!\n\nThe cold assistant told me that I can talk to their office manager about this, but she only told me that their office manager would contact me when she is available, I have no way to contact her.", "business_id": "xdbAfuSqgqnuoPvLzKjzww", "stars": 1, "date": "2015-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IJaD0LIrkIj9GKqhJzdXmw", "review_id": "KStbGT0eMYwd2foHonYwKw", "text": "I will never purchase anything from this office again! I had to call my insurance to file a grievance against this provider. I went to this office on the 27th of january with my prescription to pick out a pair of frames. I gave them all the necessary information. They told me it would take 7-10 business days for them to arrive. I later called and spoke with the optician and asked whether they could be mailed to my address in NY. It is the 24th of February and I still don't have my glasses!! They kept telling me that they sent to the NY address when I know that they didn't. These people are very unprofessional and rude. They reordered the glasses for me because I have warranty on the lenses. They called me when it arrived in the office, something they didn't do the first time. I called and the optician said that she would not send them through the post again that I have to make arrangements to have them picked up and I have to pay for them to be sent through ups. My main complaint with them is that they lied to me. I asked if they could sent it to NY, if that was something they could not do they should have informed me from the  beginning. Who has the right to be upset? Me or them? Im the one who's been suffering without my glasses and they have the audacity to get upset that I want my money back! I found a website called zenniopticals where i can get frames for dirt cheap and thats the route I'm going. I'm sure it won't take as long to receive them and when I give my address they won't send it to another address and lie about it to me when I tell them I never received them.", "business_id": "xdbAfuSqgqnuoPvLzKjzww", "stars": 1, "date": "2015-02-24", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 0}, "user_id": "Vx-d8rFVKqc8RZ5FCA4NIg", "review_id": "qKb2WJtjl9_nZYy5WlNQlw", "text": "Renovating their lobby might be paid from their new policy to charge an extra 100 dollars if you request a same day appointment as I was when my daughter needed to be seen to verify flu symptoms so she could receive Tamiflu.  At no time during the appointment was there disclosure of this new policy and I have been going there for ten years, often being seen the same day due to illness.  That is a lot of money in my household and I was very surprised by seeing it on the mailed statement.  Needless to say, I won't be making that mistake again.  I don't appreciate surprise charges that are basically taking advantage of someone being ill.  Also they didn't want to address all the issues we wanted to discuss, but wanted to reschedule additional appointments.  I think they are more concerned about billing lately than patient care.  Oh and they also prescribed an antibiotic that was over 100 dollars even after I had said I had really awful health insurance...that really blew my mind.  What were they thinking?  Be very specific and clear with them or you'll get a bad monetary surprise is my best advice.", "business_id": "2yBBmcVEbhrGrk-hAUAfJg", "stars": 2, "date": "2014-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d9E9fCGrtPgNdrWJvRpmsg", "review_id": "WFoJ8FgTo-P3aaf4eo--6g", "text": "My wife and I have been patients of Carolina Family Healthcare since 2010 & our son has been a patient since his birth in 2012. From walking in the door to smiling faces, being brought back by nurses that care, and seeing compassionate providers, to say we have been happy with our experiences there would be an understatement. \n\nOur son primarily sees their PA, Chris Jenny. He has always taken the time to listen to our concerns and make sure we understand what is going on with our sons health. And as first time parents, my wife and I have had a ton of questions and concerns! \n\nMy wife and I will see any provider that is available and have never been disappointed. Recently, I saw their new Nurse Practitioner, Maureen, and was very pleased with her integrative and holistic approach, which is one thing my family likes the most about this office.  They aren't pill pushers, they don't just throw some antibiotics at you and send you on your way. They try to get to the root of the problem. We have never felt like we were just a number or like they were rushing through the appointment so they could meet their quota like at some of the other offices we have been to.\n\nOverall, my family has been thoroughly pleased with our experiences at Carolina Family Healthcare. My in-laws are patients there as well and they have never had a negative thing to say either. I would recommend this office to anyone and everyone. If I could shout it from the roof tops, I would!", "business_id": "2yBBmcVEbhrGrk-hAUAfJg", "stars": 5, "date": "2014-12-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HmPDdx2aX4WH5PqXvIszOQ", "review_id": "NgAmzYOPJgl3RlKAW-AQ0Q", "text": "Stay Away from this place, I just witnessed the most unprofessional treatment of a patient, I am in complete disbelief of the events that unraveled in front of me. I met my significant other there for her appointment, she arrived 12 minutes early I got there on time, she had called ahead to confirm that her appointment was on time knowing that she had a sales call 2 hours later. we waited in one of the many rooms to be seen, about 30 min goes by and the door doesn't open, she sticks her head out to ask how much longer it would be and they did not know, we got the line\"he is with other patients\". 5 min later a guy in a football jersey walks in to talk with us,some kind of assistant, no tags, nothing, he is not the doctor we find out, she explains she has been sitting in their office for 50 min and wants to be seen by the doctor because the steroids he put her on are not helping with major skin irritations, shes suffering and it obvious. The football jersey guy says \" this is medicine we don't know how long it will take each patient and that this is probably not the office for you\", cant make this stuff up, now remember she called 15 min prior and confirmed there was no delays. she asked to speak to the doctor and he said the doc would be in in 5 min, 5 minutes later 2 women walk in, no uniforms, ones in old jeans and again an old football jersey the other i don't know what to say, it was surreal, they tell the patient they have a referral for her and they don't want to treat her because they felt she was being rude. We/ she never saw a doctor, was never told how long the wait would be and we sat there for over an hour like we are supposed to expect this treatment. I think this place is a front for something else something is not right. look at the other reviews. I am trying to get my spouse into Carmel Family Phys, but the doctors there are not taking any new patients, you know why, because they are awesome and they care.", "business_id": "2yBBmcVEbhrGrk-hAUAfJg", "stars": 1, "date": "2015-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EaU37r9pN8bi8irPm4gltg", "review_id": "28KEPxN810FCg4Wdvy861Q", "text": "This is one of the worst doctor's offices to visit. Not only is the staff incompetent, but they are very rude and treat you with disrespect. Their main concern is collecting money from patients and do not care about how the patient is feeling. Today I took a friend of mine, who has been sick for 3 days with a high temperature of 103, to visit  this office because he didn't have health insurance and I wanted to pay for him in order for him to receive care. They charged me $200 and we waited to be seen. Our regular doctor, Dr. Chris was unavailable and Dr. Dino was busy, so we were forced to see Dr. Kristen Spratt. Anybody who has has ever used Dr. Kristen Spratt would understand when I say she is incompetent. I guess these days anyone can become a doctor since a letter score of C in medical school is considered to be passing. That's not my point anyway. So Dr. Kristen Spratt checked my friend, if that's what you want to call it, and said that even though you have a high temperature and are very sick I cannot give you any medicine and you will have to wait and if you are still sick by the end of the week come back Monday. I explained to this genius doctor that my friend is very sick and can't wait and needs medicine and cannot come back because he does not have health insurance and can't afford to come back. So she got very emotional and denied giving him medicine. I asked to speak to Dr. Dino regarding this matter and he refused to see me. After my friend and I left, I recieved a call from the office saying that I am no longer welcomed at their office and I was in effect kicked out. Not to mention my family and I have been patients of theirs for a long time and we have brought Dr. Dino a lot of business over the past years.  I am a very sick man and need doctor care and it is very bad for Dr. Dino to refuse to see me. I am very disappointed by the way I was treated and would like for everyone to know about his office and to not go visit this very poor example of a medical establishment. The doctors here are incompetent at best and very dangerous to one's health at worst.", "business_id": "2yBBmcVEbhrGrk-hAUAfJg", "stars": 1, "date": "2015-01-22", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "EaU37r9pN8bi8irPm4gltg", "review_id": "ySuoU79H5SHzSNxY_JR_Wg", "text": "When thinking about Carolina Family Healthcare, three words come to mind: Don't go there. Believe me when I say this medical office is one of the worst places to receive care from when you are sick. Yes, they do care, but only about your money. From the doctors to the nurse practitioners, the office is a complete mess, filled with liars. After being kicked out of the office last week and told that I am not allowed to return, I received a letter from them explaining their reasoning. It stated that their reason for kicking me out of their practice was because I used offensive language and raised my voice at the staff. This is a complete lie and false accusations since I never raised my voice at any of the staff or doctors in the office or used offensive language. All I did was ask the doctor to give medicine to my sick friend, who had a high temperature and was about to pass out. I didn't use any offensive language or raise my voice. I spoke in a very calm and nice way and only urged the doctor to give my friend some medicine in order for him to get better. Last time I checked, doctors are supposed to give patients medicine in order to help them and not let them suffer. This letter proves the kind of doctors and staff working at this office and supports my point: incompetent, lying, rude doctors, who only care about getting money from you and saying they provide care.", "business_id": "2yBBmcVEbhrGrk-hAUAfJg", "stars": 1, "date": "2015-01-25", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "-_1ctLaz3jhPYc12hKXsEQ", "review_id": "yh14B6Yxw0But6gM7wlQIA", "text": "I have actually been seeing Dr. Karner for a while.  So long, in fact, that he has moved offices.  That is probably not all that uncommon.  More so is that doctors change the rules of their practices to make seeing them that much of an onerous process.  I have gone through that too.  A while back, this happened here, and Carolina Neurological rewrote their terms of service (or whatever it is called) so that if you are X minutes late to an appointment, you have to reschedule.  Guess who was X minutes late?\n\nReally, it is not that I have a problem with such a policy.  What I do have a problem with is that they said that they could still fit me in, and some X + Y (note that I did not use variable K, nor did I multiply so as to end up with K * Y, as that could result in KY, which is for another review) minutes later, I was told that I could not, in fact, keep my appointment.  And since I was already running late - if you could not tell - it just made my day that much better.\n\nThat in turn led to me trying to find another neurologist.  Yes, I am sick in the head.  But I digress.\n\nThe first could not keep the appointment on their end - the complete reverse of the problem that I had just experienced (though it still led to a bad day on my part).\n\nThe second I actually tried for the better part of a year.  Or so.  But ultimately I went back to Dr. Karner.  And when I did, I had to find him, being that he had changed offices (we covered that already, right?).  To make matters worse, since everyone loves Dr. Karner, he now goes to multiple locations across Charlotte throughout the week, making it even more difficult to get in.\n\nBut what are you going to do?  The guy is that cool.", "business_id": "1nUhZPE06iQRKI6_z78IjA", "stars": 5, "date": "2011-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Dafb-if-dxgT2KrQbKszCQ", "review_id": "hhZgXXQE0ii04rYVY6JwbQ", "text": "Dr. Wanda Spolnicki Robinson is my doctor and has been for over 20 years.  I met her on her first day at work there at MMG Uptown office.  She was young and full of energy.  That has never charged.  She has helped me through minor ailments and major chronic diseases that I have experienced.  She is very smart, energetic, caring, compassionate and professional.  I left out one important fact.  She is extremely bright and keeps abreast of all the new information and procedures that become available on human physical and mental health issues.  She volunteers every year to help the needy and works several times a year in the hospitals to keep informed on the regular procedures and problems that arise there.\n\nOne of the things I like most about her is she is a Christian.  She prays for her patients regularly and cares about their families and how things are going at home and at work.  In my opinion,  you will not find a better doctor here in Charlotte,  North Carolina.  She is a Family Practitioner / Internist and has been rated one of the Best Doctors In America year after year.  That speaks volumes.\n\nI think it is important to recognize Doctor's who are making a difference in the world and Doctor Robinson is one of those Doctors.  I feel lucky to call her my Doctor.\n\nNew Comment. (UPDATE)\nI have been with MMG for about 20 years now.  When I call in to get an appointment now days my Primary Doctor, Dr. Robinson has No appointments available for sometimes 6-8 weeks.  The staff encourages me to go to her Nurse Practitioner or another available doctor.  I say no I want to see my doctor.  I guess when you get your quota of patients you are assigned a Nurse Practitioner.  I don't know?  You build up a familiarity  with your doctor and a history of all of your tests, past issues, current issues and then you can't see your own doctor it doesn't suit well with me.  Maybe a small, more family style of doctor/practice is the best way to go. They would perhaps be more available to the patients they see. It seems like in a large practice like MMG, you seem  to get thrown around a lot over the years. I truly feel bad for leading the readers of YELP to possibly be unable to get an appointment with her, their new recommended, doctor and then be unhappy with the service.   What bothers me the most is if you can't get an appointment with your doctor they will suggest that you see another available doctor.  When you are late for an appointment if it is more than 15 minutes late you may as well turn around and go home. If you go up to see your doctor after being 15 minutes late, they don't offer any options.   No one will care why you're late,  what happened to you on the way, or anything.  They just put you down on the books as a no show.  This happened to me recently and I had a broken ankle was using a new cane to get around,  had to walk a long way in the parking deck and I was walking very slowly. When I got up to the receptionist no one cared if I was in a tragic accident on the way to the appointment, if I got pulled over for some reason, if my child got sick at school and I had to pick him up on the way which put me behind some, or if I was sick as a dog and had to pull over in order to vomit several times, or couldn't find a close enough parking space and had to ride around looking and looking for a handicap space to park. No excuses mattered that was obvious because they didn't care why I was late.  All I got was reschedule. No one knew or cared the hell that may have happened to me on the way to the doctor that day.", "business_id": "iYlGqyRNH5UYQABKsDuuDg", "stars": 5, "date": "2013-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XAQZIWgsr8NYjyWNGdE5Tg", "review_id": "RnbOWUon6GWDhtwH_vDtIg", "text": "Horrible.  Come here only if you have plenty of time on your hands and nothing you really need attention for.  Also if you enjoy being promised \"we will call you right back\" and never hearing anything from them.  There is a reason this location has such bad reviews.  They have so many appointments from uptown residents they would rather get rid of patients than see them.  My last doctor just disappeared.. No notice of anything.  I had to spend a week just trying to re-explain the little progress we had made.  Apparently the emails I had been sending to my doctor were being redirected to someone else and they never even thought to tell me the doctor had moved on.  The front desk staff is the worst I've ever encountered.  There is only one girl who I've ever talked to there who seemed legitimately friendly on the phone.  Everyone else obviously hates their job and could care less about your medical problems.  Avoid uptown at all costs.", "business_id": "iYlGqyRNH5UYQABKsDuuDg", "stars": 1, "date": "2015-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "DWGOShsF4AUZQZnRHL1-ww", "review_id": "S-bReGZtnJwinATsUqQbFQ", "text": "I have to first clarify that my rating is based on two different experiences. First, I met with Dr. Moore in July 2011 and she was great. She was friendly, knowledgeable. I liked her a lot. I don't think it's appropriate to get into detail, but it was the least painful woman check up ever. If you're local and plan to stay local, I highly recommend. \n\nHowever, in December of 2012 my parents got a certified letter saying I failed to keep my follow up appointment (which I never made) to check on my diagnosis of dysplasia. Uhm WHAT? I assumed my results were normal since I heard nothing for a year and a half. When I called to figure out what on earth happened, I found out that my results were abnormal. When I didn't come back in July of 2012 (because I moved to Boston) it flagged them to follow up with me. I guess that took 6 months because the letter came when I was home for Christmas. \n\nSo not only was the letter misleading (it insinuated I was pre-cancerous when I was not) and my results were not communicated with me, but on top of that the nurse I spoke to was outrageously rude to me. She seemed annoyed with me for being worked up about the letter and tried to intimate that it was my fault for not coming back in July 2012. She didn't seem to understand that I had no knowledge of the abnormal results or why I would be upset about a certified letter saying I could get cancer if I continue to ignore this diagnosis. \n\nNow my blood tests are exhibiting discrepancies consistent with some leukemias and I remembered this. I called the office again to ask about my medical records (the receptionist was very helpful and great!) and to have someone call me back to refresh my memory on my abnormal results. Once again, the nurse's attitude was inexcusable. She started interrogating me on my follow up care, asking why I hadn't been back since 2011 and why I thought I had two, normal results consecutively if I didn't. I had to once again explain that her office didn't notify me until DECEMBER 2012 and my last pap was in JULY 2012. \n\nLast, and this is the best part, she started questioning my current sexual information (Do you have a boyfriend? Do you use condoms?). I felt it was highly inappropriate, not least of all because I don't know actually who I'm speaking with. I'm still not entirely clear on how someone can be so rude to a scared patient, and I don't understand their follow up policies at all. Long review, but I felt strongly enough that I wanted to post.", "business_id": "jmHing2kjywBhQlZKsgD_w", "stars": 2, "date": "2013-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iBmy7fYcirpA8d94EhX5RA", "review_id": "PtqbpUonjlQeyab31881aA", "text": "I was referred to Rankin by my general practitioner when I got that great big plus sign.  My OB here was Dr. Yavorski, who was sweet, encouraging and calm at all times - well, except for my last appointment when it seemed labor was imminent (it was) - then she was appropriately excited.  If you are going to Rankin for prenatal care and delivery, there is a team of 7 doctors (although I think one of them only practices at the Ballantyne location) and you will be encouraged to meet all of them as any one of them could be on call when you deliver.  I will say that I felt comfortable with all of the doctors.  They all exuded calmness, which was important to me.  Dr. Palermo actually ended up delivering me and her deadpan wit was the perfect thing to get me through the process.  I'd planned on an unmedicated birth, and the doctors were all supportive.  It wasn't until I went into labor and had a personal change of heart that I went for pain meds and they were supportive of that too.  I never felt like I was bullied or strong-armed into making a choice, and whenever I had questions they were answered to my satisfaction.  My pregnancy was pretty uneventful so I never really got to see them work in a crisis though. These doctors deliver at Presbyterian hospital, which is state of the art.\nWell after everything I came out a healthy mom to a healthy baby boy, so I'm at least a fan.", "business_id": "8BOcD4EO-9hhEWps0fXm6g", "stars": 4, "date": "2012-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oDLrKKrDFju_JTj-PEieGg", "review_id": "r-6Mnr04YRroZwerL5WQow", "text": "I'm constantly amazed by how rude the receptionists are. Not to mention my doctor, Dr. Palermo, left the practice and I never got a notification. If seeking an office that cares (even just a little bit), avoid this group.", "business_id": "8BOcD4EO-9hhEWps0fXm6g", "stars": 1, "date": "2015-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I9sYAaO5eXoobz2_XmUBFA", "review_id": "yMj5ihgLUwO3S6sBNZo_YQ", "text": "I had been referred to Dr. Svendsen at Rankins Women's Center several years ago by a friend. I am so happy that I decided to switch to this practice and specifically to Dr. Svendsen. He is the only medical doctor that I have every been to who actually sits down and listens to your concerns and addresses each and every one before you leave.  Although there is often a wait time I'm confident it is because Dr. Svendsen is being as thorough as he can be with each and every patient which everyone deserves. To try to bypass the wait I try to make my appointments in the mornings when I can.  The receptionists and the nurses have always been very nice to me and very helpful and responsive when I have had questions about health insurance and coverage.  I am due March 2015 and very confident that I am receiving the best care possible. Now that my husband has met Dr. Svendsen he agrees that there are not many doctors out there that truly care like he does. I would recommend Dr. Svendsen to anyone looking for a new OBGYN.", "business_id": "8BOcD4EO-9hhEWps0fXm6g", "stars": 5, "date": "2015-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "83avt8bD38s79XhA-n8Ezw", "review_id": "xz3euZgqVB0Da6dm7BMX7Q", "text": "The receptionist, Lillian  (or Vivian),  whatever her name was, she was VERY rude!  I'm not  planning on being a patient here if I don't feel welcome before I even step in the door. Fire Vivian (or Lillian)  whatever her name is,  and hire someone who doesn't have a problem doing their job. I have insurance, good insurance, so it's not like you guys aren't getting paid. - ANNOYED and VERY disappointed.", "business_id": "8BOcD4EO-9hhEWps0fXm6g", "stars": 1, "date": "2015-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "KMu41_H5Fd63dAk4DmJlqg", "review_id": "UOEwhSDmVbfn0Tn90Cnq5Q", "text": "Park Road Location:  My 6 year old was in the need of some care from and ENT and I tried to find some reviews online and there were not that many so I thought I would help out the next Mom by adding my review. I felt the customer service at Charlotte Eye Ear Nose & Throat Associates PA was fantastic from the point of my call to their office to schedule my visit, to the desk when I signed in and signed out. We saw Larry the PA and he was so great with my 6 year old and my 3 year old who joined us for the visit. The advise we were given and information sent me away that I got a proper diagnosis and the information I needed to help treat my son with his condition. I have no complaints and hope this review will help you in making your decision.", "business_id": "UOLNw0-7GjxomFQiHUXisA", "stars": 5, "date": "2009-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BIrzgkZDgslQXkjn0jvUBQ", "review_id": "w5Mc6eBA5LPwuOKJDY_xLg", "text": "My daughter has been seeing Dr Saunders for 6 years now, and he is kind, gentle, patient, and has taken very good care of her. The only complaint I have isn't about him at all; it's about how hard it is to get this practice to pick up the phone or return calls in a timely manner!  Reschedule in person right after your appt even if it's a year away because you can forget calling.", "business_id": "UOLNw0-7GjxomFQiHUXisA", "stars": 4, "date": "2015-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TZTW8Jhq6SmMwkhRpKf7Ig", "review_id": "o25YBvSYEHcY3lL9Gz-QRQ", "text": "My son was referred here from our family doctor. My son who is totally affraid of needles and the procedure did amazing. His ingrown and infected toenail was removed and no tears were shed.  In fact laughter and much joking around kept him very happy. Still very professional  even tho there was joking going on. I would recommend this office to anyone with a squeamish child!", "business_id": "ByctOq-Af6lAZxROXkXTXw", "stars": 5, "date": "2015-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "cxTh9xxqbs-m8Paq6jAumg", "review_id": "-aggdIiVWoS0HlJG_ecdlw", "text": "When I get sick, I kind of get happy. Not because that means my diet will most likely consist of soup and ice cream since those are my sick comfort foods but because of Carmel Family Physicians.\n\nI've been going here for the past 5yrs and could not be happier with the treatment I've gotten. From bronchitis to strep throat to sinus infections to upper respiratory infections to food poisoning--they've helped me with almost everything under the sun. They are located right near the CMC off 51 and 485 and have very convenient hours---I'm talking until 8P on weeknights plus Saturday and Sunday walk in hours. In the past I've been able to call in for an appointment the same day which is pretty much unheard of at any doctor's office I've been to. They have a number of doctors and physician assistants there Clint Price is awesome, so see him!\n\nNice staff, recent magazines, in and out within 20 minutes. Yeah, I dig.", "business_id": "siixOX00BhEkUlKg3n06tA", "stars": 5, "date": "2011-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ybG5P8QlP5rA58yd7NRqDg", "review_id": "EKI0xGaEALh6i0Oia8VGkA", "text": "I've been a patient and fan of Carmel Family Physians since the early 1990's.  I've been under the care of (the best Physians in my opinion ever ) Dr Daniel Sappenfield. He is a patients doctor. He listens and takes time with you and genuinely cares about your well being. Dr Sappenfield, and the entire staff at Carmel Family are professional, competent and efficient in meeting your health care issues and needs. \nFor existing patients they also offer Sat & Sun appts. \nThen there's the Pharmacy staff that are also the best - you can't best this team ! \nTwo thumbs way up !", "business_id": "siixOX00BhEkUlKg3n06tA", "stars": 5, "date": "2015-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "66HproGpjfM6nLvn_EI67w", "review_id": "kt2TmqFFjEvZGQatGXYhjA", "text": "I have been seeing Dr. Larsen for more than 6 years.  I can not begin to tell you how happy I am with his practice.  I manage a medical practice of my own and belive me I know how difficult it can be to provice quality care and good customer service.  The have accomplished it every visit.  Wait times are always a possiblity in a medical facility, but they have never been an issue with Dr. Larsen (usually 5-15 minutes).\n\nDr. Larson is extremely personal and professional.  I never feel like a number with him or his staff.  He has gone out of his way to make sure I've gotten the care I needed, even when I had a lapse in insurance coverage.  \n\nHis office is 20 minutes from my home and 45 minutes from my work.  I gladly drive there and will continue to do so.", "business_id": "R-ff6qTsHb6HC7wQ2Wl5bg", "stars": 5, "date": "2012-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iQQSSMjPfnVdySlFKDRyng", "review_id": "as7kOc_dXVZuAxObe5G0Ww", "text": "This is an excellent urgent care office to go to if you have a need for immediate care. I went there with a severe sinus infection and cold, the front desk was efficient and quick. It is a very friendly office and the Physician Assistant that I saw there was kind, knowledgeable, and a good listener. She diagnosed my problem quickly, asked me if I wanted an additional test for strep (versus just giving me one) and provided me with the appropriate medication. Being new to the area they also gave me a great doctor referral for a general practitioner. I am well on my way to recovery and never had such a great experience (if that is possible) at an urgent care in California or North Carolina. I would not recommend anywhere else, great hours 7 days a week.", "business_id": "6YSHRi2-qYYCiZ1CMXvn7w", "stars": 5, "date": "2011-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0TAOlKdgeX3RDJ3FYezGeQ", "review_id": "yu4u9w7xZ4-Ag_rR0kqS3A", "text": "Awful awful awful!!!!  I have never experienced such RUDE nurses or doctor in my life. I will never go back here again. I'm not sure how they have received positive reviews.", "business_id": "6YSHRi2-qYYCiZ1CMXvn7w", "stars": 1, "date": "2013-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gLcyTNCv76JJHhoQO2UTKQ", "review_id": "4-_4wOxttEV-NjqQ4oE5dA", "text": "I had my first ever eye exam at Providence Eye & Laser Specialists, and they were absolutely incredible. Everyone there was extremely patient and pleasant. They walked me through the entire process, and I believe I received excellent care. Dr. Engle was excellent, and I look forward to continuing to work with Providence Eye. I never imagined that I'd be thrilled about going to an eye doctor, but that is the case with this wonderful office!", "business_id": "Z5HWuClqy4YZzvVrTRUEuQ", "stars": 5, "date": "2013-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1BxW_M7nNnHj6Ph-kYecGA", "review_id": "QZ0Kjbj-BMci3YEbdIC1ww", "text": "- Excellent staff\n- Excellent service\n- Excellent patient care\n- Excellent technology\n- Excellent EXPERIENCE!\n\nNo doubt about it, Dr. Mozayeni will be my #1 recommendation for anyone considering LASIK surgery.", "business_id": "Z5HWuClqy4YZzvVrTRUEuQ", "stars": 5, "date": "2014-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1o6-atv7sTtGobRMm6EIYg", "review_id": "RhkM187TemHR7aFwh1Vdug", "text": "One word - CLASS.\n\nThis whole operation is all class.  \n\nDr. Mozayeni is a wonderful doctor and makes you feel completely comfortable and confident in the procedure.  I looked at other places for eye surgery and you didn't even get to meet the surgeon prior to surgery, not to mention the pushy staff and low rent office space.  Having that touch point prior to surgery definitely made me feel more comfortable.  After the surgery, Dr. Mozayeni personally called me to make sure everything was okay; like I said, all class.\n\nThe offices, personnel and care were all world class.\n\nWhen choosing an eye care professional, I didn't want to go bargain shopping.  I felt that when it came to my eyes, you pay for what you get, and I'm extremely glad I chose Providence Eye & Laser Specialists versus the competition.  Ask yourself are you a Neiman Marcus person or a Walmart person?  I'm definitely a Neiman man.", "business_id": "Z5HWuClqy4YZzvVrTRUEuQ", "stars": 5, "date": "2015-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Zk50dqNQ8q6s_72LamUL-g", "review_id": "cCaebs42fNnJhp3Xwa438A", "text": "Choosing a pediatrician for your little one is like like choosing a potential spouse--it's no small task!  You want someone who will be loving, caring, attentive, have time for you when you need them and make you feel special.  While pregnant, I asked any and every mommy I came across who their pediatrician was and I consistently heard great things about Arboretum Peds.  I have been very pleased working with them!  They fit us in when our daughter was only two days old for her first appointment and we've never had trouble getting appointments.  Our doctor is knowledgeable, gentle, and very kind.  She definitely makes me feel she cares about my daughter and how things are working out for our new family.  After our first doctor's visit we received a survey to ensure we received excellent service and were happy with our experience, which shows they are committed to their clients.  The nursing staff and receptionists are always extremely friendly and kind as well.  The nurses are so sweet and it is apparent they enjoy what they do as they giggle, coo and play peekaboo with my daughter during her checkups.  The waiting rooms have plenty of toys and books for the little ones and they even have a separate waiting room for sick children to help avoid sharing germs, which is of course appreciated when you're bringing in a healthy four month old!  Be prepared to spend some time in the waiting room prior to your appointment, but it's worth it for the best!", "business_id": "b4NC-S522RPFw6CLqqOyzg", "stars": 5, "date": "2012-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "e2j5nTQ2dnkB--pJakcUSA", "review_id": "TZcKZAmDEjU9UQx4qDgSDw", "text": "I absolutely love Arboretum Pediatrics. All of the staff, nurses and doctors are fantastic. The waiting area is separated for sick and well children and the space is bright and welcoming. We have never had to wait more than 15 minutes to be called back. In fact, it's usually less than five minutes after our arrival. Once we're called back, after the nurse has weighed, measured and taken down any additional information she needs, we normally wait a couple of minutes for the doctor to come in, not long at all! When we were trying to decide on which practice to go to, we toured a few but were especially taken by Arboretum Pediatrics' organization and impressive and highly qualified physicians. We have seen several doctors at the practice and love them all. They are so nice, so friendly and always ask me, as a mom, what my gut tells me and how I feel. This is something that has made me appreciate this practice so much more. They understand that while what they're treating our children for might be something they see regularly, it can be terrifying for us as parents. They allow us to ask all the questions we have until we feel we have the answers and have been adequately informed. After we moved to Charlotte from California, my son's primary doctor took the time to go over the California vaccination schedule with me and compare it with the North Carolina schedule. He spent plenty of time talking about each one and making necessary adjustments, taking into account the amount of time we still spend in California. We are thrilled to have found such a wonderful practice to take our son to. I wish I could give them 10 stars. It is clear they have my son's best interest in mind. They're all so caring, attentive, and are truly in the business of healing.", "business_id": "b4NC-S522RPFw6CLqqOyzg", "stars": 5, "date": "2015-02-18", "type": "review"}
{"votes": {"funny": 1, "useful": 7, "cool": 8}, "user_id": "CvMVd31cnTfzMUsHDXm4zQ", "review_id": "EJPoihsq9Y9-OPSNBzUKEg", "text": "Since becoming parents, knowing the value of a wonderful pediatrician is that of knowing a real-life Gandalf The Grey. Thus, it's no mystery that I'm about to say these folks are freaking magic. \n\nWe've had a slew of normal appointments with Arbo Pediatrics and all have been so easy, relatively pain free for our son (and us), and relatively swift. The Pediatric  Doctors and nurses we have seen have all been so genuinely nice to us and especially our son. They have all been cheerful, thorough, extremely helpful in understanding the wonderment of baby growth, and other simple pleasures of parenthood. \n\nOur most recent visit was that of the unplanned variety. Our son developed a bit of cold from who-knows-what and eventually turned into Croup (lots of nasty wheezing, coughing, barking sounds, and constricted airways). I called around lunchtime and one of the Pediatricians saw us just after 2pm. She a good look at our son, listened to his breathing, and suggested we go for a steroid shot to help with the inflammation in his esophagus. Within a matter of hours, his breathing had improved. No wheezing during his naps, and the next morning he was relatively normal. So thankful they were able to see him on such short notice AND help him with a swift recovery. \n\nAbsolutely over the moon for this practice and so thankful for everything they have done for our son. Happy customers here.", "business_id": "b4NC-S522RPFw6CLqqOyzg", "stars": 5, "date": "2015-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "CvRv3ON9blRxoWGy_0c5qQ", "review_id": "YrEgHXe3aMiror6qxDTpgQ", "text": "If you make an appointment be prepared to wait at least an hour. They are always behind. They say 'we will be with you in a little bit.'  Make sure to ask how long a little bit will be. They could at least offer free wifi. I'm glad I only have to come 3 times a year. Good luck to all who come to Horizon", "business_id": "KgdLtB46PtgXV37IXpuu8w", "stars": 3, "date": "2014-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CngGHOuTkSkwaKlj0CljHg", "review_id": "xx8YNoTXSTTZrId9sBRadQ", "text": "The facility is new, clean and neat, and more importantly, everyone is very friendly and nice - from the people at the front desk to the nurses who takes your vitals to the doctors. I have seen both Dr. Bartee-Allen (female) and Dr. DeSena (male), and both were incredibly nice. You hear so much about doctors rushing through exams, but they both took the time to sit down, chat with me, make sure all of my questions were answered, and talk through my options. They are sympathetic and informative at the same time. \n\nThey have an urgent care within the same building, and it is staffed by their own doctors, which is nice for the times when you decide you need to get checked out right away but still want to go somewhere familiar.", "business_id": "SYASUMcTwhVB3TnfeoUZJA", "stars": 5, "date": "2013-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "txFiQcsDnXxV-0IhR8Ymww", "review_id": "jbi7ApYfjpjscYGFqkEXJw", "text": "I had a fraxel treatment done here to remove some hyperpigmentation.  Along with the $1000 treatment (and this was 5 years ago), I also had to purchase the Obagi Nu Derm system.  I was told that the treatment felt \"tingly\" and that I would experience some \"bronzing\" afterwards- like a mild sunburn, but that I would be just fine by Monday (treatment was on a Friday).  \n\nFirst of all, the treatment felt like they were rolling a rolling pin covered in hot needles all over my face.  Anyways, I went home, washed my face with the appropriate product, put on some ice, and slept with my head elevated per their instructions.  \n\nThe next morning my face felt like orange peel and was so swollen I couldn't even open one eye.  I was completely unrecognizable.  Over the next few days my skin started massively peeling and crusting.  It was excrutiating to smile, chew, talk, etc.  I wiped away built up scabbing with sterile water and used antiobiotic ointment on the open wounds, but other than that I could not/would not touch my face- the exfoliating and bleaching obagi system was out of the question.  Eventually my face healed, but I couldn't go out in public for almost a week.\n\nThe kicker? After all that, the treatment didnt work at all.  The hyperpigmentation came back worse than ever.  Of course, when I complained I was informed that this was actually my fault for not following their recommended skin care regimen.  6 months later I went to a dermatologist who prescribed triluma.  1/10th the cost, very little irritation, and it actually worked.", "business_id": "1IxCNVVW9aKbK3BfQpI7eg", "stars": 1, "date": "2014-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "rouEJREISaR5k6TDeDnN-w", "review_id": "_0ztpRduOIe7E9azl4nv6w", "text": "I have been a patient of Doctor Johnstone's since approximately 04/2007.  I have seen her through thick and thin, joys and sadnesses, 2 breast lump scares, abnormal papsmears, etc.  No matter what troubles and health concerns God presented me with, Dr. Johnstone was there to calm me, lend an ear to any and all of my concerns, and to move forward with appropriate treatments.\n\nI was overjoyed last May to learn that my husband and I were expecting our first child.  I could not wait to go to Dr. Johnstone's office to tell her the news & talk with her about the prenatal care that was to come.  Unfortunately, due to the fact that it's a 45 minute to a 1 hour drive to Dr. Johnstone's office, my husband asked if I could please find a doctor closer to our home in North Scottsdale to go to for the prenatal care as he did not see any sense in driving so far south to frequent appointments when there were perfectly capable doctors much closer to home.\n\nHesitantly, I agreed to switch doctors.  I asked my primary care physician at Mayo Clinic Thunderbird who she would recommend and she gave me the name of an OBGYN only about 15 minutes from my home.  My husband and I visited them for several appointments.  The doctor and the office staff were courteous and nice.  They seemed to know what they were doing/talking about.  However, this doctor WAS NOT Dr. Johnstone.  I missed her, her patience with my questions, her terrific way of explaining things to me in a way I could understand, etc.  \n\nAfter I cried and cried to my husband to PLEASE let me switch back, I returned to Dr. Johnstone late in my 2nd trimester for the remainder of my pregnancy.  My baby is due Feb 7th 2013 & I couldn't be happier I made this decision.  I could not imagine anyone other than doctor Johnstone delivering this baby.  \n\nI have read the reviews others have posted regarding not being pleased with the front desk/office staff.  I have not had that experience.  They are running a business and sometimes they are very busy and down to business, but I find that if you greet them with a positive attitude, a smile, and your respect, they will be equally respectful to you.  \n\nI would definitely recommend Dr. Johnstone and her practice to anyone.  It is true sometimes they run behind and you need to wait to be taken back for your appointment a little late.  I am not put off by this as I worked for Social Security for approximately 8 years and I understand what it's like to fall behind when giving your full time and attention to each individual as they deserve.  Also, I would imagine it would be reasonable to think some patients may be a little late for their appointments causing the whole office to fall a little bit behind.  It does not turn me off at all, and I will gladly continue driving the distance for this high quality of care (& genuine caring) in the future.", "business_id": "1acmBPmmFDovVSHHzMrJ9A", "stars": 5, "date": "2013-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YF-Hfjsw3ZnPqHfoLCCvUQ", "review_id": "g8KvgNmAQ6esXAvUShAxEQ", "text": "Not going to lie...my first trip here I was not impressed. I didn't like the medical assistants because they were not very friendly with you as well as the front desk. But when you get back with Dr.Johnstone you are good (: My first trip was for a new patient consult. My second and more enjoyable experience was for my well woman exam. Dr. Johstone is AMAZING. She makes you feel welcome, wanted, and is very thorough. She sits with you and chats and always makes sure your questions are answered.", "business_id": "1acmBPmmFDovVSHHzMrJ9A", "stars": 4, "date": "2014-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "9G-MPhadAoE0WuA9n2ZpnA", "review_id": "82HurlzWy4KM7752wD6B6Q", "text": "I've only been going here for just under a year. I'm expecting my first child and had a lot of questions, and everyone from the front desk all the way to the doctor answered every single one of them.. No problem. Dr. Gibson is my doctor, she is very helpful, and she has answered every question for me, she is kind and asks questions about my family just to get to know me. I feel very comfortable going here and I would recommend it to anyone.", "business_id": "1acmBPmmFDovVSHHzMrJ9A", "stars": 5, "date": "2014-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "hGvHc3YnSvAgUhSGEum5cA", "review_id": "PVz8dUC7KkKQvWVnNi3Flw", "text": "As an East Coast transplant, I admit it is very difficult to find doctors with great bed-side manners out here in Phoenix.  I can't pinpoint why doctors out in the west seem so irritated until I met Dr. Sharon Thompson.  She is down to earth, easy to talk to, and  makes every visit worth the trip and the co-pay.  Yes, the girl at the front desk could use some attitude adjustment but I'm happy with Dr. Thompson and that's all that matters to me.  So, the four stars reflect just that.", "business_id": "1acmBPmmFDovVSHHzMrJ9A", "stars": 4, "date": "2014-12-26", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "ybDMkgFzWdz_402XQSHclA", "review_id": "4ZPl4Tqtc4yHv0L-BEpLpw", "text": "So here's the good, the bad and the ugly.\n\nFirst and foremost, she's an outside of the box doctor - and that's hard to find. Someone who will go the distance regardless if you're a textbook case or not. \n\nDr. Shafran ... words can't describe her bedside manner, but once you get past her rough exterior, she's like a little puppy - soft, cute & cuddly. \n\nThe staff... well, some days are good - some not so good.\n\nOverall- I refer everyone. Along with that I let them know that she's going to yell at you but instead of feeling insulted... laugh it's worth it.", "business_id": "PFO7RF1xz4ZBuaq46KsLpA", "stars": 4, "date": "2009-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wLDWtFpyh0hr3wfpj_lxWg", "review_id": "f3BDEYMA41YH0i2HsAuVLQ", "text": "I can say nothing but good things about dr. Dedinksky and his staff. They are like no other dr that you normally go to. Their service is excellent. Easy to get appointments, get a hold of them and great central location. I would highly recommend them as your family dr.", "business_id": "kHQCZ5UQmNX2KiSU5cUpaw", "stars": 5, "date": "2014-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m-KukDHoMGdkmE74hUsc4g", "review_id": "fW0TUdnlddwJpYZcfVbWKQ", "text": "Let me preface this review by saying that I MAY try this office again just with a different doctor. Dr. Drewitz  (and a few others) got pretty awesome reviews elsewhere online and was a peer-voted TOP DOC in the Phoenix Magazine. While that's not the patients voting, Yelpers, I suggest you do your own research. \n\nNote: I will update my review if I need to go back.\n\nNow to my experience. I called with digestive stress thinking it was a pretty serious episode that I was having. They got me in quickly but with a young doctor that hadn't received very good online reviews. They were quick to assign this one to me and although i was leery, I decided to just give this guy the benefit of the doubt.\n\nAs another Yelper just before me mentioned, although I don't know if we had the same doc, the bedside manner was virtually non-existent. While he may just have a laid back personality, professionally, I prefer my docs to act like they give a shit.\n\nSo then after asking me a few perfunctory questions about my current symptoms, he does the \"stethoscope to the heart and back\" routine and sends me to a kind woman to schedule my CT scan at a local Imaging place. Again, they got me in pretty quickly.\n\nHere's where it went awry for me. I went in for the scan on a Friday and the CT techs said the drs. office would receive results in 2 to 3 bus. days. I called Digestive Health Center - Coronado in 4. They had the results but the dr. had to sign off so someone could tell me my results and hadn't. Meanwhile, I'm beginning to panic cause NO NEWS IS BAD NEWS when you're a patient with a condition.\n\nEIGHT BUSINESS DAYS LATER, I call back like WTF? The assistant was apologetic but noted he STILL hadn't signed off on my results. Now remember , that this is simply so they can tell me something IS or ISNT wrong with me. Jeez!!!!!\n\nSo I said I need another doctor then. An hour or two later another doctor calls back to tell me all is fine. For this frustrating episode, I receive a dang near $200 bill (after insurance pays their part and note how quickly THAT arrived vs. how slow the follow up was) and after paying $350 out of pocket for a CT scan. So $550 of my hard-earned- and- not- easily- come- by savings later, I am ok but seriously do not feel the service I received was worth it!", "business_id": "QC3osgPdEl_TEZA2CtNeQw", "stars": 2, "date": "2013-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RnxGQjraQvxxq5LxUebA6A", "review_id": "2z-wg2Krnz624wYwo_J_Gg", "text": "I made my first visit here in November 2013. I found the front desk staff to be friendly and accommodating. I was very happy with my visit with Dr. Mills. I can tell that he thinks critically about all the information I provide, and when he arrives at a recommendation he is very articulate. His approach made me feel comfortable and at ease.", "business_id": "QC3osgPdEl_TEZA2CtNeQw", "stars": 5, "date": "2013-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M3H8du5TxqlTY7qJd4FDbw", "review_id": "TPq_pvvAavvTbzSvXDr11Q", "text": "The last appointment that took an hour and a half before we were seen by the doctor should have been a red flag but... it's a shame they're convenient and looking for another doctor would be difficult. Apparently, calling a few weeks in advance for more contact lenses is not long enough. Still waiting for a call back from his office. Looks like ordering online will be faster. The back office and support staff are extremely disorganized and don't care about your time.\nI will say the doctor, himself, individualizes every treatment plan which is a positive! One doctor said my son was too young for contacts, while Dr. Plotnik was more than willing to prescribe my son contacts. Six months into it, my son wears them without a problem!", "business_id": "h3tDZ2TBw7w_W9bA2cR2DQ", "stars": 3, "date": "2015-12-11", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 0}, "user_id": "dlGIDnT6IuVJbnx99Xg5JA", "review_id": "sCDLqgLghqf99VQtVGC8WA", "text": "I HAVE NEVER been to a more unprofessional place in my life! My Dr's MA, was loud and  obnoxious! She called my name and says \" come on honey, walk this way\" walked so fast I had no Idea where she even went then came out of a room and says \" I said this way!\" Then she starts talking to me about my health problems while we were still in the hall... I almost felt like she was on drugs... The Doctor finally came into the room.  He had the worst bedside manner I have ever seen! He did not want to hear any of my symptoms. He wanted to run all sorts of test... how did he now what i needed? He was suppose to be one of the \" top docs' at the institute...  When we were done, I went up to the front desk and a drak haired lady was on the phone and not once did she recognize that I was waiting for her!  I would never in a million years recommin this place to my works enemy!", "business_id": "KXt0Iky3ybeLsbY9KC6GSA", "stars": 1, "date": "2014-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ug6T1yoWwg7PDFkEj3zXmw", "review_id": "bvQJF-hTBsizMoZNfT4imA", "text": "Unfortunately ,my sister transferred to St. Luke's from a different hospital.  After only a couple of days, she showed rapid deterioration of her faculties.  Even her manner of speech changed.  She became a different person and looked sickly and yellowish in color.  They gave her someone else's clothes that were about 40 sizes too big and appeared to be from the late 1960's.  They were so old they were moth-eaten.  She had her own clothes there, but the attendant told me they would  not permit her to wear them for some unknown reason.\n\nWhile I was visiting her one evening, my sister had to use the restroom.  The attendant told her she could only leave the room once, and if she did again, we had to terminate our visit.  As my sister had an upset stomach because of the food she had eaten, she felt the need to go again after a few minutes.  The attendant told us to say goodbye, and I was not permitted to see her again that night..\n\nWhile in the waiting room, I could hear other patients on the inside screaming, throwing things, banging and kicking on walls and doors, cussing,  etc.  There was general pandemonium going on for the entire duration of the visit.  One patient who was also in the waiting room with us visiting with relatives cried loudly and incessantly the entire time I was there.  There was no privacy, which made for a most distressing visit.\n\nEven though we weren't permitted in patient quarters, it sounded just like an insane asylum.  This was unit 5.\n\nAvoid this place if you can help it.  Believe me, it's frightful.", "business_id": "r1sLMV2DfDfJZ8HJMzKhow", "stars": 1, "date": "2015-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HQXz4T9u3KKf7wCVHrHkWw", "review_id": "Ou3IViNk991Az5uDigrXNA", "text": "I've been with Dr. Kaczar for  years, and I feel he's a really good doctor but I think his office staff could use some customer service training.  If you are looking for  helpful, understanding and courtesy staff you are not going to get it here.  Example, they told me they will not provide reminder calls before appointments, they do so when they feel like it.  Then hit you with a $25 fee without hesitation.  \nTake the good with the bad.  A great doctor who will listen and take the time to get to know you personally...and the less than helpful staff.", "business_id": "OUJmtRxNkV0WT8rrr-qmRA", "stars": 2, "date": "2014-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "F66ALXcvZJcpGMbJ90zS8g", "review_id": "XKkMehtlgACk6k8MsOkUAQ", "text": "Our daughter Heather, was born with a congenital heart defect. She has been under the care of a Pediatric Cardiologist since the night she was born. \n\nWe (with the Lords help) believe that she has surpassed most Doctors and has even been told \"I would bet my paycheck (DOCTORS) that you would have had open heart by now!\" \n\nWhen we moved here to Arizona 3 years ago, we were more concerned about getting a new Pediatric Cardiologist than anything else! We started off at the Cambridge location and did not like the cardiologist we were seeing.\n\nAfter some research we found Dr. Garn at the Dobson Location! All I can say is that we love him and we actually look forward to seeing him for our 6 month check ups. He spends a lot of quality time with us making sure we know exactly what the latest update is on Heather. He seems very thourough and doesn't want to just go in and do a \"heart cath\" which we are grateful for! Staff is great and wait times are minimal compared to otehr places.", "business_id": "BXKhaF0EeDnycbqgKzDuJQ", "stars": 4, "date": "2013-02-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iKHwDEjP3aIiOjC2XV8S7g", "review_id": "PYwEy60vGTuH4YFOeNZbQA", "text": "If I could give Dr. Stock and his staff 10 stars, I would.  Dr. Stock at the Dobson location is professional, knowledgeable, thorough, compassionate, and spends a great deal of time with his patients.  His staff including Lynn, and ultrasound technician, Mary, are so kind and attentive.  If your child has a heart defect, I wouldn't hesitate to recommend Dr. Stock.  We have the utmost confidence in him.", "business_id": "BXKhaF0EeDnycbqgKzDuJQ", "stars": 5, "date": "2014-01-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "E5qFR0RBQBoXx8FbrOkdbw", "review_id": "iId8eSiGMDEwvv5l5ZrksA", "text": "Good experience.  The dr was very detailed.  I wasn't 100% comfortable with the sonographer, but she managed to get the pictures the dr. needed...eventually.", "business_id": "BXKhaF0EeDnycbqgKzDuJQ", "stars": 3, "date": "2014-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dw6WrHdihS1EE8XsC9_5AQ", "review_id": "xj964btEnGpzMyZmW4kv3g", "text": "Excellent group of physicians!", "business_id": "aOtx6bMU5M-Q_cNxhB0wYw", "stars": 5, "date": "2013-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ELipIXivMnj18J-kScQ-2Q", "review_id": "e67LLKbd-Rw98WhaZwT9ig", "text": "I love love love my doctor! This a great clinic! Dr. Wilson is the BEST!! He sits down and really listens to you and cares about each person! He sees a lot of cousins and my sister in law as well and we all LOVE him!", "business_id": "aOtx6bMU5M-Q_cNxhB0wYw", "stars": 5, "date": "2015-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "admcXi_CTOmulqYjQAfB5w", "review_id": "fC8HSAs6u0zA1iQ44cv0eQ", "text": "I love this doctor.  He was so thorough.  He took his time and asked all kinds of questions. He diagnosed my problem and solved my issues when my regular doctor could not.   His office is old school.  Charts are paper, no credit card machine, etc.  But the staff is nice and Dr. Nagul is very nice and has a great bed-side manner.  I highly recommend him.", "business_id": "HsJiTqIjUqI-t1bnPFcp2g", "stars": 5, "date": "2014-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ps0_3XcqKKM5jex4VkICNg", "review_id": "4ThmpbMmR2GnTfwoaNGTgw", "text": "We have been here twice now and we have left both times with huge smiles on our faces! The wait times were minimal and the entire staff was amazing! The tech took her time with us and never once made us feel rushed and was very informative. i am a talker and she listened and answered all my  questions and was very sweet to us. We had the pleasure of having her both times too!!! She had remembered us from our last appt from 6 weeks previous and was referring to things we had talked about last time. She even tired to get us specific pics for a cute frame we had bought. She was GREAT!!! I would def recommend PPA to everyone! They have been nothing but wonderful to us.", "business_id": "K4yExVqUtW2sRE4grXU8Zw", "stars": 5, "date": "2015-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "fH0lN3642pcJFkxkUvdgGw", "review_id": "-EQW4Ad8QI5LXYE5h6Iydg", "text": "If Jan Bland wasn't so incredibly amazing I would never step foot in this office again. The front office staff is so beyond unprofessional and incompetent it blows my mind. How they still have jobs is a mystery to me. I've worked in the healthcare field for over 7 years and never in my life have people messed up so much. They forget to put charts up leaving patients to sit in the waiting room, put charts in wrong doctors spots forcing the doctors to come up questioning where their patients are at. Again Jan Bland is beyond amazing just wish the office manager would grow a backbone and fire her check in girls", "business_id": "cVxig7AVvbWkHh9ZyOQyfA", "stars": 2, "date": "2015-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E5qFR0RBQBoXx8FbrOkdbw", "review_id": "2T5-35q-rf7plGdM5KfTHA", "text": "Dr. Argueso and his PA Marilyn are fantastic.  Dr. Argueso is a little curt and fast, but I'm perfectly fine with that. He is a terrific surgeon and handled my son's corrective surgery perfectly. You can't even tell he had surgery.\n\nMarilyn is so kind, so patient and she really makes sure you understand everything involved with surgery, recovery and wound care.\n\nThank you!", "business_id": "lZFUmxcvjD8LdzyTYXBd_A", "stars": 5, "date": "2015-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CxZjg_w4BCDnC4gA4ByJ0g", "review_id": "-LznHIR-Eu0g6hbQMt6EIw", "text": "I was very dissatisfied with the care I received from Dr. Sweeten's office.  The office staff in the pre-op section of the clinic was abrupt and unfriendly much like the reception I received from Dr. Sweeten.  When Dr. Sweeten entered the exam room for my consultation visit, she didn't introduce herself, opting to jump immediately into taking medical history notes.  She was dressed in decorative scrubs, so I just assumed that she was another office staff member.  Dr. Sweeten pulled out a couple of diagrams of the female reproductive organs and began to chicken scratch on them as she described the procedures she intended to perform based on my symptoms.   My inner voice questioned if I was making the right decision, but I was under the gun as the end of my medical plan year ended, so I decided to schedule additional procedures.  As I spoke with the office assistant in charge of scheduling, I mentioned that Dr. Sweeten might want to upgrade her systems in place to describe the procedures to patients.  I politely suggested that the office might want to consider updating their handouts such that Dr. Sweeten doesn't have to write upside-down on the handouts from how the diagrams are oriented, adding that printed information about the procedure would be nice.   The receptionist in the out-patient clinic section of the facility was a little more courteous.  The clinic scheduling system was a nightmare.  I had to wait for more than an hour for both of my procedures as at least ten to fifteen other people waited in the waiting room for either their appointments or to pick patients up.  Once I got back to the exam room to change into a gown, I saw lint balls on the floor and a black handprint on the exam room table.  The clinic staff handed me a plastic milk crate IN which my hospital gown was placed and directed me to place my shoes and clothes.  The clinic staff appeared annoyed that I asked for a different gown that had not been in a crate that others' had already used to place their shoes.  Dr. Sweeten met me in the pre-op waiting area prior to my first proceedure.  In reference to the suggestions I made about her pre-op consultation, she curtly and sarcastically stated, \"I hear that you didn't like my drawings,\" to which I politely responded, \"No I didn't.  I think that you could put together something in Microsoft Word that would look much more professional.\"  I didn't get a response.  The short version of the story is that my period and vaginal discharge continued without interruption for approximately 5 weeks, as the doctor advised.  I then had a \"period\" for one day that included minimal spotting of which I was also advised was possible.  Three months after the procedure, I'm back to having a painful full period with clotting just I had prior to my procedures.  I knew that the return of my period was possible as stated by Dr. Sweeten, but something in the back of my mind wonders...  wonders about a lot of things...", "business_id": "kOT8AO8e1e3J9pUBJ2C7Iw", "stars": 1, "date": "2015-02-01", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "e3i2J-cBKJoP9Mth5uolhw", "review_id": "2QM3fF7qzeD40b-16BtTpA", "text": "The only reason I'm giving this place two stars instead of one star is because I really had a good appointment with Whitney Padgett, the nurse practitioner. She was kind, down-to-earth, smart and a good listener. However, in the end it was the doctor and one of the front office staff members who are the reasons why I won't return to this practice. As a 30-year-old married woman who moved to Scottsdale from CA, I was hoping to establish a relationship with an OBGYN here in the Valley so that I already have a trusting relationship with a doctor when my husband and I decide to have a baby. I was a happy patient of my last doctor for 12 years.  I scheduled my first appointment at this practice as a new patient and was seen by Whitney Padgett. It has always been my understanding that standards of care require doctors to actually see a patient if it is his or her first time going to a specialist. I was a bit shocked that I was seen only by Whitney and never a doctor at all, even though I was new to the practice. This aside, I returned for a second appointment and this time I saw Dr. Carol Hahn. I came to my appointment with Dr. Hahn for a problem and not the usual annual appointment, so naturally I was a bit worried. From the moment she walked in, Dr. Hahn was curt and condescending. She spoke to me as if I were below her. (I'm a professional working women who is married to a doctor) She typed notes on her keyboard with little eye contact. And, at one point corrected me as I was speaking about my health and at another point she made an unprofessional joke while performing my exam. However, the real shock to me came when she tilted her head down and asked me in a tone as if I was a teenage girl, \"Are you sexually active?\" I know this is a standard question, but my chart indicates that I am a married woman and that I take oral birth control for pregnancy prevention. Do you think she could have read my chart?? Or perhaps glanced at the clinical notes from my first visit to the practice? As I left this appointment, I was paying my co-pay and getting ready to head to work, I was told that I could not leave without paying the bill from my previous appointment. I explained that I had just received the bill two days prior for my previous appointment and had it at work with a stamp in my outgoing mail. I was told that I could not leave the building without paying that bill in person right then and there. When I explained that I'm still within the due date and that I have it ready to go in the mail, the lady told me that I would need to wait for a manager to approve it before I could leave. I told her that I needed to get to work and that I did not have the time to discuss this. I put the charge on my credit card to appease them and finally walked out the door. I can tell you that I will never return to this practice again. From the level of care I received to the treatment and finally the billing practices, this place was an unpleasant experience.", "business_id": "eovEq5kDSdf0WF_P_bD2Uw", "stars": 2, "date": "2013-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Bkgq4Ktyf1nvDKM5pq7bRQ", "review_id": "Q4VNmPy2XkJELPF8G_gfYQ", "text": "I feel like this place doesn't have as good of reviews as it should so I figured I would add in my two cents. I love Central Phx Women's Health. More specifically, I love Dr. Cyr. She makes me feel super comfortable regardless of my questions or reasons for being there, and I never hesitate to call or make an appointment like I've done in the past with lady-part doctors who I didn't like. So, it's great for my health even! I've been going here for more than 6 years now and I recommend it to everyone. Although, to be honest, I hope not everybody takes my advice because I don't want my fav doc getting too busy!", "business_id": "eovEq5kDSdf0WF_P_bD2Uw", "stars": 5, "date": "2014-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1gKJ6A2c5r8Ni6g6IhESpw", "review_id": "8lVuOmf0ueosNpBC4v_uvQ", "text": "I haven't had any problems with the office staff or the docs. They've all been quite prompt which is hard for a lot of docs to accomplish. I see Dr.Spieker and have seen a NP Kim a few times and they've been fine. I go for pregnancy care. I've always thought the office looked nice. \nThey are often pretty terrible at keeping the bathroom stocked with urine cups, those cleaning wipes, and TP... Annoying for a place that makes you give them a urine sample every time!\nI have friends who have seen the other 2 docs and they liked them and recommended all 3. (They're all women docs.)\nYes it is on ~12th St & Osborn; I'm not sure if the map on yelp is for another location or an old location but be careful! \nThe building is not well-marked from the Osborn side so go a bit early the 1st time.", "business_id": "eovEq5kDSdf0WF_P_bD2Uw", "stars": 5, "date": "2014-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ErqnuSHSXEmoQNPTc3zE8w", "review_id": "gk9pbG6mPguXZ_9ZFjbYZw", "text": "Dr. Emily Cyr is wonderful!  I had my consultation today for some testing that I'm going to have done next month, and she made me feel so comfortable.  I actually teared up a bit,  and she made me feel like a little less of a dork about it.  Haha.  Anyway,  she's super friendly, as was the office staff.  The building is beautiful.  It's brick and home to several other offices; so,  give yourself some extra time to find exactly where it is in the building (hint: 2nd floor). Show up early,  like they advise,  since the office gets busy.  Dr. Cyr  booked my follow-up appointment next month over her lunch so that I don't have to take another day off of work (school holiday).  Seriously,  how sweet and kind is that?  I'm going to highly recommend the office to anyone in need of an OBGYN, even if it's not for anything other than annual exams, as in my case.  :)", "business_id": "eovEq5kDSdf0WF_P_bD2Uw", "stars": 5, "date": "2015-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wd_CvErPv6oGsf0GjmN__A", "review_id": "wHQe5iOG044oEV-Qsbsxlw", "text": "I really like Dr. Hahn and my experiences with her are always positive. However, the staff is super rude which always leaves my girlfriend and I to question why we go there. Even when there isn't really a point of contention, they create one with the rudeness. Its happened one too many times and we are now looking for new OBGYN. Somebody needs to talk some sense into the staff(front desk, nurses) that is bringing this place down. Not all the staff is bad those that are, ruin it for the rest.", "business_id": "eovEq5kDSdf0WF_P_bD2Uw", "stars": 3, "date": "2015-12-07", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "9zuPDV5lge3dBTtYOHYvJQ", "review_id": "Sj_06QJs22drfBGZBFd6Pw", "text": "Thank you for your help, I recently lost my job and Dr lee did everything she could and helped me accomplish my goals without having to hound in the insurance company! It has been a week since my procedure and you would never known the improfections were there! Thank you soo much! THE results are SO greatt and truly appreciate your help!", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2012-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "u-M4jMYKXsj-l1BYdyNpRQ", "review_id": "ODhX0C3wpKTI0INM0k-TVg", "text": "Phoenix Skin is amazing!!! I came here for my acne problems (no I don't have extreme acne, but would like to get rid of some scarring and big pores). Since I'm not getting any cosmetic services like botox or restylane I only see a PA. My PA is Katherine Haworthe and she is amazing. She worked with me to find the right regimen for my sensitive face. I also religiously come every 5 weeks to get a chemical face peel to help minimize my acne scarring and huge pores. Haworthe takes the time to answer questions I have and is always on time when I come in. I recently got my moles checked and she did a great job recording and taking pictures of every mole I have to monitor it. The office staff is great and it is really easy to make an appointment in person or over the phone. Will be a customer here for years to come :)", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2013-01-26", "type": "review"}
{"votes": {"funny": 6, "useful": 5, "cool": 5}, "user_id": "k4-6lakq7t3kCgbvPxcuvg", "review_id": "BNPx73aCeHTfsw-npRS9pQ", "text": "I came in for a microdermabrasion session with McKenzie and had the best experience.  She was really sweet and friendly and she took the time to explain the process and to closely examine my skin.  \n\nShe complimented me on my skin and told me that for someone of my age my skin was in awesome shape and that I merely needed to add more moisturizer to my daily regimen.  That was nice to hear since I always thought my skin was just average, but she assured me that my skin was in excellent shape.  (It's funny how the small things like that can make your whole day better.)\n\nWhen the session was over my skin felt amazing and softer and it looked brighter and clearer.  When we were done she recommended a product to help me with a pigmentation issue and explained how to use it and how to care for my skin afterwards.  I'll definitely be back for more microdermabrasion sessions with McKenzie.", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2014-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pBvF6TQDaIpL0o6U81In8A", "review_id": "JbRq--UO8M4XYfidGGH9bg", "text": "The absolute best! First off the staff here are amazing! Blanca walked me through the entire procedure and made me comfortable from day one. Dr. Laris is an artist! I was so impressed with the fact that not one person tried to sell additional services to me and I was given realistic expectations. I was told the mini lift would send me back 7-10 years but it turned out to be at least 10 years! Thank you Dr. Laris! I can not even begin to express my gratitude!", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2014-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SmBtqSl_H50a6uxJvqA5Xw", "review_id": "jPkI6MzhRfMnvQmSOWbr8A", "text": "I came in for a laser tattoo removal, I was expecting a long wait and a long process but nope not what happened here. I checked in for my appointment got seen right away, and it took less than a minute to get the procedure done. Very professional, and friendly!", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2015-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aOma3hOCEes6PqLJb6kc6g", "review_id": "s_HG35pEMDGxWbwcecQT8Q", "text": "I rarely write reviews so when I do, I put strong consideration into my recommendation. I have been a patient of Phoenix Skin on and off for the around 12 or 13 years. It is the best care and service I have ever received from a doctor's office. Over the years I have seen both Dr. Laris and Michael Richards and they are exceptional. I have developed a lot of faith in their judgement and I can tell they genuinely enjoy helping people. Their two offices are on the opposite side of the valley for me but I still travel over an hour to see them because I feel well cared for. \n\nIn the interest of full disclosure, I should add that in over 10 years, Dr. Laris and Mike Richards don't seem to have aged. To whereas, I seem to have aged exponentially. Probably from having two beautiful children that siphon my life force. Current estimates predict that I will look like a more weathered version of Death Wish franchise actor Charles Bronson within 18-24 months. But for some reason Dr. Laris and MIke are somehow unaffected by the normal aging process. There are two plausible explanations for this. A) They are a member of some tribe of vampire/lycanthrope hybrids that leapfrog through time and remain young, or B) They now a thing or two about healthy and attractive skin. Whether it is the former or latter, they are both great people and are outstanding medical professionals in a specialty field. I really enjoy their office and would refer any loved one to Phoenix Skin and know that they are in very capable and caring hands.", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2015-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uaX4vCSUAEWmp0kdHenOvQ", "review_id": "NDt-cqyk8QTCaHHF_G4uHg", "text": "Dr. Laris and all at Phoenix Skin are most professional and uber - caring. I am a 63 year old man who thought he needed a full face lift. After a consultation, Dr. Laris recommended the less invasive, and less costly ylift. I am very pleased with the results. I trust these people. They play it straight. I will be back.", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2015-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pf7FT8PluR7USCuaoxIoxg", "review_id": "7D77PSrXZLMD7vv0ywJAag", "text": "Last year, our very active toddler (then 2-yrs-old) was diagnosed with a bone cyst in his femur. Our pediatrician gave us a list of orthopedic surgeons to consult and although Dr. Shindell was at the top of the list, we actually went to the second name -- one of the largest orthopedic groups in the valley -- first. When we met with that first surgeon, he said he could help our son but given the size and placement of the cyst and the risk of it breaking, he recommended that we go to someone who handles these type of cases more often. We asked who he would recommend if it were his son, and he said Dr. Shindell.\n\nWhen we called Dr. Shindell's office, they were able to get us in for an appointment the next day. Needless to say, we were extremely anxious, but Dr. Shindell's calm demeanor and extensive experience helped us worry less. He explained all the options (including a brand new procedure that just finished clinical trials) and possible long-term effects. There was absolutely no pressure to take any one option over the others, and he was willing to give us the weekend to think over our options.\n\nIt took us about 20-minutes to decide what to do. Dr. Shindell immediately set up the surgery date and called Hanger Orthotics to squeezed us in for a fitting even though it was the end of day on a Friday.\n\nThe following week, our son had his surgery (would have been sooner, but we had to wait for his custom brace to be made). Dr. Shindell met us at the hospital to explain the details of the surgery ahead of time. After the surgery, he met us in the waiting room and explained the recovery plan and what to expect. Shindell again checked on our son the following day to see how he was recovering. Every time, he explained everything fully so that we could understand what was going on.\n\nWe still see Dr. Shindell regularly to check on the progress of our son's bone graft. Although he seemed very stoic when we first met him, we also have seen how much he personally cares about each patient... and their parents.\n\nWe are absolutely grateful for Dr. Shindell!", "business_id": "epXH-NxReRzcJzpMyBEXNw", "stars": 5, "date": "2011-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2AGGIi5EiVLM1XhBXaaAVw", "review_id": "LjMlS-gQtVNBVXB6JNU0sA", "text": "After a questionable experience with another doctor, a qualified orthopedist who was not a pediatric specialist, we visited Dr. Shindell. Finding him was such a blessing. Our five year old had broken her arm in a unusual spot that could not be placed in a traditional cast. To make a long story short, with the previous doctor we were never able to be fitted with an appropriate sling for her arm. With Dr. Shindell? We had a perfectly fitted sling in about ten minutes. Perhaps it was something any pediatric specialist could have done, but the gentle and knowledgeable way in which it was accomplished was exceptional. \n\nThe office support staff is great, from the front desk to the x-ray technician. All very friendly and supportive. Dr. Shindell himself has a very calm and reassuring demeanor, which is just what we needed. We left feeling that we had found the best care possible for our little one and that she was now on her way to recovery. It's very apparent why Dr. Shindell has been repeatedly recognized for the quality of his care. Highly recommended.", "business_id": "epXH-NxReRzcJzpMyBEXNw", "stars": 5, "date": "2015-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "AkJFqLqHHAKY3H5R8p7cPQ", "review_id": "J8S3Pv8MSsmkDf3mzML8Mg", "text": "Wow, I don't know why this place got such bad reviews.  I will start off with a negative, is that the Tempe location has almost an extra 30 minutes wait if you come in the afternoon.  I would recommend their Phoenix location which is better managed.\n\nI went to see Dr. Anikar Chhabra, who is the team doctor for ASU, Phoenix Mercury, and has performed various other surgeries for famous athletes in the Valley.  He is very attentive and knowledgeable.  His PA, Kevin Cantwell, always has a smile and is a good understudy to Dr. Chhabra.  Dr.  Chhabra performed a left shoulder subacromonial decompression to relief pain from the back of my shoulder.  I am currently rehabbing from the surgery, and I feel so much better with the pain gone away.  \n\nI have not visited other doctors at the clinic, but I highly recommend Dr. Chabbra!", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 4, "date": "2011-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b6D1nQTnVPX0Qm5j7gkTRQ", "review_id": "kYh-tdq6HfCHKHl3JCaGlg", "text": "This was once a reliable clinic. However, not the top notch service they provided at one time. Had me see a doctor (as mine was on vacation) who really couldn't give me any answers so I still had to make another appointment as well! Billed my old insurance (even though they had my new card) and sent me a bill for money I did not owe. Time to find a new orthopedic clinic. Good doctors but a mess.", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 2, "date": "2015-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ud77tmWH6vIX7A9uR9BNhQ", "review_id": "ggCPICjNpM_bgFEZrWtoRw", "text": "I want everyone to know that Dr ballie treated me like a person he's kind and caring always listens about my concerns  he is the first doctor since my injury that has cared, what a great doctor and great staff I would recommend him and his staff to everyone who needs the best orthopedic doctor on your side sincerely vikki", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 5, "date": "2015-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tKdr20-y3G9GDzVNlfBPDQ", "review_id": "-ixWraOgTrTn7Xo8pwHocg", "text": "I went in for toe surgery and I had a Great experience considering the circumstances Lol. I thought having to be there 2 hours early was a little to early but it really wasn't considering the prep time and what not . The check in staff were very polite and the nurses made me feel comfortable . And they made sure I was comfortable before and after surgery . I'd recommend the center to others .", "business_id": "rdc24noiVveKlfifEwVNvQ", "stars": 5, "date": "2015-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3rWlaf-JoELz1g6MutY1Bw", "review_id": "gdR68GhwBbgsOwnX47UBUw", "text": "Dr Zeman was referred to me by multiple people.  In every profession, they have exceptional people, and Dr.Zeman is just that.  He used the least invasive incision and results are great.  Besides being a great technician in his trade, his bedside manner is wonderful. I won't have my family go to anyone else but him.  He is REMARKABLE!!", "business_id": "ZPkomfeRH2pflacWf7U3-A", "stars": 5, "date": "2014-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3yZ4FSQH1wNF5wZgn6ha5Q", "review_id": "-Wqp6yrtuBlW2DD-9YcLnQ", "text": "After years of being scared, I finally decided to have Lasik done.  One of the best things I have ever done, and worth every dollar.  I visited other eye centers, but Barnet Dulaney Perkins was the best.  The staff is very friendly and very informative.  From my consultation to the Lasik procedure, I was explained everything that was being done or would be done.  Dr. Fintelmann was AWESOME!  I am reading at 20/15!  After 25 years of wearing glasses, I am glad I made the decision to go to Barnet Dulaney Perkins and rid myself of my eye-crutches.", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 5, "date": "2013-01-31", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 0}, "user_id": "I6hJr5nUcrscd2e6e934Kw", "review_id": "oPkyP20akMl8n2YsQ_iqYQ", "text": "What a waster of time and money!  My regular ophthalmologist recommended I see the same doctor who performed my previous cataract surgery (which was here) for a followup procedure.  Step 1:  Repeat the same exam I had just received from my ophthalmologist at a cost of about $200.  Step 2: Go in for an evaluation with the Surgeon ... wait in 3 different waiting rooms for over 2 hours, then leave, since I myself had appointments. Leave having accomplished nothing as I never saw the doctor!  At no point did they indicate to me it would be over an hour delay and offer to reschedule or give me any indication of actually how long the wait would be. Feels more like a surgery factory than health CARE.  I have no intention of coming back to this facility.", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 1, "date": "2014-12-17", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "yIuYAeqkKiKlLUmSiktMHg", "review_id": "bhKnaVen_o_uoBX3NgJHGw", "text": "I visited a couple places before I chose where to do Lasik. When I came to BDP I knew my search was over. Everyone was so friendly, very informative, and didn't try to pressure me like I experienced at other places. The pricing was very similar to other places too (a little cheaper even). Also, at another place I was told I wasn't a Lasik candidate and would have to do PRK. However, BDP explained why I was a good candidate for Lasik and made me feel very comfortable with doing it. I was a little nervous about the surgery, but Dr. Perkins was great and when I met him that all went away. It was a quick procedure and he talked me though every step.  I had the surgery on Friday and was seeing 20/20 on Saturday! I love my new vision and would highly recommend using Barnet Dulaney Perkins Eye Center!\n\nPRICING: One thing I didn't notice on Yelp reviews was pricing. I know that it varies from place to place, it may differ because of your eyes, and you can get some discounts with some insurance. But with the little research I did, I think Lasik is usually between $2,500 and $4,000. I paid $3,000 at BDP (I used a discount though).", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 5, "date": "2015-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tFjza42BfXVhCDZucimycg", "review_id": "SwOfWj15oFXSPVWZAi6QYw", "text": "The worst front office ever.  After surgery, i bought glasses from them. The glasses I got were NOT what I ordered. They offered to take them back for a full refund, but I have been waiting 8 weeks.  They said a week or two but maybe as long as 8 weeks , because they are such a  large company. Now after 8 weeks they said MAYBE they could credit my credit card, because a check will take \"some time\". They just want to keep my money  8 weeks and NO REFUND.", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 1, "date": "2015-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Cvo43DagW35WI12ohiHTog", "review_id": "HC0oEbgZFksQ44wKZ8YICA", "text": "Last week   was  my first  visit  to  Arcadia Family Clinic .I just went  on Medicare and I picked  this office because  a friend recommended the doctors there. I needed a  new new  PCP .I could  not have been more  impressed  with the  office staff and  Dr.  Shealey .I was seen as soon as  I finished  my  paper work.  Dr Shealey  was  attentive ,listened  to  my  concerns and  ordered  all the  tests  she thought  I needed. There is a  lab  in the  office so blood work was done there , and BTW probably the  first time  I haven't gotten a  huge bruise  in my  life!  I saw the  negative reviews  on Yelp but  I am going  to  give  them 5 stars and could not be more pleased with my new  doctor. I tend to only write reviews  if  I really like a. business. The  negative  reviews on this clinic could  have made  me choose another doctor  so  I am going to  highly recommend this office.", "business_id": "c_PhRjEIA2jRAvWDWsn4Vg", "stars": 5, "date": "2013-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u2Jed1MjcTPNnVmBZvfc3Q", "review_id": "LsY6OX6bkKV41coX1SZWvA", "text": "I have been going to see Dr Kramer since last year when I had to get clearance for a simple knee surgery great guy, but his staff I'm assuming his Medical Assistant has not been responsive. I called several times to get my sleep study referral and she keeps saying, \"I will send it\" never hear from her. The front office people seem to do a better job, but I'm tired of calling so time to move on.", "business_id": "9zlpLPhXYwK_STi2u8DjxQ", "stars": 1, "date": "2012-02-04", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "TnQHhiLKuSQAztYChfgesw", "review_id": "V9dVdniLj8YiDp4oDVcBlw", "text": "Very impressed with Dr Kramer.  He's very thorough and spends an unusual amount of time with you during your appt, not something you see much anymore.  He always has a student along with him and his manner of teaching combined with his dry sense of humor is refreshing.  The only reason I did not give him a 5 star review is because he usually is running behind quite a bit, however considering you know you will get your fair share of time with him when it's your turn, its not something I can whole heartedly complain about.   I would definitely recommend this office.", "business_id": "9zlpLPhXYwK_STi2u8DjxQ", "stars": 4, "date": "2014-02-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "l53FUDHRHLg7BQ89KgAtxQ", "review_id": "RLuNYaKtHvaKYgrNCqsvsw", "text": "It's such a great feeling to really trust your Dr.  Even if you only go once a year, it's nice to know what to expect.  After having my last two awesome Dr's retire on me, I found a great Dr that I've followed to 2 different offices and through about 6 different insurance companies.  Whew!  \n\nWhile their last waiting room was more warm, this one has lots of distractions, which can be even better I suppose.  There is a tv going (I've seen it generally on talk shows and news channels), lots of seating, a good amount of magazines and some stuff for the kids.  \n\nOnce inside, you can see that each Dr has his/her own space within the office including separate stations for their P.A. The best thing about the old location was that if you needed blood work or an xray, you just had to walk down a hall.  As of last time I was there, you had to go downstairs for blood work, but I was told they are looking to soon have both in their same office again soon.  You have to love one stop shopping - even in a Dr.\n\nAll of the Dr's at the office have been great.  My main Dr, Dr. Veronica Lindo went to part time a few years ago so I've seen several other Dr's in the office, though Dr Smith the most.  My girlfriend thinks it's awesome to actually have a young black female doctor as it makes her feel so much more relatable.  I love that they are so informative, friendly, and willing to make sure you understand what's going on before rushing to the next room.", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 4, "date": "2007-02-28", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "m8vVTi2b-SWv3EJrvrruMg", "review_id": "HsgsS9q6lJKrQ1ydcmWAhg", "text": "This doctor's office is AMAZING!! I always see Dr. Collins but have seen others when I'm sick and she's booked. \n\nNot only are they speedy (10 minutes or less in waiting room) but the front office in general is very capable and helpful when any insurance issues have come up. Dr. Collins really cares about you as a person and your overall health and even calls with test results if it's anything out of the norm (or even if I was just a little worried about them).  She also is very personable and non judgmental when I tell her the truth about how many cocktails I indulge in on a weekend - although she continually tries to encourage me to stop having 6 cocktails on a Friday night  I also feel like I can tell her the truth without feeling like I'm in the Principal's office. \n\nBest part by far is when I didn't have health insurance for a few months between jobs they were super accommodating with my cash pay situation, didn't rip me off, and cared enough to tell me exactly where to go for cheaper med prices and weren't so far into in the drug companies pockets like most doctors to insist on pricey meds or name brand medications.\n\np.s. Dr. Collins doesn't accept new patients but if you call and ask her medical assistant they usually can fit you in...", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 5, "date": "2011-01-31", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "nrs9jqza1TYWxwmXmTqzqA", "review_id": "XcagldZDRAI_9yXNbFHMZA", "text": "I love this place!! I moved here 7 months ago and made an apt with Dr. Mansfield. She is awesome and so is her assistant!!  She's easy to talk to and will do anything to help! I've been a few times and will return again and again!", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 5, "date": "2012-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "mR7LQurf_awsKqDK46NRew", "review_id": "5cFEyDZsAR2Sr8VO73K4Gw", "text": "Best. Doc's Office. EVER. \n\nMy primary care doc is Dr. Mansfield and she is AMAZING.... as is her assistant. I don't know what I'd do without them. I've also been to other docs if I'm really sick and can't get in to see her, and they've all been great. The front desk staff is very friendly and quick with processing people through. You never have to wait long with an appointment and they have a streamlined process to get people through to a doc quick, but not so quick that you feel like you're just a number. They listen to what you have to say and don't just give you meds for the sake of giving you meds.... which I LOVE! These guys rock!!", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 5, "date": "2013-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "g6M4XGZXF5-cR63hlZcMCA", "review_id": "_E5tL_rjeltptC1LV_2sZw", "text": "I love this doctors office.  Dr. Mansfield is always willing to listen and is very compassionate.  She is genuinely concerned about her patients and their health.  Whenever you have an urgent matter the office goes above and beyond to make sure you get to see a doctor immediately.  I've been a patient here for about three years and am so glad to have found this doctor.", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 5, "date": "2013-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7bz7S7nQU9kMenVcPsCC_w", "review_id": "iW1R_jKbISYfIVLnob1pTA", "text": "Dr Shayna Mansfield has been my primary care physician since I moved to the valley. She has been outstanding as a doctor and very thorough in her approach with your health. During several visits she asked me a multitude of questions, as well as allowed me to be very open about what was going on. She even said at one point \"I don't know, how do you feel you would like to go about it?\". Humility is amazing, and I am grateful I can have a conversation with her rather than being steamrolled like most other doctors who carry the \"treat 'em and street 'em\" mentality. \n\nAs for he office, there was a little confusion with co pays with the office staff but no big deal. Bear in mind they are transitioning to emr so there is a little lag. They accept blue cross/ blue shield so most things are covered. Waiting room is clean, updated magazines fill most end tables. Parking is easy (I always get lucky with a front row spot). \n\nIf you are looking for a great doctor, then you should defiantly trust dr Mansfield to give you the care you deserve.", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 5, "date": "2014-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "ucGfMGHDxYCMJ_VLpMjAOw", "review_id": "ljrRXHkuUdCv3qhj3OMMng", "text": "Dr. Gregory Bell is my physician and I would definitely recommend him!!  I would have rated this place a 5 if it were just baed on him.  I can honestly say he is the only dr. that I have ever had that I like and trust!  He actually listens and asks questions and is very smart.  He takes the time to educate me on my health.  I've had asthma my entire life and had other drs try to shove new inhalers on me that I didn't like, didn't work and were very expensive.  Dr. Bell was the first dr to actually run some asthma tests on me and told me that my type of asthma wouldn't be helped by those inhalers anyway.  Great doctor that I trust!\n\nThe office itself is ok.  I've had them mess up my appointments a few times which is frustrating but the dr. has always made sure I can still get in to see him.", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 4, "date": "2014-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gmqsrEg7Ehj37oVHcZKhJQ", "review_id": "0-QTEbQGW3sZGtgfNF32eQ", "text": "Beware of how they set up your appointment.  I had requested a yearly check up but they wrote it down as something else (problem with my back).  When I got there I was seen by the doctor who discussed my back problems.  When I asked her when we'd get to the yearly check up she told me we could only do ONE per each session or it wouldn't be covered by insurance.  She said I'd have to come back for my check up.\nOver $100 out of pocket later I returned for my check up.  Not sure if it is a racket they usually pull to get you to come more than once but I don't trust them. On the positive side the staff was friendly and both appointments were on time.  Cindy is a wonderful doctor's assistant.", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 2, "date": "2015-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u2Jed1MjcTPNnVmBZvfc3Q", "review_id": "rfLq8VaCwZ2khNdo3eCg1w", "text": "I see Dr Bell who I think is a good doctor he listens and doesn't just go by the drug company's pushing drugs, but having said that the office operation is not good. Last year they called me said it was my time for a yearly exam. Went in late after work about 4:30 appointment. The waiting room was nearly empty. They called me in I waited in the exam room for 50 minutes it's 1/4 to 6. The noise in the hallway outside the room is dying down. I come out and ask around find hardly anyone except one person up in the front office. She is very surprised to see me I'm fairly sure they forgot I was even in there. I was getting upset I told her I can't wait around for an hour in a room. She didn't know what to say to me I could tell they knew darn well what happened. They ran around and I told her I was leaving and Dr bell came out said he would take care of me in a few minutes. The exam was about 10 minutes listen to my heart and said sounds okay. He asked me If I need to have a finger up my butt I laughed but was thinking to my self what a strange thing to say to a patent. I told him forget it had to go. I wasted 3 hours it was the last time I went there.", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 2, "date": "2015-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 0}, "user_id": "RxfFQxUtSIGYwTKU_rvAeg", "review_id": "DdYwjR1nv5uFNNp8LMOfGQ", "text": "After deciding at the end of 2012 that I wanted Lasik, I turned to Yelp for some guidance. Based on the great reviews, I chose this spot. I was really happy when they were able to schedule me a consultation on a Saturday. \n\nAlthough the area is a little rundown, the office/facility was very nice and I was pleasantly surprised. The waiting room was modern and comfortable, employees friendly. They ran a few tests on my vision, gave me an update on next steps, then dialated my eyes, sent me to wait in the waiting room, and then they called me back to give me my estimate. It was going to be $850 per eye (based on my prescription) and she gave me an extra 10% off with my Aetna insurance. I scheduled my appt for 2 weeks later. \n\nThey estimated 3-4 hours for the process. After I checked in for the surgery, I waited about a half hour, got called back to pay for the procedure, and then went back to the waiting room. They called me back for the surgery (with someone else) and then we waited in that room for almost 45 minutes. The whole time we could hear the employees laughing, telling stories and shooting the breeze. It was really annoying. When I finally went in, the procedure took approx 5 minutes per eye and they did a great job talking you through it the whole time. It was painless. They also provided sunglasses and goggles to sleep in. From start to finish, I was out in 2 hours. My husband was a little pissed because he was prepared to pick me up in more like 3.5 hours, not 2. Big difference. \n\nOn my day after, I didn't need glasses. At my check-up, I was almost 20/20 and was at 20/20 by my 2 week check-up. I am incredibly pleased with the results. Okay, okay, I am ecstatic. I took away a star for the long wait times, going back and forth between waiting and examination rooms, and the misquote with how long the procedure would be. \n\nOne nice thing they did was call me before my 2 week appt to ask if I wanted to reschedule. The day I chose was going to be a surgery day which would mean longer wait times. I appreciated that they would be proactive to give me the option and gladly took it to change the date!", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 4, "date": "2013-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "GKBSHjC6jPKkDGEfj9_MIA", "review_id": "-AMXt87QWM4qrjoCE4hOJQ", "text": "Be Wary of the Lasik Vision Institute,advertises $299-per-eye and $499-per-eye rates for Lasik surgery. But this is intended to lure patients into consultations at which much higher prices are quoted. \n\nwe were there today, my prescription is -3.0 and final cost is  $2499 per eye and after promotion, it is 2000 per eye and 4000 for both, \n\nShame on you Lasik Vision Institute\n\nplus, see this link\n\nhttp://www.quackwatch.com/04ConsumerEducation/News/ew.html", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 1, "date": "2013-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "LgDnh7170pSqcsRpsNYkdw", "review_id": "KtbErmmVvU2W0xYQlhXlDw", "text": "A complete waste of time!\n\nI made an appointment and went in for my eval. I went through the usual tests, charts, lights, etc. I was told that I would have to make another appointment to come back and have my eyes dilated. I asked why I couldn't do it now and was told that I can't drive afterwards. \nI assured them that all I have to do is make a call and would have a ride home, and they still didn't want to do it. I can only assume that it was because it was 4pm on a Friday and they closed at 5. Why would they make an appt. knowing that there wasn't enough time to do a full eval!!\n\nI was assured that I was a go for surgery but that they needed to do the dilation tests before it was a sure thing, and that they could dilate the day of surgery. Two weeks go by and my surgery day arrives. \n\nI leave vacation early to make my 9am appt. I show up, and finally got my eyes dilated and tested after waiting 2.5 hours. The woman told me to go grab lunch while my eyes recovered from the dilation. \n\nI leave, go grab lunch, and return at the appointed time. The woman checks my eyes to  make sure they have recovered. I was told to go out and wait AGAIN. So I do so. Then it's finally time for surgery. I call to arrange a ride. Go back to the exam room where I am told that the surgeon doesn't want to do my surgery because my hyperopia is too bad and the surgeon doesn't want a partial result!!\n\nI was told that I could expect to get a 20/30, which I accepted as not perfect. I also only needed ONE eye done.\n\nI was too mad to say anything!! Not only did I waste 2 weeks since they were not willing to do a full eval on my initial appt, but I wasted most of my day going to lunch and waiting to be told something they likely knew after my FIRST appt.\n\nI left at almost 3pm, after arriving at 9am. I wasted 2 trips, a lunch, time, arranging a ride, and a chance to look elsewhere!!    \n\nWas only one eye not enough money, were they too lazy to stay and finish a full eval on the first visit??  Who knows!!\n\nDon't go here and waste your time!!!!!", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 1, "date": "2014-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bxIuvCNQXTUb57RKfdVtxw", "review_id": "tRC9Y3xgdk1Th_bf32rzKA", "text": "It's been two years and I am still over joyed at the eyesight I have because of the doctors and staff. They cared about me and my eyes. Don't want any longer get your best eye sight now call them today!", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 5, "date": "2015-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VcMv4DSC2QY8945qLE0Fmw", "review_id": "4gk98HUuL9PV9FWi7DVxpw", "text": "Dr. Riley is very nice.  I don't know how much he truly \"hears\" me, but I think he tries.  The office manager is a different story.  I had a visit in early 2013 and reported difficulty breathing.  The doctor was supposed to call in an inhaler.  Two days later, nothing had been called in.  I followed up and was again told it was called in.  Went to the pharmacy (verified location) and they had received nothing.  I went back a few months later for stomach virus symptoms.  The initial visit and mishap was totally disregarded and not even \"remembered\" for that matter.  I had to pay another visit shortly after because my symptoms were not getting better.  Nothing was done, and I spent about 5 minutes with the doctor.  I was told it would get better on its own.  Now...  Since September, I have had an open balance with this office, and I SHOULD have called to pay it sooner.  Having said that, I can also say there is no justification for the message left on my voice mail by the office manager.  It was downright rude and condescending.  She was shaming me and bringing up my place of employment.  I was totally shocked at how unprofessional her message was.  Needless to say, she got what she wanted...  but I will not go back to that office...  the mediocre service was semi-acceptable; however, the office manager's disrespectful and inappropriate behaviour is totally OVER THE LINE.", "business_id": "BZqn7i_Z-MJ1QrxCyjFZSw", "stars": 2, "date": "2014-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "H2O83419_0LsoBHHKsmPgQ", "review_id": "DitgEKD_YyExXLUR53Fe-w", "text": "I must say that I am EXTREMELY disappointed.  After calling the number I had for the doctor and finding that it was disconnected, I had to look in several places to find that he had moved.  No one bothered calling me to let me know that he had moved and I have been a patient of his for over 5 years with a couple serious issues.  I was just in his office this summer.  After getting in touch with the RUDE receptionist (i'm sure this is the same miserable woman that was at his other office), she told me that Dr. Riley does not make phone calls.  I explained that I just had a couple questions about my medications that I have already been prescribed.  If you want poor bedside manner, go to this office.  Last time I was at his office for a follow up visit, he asked me if I wanted to have my blood work done again.  I said yes.  I had let him know that it had been 3 hours since I had any food and he said that that was fine.  He ordered the test and drew blood.  He got the results and let me know that several things that were tested were not accurate because I had not fasted long enough.  A week later I got a bill from the lab for $280.  So I had to pay for a bunch of bogus results.  Dr. Riley knew I did not have insurance and felt that it was OK to waste my money.", "business_id": "BZqn7i_Z-MJ1QrxCyjFZSw", "stars": 1, "date": "2014-12-02", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "RBwFhQsRkyjPIqxjqaMHwg", "review_id": "YiVPTZLMMax_CfzMUD5uPg", "text": "They were SO rude....Dr. Romine was nice enough to stop by and said \"anything you need make sure you contact us\" but besides that they were just plain rude. Definitely not going back....", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 1, "date": "2012-02-28", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "keGU21E2CaNMbTiJe6eGQQ", "review_id": "bAvpyvz3tF6u5BV8hXJe5Q", "text": "I saw Dr. Romine's office for a few years for acne maintenance. Eventually I decided to see one of her aestheticians for a light chemical peel.  This light peel ended up scabbing over most of my face mainly on the sides near my cheeks. I went back to  them after it started to get more severe and was told by Dr. Romine that I was actually lucky because I was getting the result of a more aggressive, more expensive peel. What I wasn't given was the proper instruction and/or topical treatment for this type of peel which has subsequently left me with the darkening and scarring of my face. I went back 6 or so months later with these same concerns and was told that I have a skin condition and that it was not caused by the peel. However, I know that it was.  Seeing as this is a dermatology office, I felt confident getting this type of procedure.  I understand that sometimes things don't go as planned, but not taking accountability for these things is a different story.  Maybe I could have taken some sort of legal action, which I did not,  but would like others to be aware before deciding to get a treatment like this from them.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 1, "date": "2013-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z0k8EZvj09tsabMBALC2CA", "review_id": "m1wGrPfC6zGMzlfwsIWggg", "text": "Very professional staff! From the time I came in , got very professional service .  The building is clean , nice and a peaceful music is going along the building and helps to relax . Surgery always is hard for me, but with the professional service this place provides keeps my heart in peace!", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 5, "date": "2015-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1ifPe76uZ-UUEbUsuySHhQ", "review_id": "VLGMAaFjXKWhKRV7wrCjjA", "text": "I am so grateful to have found this office! I needed to see a Dermatologist for my rosacea. The care regimen and creams they prescribed have really helped. Everyone there was very nice and I waited only 3 minutes to be seen. The office is beautiful. The Doctor really listened to everything I said. I couldn't be happier, I wish every Doctor appointment was like this one was!", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 5, "date": "2015-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z3JMacWPJ7r9onwLm7b-hw", "review_id": "OQWn4smdY_oC4pRw_C631g", "text": "I am very impressed by the staff especially Kayla who went out of her way to help me with my tight schedule!  I have seen both doctors and both were great answering all my questions with clarity and professionalism.  I have been a patient for several years so I have had multiple visits to the office.  Thank you Camelback Derm!", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 5, "date": "2015-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nqrxW971l7nfVgreKwBzwA", "review_id": "nRNSWItYUJYw82fjqkVHGg", "text": "Exceptional doctors that are extremely personable and take plenty of time to discuss your issues... Highly recommend Family Practice Specialists!", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 5, "date": "2012-01-04", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "DblIKwFdkkTNAeft7J4Taw", "review_id": "0F8izQ3T5I8P0vpnNkXcfw", "text": "Finding a new doctor can be a pain. So, when I came to Family Practice Specialists I was pleasantly surprised. Each time I've gone, I've had minimal wait time - and have always been greeted with friendly receptionists and staff. I started seeing Dr. Ungar - who was friendly, comforting and extremely thorough. All things you'd want in a doctor. \n\nI've also found that this office also several doctors on staff that also specialize in other areas, including Women's care issues.  Which will turn out to be very convenient in the future. I recommend!", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 4, "date": "2013-01-07", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "ye7i7pKLn7j26-M93J0DUA", "review_id": "JXBZ6LwMmpA1CBtnqXoYgA", "text": "Let me preface this review:\n\nI live a healthy lifestyle, exercise regularly, don't smoke and rarely drink.  \n\nI rarely go to the doctor and visiting this practice reminded me why. I came in because I've been having trouble sleeping. I made an appointment with KATE MONTGOMERY , RN, CS, FNP.\n\nAll I can say is WOW, I've never felt so judged in my life! She was down right rude! Canceled all my remaining appointments They also charge some BS annual fee not covered by insurance. \n\nI will finding another Doctor that is not so judgmental. If I were you, I would pass on this facility.", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 1, "date": "2013-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "ujxEf0qldCj1hnlXvqfOmw", "review_id": "NLl7fsvjlYpq_2zY5SYqUQ", "text": "Our Dr. is great but the administration fee is completely inappropriate.  They charged my wife an annual 49 fee and myself a 49 fee.  We are not going to pay $98 a year to be seen at this facility when they collect our co pay and bill our insurance company.  We will find another provider.", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 2, "date": "2013-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pleBJ1SIkr2b_2i-hjCQOA", "review_id": "zjRcin5z10lx0j0AN1fBWw", "text": "I have went to Dr. Francyk for the past few years.  He is always professional, honest and informative.  I am never rushed and he answers all of my questions.  He is a Dr. that takes his time and listens to you.  I highly recommend him.", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 5, "date": "2013-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "ixKX_0b7aa9I7z2H5g_Rqg", "review_id": "f4TobHa8mUfOrHHB_AMopg", "text": "Hi All, \nJust an update, 2/23/2013- I changed Drs because of the admin fee and the office is still trying to charge another \"administration fee\".  Soooo that pretty much means there is a bi-annual admin fee charged.  Was forced to pay the first fee because I was a patient, trying to get the most recent fee charged last month removed since I'm not their patient- patient beware, it's like a bad late night infomercial, \"How do I cancel???!\"  grrrrr", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 1, "date": "2013-02-23", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "Hm9VC9r2G4sjN6tjiGUGCg", "review_id": "lS1PEa0pviP6YpZRy4qfqg", "text": "I've been a patient of Dr. Wyse for several years. I have always booked my appointments first thing in the morning to avoid waiting in the 'little white room' too long. After the third time of waiting over an hour after arriving at 7:30 in the morning and nothing more than a \"i'm very booked\" as an apology, I've decided it's best to move on and find a new family doctor. \n\nThere are some rare services or individuals that are worth the extra wait. This, unfortunately, is not one of them. I find it very arrogant when anyone feels their time is more important than yours.", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 1, "date": "2013-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VYf9Bm977EtjD2Vtq7pI0A", "review_id": "dZoALrQJoSqX15b5SA2-_A", "text": "I started here this past year and everything seemed great. They do charge quite a bit but its a doctors profession what do you expect. My first visit was a great one aside from my needed bloodwork she examined me with an ultrasound wand I actually saw my tubes and they looked great. Due to at the time I financially wasnt ready like I am now . So I will do a follow up . Keeping my prayers up....we shall see", "business_id": "Y68Ysab60gJhX7YBjESgBg", "stars": 4, "date": "2015-12-18", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "-XJPEODAymxB1m18-1JXJg", "review_id": "Qi_FDIUdXJ0urilr8Mj6fQ", "text": "While dr Corcoran is nice and comforting getting into see one of the doctors is virtually impossible. I have never been able to get in to see a doctor or physicians assistant within48 hours and when you are sick that's essential. \nAdditionally the staff there act as if they are doing you a favor by taking your money. I have never witnessed such nonchalant behavior at a doctors office. Ridiculous", "business_id": "1GXycbqgmD9TfhQFoktSLg", "stars": 1, "date": "2014-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "KRvx3YeAa5MZZGDGHLXrIg", "review_id": "Klyq_oAIfDQj3LzQdHxnyQ", "text": "Moving into 2015 and dealing with another insurance change. I always freak when this happens because I worry I will lose Dr Corcoran. But I am lucky and all is good. I have been seeing him for a few years now and it is still great. I have had the experience where things often start out fine, and then for what ever reason things sour over time. They can get you in pretty quick. If not with him a NP or another doctor if it is an emergency. I like that Dr. C takes the time to stop and look back in your chart and remind you it has been a while since this or that or whatever. No I don't think he is padding the bill I just think that since he is a DO and not a MD they are trained to think of things more in terms of the whole picture than just lets fix this one issue. He is easy to talk to. Really if I ever got horrible news you would be ok with it coming from him.... I know sounds weird but I have had so many doctors over the years who treat you like you are gum on their shoe or too stupid to live. With my chronic pain issues he is careful to work with my other doctors and keep them informed of any new issues. I kind of wonder sometimes why Dr. Corcoran decided to be \"just a primary care doctor\" but I am glad he did.", "business_id": "1GXycbqgmD9TfhQFoktSLg", "stars": 5, "date": "2014-12-02", "type": "review"}
{"votes": {"funny": 1, "useful": 6, "cool": 1}, "user_id": "bFEr6lLL4LqOUQuYAQekJA", "review_id": "hzUF7ab8Wf0xmBY2ATgdUA", "text": "I went in to Dr. Meger's office to see him about a Brazilian butt lift a little over a week ago. I have thought long and hard about this decision, ultimately deciding I was 100% ready to do this.  I was very excited to see him and speak with him about this procedure especially since he was the first Dr. I had chose to see about this. The office is nice and inviting and so are his staff. When I actually met Dr. Meger, I automatically felt like he didn't take anything I was saying seriously. He gave me this strange, blank stare the entire consolation. He was short with his words and the whole room felt awkward at times. Even my friend who was with me felt the same way. To be honest, I was disappointed in my experience because I was so excited and was fully ready to commit to this big procedure. I will say the last woman who came in to speak with me about financing has a great personality and listened to every question I had. I really appreciated that. \n\nI am a 22 year old professional woman who makes more than the average person my age. I really do feel that my age is the reason why Dr. Meger didn't seem to take me as seriously as he would a 55 year old woman getting her 2nd boob job, financed by her husband. Dr. Meger seems like he is great at what he does, but should maybe not offer free consolations if he is going to treat them like a waste of time. \n\nMaybe I caught him on a bad day, but I felt the need to write my first online review due to this negative experience.", "business_id": "H8_d-SvwBz-Sd_ZTK7Kucw", "stars": 1, "date": "2015-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WQCfq31K0mNE3CmXW-Em5w", "review_id": "XGyLCqLYYpUPAw0FZF3_EA", "text": "Dr Meger and his team are amazing. From the moment I stepped into the office for my initial consultation all the way through to my post-op check up, I felt loved and well taken care of. Dr Meger was so thorough and the outcome has been excellent. (I had 15 yr old implants changed.) I have already recommended Dr Meger to a few friends. One of whom had a procedure and was also ecstatic. If you're on this site looking to make the right decision on a surgeon, look no further. Dr Meger and his team will take good care of your needs!", "business_id": "H8_d-SvwBz-Sd_ZTK7Kucw", "stars": 5, "date": "2015-02-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "vvtIiG9-hXaSQjgVZw59Sg", "review_id": "zTKAKOxXn0DEmkpA2kw1hg", "text": "First of all I called the number to the McDowell office and was connected unknowingly to the 7th street office and made an appointment there accidentally. So when my appointment came I went to the McDowell office first then was told that my appointment was on 7th street. I tried calling the 7th street number that i was given and it called the McDowell office 3 times. I finally was connected to the 7th street office via the McDowell office on my 3rd try. Upon arriving the place looked okay and smelled okay, except whatever cleaning fluid they were using gave my husband a headache. We waited a bit to be seen since we showed up later than our appointment. When i was seen the office people  seemed to be in a hurry and not very personable, the doctor looked at the bump I had and said it was a boil and to put a hot compress on it 3 times a day even though I was in excruciating pain and it would go away.. After following the Doctors order 2 days later I ended up in the hospital, the bump was growing at an alarming rate and was to the point I could no longer move around with out being in pain. Come to find out it was not a boil at all but a Cyst that needed to be drained immediately and would not have gone away on its own. Had I been told 2 days before that it was a cyst it would not have been as painful as it was when I went to the hospital 2 days later.  I was misdiagnosed by the Life Choices Women's Clinic. I strongly encourage you DO NOT go to this clinic no matter how cheep it may seem.", "business_id": "8PnmGKOTyHKp0b04w62fMw", "stars": 1, "date": "2015-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h6abdF5bWDLwyeihc2_VXQ", "review_id": "KRuobWtHQWVC0Et4FbZxOw", "text": "Life Choices is always my choice for my well woman check. I have referred them to my friends and clients. The staff is always friendly and have given me great referrals for other services. I chose Life Choices because their fees were less than half the cost of my Previous Doctor but they are not just affordable, they are efficient and caring too.", "business_id": "8PnmGKOTyHKp0b04w62fMw", "stars": 5, "date": "2015-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "s2TTCqBt93zlnzns5Z0TBg", "review_id": "-Aaq_8DKHXJKQz-VZZYGNQ", "text": "I am currently a patient here at the hospital.  Some of the nurses here have a great bedside mabber, but there are a few that are rude and unwilling to be compassionate to my plight.  As wel as the anathesia Dr. who instead of giving me something for the pain to slide me over in the or bed, he kept telling me to do it on my own, which caused an excrusiating amount of pain.  There is no communication, the Dr's don't relay info and am kept in the dark most of the time.  If I had my choice of a hospitals I would not have come here.  Disorganized, rude and very authoritive when being talked to; \"you are going to do it this way and that is it.\"", "business_id": "Z9ogOCIkHasuKVELa8mQ_w", "stars": 2, "date": "2011-12-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "28yBDNNKdYlm_oFCSPFJXw", "review_id": "ZKXdMpfAtF1sOjkrQbzIbg", "text": "Though the staff and medical care was excellent the cleanliness of the place was not. There was blood on the bath room door and walls of my patient bathroom. The urine measuring output cups were not cleaned out at all. Patients were expected to do this , I guess, as it never was done by staff.\nAlso my roommates visitors were allowed to treat the room as their personal waiting room even when patient was not there. The were very loud on their phones and with talking with each other and had no regard for my privacy or rest.\nStaff did not address this issue and did not even seem to care!", "business_id": "Z9ogOCIkHasuKVELa8mQ_w", "stars": 2, "date": "2012-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Aaafbip-U2aeTXbvinBLiA", "review_id": "IPYAzciXaZorJt-F9EkvVA", "text": "My grandfather stayed at this hospital this past fall.  The staff and doctors were so nice and helpful.  He didn't complain about the food, so I guess it was ok.  I did eat in their cafe which is by the main entrance.  Pretty good for hospital food and cheap! His room was huge, very clean and newly remodeled.  Thank you to the doctors and nurses that took care of him!", "business_id": "Z9ogOCIkHasuKVELa8mQ_w", "stars": 5, "date": "2012-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RrEQxpQbFdCWArBn9oClGg", "review_id": "X4j1NTR7_P7ndBYJFrjvNw", "text": "I'm sure you're thinking, who writes a Yelp review about the Emergency Room... I do! I was very pleased with the services performed by the ER doctor, nurses and X-Ray techs at John C Lincoln hospital. My fiancés car was struck by a car that ran a red light. \n\nThe ambulance arrived to the scene within minutes of the accident and brought him from his unconscious state. I really appreciate that they called and notified me upon their arrival at the scene.  At the hospital they administered a battery of tests within an hour. They made sure he was ok and they definitely gave him top tier treatment. \n\nThank you John C Lincoln hospital!", "business_id": "Z9ogOCIkHasuKVELa8mQ_w", "stars": 5, "date": "2014-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BsgXTs_hz4AwgbK0wSIIxw", "review_id": "_PCBJPtj_G3te_MypcnSZw", "text": "Had to drop off my mother's heart monitor to the cardiologist.  This office is easy to find and it nice there is 2 hour parking for patient use.  Also a nice drop off area too!  I was able to get the elevator to the floor easily sharing itbwith some very nice older folks.  The office I needed was right there easy to find.  The receptiwas very friendly, looked up my mother's information and took the monitor with a smile and a \"thank you\".  I was then out and home within 15 minutes.  Very pleasant experience.", "business_id": "Z9ogOCIkHasuKVELa8mQ_w", "stars": 4, "date": "2015-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kpbhy1zPewGDmdNfNqQp-g", "review_id": "e6to3qw0_aohiryDt02PlQ", "text": "I've been see Dr. Bruns off and on for over ten years.  He's always been extremely nice, approachable and caring.  This last time, I met with PA (I believe her name was Kelly) and she took quite a while with me trying to understand symptoms and possible causes.  She relayed the info to Dr. Bruns saving me the trouble of repeating myself.", "business_id": "PzMU15mDNyXeH8p4_qm9PQ", "stars": 4, "date": "2015-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RrcfyhWEWWPqWtAwNnTasw", "review_id": "W_CpbfGSr76GRYNE97Pvwg", "text": "I was raised in a medical household specializing in women's care.  My first visit unfortunately was a bad one - I had lost the baby.  Dr. DeSanto was amazingly caring and worked to ensure that I was not only physically but emotionally ok. In the follow ups, he focused on my goals which were to have a baby.  He took the time to hear what I said, how I felt and to answer my questions.  His nurse is a doll and she always takes the time to get to know me and where I am at emotionally on the process.  This office is dedicated to the goals of the patient and focused on real care.  While there is a bit of a wait, I would rather have that and know that the doctor and staff are taking their time with their patients.  Cannot say enough about this office!", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 5, "date": "2010-12-30", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "PO1H81tZBIjRK84sWpCsVQ", "review_id": "SHSKEqwuS07BfmM18xe8xA", "text": "I have been seeing Julie Bergdale, RNP, for about four years now and I can honestly say she is my favorite doctor I have ever had the pleasure of working with. She has great bed (table?) side manner and always makes me feel comfortable. Going to the gyno can be as unpleasant as visiting the dentist or making a speech in public, but Julie always puts me at ease. \n\nI have recommended her to two of my friends, who also enjoy seeing her. Two thumbs up to Julie and the staff at Camelback Women's Health!", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 5, "date": "2012-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YNpH3op-djAkQniQ11Go8w", "review_id": "q2hTceufEcbCk2x42wlJOA", "text": "Best OBGYN in the world - Dr. DeSanto! About to have my third baby, had another OB in another state with DD1, and moved mid-pregnancy with DD2, so I do have experience with other OB's. The office communicates well when I have questions, need an appointment or a change, or on the rare instances my appointment needs to be moved. Dr. DeSanto always listens to questions reasonably, isn't a meds pusher, reassures when parts of pregnancy that are wacky are just natural progressions. When DD2 had her shoulders stuck, he managed to get her out and keep me calm at the same time. He genuinely cares about seeing the baby and having ultrasounds. Unlike many other doctors he doesn't hold back on ultrasounds, communicating expectations for the current and future appointments & post-partum. I love Esther his nurse also. I have seen the NP in the past, she was also magnificent. I don't ever want another OBGYN!", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 5, "date": "2013-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "GrrlhpgemJtWlBlxsEbl1w", "review_id": "qqp1sPc5-cYYZQVdxnPcRg", "text": "My issue is with Dr. O'sullivan. She's straightforward, no sugar coating, no emotion, no small talk, just strictly to the point. That's usually not my go to type of doctor but besides the personality factor I didn't have any other reason to switch at the time. \nI guess I should have gotten worried when she prescribed Zoloft for me because I was \"depressed\". I've never been treated for depression nor had any other doctor ever bring it up. I was young, unmarried, still in school and pregnant with horrible morning sickness. Would you be thrilled? I did not take the Zoloft, which now has a huge law suit for birth defects! She also wanted to give me zofran for my morning sickness which I refused to take as well. \nI went into labor at the hospital at 8pm and dilated until about 4 am that morning. Dr. O'sullivan didn't show up until almost 6am. My daughter sat in the birth canal so long that when she was born she was not breathing. My heart dropped when I didn't hear my baby crying. What did the doctor do? Nothing! Absolutely nothing. She stood there looking so confused. The nurses ran the baby over to the table and called a code. Other nurses literally ran in and revived my daughter getting her to breathe. Dr . O'sullivan did not even touch my daughter once while all that happened she just watched. If it wasnt for the amazing staff at good Sam my daughter would not be here or may have had long term effects. Even worse is that the same thing happened to my cousin. Dr O'sullivan was her OB and took a very long time to show up at the hospital as well. My cousin had already had two children so she knew the risks of waiting and told the hospital she's not waiting anymore so go get the doctor on staff. The dr at the hospital delivered her baby with no problems but just imagine if she had waited for Dr. O'sullivan to show up what could have happened.", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 1, "date": "2013-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mlN-spTzIsBHAh8OCWiv9Q", "review_id": "Njo_ZZ1e_H-51U9VQTI8KA", "text": "As pleased as punch I had a very negative experience with my first health care center but now I could not be more pleased. Dr. Nelson is Amazing and so kind. I started coming here on the recommendation of a good Friend. Everything is handled in a completely professional manner. Only one time did I have an extra long wait time but it was explained to me when I checked in. the entire staff is professional and warm. they remember you ever time you return and are always smiling. I would recommend this office to any of my friends!!!!", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 5, "date": "2014-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZDybVFNpAnu2dJdkUgE6qA", "review_id": "bDassQ72HD-5H8nuiX9QZw", "text": "Excellent customer service and I love Dr. Schwartz. She is definitely not \"touchy-feely\", but she is extremely knowledgable and takes excellent care of her patients. The MA's and all of the N.P's are wonderful as well. I can say that everyone I encountered throughout my pregnancy and postpartum time truly enjoyed their job.", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 4, "date": "2015-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "c6bsJLypFvd5eeXs_EvuEg", "review_id": "huTjwRjNwh34pPImQAOB7w", "text": "Dr. Schwartz has caused me several years of pain and suffering due to her poor decisions regarding the birth of my daughter. She instructed hospital staff to not enter my room for several hours during painful contractions (she admitted this to me). Then, when she finally did arrive at the hospital and allowed me to begin pushing, my daughter's head was stuck in the birth canal. She instructed the nurse and my husband to hyperflex my legs (the nurse would not comply, so I had to hold my own leg), which caused an open book fracture in my pelvis which went undetected. I could not sit or walk without extreme pain. I could not nurse or care for my baby. When I arrived at her office crying in pain, her nurse assistant told me it was hemorrhoids (!) and sent me home with pain killers and suppositories. My fracture was never examined or treated. Six years later I have suffered chronic pain and now require surgery to fuse my hip. \n\nI am considering legal action, but am torn between letting it go and moving on. At least I can warn others to make a better decision about their healthcare. She is too busy for you at the very least and incompetent at best. Please consider my story in your decision. Thank you.", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 1, "date": "2015-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "O0GQA7CYMXAhss8qIKA2sA", "review_id": "MfvIjhkG2e5NUAW5iR9M8w", "text": "This review is for the Camelback office. This office has been very difficult since I started going there last month for my pregnancy.  I was referred by a friend to Dr O'Sullivan and because of an emergency I was only able to get in with Dr De Santo.  I have had about 3 about in a 6 week time.  The three appointments I had made were made to my convenience, around my work schedule.  I was called three times, once for each appointment to reschedule.  These reschedules had nothing to do with the doc running to the hospital to deliver a baby, they were simple errors made at the front desk.. on three different occasions.  Very frustrating to say the least.  I had to reschedule all three of my appointments and miss work each time.  Every time they called to reschedule, I would still get a reminder call for the appt they had just cancelled (which was automated and after hours).  Not only was that annoying, but I worried I would be charge a no show fee (with their own fault) and would call them first thing in the morning to point out their fault and to make sure I didn't have an appt.  They never sounded surprised that I was telling them that THEY had rescheduled me and that I didn't'  have an appt.  One day, I had to stop by in the morning, first thing to give blood.   I was told that they open at 8--and that was great because I wouldn't be missing work (I just started a new job and really don't want to be coming in late all the time or using PTO), when I arrived at 8 for blood work (along with 2 other women also there for blood work), the front desk informed us that the lab technician is not in to take blood until 8:30am, another break in communication from the front desk.  I would not recommend this office and as soon as I am done with my follow-ups I am out of here!  The doc himself is very knowledgeable but is not moving along with treatment for my miscarriage, and does not listen to mine or my husband's concerns.  He is also not very personable and doesn't take the time to explain things--rather he beats around the bush.   I also enjoyed how at every appt they would ask when your last period was, \"hello, I'm pregnant!  And my last period hasn't change the last 3 times you've asked---look it up on the chart!\"  This office is very unorganized!  They made me feel like a number and not a valued patient.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 2, "date": "2010-12-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "fPHLPrymsyb6WSFFKoMrTQ", "review_id": "zRxKPoSBu1QcE6TA7iyDlQ", "text": "I've just returned home from another successful visit to Dr. DeSanto and Camelback Women's Health.  This was my 4th visit and each time, I'm impressed by how nicely they can fit me in to a time I need.  They've never canceled an appt on me or even rescheduled!  Plus, with my doctor, I have my choice of different offices on different days.  \n\nThis time, my appt was a special case because I was in an automobile accident last week... yes, a guy rear-ended me in my 6th month of pregnancy!  :(  Of course all I could do was worry about my baby but,  DeSanto put my anxiety to rest with some talk and an ultrasound.  I sat there and watched my lil guy hiccup for a while (while the dr was doing some measuring and checking).  It was relaxing...\n\nIt's especially nice that Dr. DeSanto can answer all of my questions and never seems in a rush.  Guess with his experience, he doesn't get stumped too often.  Maybe I should try to think of an especially uncommon and hard question next time. lol\n\nSee ya there!\n\nPS  I see someone seems to have something against my Dr but we can tell your reviewS are fake.  :p", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 5, "date": "2010-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d00JjSnRS74vxl65brpznA", "review_id": "Lf4g1pAFcg8crPtK5JjiuQ", "text": "Bad customer service.  I was on my third rescheduled appointment (the doctor had to reschedule); I show up to my 3rd rescheduled appointment only to be told the Nurse Practitioner was running 1 hour and 20 minutes behind.  I came from work to this appointment.  They could have picked up the phone to let me know!  \n\nI asked if since I lived up the street if I could come back in an hour and was  told \"no\" they would take me back right away.  To do what?  Sit there naked in a gown for an hour and a half?  No thanks!  Will be going elsewhere from now on.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 2, "date": "2013-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q5uhpH1pbYWAbzUk_MJRKw", "review_id": "Lr7FVOUmhWPbsE_OOYSGow", "text": "I like Dr. Desantos. He seems nice and caring. I cannot stand office staff. They seen arrogant and occasionally rude. There is always really long wait time. It is infuriating, considering that they Require you to come in 15min before appointment time. I was refused to be seen ( by office staff, not MD) because I was there 10min prior appointment (not 30 as they required for 1st appt. It was not justified medically, girl on the phone did not verify Why I have made an appointment, could have had an emergency)\nLooking for another obgyn now.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 2, "date": "2014-02-19", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "JgufYQ94cHyEo9b8StajnQ", "review_id": "1mxNTD-A4Vw7svl6GJiGEg", "text": "Dr. Lykins was great...but the office staff was horrible!  \n\nHe saw my two kids (2 and 4) to have tubes removed.  Not sure why I had to come back for the second appointment, but I think it was a $$ thing...anyway, suppose to have surgery in two days and I canceled both!   The office insisted that I had to pay before the surgery (to the tune of $35)...but they hadn't billed for the kids last appointment.  If they had we would be at our deductible and owe NOTHING!  The lady argued with me about it...I was so upset, I have another appointment for the kids on Monday with another ENT to have their tubes out...what a circus!", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 2, "date": "2012-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "cNVLzGcqyHyMqTNmQFMIOg", "review_id": "SrqEgy3MZZZIG7Fy_FDVMw", "text": "Lacks Integrity, \n\nSo i was referred to Entegrity about a  consultation on possibly having surgery. My visit was  all of about 3 minutes where the doctor took a look and said that i might want to consider surgery. I opted not to do the surgery, and then got a bill for $744.00, of course my insurance paid half but i was on the hook for the rest. I called in and tried to qualify why i would have to pay for a simple consultation, the ladies at billing were matter of fact about what I had owed. $740.00 for a simple consultaion that took 2 minutes.\n\nI would make sure that you know what they are going to charge you before going into their office. I wonder if the insurance companies know that they are over billing when ever they can. \n\nComplete rip off. They should be ashamed,", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 1, "date": "2013-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HNBLSSyj7LaCHkihV24gsQ", "review_id": "D8b_xqwOMZcFXg-uHz6vwA", "text": "My husband and 7-year old son met with Dr. Bailey at the beginning of December to discuss allergy treatment options for my son. I wasn't there, but my husband felt very good about Dr. Bailey, who seems to be a good doctor. However, the follow-up and communication from this office are absolutely horrible and unprofessional. First, we had to transfer my son's medical records from another office. Then, we waited to hear back from Entegrity to know if my son would be a good candidate for sublingual drops treatment. We waited several weeks and I had to finally call twice to learn that, yes, indeed, my son was a good candidate and that I could order the $200+ treatment for 3 months (not covered by insurance) and pay with my credit card over the phone. I did call back (at least twice) to order the treatment and was told I would get another call to pick-up the treatment. My credit card was promptly charged, and after 10 days, I was still waiting for a call back. I called myself (again) to be told I could come pick-up the treatment at any time without an appointment. I came with my husband and son on a Monday morning, and was just handed a case and 2 forms to sign (including a waiver of liability). No word about the treatment. I asked to talk to someone before signing anything, and then was told that I didn't have an appointment, so I would have to wait! We ended up spending a good hour at the office to finally see someone who answered our questions about the treatment. I was told that in the notes it said the doctor had called us to go over the details (neither my husband not I ever got a call from anyone). Dr. Bailey might be good, and the treatment worth it, but the communication (or lack thereof) is appalling. Do something, Entegrity!", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 1, "date": "2014-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UC1DS4CUE-qkuwryyDP_Ug", "review_id": "fq0zq26icjwBlNRu0s3UIQ", "text": "I went to several ENT's without relief before trying this one. I was diagnosed and provided options by my second visit. I no longer have the breathing problems I once had. On a side note I never had any issues with the staff.", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 4, "date": "2015-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "LSSZI0HrEgmMJA2us43SZw", "review_id": "AycnvY_0iHO-p0FSdBTYcw", "text": "The Doctor was nice however, the staff is not friendly and or attentive. The lack of customer service and willingness to work with you is what will prevent me from returning. They sent my statements to the incorrect address after I requested the address to be updated and never once called or emailed me regarding my bill simply decided to send it to collections.", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 2, "date": "2015-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Aq23-C-vFts-Zj2pXQqvWw", "review_id": "j3lYcJuHPjj9CDmChDS2-w", "text": "I noticed that alot of the negative reviews were outdated and someone mentioned in the review that the office was in south scottsdale. This review is for my 2/25/15 visit at the north scottsdale office off of Scottdale road and 101. I asked the office staff if there was another location and this is the only Entegrity ENT in Scottsdale, so here goes. \n\nI was here last year as a new patient and my experience has been positive, so i have returned this year for another condition i was suffering from.  \n\nI saw Dr. Samuel Bailey both times and he has great bedside manners with positive energy and always smiling.  I hate grouchy doctors :P\nHe answered all of my questions and i didn't feel like i was being rushed. Most doctors offices usually have their PA or NPs do all the work and doctors will only see you for 5 minutes tops but Dr. Bailey gave me his full attention and was super friendly,  and kind.  He explained things easy and thoroughly enough for a child to understand AND still had time for my questions. \n\nI have not seen other doctors here, so i can't speak for them but Dr. Bailey has been one of the kindest, caring and considerate physician I've dealt with and i highly recommend him for all your ear/nose/throat needs. \n\nAs for the office staff,  they must have new staff because nobody at this office treated me bad like some of the things that were mentioned in other negative reviews.\n\nMany doctors offices want the patients to pay up front if you haven't met your annual deductible but Entegrity will file a claim with your insurance first before they bill you,  so i don't agree with some of the reviews complaining about the office only wanting money.  \n\nBottom line;  if you need to see an ENT specialist and want to see a doctor that will actually listen and pay attention to you explaining your symptoms who is very kind and caring, then schedule your appointment with Dr. Bailey. You won't like him if you're one of those people who don't like nice and friendly doctor (trust me,  i know some people who prefer their doctors to be a$$holes).", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 5, "date": "2015-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "widjU-plAStI94K-JGtPJA", "review_id": "_ONridjUTnvRJnYhWDgoyw", "text": "Go Elsewhere!! The staff is very poor at scheduling, the office is way\ntoo fancy for a doctor's office. In a day and age where healthcare costs\nshould be coming down, these Doctors are spending money foolishly\non fancy furnishings and decor", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 2, "date": "2015-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IyketgiuwVoFry2bbqapew", "review_id": "mUBkSm5RzTdsKZ14n6EYhg", "text": "I have been a patient of Dr. A. Katz for over 15 years.  He is kind, caring, and thoughtful.  I have such trust in him, that I moved my kids from their pediatrician to him while they were in middle school.  His PA is just as wonderful.  They have take great care of my family.", "business_id": "0-KOpYSe9aQTAfM38f47HQ", "stars": 5, "date": "2014-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UZysWMlFjuMWGTC2qYmIZw", "review_id": "qVvRyPG-v-jVKePrFthmrQ", "text": "Dr. Campbell is great. Excellent bedside manner, really takes the time to get to know you. \n\nI really like the online patient portal. I spend a lot of time on the computer, and don't like sitting on hold. Using this portal I had easy access to email Dr. Campbell, and check out lab results. \n\nDr. Campbell is really responsive to the email, usually replies same day  ( if it were an emergency I would just call)", "business_id": "0-KOpYSe9aQTAfM38f47HQ", "stars": 5, "date": "2014-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9hV2Tf54ZFPcllBI-dwM_A", "review_id": "fN4RRG4epIGWUN1qIF4LNQ", "text": "The staff, doctors, PAs, RNs, etc are mostly great!  They are very quick, efficient, low waiting time (if there is any), great location, able to see you same day (if you call 8am - 8:30am), and all around exceed expectations..... The only reason I did not rate this business 5/5 is because when I have called the main line to make an appointment or to request a follow up phone call, the receptionists can be curt.  I understand they have business to conduct, but speaking as if you are mid-bite into a sandwich,yelling to background noise while on the phone, and being short is a difficult combination to tolerate..... especially when there are so many other places to go to in North Scottsdale.\n\nI will continue going there, I think they are a great group of doctors / medical professionals, and I am overall very happy with Paradise Valley Family Medicine.", "business_id": "0-KOpYSe9aQTAfM38f47HQ", "stars": 4, "date": "2014-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k1coIN6KCohR0lc2LxWv0A", "review_id": "jqMSL8eJGAkEiVzBWglQGA", "text": "Reminded today of what terrible experience was... got notification of the bill :-).  Apparently, billing is slow, too.  Right on their statement, it shows my insurance paid on 10/20.  I got the bill this morning (12/17).  \n\n$105 for a 10 minute visit with a PA and a simple urinalysis...  My share is apparently $48.   Even that small amount makes me feel ripped for the complete lack of care.   \n\nFortunately, it did prompt me to find another practice - ironically in the same complex - at Grayhawk Medical who have turned out to be great.", "business_id": "0-KOpYSe9aQTAfM38f47HQ", "stars": 1, "date": "2014-12-18", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 1}, "user_id": "q9XgOylNsSbqZqF_SO3-OQ", "review_id": "s_srx5L0kxub6o6W7cPpJg", "text": "I went to Desert Valley to get an Upper GI screen. I got lost on the way (dang google maps), I called and the receptionist gave me great directions. \n\nThe test itself is pretty gross, you have to drink Barium and roll around like a guinea pig while they xray your stomach. The nurse and the xray tech were both really nice and friendly and explained everything along the way. \n\nIf you find yourself in a situation where you have to get a GI screen, I would recommend Desert Valley. The staff was polite and professional and made me an uncomfortable experience almost pleasant.", "business_id": "5HVmR0I_MUcpwKcne8zfBA", "stars": 4, "date": "2012-01-17", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 4}, "user_id": "4PSuwOabKtPxtdKePnFjnw", "review_id": "aD4q8vmY3an6-J4kq_FWKQ", "text": "I have had absolutely fabulous experiences with Dr. Holy. She and her staff are awesome. I had the liquid magic facelift and I feel amazing. Results walking out the door. I totally recommend her for a procedure or even just a full body check.", "business_id": "6r8KHqgmlM3PWVZ7suyQ6w", "stars": 5, "date": "2012-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YsfMUYu2bZkaWbVW6o19bQ", "review_id": "7PJS3HZMqJwXiYWXeRx1uQ", "text": "I was referred to this practice by a colleague of mine. I was very excited to find a \"one stop shop\" family practice where lab and x-ray's can be done in the office, to avoid the troubles of having to go to a lab and wait for the results, then go back into the office. \n\nDr. Sobel is a very personal man. I have no qualms with him. However, my first visit, Jessica, was quite rude and remained so with every visit.  Although I had a scheduled appointment, I waited in the lobby for about 30 plus mins before being walked back, only to wait another 15-20 mins before Dr. Larry would see me. \n\nAt first I thought it was just an anomaly. However, it was like that every visit, and the office staff was not forthcoming about running behind schedule, and very unapologetic. \n\nYesterday's experience took me over the edge. My appt was at 3:40p.m., I did not get called back into the office until after 4:45p.m. LITERALLY! I had checked in with \"Jessica\" a couple of times to inquire as to why it was taking so long, she said my \"chart was up there and will be called in order\", stating, \"this is Dr. Larry\".  However, I noted some people were called in earlier than I that came in later. I was finally seated in an exam room and waited until 5:14 p.m. before coming out and asking what the deal was. I asked if Dr. Sobel was being over booked or this is how late he runs all the time. They said, \"It's Dr. Sobel\". \"He spends a lot of time with his patient's\". Although that may be a good thing, it should not be at the expense of the next patient.  it is my professional opinion, that if he spends a lot of time with his patient's, then they should schedule accordingly to allow room for that time, instead of making patient's wait an hour and a half to be seen. \n\nThis kind of management is totally unprofessional and unacceptable. Of note, Dr. Larry Sobel overheard my questioning, and while visiting with another patient, and said...\"You can leave if you want\". I left and will not be back again.\n\nThe courtesy from his staff up front should've been, Dr. Larry is running an hour behind...and allow me the option to reschedule.", "business_id": "Dqr1eP7wpo0BnWdMp4ViNg", "stars": 1, "date": "2013-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "k-gGGTHk6Lqurs0Wycw6Hw", "review_id": "2qwl5CAIzmpjKNbr1lbIug", "text": "Always late!! Have never had an appt that I did not wait for over an hour. They have wasted my time for the last time.", "business_id": "9f5WxUG_Vc-PzBmX6SeTew", "stars": 1, "date": "2012-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Psh8PaEh8c2Wn8YjwyGVvA", "review_id": "EGQQu5HG23ARH87QWd7f5Q", "text": "Expect to wait as long as 45 minutes to an hour from your appointment time until you actually see your doctor. More times than not. Consistently more often than not.\n\nIf you are late, you'd think they wouldn't make a big deal since late is their standard operating procedure.  If you are 15 minutes late, they give your spot away and you are likely to get your appointment canceled. Not a very fair treatment seeing how they can be 45 minutes late regularly, but you cannot be more than 15 minutes late.\n\nAlso, blood draws end at 4:30pm sharp. They fail to tell you this when you schedule an appointment to get a lab order from your doctor.\n\nThe doctor is good. It's just the office policy and many of the front desk employees that are unyielding and like to disappoint clients and not provide 100% customer delight.\n\nDoctor: 2 out of 2 stars.\nCustomer Service in Office:  0 out of 3 stars\nTotal:  2 out of 5 stars.", "business_id": "9f5WxUG_Vc-PzBmX6SeTew", "stars": 2, "date": "2012-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pDfkd6woY8C41Vl2bST8cg", "review_id": "iw0ezNocmekm3kUcBdGMjg", "text": "If you can even get an appointment with a doctor, you will wait 2 hours beyond your scheduled time.  If you need a prescription refilled, you will have to call multiple times to get that done.  The staff is rude and inattentive.", "business_id": "9f5WxUG_Vc-PzBmX6SeTew", "stars": 1, "date": "2012-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Uns6fxAwcEjSiWNAXgFTBw", "review_id": "flJfvCuGdCCC3WnqD8duDA", "text": "He is an awesome doctor. My husband and myself owe him many thanks for saving my husbands life with his thoroughness.", "business_id": "Kpl6cUmrYMczTDY_2RnctA", "stars": 5, "date": "2013-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "68XyxAkZEFb_kXhinFnzOA", "review_id": "mwHiFz7HQp1oYlxyhKQ-jw", "text": "Dr. Druary seems to be a competent doctor and sometimes rushes through appointments. He tried to change a therapy for me that cost less than $1.00 per day (covered by insurance) to one that cost around $10.00 per day and NOT covered by insurance. I had a side effect from a drug he prescibed. He told me that was not one of the main side effects. Several drug sites list this side effict I experienced as 3 on their lists. He is also dropping my insurance this March. I fired him anyway back in August 2014...he just doesn't know it.", "business_id": "Kpl6cUmrYMczTDY_2RnctA", "stars": 2, "date": "2015-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yo3dpAvOOFoWQ6ooT0HcGw", "review_id": "vQjn291kccqY-KsYMyK8LQ", "text": "Waited an hour and still didn't see the Dr. Really bad management. I've never seen a doctor office ran this way and I hope to never again.", "business_id": "C-eUCr7R-76YFPpdpMj_vw", "stars": 1, "date": "2015-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "33vUIil_GCaT92aUaZhRXA", "review_id": "4Snnfs1UhOMKrJ-5r9JQSA", "text": "I agree with Kirstin's entire review! I too followed them from their old location & have been going here for about 8 years now. The current location is very nice & clean. The girls up front are nice but Rosie is by far the sweetest. I used to see Dr. Silvia Castro for my annual but I think she has been pretty busy with her new baby & other patients, so for the past 2 years I have seen Gretchen. She is amazing! Such a sweetheart & really does take the time to listen to any questions or concerns you may have. My only gripe with my last appt on 1/4/11 was that I had to wait 45 minutes before I was seen. I understand things can get busy, especially at the beginning of the year, but it can get annoying to wait 3 times as long as your actual appt time itself.", "business_id": "9xpYUYI4wbNA4XufvVfKzQ", "stars": 5, "date": "2011-01-05", "type": "review"}
