{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "JbWnXwjLaO1kncUkQOMajg", "review_id": "j8GuxQJ_DQsSfrJNkmcACA", "text": "A great townie bar with tasty food and an interesting clientele. I went to check this place out on the way home from the airport one Friday night and it didn't disappoint. It is refreshing to walk into a townie bar and not feel like the music stops and everyone in the place is staring at you - I'm guessing the mixed crowd of older hockey fans, young men in collared shirts, and thirtysomethings have probably seen it all during their time at this place. \n\nThe staff was top notch - the orders were somewhat overwhelming as they appeared short-staffed for the night, but my waitress tried to keep a positive attitude for my entire visit. The other waiter was wearing a hooded cardigan, and I wanted to steal it from him due to my difficulty in finding such a quality article of clothing.\n\nWe ordered a white pizza - large in size, engulfed in cheese, full of garlic flavor, flavorful hot sausage. An overall delicious pizza, aside from 2 things: 1, way too much grease (I know this comes with the territory, but still, it is sometimes unbearable); 2, CANNED MUSHROOMS - the worst thing to come out of a can. Ever. I would rather eat canned Alpo than canned mushrooms. And if the mushrooms weren't canned, they were just the worst mushrooms I've ever consumed. The mushroom debacle is enough to lower the review by an entire star - disgusting!\n\nMy advice for the place is keep everything awesome - random music from the jukebox, tasty food, great prices, good crowd and staff - and get some decent mushrooms; why they spoil an otherwise above average pie with such inferior crap, I'll never know.", "business_id": "KayYbHCt-RkbGcPdGOThNg", "stars": 4, "date": "2011-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Qs5dcst13DnQJwaBcR4VGg", "review_id": "TqmYk2z5qzd8fm0t8aGQQA", "text": "Chilling with Kimberly Vasil, Mikey & Big Bob for the 96.1 Kiss FM Listener Appreciation Party.  Kiss really knows how to throw a bash- $10 power cards, free t-shirts, megaphones & basketballs, appetizers & n/a beverages...  Apps are flowing & delicious, everybody is happy...  Nice Bash Kiss FM...!", "business_id": "sbW8qHJgzEIH42B0S-3New", "stars": 4, "date": "2015-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I-jk9_xWCV3zfDqwrIJDSQ", "review_id": "ToT3c7UGNTicg-s8Nw4Glg", "text": "Another good meal ... this time the Housemade Meatloaf. It's a blend of turkey and sausage instead of the standard ground beef. A refreshing and delicious twist on a comfort food staple. Served over cheddar mashed and mixed veggies. The server could have behaved like she wanted to be there but everyone has a bad day once in awhile. Service was prompt just the same. Overall good experience.", "business_id": "McikHxxEqZ2X0joaRNKlaw", "stars": 4, "date": "2014-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2qp-XuRq7w73yL4uyGg6-Q", "review_id": "a9BhIKXow0PAoK4NtKTQKQ", "text": "My girlfriends made reservations here for my bachelorette party last Saturday. I highly suggest that you make reservations because we were able to just walk right in and sit down. There were people there waiting 30 minutes+. We had the sangria which was amazing. Our sever Alex recommend it and it was perfect for the 4 of us.  I had their thin crust pepperoni pizza which really hit the spot. My two friend had salads which they said were amazing and my other friend joined me in ordering a pesto chicken pizza. Let's just say there wasn't any food left on the table when we were finished.  I will be back for sure.", "business_id": "6p9TlP2I8S4agxYMNFSDjg", "stars": 4, "date": "2013-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Uocg20WJDoxw02xathZb7g", "review_id": "eAN4ZQsADYytBBIY5jZt5A", "text": "This is an established, neighborhood restaurant in the heart of Bellevue.  I found the place by accident, when I made a trip to the Lincoln Bakery across the street (you have to stop there also - old fashioned bakery with lots of very bad stuff, if you're on a diet).\nStreet parking only, and you have to feed the meter.  I also found that it is a cash-only restaurant as well.  No hostess, so you just walk in and seat yourselves.  The wait staff consists mostly of older, seasoned \"waitresses\", as they call themselves,  and the ambiance isn't fancy at all.\nThe pot roast (Thurs & Sunday) is to die for!!!.  When I offered my compliments to the chef, Joe, the owner personally accepted it with a hearty handshake and a thank you and commented that he starts the pot roast, on the days it is offered, at 5:30 am.\nI try to get there close to 4 pm.  after that, the place fills up with a lot of locals, some of  whom related that they have been eating there for a long time.\nI can't comment on breakfast or lunch, but the menu offered a lot of different items, so........", "business_id": "ucKQlQvOeJxETLNkpKcaSw", "stars": 4, "date": "2015-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d4cgvF95YRZ4462NNXwWLQ", "review_id": "j_oAhKmj3hWa9mO26_1S4A", "text": "Went there on my first day in Pittsburg. Wasn't the best experience. My waitress was to busy talking to her coworkers that she couldn't even give us any sauces. The food was ok but nothing to great. When I go back to Pittsburg I will not be going there again!!!!", "business_id": "SgQYRICpMdWCmY7wM2Cmcw", "stars": 1, "date": "2013-12-28", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Or7fUkuJtQCwt4MRWF7pQg", "review_id": "oGT8r7Mn-pbteRxE5Jc5QA", "text": "This is a friendly, hipsters-and-yinzers-living-in-harmony kind of joint. Sports on the TVs, Yeungling on tap--quintessential Pittsburgh. The fried fish (with fries and coleslaw) is Lenten-Catholic quality. If I minded cigarette smoke, this place would be a four; but since I don't, perfect score. Like Scorpion once intoned...\"Get over here!\"", "business_id": "tQpYnf3P3Q_OQLYYJvlV-A", "stars": 5, "date": "2012-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4nlTiVllEXvcvZow11khpA", "review_id": "f-PrxoPb687RvMGsRpWF7g", "text": "Don't get me wrong, the foods great, but when there's only a handful of booths full it shouldn't take an hour and a half to get breakfast. If you get to the point that you'd rather leave and go to McDonalds just so you can eat something it's too long of a wait.", "business_id": "--UE_y6auTgq3FXlvUMkbw", "stars": 1, "date": "2014-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RjkOUl0iLgHkZd9bVx-BZA", "review_id": "7f-wPFGKZOzJXlofoMRdLg", "text": "Tessaro's grinds their burger beef fresh, so you can order yours rare and not worry too much about dying from e. coli (though I suppose the threat remains). I get my burger, rare, with caramelized onions and dijon mustard. It is euphoria-inducing. \n\nThis place is run by the most gracious and lovely women. I feel so at ease here, I wish I could move in. There is a sort of serene-yet-clubby atmosphere, like a men's cigar club that has been suffused throughout with a wizened womanly vibe. Whenever I come here I never want to leave.\n\nThe only downside is that if you go with your veggie friends, they won't have many options. So don't bring them.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 5, "date": "2009-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w0KBFGSbdsUtfaQid2Jzbg", "review_id": "tFkuvwmtPxKiFpbOwTn7Ig", "text": "This is my second time and I'm only writing now because I didn't really use yelp back when I went the first time.. hahah anyways,\n\nThe burgers here are really good! I got the gourmet cheeseburger - bacon, mushrooms, onions, and your choice of cheese. delicious! also you can add lettuce, tomatoes, pickles, and more onions. The meat is good and cooked just right! My only tiny complaint is that it was a little bit dry and had a bit too much charred taste. \n\nChoice of side: home fries. My friend was RAVING about the home fries and how all the other yelp-ers love them so of course I had to get them and they WERE really good! Very wonderful, recommended!", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 4, "date": "2011-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iBNeahEkdtjEo0bWWQzIgQ", "review_id": "Vabi9sfgTeNqwjD8KJDvCg", "text": "Start out by saying I worked there almost 20 years ago and the place and the employees are the same. In the restaurant business or any business constancy is key. The food is very good and the place is clean. It looks old because it is but that's part of fun. The family who owns it is a great family. If you go through Bloomfield stop in but make sure your hungry.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 5, "date": "2014-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qeNsxc0SRZ81tJ6FI9gR8Q", "review_id": "5hr3-7vVpDluidlBgix1Dw", "text": "Amazing atmosphere and people. You walk in and Tessaros is like a time capsule. There's a great old-fashioned atmosphere, speakeasy style music playing, and in general you can tell it's a friendly and laid back crowd. It really has to be experienced to be understood. \n\nThe waiters and waitresses are extremely friendly and attentive. \n\nGetting past the atmosphere, the drinks selection is very good and the prices are very reasonable compared to a lot of city bars. It's why you'll see so many regulars hanging out at the bar. \n\nI got the burger with bleu cheese. It was pretty good. Not phenomenal, but very good. The portions are generous and the prices are low as well for what you get. \n\nThis is a great place to go for drinks and a hearty dinner. Will be returning frequently. This is a place I really hope stays open for another 50 years.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 4, "date": "2015-12-12", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "D1G8W0SgCbsKTv7cAqKcNg", "review_id": "fZRSbHRPoQ0pGKDBe2BO8g", "text": "Stopped by Lot 17 for some apps and drinks with a few girlfriends.  I was in the mood for some fries and got the regular ones which were piping hot and fresh when they came out.  I ordered a glass of cabernet but I probably should have opted for beer. \n\nDecent place for drinks and apps - it was crowded so they must be doing something right.  I would check this place out again and try a full meal.", "business_id": "7XXmky6YYjsvKFwho_eavg", "stars": 3, "date": "2013-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LhgQq1x4n9ardg1PFo8vgg", "review_id": "nIsFInsOy7t7bB_OYAqjpQ", "text": "Excellent vegetarian options, excellent beer selection, good non-vegetarian options, and an all-you-can-eat bacon night.  The wait staff is awesome, friendly, and knowledgeable.\n\nThe average patron, unfortunately, isn't half as cool as the staff, and I avoid the mixed drinks, as the scotch and soda I had was just bad.  Plus, there's an awesome patio, but it's the smoking section, unless that's changed.\n\nSunday brunch is also designed to cure the common hangover, which isn't a bad plan.", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 4, "date": "2008-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "N8koJfNRHsL6ZcQsitYPtw", "review_id": "mHIfabKuBQCHLpa_J1MXFw", "text": "We went here tonight for the first time since I was craving a burger and we've been meaning to check this place out. It has a cozy atmosphere: dark, some leather chairs and mis-matchy furniture, candles, a gas fireplace at the door, good music...\n\nWe were told there would be a wait, but we were more than welcome to sit at the bar. We were fine with that. Just after we received our drinks at the bar the hostess came over to ask us if we'd mind sitting in the lounge, a table with couches as seating. We gladly took the table in lieu of waiting 20-30 minutes as we originally planned on. We closed our tab at the bar and were seated in the lounge. The couch was comfy and we were happier with the couch than a standard table and chairs, since we were having a date night and we were away from the other patrons, able to sit next to each other :)\n\nWe had a pretty entertaining time reading through the food menu, and the drink menu. It's written hilariously.\n\nI decided on the I Can Has Bacon Cheezeburgher (the title! gah!) and my date chose the Thanksgiving Burger (the actual comical name escapes me). My cheeseburger was delicious. Piled with delicious bacon and  cheese, and came with pickles, onions, tomato and lettuce. It was wonderful. I've had many a charred to the point of burnt disgusting burgers in this town and this burger was not one of them. I ordered the fries with it, though I was offered a plethora of options, and the fries were delicious. Crispy, salty, delicious. On the other hand, the thanksgiving burger was MUCH too spicy. In the rosemary spice kind of way. Way too much seasoning. His breath was pretty ungodly the rest of the night, and he didn't particularly enjoy it.\n\nAs far as service goes, I specifically want to note that we were well taken care of the whole night. Our waitress as attentive, we never had empty glasses of water or drinks and were not in need of anything. She brought our check when we asked, and it took a few minutes for her to come back to charge our card. Another staff member saw that it hadn't been done yet, came by and took care of it for us without our asking. So either they've been reading the Yelp reviews about service or we were there on a good night.", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 4, "date": "2013-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4tzuxIVry4xkOR9vbpgjrw", "review_id": "TQT0-5s3LI55DSBOAVwWKQ", "text": "How have I NOT reviewed Harris Grill yet!?\n\nI am embarrassed to admit how many times I have been here. Actually, I probably couldn't even figure it out if I tried.\n\nThis is a top happy hour spot amongst my friends. You just can't beat the $3 frozen cosmo deal. I can't say I'm usually a fan of bright pink slushy drinks, but a post-work frozen cosmo (or three) on the patio on a warm day? Yes, please. \n\nThat being said, we come here a lot in the warmer months as there is always outdoor seating availability. The inside isn't bad either but you have to take advantage of the nice weather when you can! \n\nAs far as food, Harris has a selection of 1/2 price apps during happy hour--a good option to soak up some of those cosmos. I've had a number of entree items as well, my favorite being the \"Imagine the Rastabilities\" (spicy Jamaican jerk pulled chicken mac and cheese). I'm also a fan of the jerk-style tacos and the (oh so classic) Pittsburgh salad. I can't think of anything from here that I haven't enjoyed.\n\nService isn't terrible, but not the best. We've had mixed experiences. Some of the waiters and waitresses are extremely attentive and friendly, and others not so much. One time it took nearly an hour to get our checks. We actually had to send a member of our party into the restaurant to find someone who could print the checks for us. Right before we left, a manager was coming around to check on tables, and we expressed our frustration to her. She was wonderful about the situation and gave us vouchers for a free entree on our next visit. As a frequent visitor, I really appreciated that she was receptive to our concerns and didn't try to make excuses. I very rarely complain but there was no reason for this kind of hold-up.\n\nOverall, one of the best Shadyside happy hour spots. I'm already looking forward to spring so that I can sip some cosmos and unwind outside!", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 4, "date": "2015-02-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LgTdI3xn6Jdo0H-xmT18BA", "review_id": "ED9gaeAtZqNEiE6cwxF7Sw", "text": "Cappy's Cafe is one of those places that you go and hang out with your pals for a bit to eat while catching the game.  There's no fancy decorations or bells and whistles.  It's genuinely wysiwyg (what you see is what you get).\n\nThe folks here are generally older - you're not going to find too much of the college folks here.  When my sister and I went, we pretty much had the whole place to ourselves.\n\nThe foods good, the staff is nice and overall, it's just a nice casual spot to get some grub without waiting for too long.", "business_id": "DkX3YoxhH4uADsgVgQThew", "stars": 3, "date": "2009-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qVJTPzEdycvVqCI7XWMeXQ", "review_id": "oFpPKlNDqC4dJYDWwW4Z2g", "text": "We were in Mount Holly doing some Christmas shopping and used Yelp to find lunch. Thanks to all of the great reviews we have found a little gem! The food is simple, no frills, basic drive in fare, but everything was so fresh. They were pretty busy, so food took a little time to come out. It was worth it, though. A great place to take the family.", "business_id": "jyF0rwmQEIdDWVtP5vlf3w", "stars": 4, "date": "2014-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZzUgfV1CO6XDBGi3KJqOHw", "review_id": "nUZ9y2jqBbWAYjlKjcAvoQ", "text": "I live going in with the girls for the lunch combo and margarita specials :) The jalapeño poppers are delicious!", "business_id": "AUDuCSWYzzRP3H2w7TxtuQ", "stars": 5, "date": "2015-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9mYDx_FUDB5YBELMepBM7Q", "review_id": "7QwZSiPp6fyUcbZbUGMxfQ", "text": "Neat place in the historic area of downtown Charlotte.  Walkable to all the tall buildings but feels like you are in a neighborhood.  Looks like an old-fashioned store with a tin roof.\n\nMore of a pub than anything.  Don't look to be knocked out by the food.  But it's good.  Had a half turkey sandwich with gumbo for lunch.\n\nThe bar is really cool though.  Good selection of beers including two highland beers from Asheville and other craft beers. I'll be back.", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 4, "date": "2011-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Pb6lG-USjdZGssNnIcieFA", "review_id": "eIECoMVvlgS8MOM33u-kIA", "text": "We've been to Alexander Michaels a few times and love it each time. I find it to be romantic and quant. Our last trip was on Valentine's Day. We arrived early as they are first come first serve even on Holidays.  We started out with two beers and an order of potato wedges. The bacon and cheese covered dish was delicious and I'd get it again (without tomatoes).  For my entree I had the Buffalo Chicken Sandwich with Cajun Fries and my husband had the London Broil Sandwich. We both enjoyed our meal and would recommend both menu items. We did not have any dessert this time, so can't comment on that. Our server was very nice and had a to-go box waiting for me before I had to ask. I would recommend visiting Al Mikes with out-of-towners, after work drinks or a romantic dinner date. It has the décor of a tavern, is very dim and crowded inside. You can tell the neighborhood loves this place because like other Charlotte favorites we've found it packed all the time. Enjoy!", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 4, "date": "2014-02-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "ZcEstCa4fDhNXrkZ8_Gh0Q", "review_id": "4fOh1f-IgFUs37Bxe7MBpg", "text": "There is nothing wrong with this place, in fact, it is superb.. that being said.. the real value in Morton's is the quality of the meats and seafood.. the experience is similar to Ruth's Chris or Sullivan's or Del Frisco, but the freshness of the goods was just the slightest bit better..  they bring you the cuts and live lobster table side and show you the raw/live meat.. \n\nI have to say that having seen Michael Jordan at Del Frisco and Yao Ming at Morton's... the other value is seeing famous people in Charlotte. \n\nIf you want the ultimate steak..  and have the money to spend.. go for it, but if you are just looking for a nice place to take someone special this one compares to it's slightly less expensive brothers...", "business_id": "Lt9o2RmacVY2L-IWLA8uTg", "stars": 4, "date": "2010-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "505UKRIKosxqFes-6-z7eQ", "review_id": "2YVWDCKK5rmtQwqN-lwJrA", "text": "I really hate this place. I've given it 3 chances, and they all sucked. Food was awful. Everything fried. Clean? Fuggetaboutit!!!! Staff was overwhelmed, they tried, but to no avail. With all the superior choices within walking distance, I will never go here again.\nThis is the first, and probably only, negative review I have posted.", "business_id": "-6JY1T0w4XETux5kGOj84g", "stars": 2, "date": "2011-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vemRW3Var0MvrmSSn_X2tQ", "review_id": "RbtMymsLZzpH0HAYoxbrsQ", "text": "This place has a fantastic outdoor patio and makes for a great place to sip back and enjoy a few beers. We split the brewer's feast and particularly enjoyed the southwest egg rolls with a roasted jalapeno ranch dressing. I enjoyed their winter seasonal and their Sweet Magnolia brown ale. However, they didn't make my top favorite beer selection and other than that I really didn't find any of their brews to be that great. Overall, I'd recommend going elsewhere with a better beer selection from multiple breweries. Of course, much of this review reflects my distaste for chain restaurants and breweries.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 2, "date": "2012-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0ND8hBIZPMjHxEcXwt1gLQ", "review_id": "OgIrgazZF0G42FUDLcVDTQ", "text": "The food was good, the beer was excellent!   I had the 2 A.M. burger, the burger itself was good but the hash browns on it were not. My wife had the bourbon burger she said it was good. My oldest daughter ordered the kids hamburger and was impressed that it was cooked to order not the hockey puck on bread that kids normal get. My younger daughter got the build your own pizza and she actually got to \"build\" it before they put it in the oven. The food was a little slow arriving and the service was fair, we got more attention from our server than our waiter.  I had the three of their handcrafted beers, the IPA, the Hop Goddess, and the White Ale, they were all excellent!", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 4, "date": "2015-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "svDfyraZSfiBT-CvrsycXg", "review_id": "RyD5GgvJ2mrywob1Ikq6-A", "text": "Stool pigeons is a straight up middle-of-the-road sports bar for me. I find nothing whatsoever offensive about it, and yet nothing totally standout either. \n\n(Well, except  the Hot Italian Beef sandwich is pretty standout if you're in the mood for that kind of meat and cheese monster )\n\nDon't quite get all the complaints about service?\n\n I've never had an issue with service here and have been during lunch when it can be quiet and  during high-profile football games when it is packed.\n\nTypically, I sit at the bar and find the bartenders competent but not overly cloying.\n\nIn short, it is what it is - a downtown sports bar, with sports bar food, drink specials and lots of TV screens.  \n\nAnd I don't have an issue with any of that.", "business_id": "t5l-H2KdY4MQgLDMENz9WQ", "stars": 3, "date": "2012-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "pMADiKPU0nCwYlSYblMa0g", "review_id": "2utORWbLzhKEBwmU84LTCw", "text": "Just witnessed a most sexist and unfair firing of a waitress in front of other customers. The owner was rude to other customers who tried to come to her aid. He said he lost a regular because she brought him the wrong tea. He lost a lot more regulars because of his public display of anger.", "business_id": "FjSYyID6pInYVsG-vADNzg", "stars": 1, "date": "2014-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uvHOqPt3oBocaJDZuE4ucg", "review_id": "p1-jxRnf8Ty2SP1tBO5pww", "text": "I LOVE LOVE LOVE the chicken supremes! SOOO Good! I also love the sweet potato fries. My husbands favorite is the penne pasta dish with the sausage. It is really tasty.  Great place. I highly recommend!", "business_id": "hIQRiE3UsYH7UsrsDwJwLA", "stars": 5, "date": "2013-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GZPmUmnnH7rx3xUzF5vqwQ", "review_id": "wAL0oU2qOjq023yqRTEOBw", "text": "I stopped at Rusty's Deli & Grille for lunch on a Saturday because of the reviews here.  Overall I'd recommend Rusty's, but there are better places to eat.  The restaurant is long and narrow and when I came in was very busy.  The ordering system is very convoluted.  You wait in line to order at a window.  The person at the window though was also making sandwiches so there was a wait, about 30 seconds, between each group to order.  The menu board is on the sidewall of the hallway  (parallel to the line) so you can't really see it until you get up to the front of the line to order.  It would have been better to place it above the order window (perpendicular to the line).  And you thought you'd never use geometry after you got out of high school.  Then you head around the corner to the left to another line to get your drinks and place your order again at the cashier and pay.  The layout of the place kind funnels people this way, but why do I have to order twice?  Maybe this is so they can start working on your order and have it ready when you go to pay.  I was lucky to grab a table as I witnessed several parties hovering nearby looking for a place to sit.  If you have more than two people in your party I recommend that after make your first order you send someone to snag  a table while the other goes to pay.  I ordered a cheese steak sandwich and fries.  It took a while to get my food.  You would think they would have started working on it when I first placed my order, but that was not the case.  With the volume of people in the place I anticipated a wait, but it seemed to take longer than it should to get my food.  The cheese steak sandwich was OK, nothing special, but it was hot off the grill.  I should have known not to expect too much when the menu said it came with lettuce, tomato, and mayo.  Toppings that are fine for a burger but that should never be mentioned in the same sentence as a cheese steak.  I left them off of my cheese steak.  The fries on the other hand were great.  They were thick cut, hot & crispy on the outside and fluffy on the inside.  Overall nothing spectacular, the fries come close, but good hot food.  The tab came to $10.46 for sandwich, fries and drink, which is not too unreasonable.", "business_id": "WkD7OrSIHLzgOQo9wQHu-A", "stars": 3, "date": "2011-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4R0LQiEwio4OAgwFeJT42g", "review_id": "ZVed3LO2nnH52-L7_fU_lg", "text": "Fantastic place to eat. My wife has came here as long as she can remember and we've together been going here for several years. He food is always excellent, crepes are amazing, and the service is always top notch. They recently updated the decor inside, a great place for families and couples. Highly recommend!", "business_id": "UzMMpUFwJhwUkHOyeXeWsQ", "stars": 5, "date": "2014-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "WUVUNvDBzQmr5IqYikao1g", "review_id": "bnxTPdTy9IxGW88ww9hEGg", "text": "This place is the best beer bar I've been to in a long while.  Lots of good drafts and bottles from across the country, and good recommendations from the bartenders.  Traveling on business, the Flying Saucer is a good call for dinner and a real surprise for beer lovers.  The menu is dominated by sandwiches and burgers (in the $8-$9 range), but nothing really special.  I'd bring my wife back with me, but would leave the kids at home.  I'll be back for sure.\n\nFollow up, a few months later.  I've actually been here twice since the first review.  The second time was pretty good, but I realized that the menu really doesn't offer much as far as 'real food' goes.  This last time was yesterday (Sun, 6/13) and the bartender was kind of an a-hole.  I think it was because I'm not a \"local\" as he was pretty condescending when I asked about the local beers.  I'll probably go back, but not for food and will avoid the brown haired putz pouring the beers.", "business_id": "F-e-sWfVd3eCYll3BP1QFA", "stars": 4, "date": "2010-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6zxxb7vmU6QJvaCg_X3_sg", "review_id": "r5no-jm8zfTqzWFfPa4Cmg", "text": "Always a great place to hangout with friends! Many of my college memories are associated with this place. Great atmosphere. Great servers(and beautiful as well ).", "business_id": "F-e-sWfVd3eCYll3BP1QFA", "stars": 5, "date": "2015-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "kW_DdZkz7V6RbPud56Icag", "review_id": "YSFohnuZIZ7-W4r5hOn7Gg", "text": "I am by far the biggest fan of Hickory Tavern's build your own salad. I literally could eat it every day. At this location,  however, simple instruction and ability to listen seem to be their biggest hurdle. \nI've called in to go orders, on multiple occasions, and they just can't seem to ever get it right. I don't know if it's the \"builder\" or the person taking the order.  \nThe continued mistake has prevented me from calling these guys for the past couple of weeks but tonight I really wanted one of those salads and decided to give it a shot.  Friday night, super busy inside, go in, food is ready, get home, and BAM... It's wrong again. The roller coaster of emotion from excitement to disappointment to anger is the reason I'm writing today. $12.95 for a salad (with protein), when built by the customer, should be done correctly 100% of the time!", "business_id": "r-pBY6vR_Iu5XhPRvPnquw", "stars": 1, "date": "2014-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "OS78RKkZK1uKXcn5psrIsQ", "review_id": "xgM9mfHpxqF8bW4TmfvQmA", "text": "Had the absolute worst dinner experience tonight at TGI Fridays on Harris Blvd. Bottom line- the manager would not remove a charge from our bill for food they told us was at a discount AND wouldn't remove a charge for food we did NOT get. He also told me that customers were liars and he wouldn't believe that one of his employees would tell us something wrong. So just FYI - if u are a customer here u might want to rethink as you are a liar! Please share so others liars are in the know. \nNow mind you- this manager treated me this way all over $6.00.", "business_id": "qZ1bDtcercwUw4w7trpVjQ", "stars": 1, "date": "2014-12-29", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "4K7YXIl77EOHlTfSUjLCDw", "review_id": "mdjs8GJUfqGajVMjgOrP5Q", "text": "This is one of the best breakfasts I have had! Is the decor dated? Absolutely but it just adds to the nostalgic charm! The place just reeks of beef cooking... Ahhh delicious! Check out the pastry cases!!!! OMG, is all I have to say!", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 4, "date": "2012-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Jv6lq527bHVW1EbrqzZXag", "review_id": "3OMtQG0DF7IqzEDYZYYmiw", "text": "We love the Beach House.  We come here often.  Food is always good.  Drinks are made by some really awesome people!  Specials are always worth a look. Weekend breakfasts are very popular, so come early.  Try the walleye/eggs.  Or the crab/eggs benedict.  Very very good!!", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 5, "date": "2012-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sQtlLnf_kwqSIgX6rR3VRA", "review_id": "Y6tU-DDVofipcKk9eS6hfA", "text": "This place may not be much to look at but the food is good. We ordered the fish sandwich and the spicy pub chips. The fish sandwich tasted fresh and was cooked well. The pub chips were tasty and the blue cheese sauce that came with it was excellent. They have some good beer on tap to wash it down. I will come here again.", "business_id": "G1qUGBNYNS220jKlPAlFsA", "stars": 4, "date": "2015-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "clKTx-oACO0rwblV40tpWg", "review_id": "fUm1x41RAV5dAYDOICwQJA", "text": "Lower-end sports bar. Not a bad place for a happy hour after work. The usual bar food, beer and cornhole. No frills at this place. Ask for Amanda as your server; she's hilarious! Definitely made for great conversation.\n\nI ordered the Chicken Nachos, which was ok. They didn't skimp on the abundance of shredded chicken, so it was even on the amount of nachos. (Don't you hate it when you get more nachos than meat and toppings?)", "business_id": "qQvpS262VPEHKZvM6j5uhQ", "stars": 3, "date": "2014-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Kf7xjoztHhjWl_YHLcFPrw", "review_id": "Yv4mcgaYrCn2gmUqKic3CQ", "text": "Saturday night, very busy. About 20 minute wait, not surprising. Bruschetta sirloin with potatoes was very nice. Staff was obviously stressed but food arrived timely and hot.  Kids thoroughly enjoyed the desserts. Nice array of flat screen televisions, several games available to watch from just about any seat in the house.", "business_id": "JdCFcgw4yk4M1ZRhAhBIag", "stars": 3, "date": "2015-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BeyS2Lv-tBhdlusF2In4CA", "review_id": "q-a16R6fdWLt7-KaCucCpw", "text": "I like this place because they have so many vegetarian options. I loved the vege BLT with strips of tempeh yummy :) I love the atmosphere of the place as well. I do think their prices are kind of high, but the food hits the spot!", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 4, "date": "2010-01-11", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "VmjDXbu4oRseDwsLW9Qe1w", "review_id": "VNpF-AgIy2FiuPiY51EMqA", "text": "Whenever I get the chance to stop over in this great city I always try to swing by Monte's. The service is friendly but don't expect to be looked into every 2 minutes. Which personally I prefer. This has a very local feel and the prices are just right.\n\nI had the Blue Plate special with egg whites. It was wonderful. Not greasy. The artichoke sandwhich is also off of the hook! Very good down home food all the way around and extremely reasonably priced. Especially coming from the West Coast.\n\nThe other added bonus is Monte's is located in the Willy Street area...the more eclectic part of \"downtown\".", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 5, "date": "2012-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KQ66xJU0WMVAKVVpTULmhw", "review_id": "RWNSpIDipLIKytbhet_uyw", "text": "Adorable gas station turned restaurant.  Popular breakfast spot.  Huge desserts.  Smiley staff.  Boozy malts and shakes.  What more could you want?", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 4, "date": "2014-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HLEr51WJJTWFDpPaderVDQ", "review_id": "FpLXtXQcMkkkADKu2pgAdQ", "text": "Good solid diner. Great selection of pies and desserts. Can sometimes be really busy which turns into a long wait for both a table and service. But the food is worth a little patience.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 4, "date": "2015-12-12", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "oOXgY-h-qsjdwToXjOH-VA", "text": "Quick review: very large menu, offers all you can eat fish fry, unusual layout. Decent service, mediocre food, fairly pricey for average bar food.\n\nDetailed review:\n\nAfter taking a small fish fry break, we resumed our quest to find the best fish fry in southern Wisconsin. With the roads in poor shape thanks to the recent snow, we decided to focus our sights on local offerings, and since Tully's is \"around the corner\" from our friend's house, we decided to give it a try.\n\nWe walked in and seated ourselves; we chose a small table that was located in a section \"in front\" of the bar area and adjacent to the pool tables. The salad bar and another small dining area are located on \"the other side\" of the pool table room... Odd layout for certain.\n\nOur waitress took our drink orders and we browsed the menu, which included your typical bar fare: lots of fried appetizers, burgers, sandwiches, and so on. I'll say this - there are a ton of items on the menu; even the Friday night fish fry offered 7 varieties of fish, 4 of which are all you can eat.\n\nOur drinks arrived and we placed our orders: AYCE baked cod with a baked potato, AYCE beer battered cod with cheesy hash browns, and AYCE lake perch with hash browns.\n\nWe were informed that our meals also included a salad bar trip... Too bad we had already ordered cheese curds. \n\nBut, being the troopers we are, we ventured over to the salad bar and built a few plates. It was ok for a bar's salad, but not great by any means. My tomatoes were mushy and tasted \"off\"; broccoli was dry and obviously came from a bag. Coleslaw earned decent reviews.\n\nCurds and fish arrived at the same time. Curds were breaded and typical \"from the freezer bag\" variety. Nothing special, and not worth the $6.79 price tag.\n\nFish plates each had two pieces; baked cod was drenched in buttery water and loaded with dill flake. Hmm... It tasted ok, but wasn't as flaky, tender, or flavorful as I'd prefer. Baked potato was foil-wrapped, and nicely cooked.  \n\nBattered cod had a decent batter that had just a hint of a unique flavor (we couldn't put our finger on it, as it was tasty), but it was fairly greasy and like the baked cod, the actual fish was quite \"lifeless.\"  The cheesy hash browns were good- nice and crispy, with only a hint of grease.\n\nBattered lake perch was just like the cod, only it was more greasy. I shed a small tear as grease oozed out of the piece I tried.\n\nThe bill arrived... $55 for three with one round of beers. Yikes.\n\nTully's = fail.\n\nService = 4 stars (good, prompt, fun)\nFood = 2 stars (based on fish only)\nValue = 2 stars\nMisc = 2 stars (not real exciting)\n\nI'd come here to drink some Miller Lites and to munch on some bar food during a game, but I'd skip the fish fry.", "business_id": "kOXJrbuB1a1Na6sf_WQnDg", "stars": 2, "date": "2009-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Dww8g61sT7u79FWn6aw04g", "review_id": "7fW4TugFSHS9gbee_KUZig", "text": "A decent place for gourmet burgers. I had the DBG burger with french onion soup and that was just the right amount for lunch. Came during lunch on a Tuesday and was seated immediately. Unfortunately I was seated at the corner and server did not know I was there for a long while. They have a new table side system that you can call for the server, and I pressed the button - still no server. I think the server calling system simply changes the light on top of the unit to red so if no one saw it, no one knows you are there. I was about to leave when the server came over and apologizes with a \"you sneaked passed me  ...\" joke. No - I was seated by another staff - did not snuck in.\n\nAnyway, the rating is for the food. Ordered the DGB burger with french onion soup and it was good. Juicy inside and sauce is tasty. The French onion soup is OK. onions, beef broth, bread and cheese baked in an oven. Oh - i did not know when he said fries or soup, choosing soup adds an extra cost to the bill.\n\nThe table side system also allows you to check out quickly with a credit card. While I like the efficiency of these systems, I find that it takes away the service part of a restaurant. I can order and pay right from there - so maybe I don't have to tip that much since all the servers do is to give me water and bring out my food.", "business_id": "4pZeC9W0EIiBTOJMnwG2vw", "stars": 2, "date": "2015-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QX0xEqQhWUs6t_9aWApQgQ", "review_id": "tSPBoX53eWrtrUgaVgVkBQ", "text": "Started the day with an excellent Bloody Mary, had the Mexican Salad with blackened steak- it was awesome! It came with this awesome mozzarella filled  breadstick, so tasty. All parts of my salad were fresh and well presented, the homemade chipotle ranch was perfect on it.  Our table also enjoyed the pepperoni pizza and black and blue grilled chicken sandwich. The nachos at the table across from us looked spectacular! Prices were very reasonable and our waitress was very nice, a bit slow at first, but I think they were just understaffed first this this morning. \n\nGood atmosphere, tons of sports memorabilia on the walls.", "business_id": "yrBo3c3OTKVO4H1ttBxadw", "stars": 4, "date": "2015-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wWngIJ-A9zk8vPXgfxd4oA", "review_id": "wFdUzbLlpL4hzfYIpoVIMw", "text": "The best pulled pork I've ever had! This is one of my favorite places to eat in Champaign-Urbana!", "business_id": "0kRBRm5xOWclzemsLl9iQA", "stars": 5, "date": "2011-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sleEMt44E1StWrjz3mcujQ", "review_id": "Ho9-L-VN2MuHSa8nbDN-Lg", "text": "This friday's has been recently remodelled, so it's nice and clean and new-looking even though it's been around for awhile.  The remodelling job itself SCREAMS trying to hard, but that's probably friday's corporate's fault.\n\nThey will serve you your pecan crusted sicilian teriyaki quesadillas with green bean fries and cheesecake in a reasonable amount of time, and without any of the way, way, way over the top smarm that you might expect from a friday's waitstaff.  And you don't have to drive all the way up to North Prospect.\n\nThree stars is probably the maximum I am able to give to any friday's, anywhere, just out of principle, so this awarding of three stars should really say to you \"best possible friday's.\"", "business_id": "UV04TEpMGWoQs36FkBwOgQ", "stars": 3, "date": "2007-01-25", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "amxtfaoqV0JEwbJUFeCyLg", "review_id": "m5Q-z7Ux4tweFQi4mEUIiQ", "text": "Reviewing Joe's solely based on their food, which is surprisingly delicious. The half-priced burger days are a really good deal and they have such a great variety to choose from. Also, you can get a side of mac and cheese and let me tell you it is in the top three mac and cheeses offered in the Chambana area. If you can get over the fact that you are eating at Joe's, which for me is a bit of a struggle, it is a must try.", "business_id": "1T2rnvl67Gk9Uc0gzsCKQA", "stars": 4, "date": "2015-12-04", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "fev0iI-XDrteD4SYRKjiUw", "review_id": "8BugVEYlfYOiVFeBSTpUhw", "text": "One of the more iconic sports bars in Phoenix is Majerles. Named for and run by Dan Majerles of the Phoenix Suns, this bar sits just one block away from the arena and tends to host some of the rowdier crowds during the Suns games. Majerles is consistently ranked one of the top sports bars in the country by Sports Illustrated. This accolade is well deserved.\n\nMajerles is small but laid out well with the bar in the center with smaller high-tops encircling it with booths along the outer wall. This system works well for the different types of crowds that come into Majerles. There is also outdoor seating and usually a scantily-clad hostess standing with them.\n\nNothing special about the menu but everything is good. The Chicago burger, with its blue cheese, is a personal favorite. The bar features the usual selection of domestics and imports as well as specialty liquor.\n\nThis is not really a kid-friendly environment but there is nothing to suggest they shouldn't attend. Because the bar is more intertwined with the restaurant and the waitresses are usually minimally dressed, Cooper's Town might make a better impression on the younger ones. The food is better there too.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 3, "date": "2008-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "REfQIccdKSVnEPr3Bnucwg", "review_id": "uAnAb1zL7Rjd2qyMrnfWVA", "text": "\"My vodka soda tastes like water. Lame.\" July 5th 2012\n\nYeah, this place was pretty mediocre...which says a lot considering how uninteresting Phoenix is at night.\n\nThe place was packed, the drinks were pricey, and the waitress made sure to let us know after we sat down that we had to go to the bar to order our drinks as she was off duty. And...my vodka soda tasted like water.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 2, "date": "2012-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "30C81cUBpoFUucSag18MkA", "review_id": "HxrznEcoQ4aYhK42nirSBw", "text": "I went there tonight before the Suns vs. Rockets. We sat outside to watch the street crowd which was nice. The waitress took 8 mins to come and take out to even take our water order. So when she came I asked her if they had Happy Hour she said they don't have happy hour on game day. Boooooo for that.  So I ordered the Rojo chicken sandwich with mozz. Cheese with a side salad. My husband ordered a All American cheese burger with fries.\n\nSo the food came out promptly but the chicken was some thin piece of processed meat with this huge piece mozzarella cheese on it dry toasted bread with two slices of tomatoes and some dry lettuce.  My husbands burger came out dry as hell. He had to ask for mustard and mayo on the side. Terrible the waitress didn't let us know it was a dry dull burger with nothing but meat and bread. With shoestring fries the few that there were.  I then had to ask for ranch and pickles for the fakechicken sandwich. \n\nThe service was the worst I've seen in a long time. First of all the place was packed with basketball fans trying to make the start of the game. So I had to ask the hostess to take my watered down long island back and bring a bud light. Then I had to call the hostess to take the money so that we could pay and leave. She hardly checked on us outside and she knew we were sort of rushing to walk two blocks to see the beginning of the game. I only tipped $5 that was courtesy of my husband because I would have left like $2. Sorry,I'm usually a descent tipper but she was pretty awful.\n\nI would never go back the food quality was poor and the service was even worse. Go to Hooters for a fantastic buffalo chicken sandwich.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 3, "date": "2015-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zMX4xLGkNVnbsQn52cJ7Ig", "review_id": "rM2RPoCSz1zkylKgxAw79A", "text": "We arrived as a party of 8 to an empty tavern, no other customers there. We were seated, and the waitress came back in fair time for our drink orders. It took a while for the drinks to come, but when they did, it was only a couple of the ones we ordered. I asked the waitress where my drink was, and she rolled her eyes and said something to the effect of \"my bartender is slow.\" I don't know what's up with that, as the waitress was very kind for the rest of the meal.\nWe ordered then and then proceeded to wait for about 40-50 minutes before any food came. We were now one of three tables in the restaurant, and comprised 8 of the 14 customers in it. 40-50 minutes seems a bit slow when you're the only people ordering food (at the time you ordered it)\nWhen I got my Cuban sandwich, it looked pretty good. When I started eating it, I realized that the pork was actually quite dry and devoid of full flavor.", "business_id": "2I666dqzs1XB6xigIKa9bA", "stars": 2, "date": "2012-01-10", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "fev0iI-XDrteD4SYRKjiUw", "review_id": "pGP2vVG3LHz1riOSUmxFbg", "text": "One of the few American Food chains in downtown Phoenix.  While I don't like chain restaurants, it is always nice to have a place where you can count on a certain dish no matter where in the country you go.  \n\nThis Friday's is quite different than most.  Gone are the red & white striped awnings and, in their place, are rows of Dbacks and other baseball memorabilia lining the walls.   If you are a baseball fan, you will love this place simply because of the decor.  If that wasn't enough, you get to enjoy the signs and sounds of a major league baseball game (81 days of the year) and the field itself for every other day.  All in all, a pretty nice setup.\n\nThis Friday's does tend to be priced a bit higher than others in the area.  The service is also much slower.  Also, if you are watching the Dbacks play, you may lose your appetite.", "business_id": "1-1VcGTL3GyCqUpXZLFTZA", "stars": 3, "date": "2008-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "b4C9E7vTJrOdkJQA86xYSg", "review_id": "fnNiPc6Wv1pAiJZYmkvA4Q", "text": "Update:  \nAfter reading the talk thread on yelp about the welcome diner I am so happy that they are not closing!  Turns out they decided not to and now are going to open a second one in the not too distant future.\n\nI am so sad that I came here on the last day that this little diner will be open.  I was introduced to this place by a friend of mine who is a regular patron.  It was a nice Saturday afternoon so we ate outside and I think the little diner (with 8 seats) was full.  I had a single patty cheeseburger and the favorite and a coke.  The favorite is fresh cut fries with peppers, onions and a few other things that made this a delicious side dish.  It was all soooo good... I am glad I had the opportunity to try it.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2008-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "uj94uvIwTrhE72OyTcPKAQ", "review_id": "tNLpAks8R2O_ExlmjPEyxw", "text": "Surprised I never found this place.. The place was pretty good couldn't think of a complaint", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2013-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Y7KS04okqSFAbg1NyImHkQ", "review_id": "jKB053SAv5DwMhLra7Ty6A", "text": "I've been here a few times now. I can't believe I hadn't reviewed this place like, right after my second visit when I got food but I digress. \n\nWelcome Diner is a cute restaurant with plenty of picnic tables outdoors. They do have some indoor seating, but it looks to be quite tiny and every time I've been is in a group. This is the spot for nice, sunny days-I've only been here when it's cool outside so I can't say much about what it'll be like in the summer. The neighborhood is a little sketchy, but not so much during the day. Since you're sitting outside, it's allowed for some pretty entertaining people watching.\n\nThe brunch here is awesome! I always get super excited when I can have biscuits and gravy (since the only animal I eat is of the fish variety). You can get biscuits with mushroom gravy!! The portion I got was huge and so dang tasty. \n\nThe drinks are awesome! Get the Hurricane..even if just for the cashier to yell \"HURRICANEEEE!\" when you order it... It's pretty fun and adds to the overall experience.\n\nI will definitely be back to try their dinner options and grab another delicious cocktail.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2014-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "yOW_07olC5HaDlrzpEKECw", "review_id": "ZT-bkiBd4uFA8LIhsQcMbQ", "text": "I have no idea how such a tiny place is able to churn out such an enormous amount of quality food.\n\nThe patio is large and eclectic with an array of mismatching tables, chairs, and lights. It's hard not to immediately feel at home here. Food has been exceptional on every visit, my favorite item being the fried green tomato sandwich. Cocktails have also been superb. It's a good bet that whatever you decide on will be both surprising and just what you were hoping for.\n\nMy husband and I had our wedding dinner at Welcome Diner and it was absolutely perfect. Before friends arrived I warned the staff that there was a sizable group coming by and if we were in the way or too loud to please let me know and I'd deal with it. The staff's response was, \"That's just the vibe here. You're fine.\" They handled the crowd that night so well, and with such great and friendly energy.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "6X1cTI_ksA73jnSQvPWY7w", "review_id": "PLBj4kYrloK-VomQckACLw", "text": "This is the homiest  most delicious place to visit. You won't be disappointed in the chicken, biscuit & gravy combo. I had to try chorizo, also delic! Nicest and friendliest guys around!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EG1DRLG5ehpc86B4Cqzqag", "review_id": "4tqjFWSfHr6WvJDW-UNawA", "text": "Looking for a cheap and good breakfast place?  Love this neighborhood Coco's.  Never too busy and food is always hot and fast.  Bacon crispy and pancakes are light and flavorful.  Less than 10 bucks, no wait, and good eats near my house.  No hipsters is a huge plus.", "business_id": "SZvYxcvYYVRue9MXcEDjsA", "stars": 5, "date": "2015-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kJfFhQASj0_KRkWXE1WQXQ", "review_id": "R6E2XuvbXVEB-zEuXy7zwQ", "text": "Went back to MacAlpines last week to give it another try.  The service was pretty good, the waitresses are very attentive to their guest.  I got a chili burger and my girl got a grilled cheese, which were both ok.  I still wasn't crazy about the food, but both of us couldn't stop talking about how amazing the shakes were.  I am lactose intolerant and shouldn't have dairy at all, but I decided to give one of their shakes a try.  I do have to say, it was definitely worth the stomach ache that I got afterwards.  If I were rating just the shakes in this review it would be 5/5.  Will be back to MacAlphines to have have one of their creative shakes.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 3, "date": "2012-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tJ6cgl7MDVQP8xFU2bPPNw", "review_id": "DfRXKWpmwiC9A61BcIZ-Yw", "text": "Becoming our favorite place. The ice cream is \"awesome\" according to our kids! A must visit", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 5, "date": "2015-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pD_n0td47wbYdXCJ8_zOtQ", "review_id": "66MqegKBu9e5mUVZpRqTKQ", "text": "The bar smells overwhelmingly like old, stale beer; I wonder if the floor mats have ever been cleaned. I have received good service here before but my experience eating alone at the bar was horrible. It took forever to be greeted, the bartender was unfriendly, took even longer to finally get to place my order (even though the bar was not crowded at all), and the smell was utterly unappetizing. If you come here, do not sit at the bar, your service will surely be better otherwise.", "business_id": "hzUOqxpcnYYBgLlrgvjQYQ", "stars": 2, "date": "2015-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JdB61ZARmEI0uN8Uigs09A", "review_id": "4KZ4BO2GArHdeis3SXnS2w", "text": "I'm only in PHX 2 years, this Applebee's is just 10 minutes down from the Biltmore where I live. It is always crowded, a bit noisy, if a wait, not too long for a table. The manager, Neill, constantly checks tables to see if everything is ok with the diners. Had 1 issue with the kitchen preparation of the food on a prior visit, Neill had it corrected at once. Wait staff is very attentive even when they have a lot of tables. We had a waiter the other night, Max, who is the best of them all, so is Jeremy. The burgers are great, they have a Monday burger special with fries for $5.99, after 9 pm wings 45 cents each, always cooked to perfection. I have had lunches and dinners here, sandwiches, chicken and beef dishes, all nice portions and very tasty. I did notice with concern a full bar many nights and only 1 bartender. He was keeping up with the rush but they should have 2 on busy nights.\n\nI am here at least 2 days a week sometimes more, so that says it.", "business_id": "cjUmPLRT43wN9Z87A9BOpg", "stars": 5, "date": "2014-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WK2Jh-uBmeqH7oI9IxfSHA", "review_id": "Quw2yvgEy5n4_MnamT7-ug", "text": "The wings at this LW were fantastic.  Not battered, but deep friend how they should be.  They were crispy and well done with a sauce that tastes fantastic (I got the hot).  From a wings standpoint, it totally gets a 4.5.  \n\nI tried the ribs and they were pretty bad.  Everything else looked good though.  \n\nIf you want hot wings, this is the place to go.  I only wish they had some sort of hot-teriyaki sauce.  Oh well, can't be perfect.", "business_id": "BT2Vls7h6sWrCKa5gGXbKg", "stars": 4, "date": "2009-12-31", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "YPLf_ye2CpQeYzpsPfc84w", "review_id": "IwxdP6Tdy4mTu9jqhLTmjQ", "text": "Horrible. This review is from June 5, 2014.  I remember very vividly, the food was horrible! My husband and I went there during lunch time, I ordered a steak (duh) and he had a burger. The steak was extremely thin, looked like some ordinary boring cheap piece of fried beef.  AND it lacked lots of seasoning and color! The manager saw how unhappy I was by the way I was picking at my food, politely asked and I politely told her.  She was nice enough to offer another in which I declined (I can only suffer so much through this horrible food!), well, she took it off the bill thank god......  \n\nDrinks were fair, service mediocre, atmosphere boring and smelled like old people.  \nNever again.", "business_id": "gQjTs4BDNYSu9oJhkEsssw", "stars": 1, "date": "2015-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "v1PxgfLviKc4WgFgYCgFgg", "review_id": "LXOR0H-4kDnwhl_G0w4NZQ", "text": "Went there last night to celebrate a good friend's birthday. Loved the dim lights atmosphere, which seem to made the couples celebrating Valentine's Day feel more comfortable. \nThe service was excellent. Jose our server did not fail to pay attention to each member of our 15+ party. Appetizers and entrees were enjoyed by everyone. The portions were good for all to share, and as the restaurant mentions on their website, the prices are reasonable.\nI had the almond crusted tilapia, with a raspberry butter sauce and green beens, and truly enjoyed it. \nWill come back.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 5, "date": "2011-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "yhZxCcGyhltqsJN6foL_Wg", "review_id": "AR4eUfdsJrRWs_R6TYofXw", "text": "Came here last night with a group of 5 of us last night for some dinner and cocktails, we didn't make a reservation but were able to grab a bar table without a wait.  This place is really nice inside; not what you would expect to find when you realize it's nestled inside of a strip mall.  Our server was actually the bartender and he was impressive, very quick and knowledgeable.  I had a late lunch so I wasn't looking for a large meal so I ordered the soup and salad combination.  The chicken tortilla soup here is to die for!  My friend loved it so much she actually ordered a second helping.  My boyfriend had the ribs and said they were amazing.  \n\nIt's a bit out of the way for me, but I would certainly like to come back sometime and try out an entree.  Overall I would definitely recommend coming here!", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 4, "date": "2013-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B9QqA0V6YP6-hCPZCAR0QQ", "review_id": "9AsiN1COcNn-IuaEej-Ukw", "text": "Went here for Valentine's Day with my boyfriend. It was our first time there and people ordered the steak and appetizer and a dessert. I thought the meal was excellent very flavorful and worth every penny. The service was good as well. I would definitely go back thank you for a wonderful valentine's Day experience!", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 5, "date": "2015-02-15", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "JlCjjf4H8rs2_lkj7xWRZA", "review_id": "BW46E2-IDB29AbT5bbdBCw", "text": "The Dillo is easily one of the best bars in the Camelback Corridor, with a friendly staff, great drink specials and yummy snacks! \n\nI started going here when I moved into the area, and now I don't mind going anytime of the day! The day bartenders are always super friendly, as are the night bartenders. The food is delicious regardless of when you order it- my favorites are the fried pickles (frickles) and the buffalo mac n' cheese. \n\nIf you work in the 16th street area, don't forget to write the name of your establishment on your check so that you can be king of camelback!\n\nGo Aunt Chialda's! ;-)\n\nLove you Dillo!", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 4, "date": "2011-02-09", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "zQE0aulnd-gcfVw17HeULg", "review_id": "1vEpDhjnuQ548M2Agy4WVg", "text": "Good good ol' Armadillo Grill. It's been years since I used to frequent this place during my car biz days, back then I used to come here for their \"Armadillo Gold\" wings and CHEAP happy hour drink specials. This review will focus on my most recent experience here. \n\nI came here because I was looking for a reasonably priced healthy meal at 1 am, a virtually impossible combination to find at this time. And I got exactly that, a hearty blackened chicken salad with fresh greens topped with a generous amount of moist and savory chicken. It was very good, and for about $10 it's the only place I can think of that I can get a quality salad this late at night let alone for that price.\n\nIn addition to the food which is surprisingly good for a bar, they have very attentive and friendly service. I always leave 'dillo feeling well fed and like I got my money's worth. This establishment has made it's self synonymous with quality food and value in my book and earns a 4.5 from me.", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 4, "date": "2014-02-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "EKwGhgLrM18ErVKKeYE2UA", "review_id": "GKMyZubnvfwdtnhHcclA2Q", "text": "Went here for Christmas dinner. I like the ambiance of this place. Dim lights, wood paneling. Very cozy. I ordered the bisque as starter. It came with shrimp and I think crab. I was so yummy and had just a bit of a kick to it. Well I thought it had a kick, one of the people I was eating with who loves spicy foods didn't even notice. For my meal I ordered the stuffed sea bass. Soon after I ordered I was told that they were out, which seemed weird to me because I thought they printed out a lunch and dinner menu once a day and we got there at 4 and there weren't that many people there that early. Anyway, I selected the stuffed lobster instead. It was good. It was half a lobster that was stuffed and then the claw. I love seafood so I could have done with a more generous serving. Oh, well. Ask for bread! After reading the reviews here and getting to the restaurant I noticed that no other tables had bread. And although there were 5 of us eating dinner, I swear they brought us just enough bread for 2-3 people each time so we kept having to ask for more. All in all it was a nice meal with great company.", "business_id": "MU3i2uEyUBntebU6pEyMbw", "stars": 3, "date": "2009-01-09", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 0}, "user_id": "meuqHEjGCmrO3zDlr6OU7w", "review_id": "5HE-vY8I22KKBhcbXZ9w1Q", "text": "I agree with Jake...Mediocre at best....\n\nBoring layout and unkempt when busy....Busy frequently!\nFinding a seating area off the main path is a plus!  The main path feels and looks like an over sized hallway...Beware!  I have been to other CPK's and this one is layed out poorly compared to others I've been to (San Luis Obispo in California, San Francisco in the Business District, and one in Scottsdale close to Bell and Scottsdale Blvd.---Very nice!)\n\nAt this particular location, service was a disaster this past Wednesday evening after work 02-13-08.  ----The two dishes ordered were: Tomato Basil Spaghettini with goat's cheese, and the second dish was Fettuccine with Garlic Cream Sauce with Chicken.\n\nBoth dishes came out at the same time---The Tomato Basil Spaghettini was warmish, at best...The Garlic with Cream Sauce with Chicken had no Chicken! ---(had to be returned to the kitchen) .  I asked the waiter to please return mine to a hot oven or lamp so that I could begin at the same time as my guest...  All this time the waiter acted as if he were doing us a favor, as if we were disturbing him from sorting his receipts from his other poorly served customers!\n\nWhen the food finally arrived, my dish was even colder, just mildly warm!#!$#!  \n\nI recommend that if you are out to impress a guest in any capacity, this is not that place to take them...Go next door to the Cheesecake Factory!  I'm not sure about the service, but the whole layout at least,  looks inviting and clean.", "business_id": "ut-kla-EA23nJOij_dcL0Q", "stars": 2, "date": "2008-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4dnDsoHuxUtzhaumxbpR5w", "review_id": "3SanizT67IviI5qxT8cGXQ", "text": "I wish I could say this place is a secret guilty pleasure. I don't know what it is that keeps bringing me back, perhaps it's the never-ending menu and the hope that maybe someday I will order something I like. However, that has yet to happen and more often than not I find myself disappointed. \n\nOr maybe I am just not ordering the right dishes? I've tried the grilled cheese, Pasta Da Vinci, chicken Madeira, Caesar Salad, Cheese pizza, Roasted chicken.....all being mediocre. Sure, they load your plate with enough food to last you an extra three meals, but they're an extra three meals I'm just not really interested in. \n\nThe service is always great, though. Maybe they feel the need to make up for the ridiculously long waits this location often suffers....\n\nI think I am done experimenting.", "business_id": "2r8jGeuYvMkyP2ik_X-Bxw", "stars": 3, "date": "2008-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BXuwYUljJIGWbscJdzkmUw", "review_id": "YipV49M7azwZ9Et43EssCw", "text": "I always have a pleasant experience when I go to Cheesecake Factory. The service is superb. Huge servings but the food is ridiculously overpriced. You're just paying for the ambiance. you can get better food elsewhere.", "business_id": "2r8jGeuYvMkyP2ik_X-Bxw", "stars": 3, "date": "2013-02-07", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "38BNIi0H7C98g_AjFcepJA", "review_id": "s9TCAgp9fd7tPJJKL4aVYw", "text": "I'm not big on chain restaurants but gave this one another try mostly because I was taking a friend and her daughter out for her birthday.   3 people - no alcoholic drinks nearly $80 with the tip, how ridiculous.   Mediocre service, which had to be hunted down several times for water and soft drink refills, they didn't even give my friend anything for her birthday.  \nBest part is when we were ready to leave, we were told we would have to wait because their systems were down and they couldn't close anyones bill out - so 20 minutes and no apologies or discount later, we got our check.  It will be my last time at any Cheesecake Factory, they can take their overpriced crap and keep it.", "business_id": "2r8jGeuYvMkyP2ik_X-Bxw", "stars": 1, "date": "2015-12-10", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "zBkv5EqgkrgT_f3oL1B4yg", "review_id": "rNq2OJViy8guHz0JF1DNTg", "text": "My boyfriend and I have just recently discovered Keegan's and we are in love. The fact that their happy hour starts at 8 is by far the BEST thing ever. It also makes it our go to place. I'm pretty sure in the last two weeks after we 1st visited we've been back 5 or 6 times. The prices are perfect, the service is great and the food is really delicious. I wasn't putting a lot of hope in the food but everything that we've tried has been very good. My only suggestion would be that they turn down the grill and cook the food a bit longer. I had to have them remake one of my sliders and I've seen other situation were people asked for their food to be cooked more. But the food tastes so good that it isn't even an issue for me or my usually very picky boyfriend :) we just make sure to have them cook everything well. All in all, I dig this place and will continue to visit every few days or so.", "business_id": "rVUEZpHQfWI_3kt0lBwaxQ", "stars": 5, "date": "2010-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zC83tixnn1NxaNwRIlHd_g", "review_id": "dgg3TDN9s3bzujMSNsD50A", "text": "We stayed away from Coco's for a couple of years, due to HORRIBLE service at the 7th St and McDowell, and bad service @ the Priest & Elliot one.\nWe have started going back to them recently. We went to this one today for a late breakfast. The service was a bit slow, but not as bad as we have seen.\nThe food was delicious! The coffeecake is wonderful.\n\nIn general, we have learned to not expect great service at Coco's, but that the food will usually (mostly at least) make up for it.", "business_id": "2gMx4KnXbNtpoCuVCmyo3g", "stars": 2, "date": "2010-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "b4C9E7vTJrOdkJQA86xYSg", "review_id": "ZmJo7R0zneCjf5YEMmjBlQ", "text": "This is a great neighborhood bar and grill.  It is your basic menu with some surprises and daily dinner and soup specials .  I always seem to get the same things every time I go... I either like the London Beef Dip with fries (fries come with a mixture of regular and sweet potato fries which are yummy) or if I am looking for something a little lighter I love their chopped salad.  They make a house sangria that is fantastic and they also make their own infused pineapple vodka which is very tasty too.", "business_id": "To5CjntVFawXM_hpAhvVdQ", "stars": 4, "date": "2008-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zk8wqo_34FDtdlZbTD-_zw", "review_id": "4I7JfMuZlD3VAYVPrhidSw", "text": "What a brilliant place!!! Food great, service even better and the atmosphere , well you just have to go there yourself and experience the place. \n\nAwesome everyone!!! I'll be back tomorrow night!!!", "business_id": "To5CjntVFawXM_hpAhvVdQ", "stars": 5, "date": "2014-01-25", "type": "review"}
{"votes": {"funny": 5, "useful": 6, "cool": 4}, "user_id": "wNqwKWaRjClmcKsoJJRFow", "review_id": "5nScuboxiGc6uTrvWVylVA", "text": "Wow.....wow, wow, wow WOW!!!! I made it back here less than two weeks after the Yelp Elite Event for a dinner with co-workers. If I come back here a million times, the view here will always leave me awestruck. There can't be a better place in The Valley to bring someone special to take their breath away.\nSince there were five of us and we love to share, we were able to sample a little of everything. We started with the scallops and duck ravioli. At the Yelp Elite Event I pretty much had a permanent spot at the scallop station so we all know how I feel about the scallops. The duck ravioli was delicious too. LOVED the appetizers.\n\nI have to say that those of us who ordered the filet mignon for our main suffered severe buyer's remorse after my co-worker shared her venison with us. The venison was tender and smoky flavored and not at all gamy tasting. Served with sweet potatoes, I am KICKING myself for not ordering the venison. I do have issues with eating animals whom I classify as lovable and beautiful so venison, along with lamb and rabbit are usually off-limits. Had I known what the venison was going to taste like, I think I would have made an exception (FORGIVE ME, BAMBI!!)\n\nMy filet mignon with horseradish crust, was not bad but especially compared to the venison seemed a bit dull. That didn't stop me from eating all of it.  I have to give them props for the bread they served because it came with a choice of mushroom truffle herb butter, arugula pesto (which was AWESOME) and the THIRD spread, which for the life of me I CAN'T remember was awesome too.....it really was a toss up between the pesto and forgotten spread.\n\nWe also enjoyed some delicious cocktails and a great bottle of malbec, and later some desert. I can only vouch for my Tahitian Vanilla Creme Brulee which was a great way to finish our meal.\n\nThe service was impeccable, although my co-worker and I were both given the lobster bisque when we ordered salad. This is hardly a tragedy though because I got to enjoy the lobster bisque too.\n\nDifferent Pointe of View is definitely a place you'd come only on a special occasion but it is, for this Yelper, one of the best fine dining options in The Valley. Just review the menu carefully and listen to your server....you don't want to be out-ordered!", "business_id": "3Zsjlum5kl5N5KV712aTMQ", "stars": 4, "date": "2012-01-20", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "EYN_yuSLhpPH8MRlRlAaCQ", "review_id": "p99Rz0vdTcLcfGpzYDhTmA", "text": "IN SHORT: Anthony DeMuro crafts an elegant menu on top of one of the best views in Phoenix. Reservations are key for that special occasion, but the palette of flavor developed throughout the meal will surprise you at every bite.\n\nTHE STORY: Different Pointe of View is one of the finest pieces of culture in Phoenix. Nearly every table can enjoy miles of city and mountain views that lend an understanding to the city's form so rarely found.\n\nThe wonder doesn't stop at the atmosphere, however, as the food and and drink never stop wowing. The salad options change seasonally, but be sure to include one in your meal as an appetizer or small second course. During my most recent visit, I enjoyed the phenomenal Poached Pear and Micro Herbs salad, which included a cinnamon-cider poached pear, dried goji berries, Humboldt Fog cheese, toasted pistachios, and a d'anjou pear and tarragon dressing. Presentation is one of Chef DeMuro's greatest talents, and each ingredient truly shines as it arrives on your plate. The Blueberry and Rocket Arugula salad was also a favorite, with dried blueberries, goat cheese, Marcona almonds, shaved beets, and a sweet cabernet lavender vinaigrette that was astonishingly light, floral, and fresh.\n\nFor my entree, I ordered the Vanilla Brandy Poached Maine Lobster, which came beautifully served against 3 lobster and parmesan raviolis, expertly cooked with the perfect bite. The smokey lobster buerre blanc sauce added another hearty, yet southwestern element that finished off the dish.\n\nOf course, service is impeccable, and our waiter and sommelier truly acted as if they were happy to be serving us. We were tended to often, and frequently asked about each course. Needless to say, Different Pointe of View is just perfect for a rare, relaxing, beautiful, and immensely satisfying meal in the heart of Arizona.", "business_id": "3Zsjlum5kl5N5KV712aTMQ", "stars": 5, "date": "2013-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Sua3G9ep8oJ52ancCTFqAQ", "review_id": "SjmldK4LX-1UG7KEDr0v3w", "text": "Priir to visiting Different Point of View... i made the mistake of reading too many negative reviews/comments.  This place was an exceptional dining experience.\n\nFirst, the view is amazing.  You need a shuttle to get to the top of the mountain from the hotel property.  There is a bar downstaits from the dining area where you can have a drink inside or out. Outside has an amazing patio (1/5th of iy can be seen in my picture) which overlooks pheonix.\n\nWhile having drinks, i noticed they were underpoured SEVERELY and cost $14 each.  After several.. I was begining to get annoyed by the size and made a commeent to the waiter.  He apologized and gave me an additonal Macallan on the rocks on him.  So although yhe drinks were severely underpoured, an attempt was made to please me.\n\nThe food ordered to the table:\nCHOPPED SALAD\nLOBSTER BISQUE\nSAUSAGE RAVIOLI\nDUCK SPECIAL\nSHORT RIB (BONELESS)\nVANILLA BEAN ICE CREAM\n\nThe lobster bisque was very very tasty and the other person in my party enjoyed his salad.  We split the ravioli appetizer which consists of 3 raviolis but we each received 2.  They had broccoli rabe sausage and a nice filling.\n\nI forgot to mention the two types of bread for the table came with a selection of 3 amazing spreads:: blood orange butter, pesto, goat cheese reduction.\n\nThe duck was a great taste but I ordered the short rib and only \"tried\" th e duck.  The short rib was a tiny bit overcooked but i am mentioning it for the sake of being accurate... it wasnt bad and didnt take away from how good it was.  The polenta and veg inckuded underneth the shortrib also had a great taste.\n\nIt's important to note, 4 scotches (one complimentry), 2 bourbons and an additional 2 orders of ice cream were added to the bill before seeing $187.50.  To dome this may dound a bit much, but I dont believe those people travel to New York.  Furthermore, I understand price should be relative to the geo location and I still dont believe it was OVERLY excessive.  This place is great for those who want a mountaintop dining and drinking experience with high quality food.\n\nMy trip consisted of visits to Tomasos, The Mission, & Different Pointe of View.  Different Pointe of View would come in second to Tomasos.. but just because I am italian and love pasta :-)   If I am to be in PHX again, it will be a must gor me to visit Different Pointe of View again.... wiyhe the misses most likely.", "business_id": "3Zsjlum5kl5N5KV712aTMQ", "stars": 4, "date": "2015-02-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "okcNd96gHHf_83wly93bpQ", "review_id": "UiE7IWjK79FNX5o0hb-LQA", "text": "its a bar what to expect, but noisy kids friendly it seems. The wings are good.", "business_id": "F-ykHfGY9lWr12OJ_Ofy7A", "stars": 3, "date": "2012-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dYrlHXDfyMn4GA7SsaSd1Q", "review_id": "Ja87yK_uLwVeM2ztNDafMw", "text": "My father has been going there for years and I have met him there. I recently started going there on my own and found it to be an excellent place to hang out or eat. They are a sports club that actually shows hockey games, WOW what a concept. I've also enjoyed singing karaoke there and now they have free comedy shows to. The food is also great and priced fairly. I found a new place to hang !!!!!!!!!", "business_id": "vFJmFFfPVhHkC3bWOeZnNA", "stars": 5, "date": "2011-12-20", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "wqQ-50Sjf9ol3SYaPbA1YQ", "review_id": "Im-5XMjiTXOFdvKT7ijw5Q", "text": "It's Denny's? Good bfast this morning!", "business_id": "UYHa5iKUddnZrlxF7taI0Q", "stars": 3, "date": "2012-02-02", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "VZ4mMMnCgs1GbKeS6sYQ5g", "review_id": "vggjzSfp-bwfJvBnwzhdxA", "text": "Why, why, WHY has no one told me about this place! This place is EXACTLY what I want when I go out to breakfast!\n\nThe location:\nTotally tucked into that strip mall at 4oth & Greenway where most people (including me) never get past Starbucks and The Gelato Spot. Small inside, but feels cozy. \n\nThe service:\nAwesome- nice ladies who fill up your coffee, are sweet to your kid and know that what they do is based on immediately making you feel comfortable. On a related note for those of you with kids- There is NOTHING I appreciate more at a restaurant than a server who 1) gets your kids food out as soon as possible. Eating kid = happy kid and 2) hands YOU the hot plate so you can take care of it, rather than dropping the plate in front of your 2 year old, announcing it's hot and leaving. DUH!\n\nThe food:\nFantastic- I had the chicken and veggie skillet. I never order skillets because they are always greasy and loaded with cheese. I took a risk and it paid off! Perfect combo of yummy but  not, I need to purge after this!\n\nThe price:\nJust right, a LOT of food for not  a lot of money. Me, the wife, and our full size 2 year old ate for under $25. And let's just say I took food home- NEVER happens :)\n\nThe customers:\nTotally cool- the place is full of regulars who were all nice to our little one. It didn't hurt that he went table to table saying goodbye on our way out, but nothing makes me want to smash a face as much as a person who is rude to my kid so mad props to the regs!\n\nAll in all, this place  is just my speed and we will be back... A LOT!", "business_id": "2RxIERKZi5gjLW76MkFotQ", "stars": 5, "date": "2009-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "A_O8wZOsMTPwyeYA4-Rsow", "review_id": "ju2gApVtnIlJ6FdYVRzLHg", "text": "If you like greasy truck stop-esque food (like me) you'll LOVE The Waffle House.  And I can not recommend the Hash Browns enough! Yum!", "business_id": "VuPhv9CNIHLOzS2JeDwLOA", "stars": 4, "date": "2006-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-2PFmYGWB6rQhZtRh6PlPA", "review_id": "8UJYBiYm_hOkgqmAa79tRQ", "text": "Car hop was nice (in that fake nice sort of way). It did take them a while to answer the button and they weren't even busy. We went after I had to visit the urgent care across the street. At least 2 songs played before we got to order. The one on 48th st and baseline is way better", "business_id": "QEytIMqL_i4VETkP_kqePQ", "stars": 3, "date": "2013-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Abrkd94L1fFs1Xgcp7MAbQ", "review_id": "nVZrq8RujIsEob-_AOMGaw", "text": "When we went here, we didn't realize that it was a real working farm. We just thought that was the name of the restaurant. We went for breakfast at the Morning Glory Cafe. It's all outside seating, self-serve coffee in a laid back atmosphere. The food was excellent. I got the breakfast tacos with eggs (although I would have preferred if they had a tofu option.) My husband got the cowboy breakfast and enjoyed it as well. Portions were large and service was fast. It's a very unique dining experience and I recommend it to all, especially tourists like us.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 5, "date": "2010-02-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "lOvgjEkecLfVJwJriEjt2w", "review_id": "vxiwUjzNSfEDf0ylJmt8PQ", "text": "Beautiful, charming farm with 2 restaurants on the premises. Lots of beautiful crops, pecan trees, awnings and pergolas to drool over. There's even a chicken coop! I honestly could spend all day here. I wish I had known about this place when planning my wedding, it's absolutely gorgeous.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 5, "date": "2013-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PDsw3VrEipkveDLbMxX2pQ", "review_id": "6rnF_85As3_Ywla_zK8TOQ", "text": "An absolutely delicious brunch with honest food and eager to please staff. Youll definitely see me again.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 5, "date": "2015-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "_h4oH3MMHrf14jS_99r2fw", "review_id": "w19k-3hg3cpv4xdu-HbVIg", "text": "I normally do take out this location . Staff is always very nice . Food is great . Better then a lot of other ihop locations .", "business_id": "lq2iZK7epi23byzcejjqTg", "stars": 5, "date": "2014-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ORw3ZwZHLGeTHx-cORSFNw", "review_id": "2k5CAHyL9o8MmKEqFGzeVA", "text": "Went to Keegan's last night for dinner. We arrived around 7:30 PM. The amount of people there was just about right - not completely empty (which would make me feel like it was unpopular for some reason) and not completely full (which would lead to inattentiveness by our server and an overloud environment). Our waitress introduced herself and asked for our drink orders promptly, and brought them back promptly. \n\nAfter looking over the menu, I ordered the filet mignon (medium) with steamed broccoli and sauteed green beans. We each had a starter - I had a salad with blue cheese dressing and he had the French onion soup. Neither of us was particularly enthused; my dressing tasted like mayonnaise and there were only a few slim morsels of blue cheese to go with my lackluster lettuce and single tomato. \n\nThe entree, however, truly redeemed any lukewarm feelings I had. It arrived only a few minutes after we finished eating our starters. The outside was charred - as advertised - but the inside was a perfect pink, just the way I like my steak done. The filet was spiced absolutely perfectly. Every bite was a new treat. The beans were also delicious. The broccoli was NOT up to par, but it was the only thing on the plate that was not divine. \n\nAfter we ate our entrees, it was after 8:00, so appetizers were half-off for Reverse Happy Hour. Although our waitress said they normally do Reverse Happy Hour only at the bar, she asked her manager and told us it would be fine to order appetizers from our table - great service there. We got the spicy chicken wings - another winner! The spicing was amazing. They were really, really good. \n\nOverall, we agreed that this restaurant was a winner. The service, filet mignon and chicken wings bring this place up to five stars, with only one star taken away for the broccoli and salad experience. I was really pleased with my experience here.", "business_id": "SgTjnyElc26gPUghVuCuSQ", "stars": 4, "date": "2012-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "Ixq_feoJpn3aua9j6PLITg", "review_id": "UwLNkoJKeVjq_5c9sDzgag", "text": "the thing that stunned me was the hostess. She was not at all happy, and when she seated us, i saw a delicious soup someone next to us was having and i asked her \"omg what is that soup it looks good???\" and she looked at me like i was dumb and said, \"....i dont know\" and walked away...it was ridiculous....my gf that i was with is a hostess and she was in disbelief too....she could have said, \"I'm not sure, ill ask your waitress to find out, or i will find out for you\" but \"...i dont know\" with an attitude? very dissapointing especially being the FIRST impression that we have when we walk in.... very bad customer perception. \n\n\n\nBesides that, The food was awesome, and my waitress was awesome...but very dissapointing on the hostess end...first impressions are everything.", "business_id": "NX5YHSIyesufcsI7Rg5NLg", "stars": 2, "date": "2010-02-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "veTxWRC7AjI0ChuV0pvqkw", "review_id": "MEhkw43GlSQtrJLKX89ghA", "text": "Wow this place is amazing. i got the special that came with 2 eggs (i got them over medium) hash browns (capped & smothered meaning mushrooms and sausage gravy as a topping on the hash browns which was amazing) 2 slices of ham, 2 pieces of bacon, two slices of toast and a waffle of your choice.\n\nFirst of all this place is not called \"Waffle House\" for no reason, Absolutely the best Waffles here than i ever had anywhere else... and ive had waffles all over the damn place. Outstanding staff they were very nice and on top of things, if i ever come back to AZ i would come here first before stopping by at any other place.", "business_id": "0kZ4aYmqf5fzTt9Yvz8Kvw", "stars": 5, "date": "2012-02-24", "type": "review"}
