{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "T_wjLgPOPXry7Bea4MzoVQ", "review_id": "XW_RwDoN9StbDt0Y1pc3VA", "text": "I have never seen a restaurant that has a frowning brownie (a.k.a. Frownie) as their icon, mascot, or spokesperson.  King's Family Restaurant has surprised me with this.  I think it might be in direct dialogue with Eat N' Parks smiling cookie -- funny (funny odd, not funny ha-ha).  We were seated rather quickly by the manager.  Very nice people work here, I was happy to find that even though they had closed a section, the server was willing to stay longer to serve us our dinner.\n\nWe chatted with the server a little bit -- she was quite engaging -- and then moved on to order our meal:\n\nTea\nPepsi\nOpen-faced Hot Turkey Sandwich with mashed potatoes and gravy\nBuffalo Chicken strips with mashed potatoes and macaroni n' cheese\n\nOur drinks arrived and our server conversed with us some more about the area.  She would leave every couple of minutes to check on our food and to make certain that her other tables had everything they needed.  Eventually, our entrees arrived -- both piping hot.  I went straight for the macaroni and cheese.  It didn't taste bad, but I swear that it is made by Stouffers.  I didn't feel the need to eat that much knowing that there were other things to eat.  I tried the mashed potatoes and found that they too came from a package; but, again, they didn't taste bad with the brown gravy.  I moved on to the main part of my meal -- the buffalo chicken strips.  At least they were all white meat and the buffalo sauce was more than just mild.  I contented myself with eating them.  \n\nI tried some of the hot turkey sandwich and just left the rest for my friend since it was not fresh cut turkey but instead luncheon meat that had been heated.  I finished off my dinner and was happy in the end.  No, it wasn't the best food in the world, but the service greatly helped the perception and it didn't taste bad.", "business_id": "wJr6kSA5dchdgOdwH6dZ2w", "stars": 3, "date": "2009-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iW71aYulKp5Vv-8eIEvb5g", "review_id": "Dm7Q_ZHL7Pphk9mBh5KtxA", "text": "I've been coming here for years but the new owner makes a world of difference.  Great bargain and better breakfast. You can't go wrong with straightforward good food made well. In an area known for great basics these guys get it right.\n\nTake a trip to Stowe hunry.", "business_id": "r8BwdblCW-ZUES37BL0khw", "stars": 4, "date": "2015-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "E-C5691FjWXigfBF51u6pg", "review_id": "p5wVMSpK5Qbc6y_p9MqZ2g", "text": "Great food and diner atmosphere. Well worth the wait if you come in on the weekend. Everything is fresh and made from scratch. We will be becoming a regular at this place for sure", "business_id": "2Igiyhi82R8_QaaPplRmCw", "stars": 5, "date": "2013-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PnEezX1d76TRbLratLUnTw", "review_id": "bLoG0hZyAD151xcRyYsa7g", "text": "I got to check out The Dor-Stop Restaurant on my first trip out to Pittsburg. My friends mentioned that this place was pretty popular and had been featured on Guy Fieri's \"Diners, Drive-Ins, & Dives\" so there's typically a wait, but it's worth waiting. Upon walking in, the dining room is pretty small, which meant we had to wait outside. The decor looks like it was mostly untouched from the mid-80's, but that's the charm of an old school diner. The few recent additions to the decor include pictures and articles related to Guy Fieri's visit, it's pretty heavily publicized throughout the restaurant, including at least one dish on the menu featuring Guy's name in the title.\n\nDiners are never the most attractive places, they succeed on their low prices, quick service and delicious food. The Dor-Stop Restaurant nailed all three of those factors perfectly. My breakfast was simple, I ordered a vegetable egg white omelette with home fries, wheat toast, and a side of spicy italian sausage. The food was delicious, though I received a regular omelette instead of an egg white omelette, but that's not the end of the world. I also got to taste the chocolate chip pancakes (they call them hotcakes) and some kind of strawberry french toast, both were absolutely amazing, definitely some of the best versions of those items that I've ever had.", "business_id": "2Igiyhi82R8_QaaPplRmCw", "stars": 4, "date": "2015-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tHniTtWA8JWhdvZKQUVLKA", "review_id": "-2LJbOPYmSIRJdRDkDHmhg", "text": "This place is adorable and quaint. It's a former house turned into a bed and breakfast plus a restaurant. I had brunch here. The staff was clearly very well trained and put a lot of effort into the details, while retaining it's cozy, intimate, homey feel. The food was also quality.", "business_id": "rUQfZOengMpXFkLvJrNJ3g", "stars": 4, "date": "2013-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Cmr-DQGmZl81Pe7k38aqDA", "review_id": "iOddrE1vV2Z41QglRq0a_Q", "text": "Each time I've been here (3 or 4 times as the writing of this review) I've ordered the hotcakes. And when they are sooo good why would you ever order anything else? \n\nThis location of Pamela's is certainly nice and clean enough. The waitstaff are attentive and the kitchen is fast. So really this is a review of those hotcakes. The crispy edges really are the best part. That said the middle with the fruit stuffing, brown sugar, sour and whipped cream is pretty awesome too. \n\nI have eaten here each time I've visited my sister out in the 'Burgh, a tradition that I hope will continue.", "business_id": "TxKmAsKQjND5vbhBdUSyIA", "stars": 5, "date": "2011-02-28", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "NChl6bTuhngG6_R4-pp20w", "review_id": "VnSfA8uAb1M6d-xM-C0xdw", "text": "Not sure what was worse the waiter's B.O. (which was akin to a Mumbai locker room) or the fact that this place is most likely owned by the Gambino Crime Family....\"Cash Only.\" The wait is probably the most enjoyable part of this restaurant...which is at least 15-20 min. Our food arrived before we could take off our coats and the check came before I took my first bite of grease. The corned beef looked like mashed goat brains and the pancakes reminded me of Ethiopian sponge bread (apologies to Ethiopia). This is my second time at Pamela's (the first being above average) and most likely my last....unless for some reason I crave food poisoning.", "business_id": "TxKmAsKQjND5vbhBdUSyIA", "stars": 1, "date": "2015-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "G4RKbmhNsywBhlN2-b6cyA", "review_id": "dVDf4cnzGPoRm1fK_LGZMA", "text": "The crepes here are really lovely - well-portioned - and come with a classic side salad. The ambience here is unique - it feels like a well-furnished, cozy cave, rather than sitting in a Starbucks (which unfortunately is what the Craig Street location feels like!) It's very popular, but classy enough to bring a Sunday brunch date to. \n\nI used to come here EVERY single weekend my freshman year of college. I'm several years out of college but come back here fondly whenever I visit Pittsburgh. It's been almost ten years since I started going to this restaurant, and amazingly, the prices have only risen by a quarter (as in, 25 cents, not 25 percent) or so since I was a wee college freshman. Inexpensive with wonderful service - I only wish they had a place like this in Philadelphia!", "business_id": "cmGR1HS9ms233roSllcglw", "stars": 5, "date": "2012-01-15", "type": "review"}
{"votes": {"funny": 3, "useful": 0, "cool": 2}, "user_id": "d8y98FiNtI8OQFAp2tvoKg", "review_id": "jCaVgX3km-Gu5hClEWiFhw", "text": "OK, it's Showmars.  So all you snobby food Yelpers need to take it easy.  You know what you're getting - the cute little old Greek guy on TV.  But it ain't all that bad.  This location on 7th Street is right next to a bunch of cool shops (Heroes, VisArt, Ho Ho Cherry House, Sunflour Bakery, Philosopher's Stone, etc.)  So make a day of it!\n\nAnd it's right next to a fun intersection - try not to get hit by a car, it's like playing Frogger.  Yep, you're the frog. Good luck!\n\nService has always been great here.  They are sooooo nice.  Monday night, kids eat free with a paying adult.  And Jason Frame does magic at your table.  His card tricks are really good.  They also have a good variety of side dishes, unlike other Showmars around Charlotte.  I dig the fried okra.  They also have root beer to drink, which is always a bonus.", "business_id": "8PsQqhrAH5uqJ7HODOmXYg", "stars": 3, "date": "2012-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WX2OGNtFMkfZYSopABxchQ", "review_id": "dPLUZrCANhAUtWOO2Y_7PA", "text": "A good place to go if you have a family with different likes and dislikes in food.  There is a wide selection of things to choose from whether you want BBQ or a veggie burger (which our table ordered both and both were good.)  \n\nHowever that being said, a restaurant that is so broad in choices usually does not make anything that has a WOW factor either.  Everything is good, nothing will knock your socks off or be anything to write home about.\n\nThe service was good, the atmosphere was nice, but with so many choices in Charlotte I would not come back in a hurry.", "business_id": "hIQRiE3UsYH7UsrsDwJwLA", "stars": 3, "date": "2012-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4P1AfdABykulRK6C-ww4sw", "review_id": "EcyWEeZHl8hdWCKTTdS-JQ", "text": "I remember going to the OPH near Detroit when I was kid.  I never realized they were a chain until I moved to WNY and they had three loactions there, which were all just as good.  I was happy to see the two locations in Charlotte when I moved here.  This chain has a lot going for it - especially fresh food AND consistency.  \n\nThis one is a good location but gets very busy on the weekends.  The food is always fresh and the service is also good, plus you cannot beat the price.  The food tastes a lot more \"real\" than IHOP and Waffle House and it's just overall a better experience.", "business_id": "UzMMpUFwJhwUkHOyeXeWsQ", "stars": 4, "date": "2010-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "bK_pSZB_ffrz5eAvnIToiA", "review_id": "i2tQE31ZdewENzDIuy96gQ", "text": "Places like this are a dying breed which is a shame because I absolutely love it here. I've been going to Charlotte 2 to 4 times a year for about 6 years to visit one of my best friends and there hasn't been a visit where I haven't gone to Sunrise. I love all the booths and I've never had to wait for a table. Among my favorites are grits, biscuits, baked spaghetti, peach cobbler and real sweet tea! I don't drink coffee but my friends really seem to like that too. The servers are friendly, the food is good, the menu is large, you can eat breakfast ANY TIME and you can't beat the prices!", "business_id": "KQqkkg5jaxIbdMIG4MJCIw", "stars": 4, "date": "2012-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Vv6DYMiNXX6tYeLCvOAxSg", "review_id": "LGzFPX8P29RQvhrEV1qNVA", "text": "Stopped in for a quick breakfast yesterday.  Line was long but moved along quickly.  It was very crowded, but not overwhelming.  At 11am they were still serving breakfast, but also had the lunch menu available.  All the staff was friendly, efficient, and helpful.  They had more of a variety and larger containers of juice than my local Bruegger's does.  I got my usual sausage, egg, and cheese on a blueberry bagel.  Very good!  Plenty of Christmas cheer in terms of decor and special gifts available.  If I lived nearby I'd go there again.  :)", "business_id": "zOY-W35waCcBWDmjX7_MFQ", "stars": 4, "date": "2010-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "U3VhUw4XlAkkp9ouvDQHwQ", "review_id": "o92JRR__tzr3_oA5wgHZqg", "text": "Was staying at the comfort inn next to Perkins and the clerk told me they gave 10% off for guests. I figure I'd get a late night burger and I wasn't disappointed. I called and ordered. It was coming off the grill in the time it took me to walk over. Burger was good and staff was friendly.", "business_id": "yYIEKwgQUHJpySOcVdCAkg", "stars": 4, "date": "2013-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AEP33Zp4phOGMLw_xbwf8w", "review_id": "CIB0MFELcUXJ-jfk93eHcQ", "text": "Great meal today...Lilia was a great waitress also....highly recommend!", "business_id": "u-y1z3usKenHtOGrH5Vveg", "stars": 5, "date": "2015-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EnA4CHcOwDq_XcLZBI1q8g", "review_id": "0s6bU-gkjyu1jifkDTF6YA", "text": "Best French toast in town!!", "business_id": "2UAbUSTMsR9G26A8AYO3dA", "stars": 4, "date": "2012-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5BNI8ukGTlwUI2CCeyjZOw", "review_id": "PhXmhjj4ESrQbWURtXQjxA", "text": "A solid breakfast choice if you are in the area. While I can't recall anything being particularly amazing, nothing is really bad either. With the low prices, you can spend the money you saved on buying something nice in Marketplace Mall.", "business_id": "KUpdnQi16DGP54FlDWOJ6g", "stars": 3, "date": "2011-12-27", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "NGX1PZwHET_oQOT7vkkxag", "review_id": "UKtB2YkpvAtc6PhS_mKDcA", "text": "I have always enjoyed myself here. I've dined and drank and drank and drank.\n\nA few highlights of Radio are: 1) their Absinthe service, which is quite a production. I don't feel like I can really do it justice by describing it, but you will not be disappointed if you order up a couple Absinthe drinks. 2) They offer \"The Wheel\", which is a 3.5 oz shot of each of their beers on tap. They have about 28 beers on tap, and many are the darker craft ales, which in addition to being really tasty, are higher in proof. You need a couple of people to do this right, and there are some \"rules\", but if you are already planning on cabbing it home, this is a great way to learn about beer and get drunked. 3) Their kitchen stays open all night. 'nuff said. 4) Radio is one of the very best places to sit outside on a nice summer night. Get a table at dusk, put your back to the window and watch the night unfold.", "business_id": "AB5RgQ0ZnMThdqgFS3cPuw", "stars": 5, "date": "2010-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0XblLlmCumBzPBYgVqNvBQ", "review_id": "nt2k_QXKP1-AtUEYMW18nQ", "text": "This place is pretty awesome in downtown Champaign.  I had the torta maria out of sheer curiosity for what sweet potatoes, goat cheese, tortillas, and vanilla bean sauce tasted like all together.  Goodness me!  That's some good stuff to put on your fork!", "business_id": "AB5RgQ0ZnMThdqgFS3cPuw", "stars": 4, "date": "2015-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_AZQtUj6jcJSIPv507GrhQ", "review_id": "6FzLwomewolXhofqsuFGwQ", "text": "I have been going to this IHOP every month for 4 years. Our group is anywhere from 8 to 25. There are only two places in the restaurant that accommodate groups and for the most part, we have been seated relatively quickly. Over the past year, service has gone down hill. It started taking forever to get our order taken, get our drinks, or get our food. We are a very forgiving bunch and know it's not easy to serve a large group but as service started really sliding, our last trip ended the relationship. We had about 20 people and knew we would have to wait a bit, but after 30 minutes, we inquired how long and it was like \"your waiting for a table?\"the kept sitting people at the tables that only could accommodate large groups. How can you not remember a group when they take up the whole lobby? We called a near by breakfast place and they were thrilled to have our party, which grew smaller since some left at that point. We found a new home and they will get 5 stars on my review.", "business_id": "P7wKlbSRsoRrfH3DFOY08A", "stars": 1, "date": "2013-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LoYy8ruCxPZZPF78_Bu2eQ", "review_id": "bf9X5Yab38Vr9te0y3Kkxg", "text": "Fastest place to grab a bite during lunch hour food is good prices are reasonable and the staff is friendly.", "business_id": "9BH18avE46LlHMvJn67MaA", "stars": 4, "date": "2014-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Pi0iwgZZBT0HxVRFQpY36Q", "review_id": "fvIdMzFqcg5wSU7iQhFK0Q", "text": "The first time I came here something was wrong, they gave me a discount and a stamped card for a free meal. I went back after 6 months to give them a second chance and my biscuits and potatoes where cold upon being served. I noticed discoloration in my scrambled eggs and everyone elses eggs where bright yellow. .The food is over priced, My order was $8.50 and it didnt even include at least two pieces of sausage. the waitress could not do her job and notice that there was 3 of us and only 2 sets of utensils so I had to wave another employee down.  will never eat there again. I dub this place the bad egg", "business_id": "SkNUbFJiJtbZjY-S_S0u7g", "stars": 1, "date": "2014-02-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "sYe1DZYWnAHVfEzWlLkaAw", "review_id": "tDI8yR8OjE3C-T8qnvwDuQ", "text": "Scotts is what you expect when you say Jewish Deli.  The corned beef hash is crispy on the outside, with green peppers and onions mixed in.  All of the portions are large to say the least.  The first time we went was for breakfast, but after seeing a corned beef sandwich go by, I changed my order!  Bacon that tastes like bacon, eggs cooked the way you ask for them, and lots of personality in the staff and owner.  Jan is a hoot, and Scott is always behind the counter to add color.  Not fancy, and you will have to Fabreeze when you get home, but a great meal that a chain will never match.", "business_id": "PxeX1M8WtyPxX1MuuGIh-g", "stars": 4, "date": "2010-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BiZvuNKi0bs_YwttHhhq4w", "review_id": "i48dqt-3Ly_s9K3MyL4A2Q", "text": "Boyfriend and I were in the mood for a quick yummy lunch and he brought me here. Its an old school diner feel with older cute women that wait on you. To be honest, I wasn't particularly impressed with the layout and some of the deli choices (it didn't seem like the cleanest place to me) but the service was sweet and the food was ok. \n\nThe decor is kind of funny, it definitely embraces \"generations\" as it has old wedding photos and family photos on the wall. \n\nWe both had pastrami sandwiches but I had only a half with some soup and boyfriend had the whole. The soup was really thick with veggies and meat. The flavoring wasn't my favorite but boyfriend really liked it. The sandwich was good, but a bit greasy and HUGE. This is definitely the place to go when you have a hangover. We could have split the one sandwich since it was so huge. I was able to eat about 1/4 of it since they give you massive chunky fries and cole slaw.\n\nI saw some other people getting different things and it looked good so I would come back to try some other items but this isn't my number one favorite place by any means.\n\nI probably would have rated this a 3-3.5 but the older ladies were just so sweet.", "business_id": "PxeX1M8WtyPxX1MuuGIh-g", "stars": 4, "date": "2014-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6CJBUmthxEDfZF4DaNI-Rw", "review_id": "g4Va37YapET6ZTyHR9sFxA", "text": "Denny's is always been a favorite places  easy cheep and  great service.", "business_id": "FKHv7FkblONv9qqBndJUrg", "stars": 4, "date": "2014-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XpejQYZqVcYGX7fYuYHzSw", "review_id": "MgmpSDnRpBZXrnc5e0_fAg", "text": "Recently went to a happy hour with some former co-workers at D&D.  I was the first to arrive and waited at the tables outside for my party to arrive.  After a couple were there, we went inside to get some beverages and went upstairs for a table.  The beverage selection was good, I was drinking beer, and while they didn't have anything on tap that I was interested in that night, there were several in their selection of bottles.  Some more of our group arrived, and a cheese tray was ordered, and it was decided that we were going to go sit outside, b/c they were starting up the heaters.  We got a table right under a heater, not too far from three dudes playing music.  I probably would have rather stayed inside, if only because of the music...I'm not against music per se, but I have trouble listening/focusing on conversation when music is being played.  Anywho, the funny part about this was that at one point, the band brought up some girl from the crowd who sang two songs with them.  For whatever reason, the conversation stopped on the patio.  Not sure if everybody knew her or what, but another guy and I just started talking...I mean, if we were talking during the band, why not talk during this girl's singing?  Hopefully we weren't too loud and didn't offend her.  Anywho, the cheese tray was good, but wish it had been labeled, because whoever brought out the tray did not do a good job at telling us what was what (I can't even remember if one of our group brought it out or an employee).  One other minor problem was that our heater went out (ran out of gas) but no one ever came over to restart it, and it got cold...  \n\nOverall four stars.  Pretty good happy hour specials and a nice setting.  Bet this would be a pretty great place to go in the evenings when it's a tad warmer.", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 4, "date": "2009-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lYiY0z9gpe0xL0NZIc7iUg", "review_id": "91dVoYpAUZ_WuE7A6tfhdA", "text": "This place has the best sandwiches. And they've been consistently great every time I have eaten here in the past 25 years.", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 5, "date": "2013-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t6mqJt54rJd6uWVBZUXi_w", "review_id": "YF7RA6UNer6UZ6hjHMEGfw", "text": "Amazing brunch buffet.\nSomehow, between my internet searches and the time we arrived for brunch (time span: hours), the menu and pricing had been streamlined such that $39.99 got us the expansive cold item/dessert buffet, the hot small plates, and unlimited coffee/tea/juices, and an extra $8 got my husband unlimited mimosas.  The menu is always changing, and certainly some dishes are more memorable than others. For us, the hot pork tenderloin was perfect: crisp crust and tender inside. Our Wright's benedict kind of fell apart as it arrived to us but it was still tasty. The cold seafood bar was fantastic. The cold lamb bite with cous cous was alright only.  The desserts were all great, but by that time we had not paced ourselves and we were stuffed, so the desserts were kind of a blur.  Service was friendly and attentive. I would consider coming back to Phoenix just for this buffet -- what an amazing find/value!!!!", "business_id": "imvNxppzxkLUPH64pQsDQg", "stars": 5, "date": "2014-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nY4GuH4FVUrJDoZ2tjdfkA", "review_id": "Abwqwzec6wGbmFSUwGGK_w", "text": "The atmospher in this place is great, but you would expect that for a huge mansion in central Phoenix.  Our food was good;  however, our waiter was brisk. We had to ask him to talk slower and repeat menu items as he went too fast.\n\nOur food took 45 minutes.  Since we were on the tour this was a problem. We did not order anything that required a long cooking time.  Just a burger, mahi sandwich and a salad. So we quickly ate and paid the bill. Never had a chance for a cup of coffee or to even consider a dessert. \n\nIf it wasn't for the mansion and the surroundings I would find another place to eat. The house is gorgeous and the stories are fun.  I like considering what it would look like when the Wrigley's built it.  This is one of the few homes in Arizona that would be considered American royalty.\n\nPS - my friends bacon burger looked nothing like the one posted in their pictures.", "business_id": "yPfvOB63thP5t3pGZPJExA", "stars": 3, "date": "2012-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EKS2Ww4AAO62U2EAeqZM-Q", "review_id": "jiZDVhQzb2pakcka2zg7Aw", "text": "Went for a Holiday lunch. Called ahead to see what vegan options they might have. They had no idea what vegan was. Pretty shameful for a supposed high end cook staff. Got there and the only vegan option was a few fresh fruits. Not even any of the salad dressing was vegan. If you are vegan... Thank you! And STAY AWAY from Wrigley Mansion!", "business_id": "yPfvOB63thP5t3pGZPJExA", "stars": 1, "date": "2015-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "FVSJR7CxGy3RTS53bLDUaA", "review_id": "buu5gmc2rSAmxIlCAPhrPg", "text": "This place is awesome.  Traditional French.  I had the Coq Au Vin, (Vincent special) for lunch and hubby had lobster quiche. The Coq Au Vin was amazing chicken in red wine gravy on top of creamy mashed potatoes with snow peas. Half way through my delectable meal I realized I had been served HALF a chicken, not just a leg and thigh. I had to box the breast and wing for take home. This is crazy for this much protein for only $11.00, unheard of these days. And not to mention the buttery croissants with jam, their idea of bread basket that is to die for.  THEN!!!! They treated us to dessert which was an apple berry crumb pie with homemade vanilla ice cream. HELLO! Viva La France!!!!!", "business_id": "oc0Wl6ktfMLb5VZ2Uz6M2A", "stars": 5, "date": "2014-02-20", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "HZeFzs42f0iGaA-sP_hUnA", "review_id": "gS4CnVo21opwwj878aiaBw", "text": "I've been here a few times recently, in various different social situations - romancing, bromancing, and a business meeting. \n\nWow.... is all I can say. The happy hour(s), $5 wine, is a great deal. The food is superb. I think it's a hoot that it's in the old 'Synthony' location, what was once the coolest pro audio and keyboard shop ever. The ambiance is awesome - cool, urban. cultured. The service and knowledge of the servers is above par. It's usually packed. Definitely one of my favorite places for wine in town! I wish I'd been going for a long time, and didn't just get clued in recently. I'm glad I don't live closer... I'd be there all the time!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2008-12-29", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "zoJBalZn3RwhbT4yike37g", "review_id": "BVfMG8TXwDnMPHgQbGD1JA", "text": "This place has to be one of the most overrated restaurants... ever.\n\nSo this review is for dinner and maybe that is why I was so utterly disappointed.\n\nFood:\nBrushcetta- We sampled the artichoke, pesto with salmon, roasted red peppers with goat cheese, and the fig spread with green apple.  I mean all of them were decent nothing was amazing.  In fact, i think I could easily put together a couple of them myself and have them taste just as good if not better.\n\nNine Iron-  Once again, it was OK.  Nothing special at all.  Just exactly as was described on the menu.\n\nItalian Picnic Salad-  Once again, nothing special at all.  Could have made it myself.\n\nService:\nSo on vacation we tend to eat out.  This was our 4th dinner out in a row and the first 3 had impeccable service.  This place did not.  I felt like it was a lot of waiting and waiting more.   We ordered something they did not bring and when we asked for that something we waited and waited....  Servers were nice enough though but they didn't seem that busy on a Sunday night so I would have expected service to be better.\n\nAmbiance:\nServers-Well, the servers I would classify as Arizona hipsterish.  Like not real hipsters.  They should go to SF to see those.  But definitely trying to be hipsters\n\nPeople there- 30- somethings at birthday dinners mixed with 20-somethings on date.  And yes, we did witness a couple making out.  Once again this was 7pm on a Sunday. Spare me please.\n\nThe Place- First, we asked to sit inside because it was slightly cold.  Well they sit us inside but right next to the open half of the restaurant so it basically was sitting outside but without the heater.  Other than that it was cute inside.\n\nMaybe this place was more like 2 1/2 -3 but I was so disappointed with the food and ambiance that I have to round down to 2.  This place is probably great during happy hour but when you're paying full price, it's just so not worth it.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 2, "date": "2009-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "i2TRnWtvxxwJuynRKrw35Q", "review_id": "RQNPKWumj5QgQwGGRwdQNg", "text": "I love Postino!  I have visited more than half a dozen times.  The waistaff are always friendly yet professional, and the atmosphere can't be beat for a group of friends.  It is not an ideal first date spot because it is \"open\" seating and usually very full.  However, I meet girlfriends here for wine and bruschetta all the time.  \n\nMake sure to have the soup of the day, a great glass of wine (or a bottle!), and DO NOT MISS the bruschetta.\n\nEnjoy!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2010-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "vhxFLqRok6r-D_aQz0s-JQ", "review_id": "uvvgODmYhhqH0mdsS6Jzwg", "text": "Still one of my favorites.  The bruschetta is delicious and the fact that you can order different kinds appeasing my non-commital inability to make a decision self.  Tuesday nights are almost impossible to get a seat at now that they have a special running where you can get a bruschetta board and a bottle of wine for like $20.00 bucks or something ridiculous.  Have small bills with you as the parking situation almost requires that you go through the valet.  The restaurant is great for a light nibble or a heavier dinner if you get a pressed sandwich or salad.  (The chicken salad in particular is one of my favorites)  You'll see a lot of couples here on first dates (which can be a lot of fun to people watch)  I've seen some really awkward dates, and some really great ones were you're convinced you're seeing magic happen right in front of your very eyes.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2011-01-03", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "i8DseVjz5ypByMh3ZfxEFA", "review_id": "UMqn3HsPh5ak5AbVh9yVMQ", "text": "Bruchetta board, pitcher of Kronenbourg, sitting on the patio, stellar service and boyfriend = death because this is the best dining experience I might ever have. \n Favorite slab consists of: Roasted Red Peppers on Goat Cheese, Warm Artichoke, Dates, Pistachios with Ricotta and Sheeps Milk below a sweet Tomato Jam. \n\n The only *bad* (more so just personally annoying), thing I've ever come across here, had nothing to do with the food itself or even the servers..well not our server..was when one of the ladies walking around clearing tables felt the need to express to us that SHE has OCD therefore, we needed to remove the last 2 pieces of bruchetta from the board, so she could clear it..because it was making HER uncomfortable..\n\n Never push your 'disorder' off onto someone else and expect them to abide, especially when your customers are deep in mid-conversation about serious things like puppies and the night's baking agenda...this customer will not yield and out of spite, leave a lingering, lonesome bruchetta upon the slab for your sake.\n\n I, too, have a disorder - not caring about your fear of individual bread pieces on a plate.\n\n Despite said occurrence, there are NO complaints, ever. A valley staple that I recommend highly, for all occasions.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2011-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "rn-S3h35NiiAvKvEMDbtZg", "review_id": "kO_wxDM35PUy6ukVEP_m-Q", "text": "Been a few times at various times for various reasons.\n\nFood - 4/5\nLove the bruschetta, sandwiches are good really no complaints, good alcohol selection. \n\nService - 4/5\nI always receive good service. \nValet is always youthful.\n\nAtmosphere - 3/5\nCasual, great place for meeting friends. can be a little too busy for my liking.\n\nPrice - 3/5\nAverage I can't really complain.\n\nOverall - I don't go out of my way to go here, but I certainly recommend it.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2012-01-26", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 3}, "user_id": "fZk4Mtsb_dGqifrWN1ET7g", "review_id": "xwq5qvzTgzuVR_s6g2AqXA", "text": "Just go.  Get the bruschetta.  Get a $5 glass of wine.  Get another.  Get another.  Get another.  Call a taxi.  Come back tomorrow.  Repeat as needed.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2013-01-09", "type": "review"}
{"votes": {"funny": 7, "useful": 9, "cool": 9}, "user_id": "YLE6GoJ61fb0QBF7JTkaJg", "review_id": "f4sX1c22qeMhdbRrr3Xe4A", "text": "Postino has 3 locations around the Valley!  I've been to 2 of them now and the one thing you can say about Postino, they are an amazing place to dine/drink and they are very consistent with service, quality and ambiance.  \n\nWe typically go the Postino on Central, however we dined here a couple of weeks ago with some friends and found them to be fantastic! I really like the patio area!! It was too cold for us on this trip however this is a \"must come back\" kinda of place just to enjoy a great meal on their patio!!\n\nFood~ if your dining for lunch go straight to the salads and/or bruschettas!!  Their portions are actually larger than you think and after you pick and choose some of the different ones to eat, you'll thank me for passing on the apps!!  \n\nHowever if you re dinning for dinner or have a larger group or a huge appetite, then go ahead and order some apps.  I suggest trying their Bella Postino~ warm artichoke dip and white bean hummus with assorted breads or their Butcher's Block~ with different artisan meats and cheeses served with Tuscan beans, olives, nuts and crostini.  Both are DELISH!  \n\nBruschetta's~ here are some of our faves;  Prosciutto with Figs & Mascarpone, the Smoked Salmon with Pesto is my go to!! The Burrata, Bacon, Arugula & Tomato is also a go to!  We also like to try their seasonal burchettas as well!  \n\nPaninis~ go for the prosciutto with brie or their Nine Iron with smoked bacon layered with grilled chicken, fresh burrata mozzarella, lettuce, beefsteak tomato and special sauce = nom.nom.nom!! \n\nService~  our service was a little slower than what we are used to at their Central location however our server was very friendly, knew the menu well and tried her best to keep up.\n\nAll in all it was a FANTASTIC experience!! My friends and I are looking forward to coming back on a Monday or Tuesday when they have their $20 special, a bottle of wine and burchetta ~ put me down for 2 please! I hope to see you there.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2013-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p2idPmL-9tnnBcELYKdIaQ", "review_id": "UwqkTNBkmo0W7Grtq9Ba2w", "text": "I LOVE Postinos Arcadia! What's not to love about a beautiful, modern indoor-outdoor restaurant, with excellent paninis and bruschetta and a fabulous selection of wines by the glass?\n\nReasons why I love Postinos, and you may too :)\n\n1) Great building with modern/chic decor - There's ample indoor and outdoor patio seating, and it's the perfect spot for lunch with the girls, or a date, or whatever! Parking can sometimes be tricky, but 9 out of 10 times, the valet guys will be there to help you (valet is free!)\n\n2) Butcher's Block Appetizer - $14 and well worth it and perfect to share - It's loaded with an assortment of artisan meats and cheeses served with tuscan beans, olives, nuts and crostini - Yum!\n\n3) Bruschetta - $14 for a choice of 3 - The bruschetta is made with beautiful thick, large slices of crispy, fresh bread, and topped with all sorts of delicious toppings. My favorites are 1) the Brie, Apples and Fig Spread, 2) Prosciutto with Figs and Mascapone and 3) Salami with Pesto\n\n4) The Wines! Great selection of wines ; there's something for everyone.\n\n5) Happy Hour! $5 glasses of wine/beer Everyday between 11am-5pm !", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2014-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "m21EE2_CqPzpXdKsYsbVIA", "review_id": "HCZ5V-jsG-l1Lt2iUB1sGQ", "text": "Love this little neighborhood and wish other places in the valley could replicate the character as well as the great food and wine list.  \n\nBottle and a board of bruschetta on Monday and Tuesday nights along with a reservation for a party of 8? I think I'll get my gang together!  But I also love the open garage doors and the little patio!  Follow up with a walk through the LGO grocery and bakery and get yourself an MJ for dessert.  Perfect evening with friends!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2014-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jFHmCsK5Vs3qSS5vvmb2Jw", "review_id": "aDP4uRDu8UJvO-ZCIxA_Pg", "text": "Great lunch place with good food and good service, but not so sure about five stars... I dont give those out that easily.\n\nI ordered the bruschetta plate:\n- Prosciutto with Figs & Mascarpone - delicious!\n- Brie & Apples with Fig Spread - delicious though a little sweet\n- Burrata, Bacon, Arugula & Tomato - delicious but gets a little soggy\n- Fresh Mozzarella with Tomato & Basil - good but the tomato was not very ripe\n\nMy sister had the chicken salad, with pecans, apples, gorgonzola and raspberry vinaigrette - she said it was alright. I tried some of her Prosciutto with Brie panini, that comes with fig jam and arugula - that was really really good. Heavy on the prosciutto, light on the fig jam - an excellent balance :)\n\nThey also have happy hour drinks 7 days a week -- all wines $5/glass, draft beers $5/pitcher -- worth noting!\n\nOverall I liked the place and the prices were great, but I think my expectations of a soulful renovated historic post office were maybe too high.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2015-01-28", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 3}, "user_id": "-Dof9NwAoQwRM-GVPZk5zw", "review_id": "Mtgnj4dH9RE_zLGSTHyY2A", "text": "Definitely one of my new favorite restaurants!\n\nA friend and I went to lunch there last week and it was even better than I expected after reading the other reviews.  The menu is EXTREMELY extensive.  The b-fast all day long is a plus, but I wasn't in the mood for that this time so I stuck to the lunch menu.  I ended up ordering the half sandwich and soup of the day and my friend and I split a side order of sweet potato fries.  The eggplant and roasted veggie sandwich was really good, but huge and messy!  I ended up eating a lot of bread and then eating the insides that fell out with a fork after wards.  Delicious nonetheless.  The homemade chicken noodle soup was outstanding!  It had lots of other bits of veggies that are not traditionally in the soup (red pepper, green pepper, corn, etc.) and it added to the soup quite nicely.  Did I forget to mention it's a GIGANTIC bowl of soup?  There's no little cup o' soup here - come hungry!  The fries were delicious although we didn't even need them since our meals were \"Hungry Man\" sized.\n\nSome side notes:\n\n1.  Parking is awful for lunch.  If you don't mind creepily stalking folks in the parking lot and possibly engaging in an altercation with another patron attempting to park, go ahead and give it the good ol' college try.\n\n2.  I ordered a water with lemon.  I received a water with no lemon.  When I asked for some lemons for my water, they brought me out a small plate with SIX (yes, I really did say six) overgrown lemon wedges.  I tried to come up with a scenario where one person would possibly have a need for one entire lemon on steroids.  I couldn't come up with one.  There is no reason for one person to be in possession of that much lemon.  Period.\n\n3.  We walked in and staff #1 seated us.  Staff #2 took our order.  Staff #3 brought our drinks and later the pile of lemons.  Staff #4 brought our meal.  Staff #5 cleared our plates.  Staff #6 brought our check.  Staff #3 took our check and brought the receipts/change back.  Did it really take 6 people to get us through a weekday lunch?  I was mostly entertained by it - it almost became a game of \"who will show up next and what is their task?\"  It was still a little ridiculous.\n\n4.  Being a semi-health conscious diner, I loved that they had fat free dressings, made tuna salad with low fat mayo, and just had many, many more healthy options than the average restaurant.  I appreciate places that can fix a good meal without drenching it in calories and fat.  There are plenty of places to go for that sort of meal when you're in need.  No shortage there.  It's nice to have those options beyond the standard no dressing, burger wrapped in lettuce, or vegetable medley consisting of zucchini, carrots, and cauliflower.  A big up for Taylor's.\n\n5.  For a half sandwich with soup, half of the fries, tax, and tip I paid about $16.  It's not the cheapest lunch in town, but it's worth what you pay for.  Just remember that the portions are gargantuan so no need to order a lot of extras to fill you up.\n\nI will definitely be back again.  Enjoy!", "business_id": "UxvOXcoCRFRAVhRB0D9imw", "stars": 5, "date": "2008-02-25", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 3}, "user_id": "7cR92zkDv4W3kqzii6axvg", "review_id": "J_gRRu8cFqVDm5b5D4LWPw", "text": "What a great little neighborhood donut shop!\n\nFree Wi-Fi, great cappuccinos, and DONUTS! What else do you need?!\n\nOh, and they are actually doing Yelp deals! I did my first Yelp deal here, getting a discount on my order for checking in on Yelp!\n\nIt's like free donuts! Woot!!", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 3, "date": "2011-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h_swPhqAt7QmvcM_YsbFDQ", "review_id": "51c-2pWXhnBAJiG45gWItw", "text": "Great breakfast spread to fill your desire for a hearty start to the day. Our Wonderful waitress sent us on our way with coke and ice tea in to go cups...gratis. \n\nI highly recommend!", "business_id": "Y3a3RkR97J_ReiKgiMXeJg", "stars": 4, "date": "2015-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VRlnJ5KBSzX9PxlBjJIdag", "review_id": "rqHLFuGhBmTgHQ68lNI-Jg", "text": "The menu they handed me when I walked in felt like it hadn't been cleaned since the place opened. had a horrid odor and I just walked out. if they can't clean their menus how can I expect them to clean the kitchen where they make my food.", "business_id": "UYHa5iKUddnZrlxF7taI0Q", "stars": 1, "date": "2015-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "A_O8wZOsMTPwyeYA4-Rsow", "review_id": "ju2gApVtnIlJ6FdYVRzLHg", "text": "If you like greasy truck stop-esque food (like me) you'll LOVE The Waffle House.  And I can not recommend the Hash Browns enough! Yum!", "business_id": "VuPhv9CNIHLOzS2JeDwLOA", "stars": 4, "date": "2006-01-07", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 2}, "user_id": "Vh7HNMDLVVmnnBsIe7i7Qw", "review_id": "O8dD_ifpoStWwzIS4QKsWA", "text": "A favorite spot for lunch on weekends?!?!?! God.  I hate you guys. This restaurant makes me want to move to Tempe!!!!!!!!  Does not compare to ONE, not even ONE sandwich place I can think of in the east bay.  I got the Pecan chicken salad sandwich and Billy got the steak sandwich, hands down, best sandwich this side of the fucking mississippi.  All outdoor seating, so be forewarned, if the weather is not good, you'll have to maybe escape to an air conditioned car somewhere to enjoy your mayo while it's still good.\n\nOne thing I just can't understand...  We were steered to this place by two peeps at the Fry's down the street after atleast five minutes of head scratch.  Now wait one goshdern second people!!!  How could you even question the all supreme sandiwch gods when it comes to the caliber of this place????  Please.  If I worked at a Fry's nearby, this place would be my fucking fall back plan in a second.  I'll stop now.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 5, "date": "2006-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M-j04kcOanazSntBzoD3ng", "review_id": "kh_3aAf8xOtu1bWCb41lqQ", "text": "Beautiful property, nice place to spend a lazy weekend morning. But the food is overpriced, and really small in quantity. I got the Italian sandwich with meats and pepperchini and cheese....it was good, though very much on the salty side. My friend got pasta. It was simple and tasty, but the quantity was so little that he was done in 5 minutes! My sandwich came with no sides. The passionfruit ice tea I got was delicious, though. I think the food prices include the price of the entire \"experience\"--the farm, the artists cottage and the ranch-like atmosphere just a short drive away from the city. That's what makes this place pricey. I had a coupon from Groupon so I didn't feel too bad about it! Oh, and we saw some people out in the picnic area with metal detectors....don't know if The Farm had hired them, but they were using those detector thingies to hunt for quarters! One of the men said on most \"expeditions\" they find rings dropped by guests. So be careful, people!", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 3, "date": "2010-12-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fezRz8fMPcvCFYuQu3XamA", "review_id": "t1s1lk10RMvvxehv0Qp_rA", "text": "Over priced sandwiches!!!\nTasteless Flank Steak Sandwich (nothing else) and a bottled coke $16\nSurrounding area with picnic tables was nice though.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 2, "date": "2013-12-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WCCFT9AXEAWrVTYSGD3RbA", "review_id": "AmVOzmDzdxCKNVVo9Yd0PA", "text": "Visited this place as it seemed like a unique experience... sadly it did not meet up to the hype. Location, Location, location is the only thing that is worth anything more than 3 stars. The food was nothing special and a little unflavored. Do not get the broccoli and cheddar soup... it is not cheesy at all. The soup has the consistency of boiled grains with yellow food coloring.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 3, "date": "2015-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HL7NUwyAVtOKHz5xhB5Qfg", "review_id": "-CSRhWj1OXMm9Myk2-kfGQ", "text": "One of the worst breakfast experiences that I have had.  Ordered 2 eggs sunny side up, hashbrowns and sausage. Complex order, I know, but none the less after 45 minutes our food still had not arrived.  Obviously our order had not been placed, my wife inquired as to the status of our order and informed the wait staff that we needed to leave soon please bring out the order. What occurred was a train of people with various excuses as to why 2 eggs have taken now an hour to be cooked and served.\nWe ended up having to take our order to go, what we received was two eggs that could only be described as extra well done and hard, burnt sausage and cold potatoes.\nWaffle House would have been a better choice than this IHOP.", "business_id": "lq2iZK7epi23byzcejjqTg", "stars": 1, "date": "2015-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "PShy2RYNadDUhJf4ErOJ7w", "review_id": "LBlZ3nfNYTqhEYzpMf5dSg", "text": "I minus one star because the place is always freakin sooooooooooo crowded!  Which pisses me off.\n\nNot sure if I'd eat here for any meal other than breakfast....\nBut I've only ever had breakfast here!\n\nTheir crab cake eggs benedict are soooooooooo good.  Mmmm.\n\nI love breakfast.", "business_id": "NX5YHSIyesufcsI7Rg5NLg", "stars": 4, "date": "2008-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mv57w-UBp5JdlivZ5O_asg", "review_id": "J8hotviyzNRTINZNlAFw5A", "text": "Visited early November.  Few tables so getting there on off-hours proved a wise choice.\n\nGREAT carne asada (street) tacos.  Must have eaten 8 of them.  Had the refried beans also which were tasty.  They give you like 4 choices of salsa in squeeze bottles for whatever your palette or mood which was great as I could combine a couple to get exactly what I wanted.\n\nService was fast but slow enough to know that they made my tacos after I ordered them.\n\nAs good as my favorite stand in Tijuana?  No but about the best I've had on this side of the border so far.", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 4, "date": "2010-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "loJkedgXjeguaAUbWBO4kg", "review_id": "jtTzumVfwnLJsRIdsgXu0Q", "text": "Great food, nice people and mediocre service. I enjoy this place often!", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 4, "date": "2012-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xl6PerjP9NNeB1eznBjCSA", "review_id": "DBKDXZpHO33gsdVs_HisaQ", "text": "I had the fish taco and rice....it's was fabulous and really fresh. Loved it.", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 5, "date": "2014-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xtnLQapwBakfMcY2iL7onw", "review_id": "jy0kkCSdubK4hY6EWCPYzA", "text": "Do it.  Order anything. It's all good. Reasonably priced. If you can handle hot, order the bombero suace. It's worth it.", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 5, "date": "2015-02-04", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "veTxWRC7AjI0ChuV0pvqkw", "review_id": "MEhkw43GlSQtrJLKX89ghA", "text": "Wow this place is amazing. i got the special that came with 2 eggs (i got them over medium) hash browns (capped & smothered meaning mushrooms and sausage gravy as a topping on the hash browns which was amazing) 2 slices of ham, 2 pieces of bacon, two slices of toast and a waffle of your choice.\n\nFirst of all this place is not called \"Waffle House\" for no reason, Absolutely the best Waffles here than i ever had anywhere else... and ive had waffles all over the damn place. Outstanding staff they were very nice and on top of things, if i ever come back to AZ i would come here first before stopping by at any other place.", "business_id": "0kZ4aYmqf5fzTt9Yvz8Kvw", "stars": 5, "date": "2012-02-24", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "6t1CDk7k7z1eJSCKOz0IEw", "review_id": "4S3sW22Uzo6OMs4hKBE3Hw", "text": "Pros: Good food, good price. I love that they offer healthy alternatives like egg whites, turkey sausage, turkey bacon, non fat yogurt with fruit and more. Fun to look around the random store but why would you buy anything there? \n\nCons: The wait is always forever to get in, tables are crammed together in 2 small rooms. No flavored creamer and drinks and food normally come out at the same time.", "business_id": "dGcVT0WGenhh8Np76ta6AA", "stars": 3, "date": "2014-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RGW8uwzFVCEqJUNZKJmx5g", "review_id": "Vbadl8GPiAnhCgKAj9SsMA", "text": "I'm giving this paradise bakery 2 stars, because 1 every time I go in there their staff is never friendly. And on top of that, today i placed a to go order and they gave me the wrong soup when I got home. I love paradise bakery but this location is terrible.", "business_id": "JJGkhOmfOFamPbCAaRKPPw", "stars": 2, "date": "2015-02-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "d4XZRP8e7RK-daNi6suclw", "review_id": "Y1s_t8SFusUPly1rpv9sJQ", "text": "well two stars it is. I bit my tongue wile checking out but let me tell you I was let down. First, I find a bug in my water. I ask for a refill cup all is well,  but I ordered a smoothie and that was also a disappointing use of 4 dollars. As we leave my server rabecca wants to know if I'd like some waters to go? We both know I would not like waters to go. I was a first timer here so I know my experience doesn't hold weight but I will not be back.", "business_id": "8aPTQeDYOMNEu907WfflCQ", "stars": 2, "date": "2014-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6O9JEjAbXojH8LjeL8G3fA", "review_id": "2mil6ZZA3eNxqUDg9jg7IQ", "text": "I have always had a good experience here. Staff, food, everything is nice and service is great.", "business_id": "dbh72sNyNeHUgJqQye9Vbg", "stars": 5, "date": "2013-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dRRm8PqVK2O2kevJ_HFTAA", "review_id": "frKa0cQS0Ny4g5Xynus3Fw", "text": "Christmas Eve meal with my oldest daughter. Got T-bone steak and eggs with red potatos.  Cooked perfectly and well seasoned. And they know how to cook a good over easy egg without wrecking it. Latisha was my server. She was decent. I was happy to find a place open during these hours.", "business_id": "2D7amHyeakOVlsSywblMkw", "stars": 4, "date": "2015-12-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "zCC6huLkNBEr3JUgQyxJbg", "review_id": "EARQJgTy4qXPCmdEasLJRw", "text": "I like coming to Mimi's because it is owned by Bob Evans, which we do not have here in the desert. The food is traditional comfort food and always good. The highlight for me is the carrot raisin bread. I never order dessert because the bread could quality own its own as a dessert.\n\nI ordered the meatloaf sandwich - it came sliced in half with a side of onion rings. I could only eat the one half. Nice portions. I noticed on the menu a drink called Pom Zero. That was new to me - pomegranate juice mixed with Sprite Zero. It could a nice spritzer - and I had about 6 of them. \n\nThe service was very good. Our waitress was always there to see if we wanted anything and the drinks kept flowing. At times I had half a glass and one in reserve. I also like the New Orleans deco and the feel of the restaurant. I didn't notice it on the menu this time, but in the past I ordered the grilled vegetable stack sandwich - that is incredible! If it's there, give it a shot!!", "business_id": "qLXxp0rpzT4kG9tT3wZwfA", "stars": 4, "date": "2010-02-06", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "N7lSh49zQ13sG3Jpa9E6cw", "review_id": "IstNYg-H6lwHM_NPxfPAtA", "text": "Crackers has been a long term staple for me, held over from my days as a Mesa resident. You just can't go wrong here. \n\nOffering breakfast and lunch, everything on the menu sounds delicious and everything i've had was even better. I'd love to be able to say that i've tried everything, but let's be real here- it's a big menu. \n\nCrackers offers an average of six different soup selections every day, with one or two daily specials. Same with dessert- daily selections may vary. Both are homemade- no boxes or cans here- and they taste like the best thing your mom ever made for you, only maybe a little better. (assuming your mother was a good cook) \n\nThe breakfast offerings are hearty and full of flavor, the lunch offerings run the gamut from light snack to full blown food coma material. Great stuff. \n\nLike Meredith said, the decor isn't anything special- it hasn't changed much in the 15 years or so since  I first ate here. I think they're going for homey country charm. It doesn't matter though- this isn't a place to go for ambiance, unless you're a reclusive Mormon housewife. \n\nCrackers has two other locations- one out in east Mesa and one in Tempe. I haven't been to either of those, but this one is definitely a winner.", "business_id": "2nzUx_M8Szyzsf4CszHasw", "stars": 5, "date": "2008-02-15", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "JGCAc1ELELm_P_-FlgX3hA", "review_id": "5Z6c_6nrScJqqliwVEte0Q", "text": "Ignore the fact that the interior design looks like it hasn't been updated in over a decade, this is my go-to breakfast joint. \n\nThe best way I've found to have breakfast here is to come with a partner or two, order a few plates (California Eggs Benny, Southwest Carnitas, and maybe some Cinnamon Swirl French Toast) and gorge yourself on a little bit of everything.\n\nI've been meaning to try some desserts, but after all that breakfast and a pot of coffee, I don't have the room!", "business_id": "2nzUx_M8Szyzsf4CszHasw", "stars": 4, "date": "2012-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "vXhQk4PL2boIpUV-k-CloQ", "review_id": "wkocTNWckdcbKsCtgqllfA", "text": "Thanks Yelp for helping me find this jewel of the desert... Took my daughter to breakfast here and it was great.  Service was prompt, and courteous, the restaurant is comfortable and well lit. She had french toast and the breakfast burrito, I had the eggs Benedict. She offered me a preference to my eggs, suggesting that medium would be normal on the poached egg. The reason we are at 4 stars and not five is that the eggs on my plate arrived with fully cooked yolk. The waitress was very accommodating after I pointed it out. She brought me a second plate shortly thereafter. It worked out well because we were planning on splitting the cinnamon french toast anyway. The second set of eggs Benedict the eggs were correct but the hollandaise was bland. I will try something else next round as this place has many items that temp me... One last note we were celibrating my daughters birthday, the server brought us a lovely brownie for her big day. Thank you for a great place to go and share some time with my \"baby\" girl.", "business_id": "2nzUx_M8Szyzsf4CszHasw", "stars": 4, "date": "2014-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M_zCYzsBuuhQTO3h8Per9g", "review_id": "rgvAHob1bjMZ0tO3qFB0MA", "text": "A dear friend has been craving eggs benedict for awhile, so I thought I'd take him to Cracker & Co., as he's never been.  Not only did he love the eggs benedict, but he swiftly became obsessed with the homemade hashbrowns.  I was personally wowed by our server Kim.  All of the special requests I made (which there were quite a few) were delivered perfectly and with a smile.  By far the best service I have received in an incredibly long time.  If you've never been, I highly recommend that you check it out and ask for Kim to serve you.  You simply can't go wrong!", "business_id": "2nzUx_M8Szyzsf4CszHasw", "stars": 5, "date": "2015-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uMgHExkJbFr1WsdZkckfEQ", "review_id": "w0dBueUk7_E_hgkM24z2SA", "text": "This place is the bomb!  It's the 2nd Cracker Barrel we have been to in 3 days. Unfortunately it's time to leave Arizona and go back California where Cracker Barrel won't do Buisness. I wonder why?.........", "business_id": "g5csdtYUt97hkexFMCVf-g", "stars": 5, "date": "2015-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "8dbRf1UsWp2ktXHZ6Zv06w", "review_id": "-GYM1F_XFcNMLIv6W9cBrQ", "text": "Had the day off work and my oldest daughter was at home too, thought to myself, man I haven't gone out with just her in a while, let's go get breakfast. Asked her if she was game and she said yea and that she wanted some comfort food, so off to Chase's Diner we went!\n\nOk I don't know what all the fuss is about, this is a diner, not a fine wining & dining , this is diner food.  I personally like Chase's, I have gone here quite a few times with my kids for dinner, and they have good burgers and home-style comfort food, just never had breakfast.\n\nSo I ordered the works skillet that had peppers, onions, ham, potatoes and came with English muffing, now that was some good food! It was perfect! \n\nMy daughter ordered the Volcano, which were 2 huge buttermilk biscuits smothered in sausage gravy with a side of hash browns, man did that look delish!!!! She loved every bit!!\n\nThis diner is a good place for a fast home style meal!  I will be back!\n\nOh yea they have this great breakfast deal too, 2 pancakes and choice of either sausage or bacon for 3.99!", "business_id": "kNnk3xy9eb4ym8nljQUGlA", "stars": 4, "date": "2012-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rO3WEI9L-_deUR9-JHuNQw", "review_id": "yR50u0QM-_O9yTmhvYHlhQ", "text": "I come here for one thing...\n\n\nThe grilled chicken chimichangas with the red sauce on the side so i can use it for dipping.  I cannot tell you what is all in it but the grilled chicken alone is fantastic. Do i love the price for all of this...I guess.  Its not a stellar deal or anything but its like a once a month or every other month thing for me.  I love that the place gives you chips and salsa before your meal but i usually like to wait for my actual meal so i am not absurdly full from stuffing my face before hand.  \nBelieve me Chimichangas are not good later on so you have to have an appetite on you for sure.\n\nHorchata is okay. Not my favorite either seems too watery in my opinion, I love it when horchata is more on the creamy slightly sweeter side rather than watery and kind of sweet.  One guy that works here knows my friend who is hooked to this place and got me started so when we walk through he already knows.  The girl who cannot do her makeup for the life of her on the other hand is a different story.", "business_id": "qgJZUKNVY-LbGKk6XEP3JA", "stars": 4, "date": "2012-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eVPXWq00dLpJEcRq4VlOag", "review_id": "ZVf29uEY1ct2MVkm23XAyw", "text": "Service was a bit slow, although I was seated quickly. Corn chowder was tasty but not very hot. Had the Cheddar  Broccoli Quiche. Filling was good, but the crust was really soggy, even the edges. Seemed like it could have been microwaved. Probably won't go back unless that is where others want to go.", "business_id": "-6Roo-EHgSdUa4rP3tWyRw", "stars": 2, "date": "2012-12-11", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "_4lqpCYCqOQzbB6xQGGhrQ", "review_id": "iWn7jgpz9f6OpONbFHAGTw", "text": "Damn this place is yummy.  I just moved to Glendale and was happy to see there's a location over there.  So I will be going there a lot.\n\nI've been tot his location twice with some friends and the service is incredible.  My girlfriend was a little hungover from the night before of a little partying and banana's are a great medicine for a hang over.  I called up Good Egg before we showed up to ask if they had fresh ones.. they did!!  We show up and I go in and they happily hand me one.  Aweee.. how awesome.\n\nIf you order their pancakes, keep in mind the size of these monsters.  You can get one, two or three.  Our friend's son can polish off the three stack like it's nothing.  I did two and barely finished it.  The food is delicious and the variety is huge. Omelets, pancakes, eggs, etc. \n\nThis place is great.", "business_id": "oSDf6BHiMlKGZdFFmIo6NQ", "stars": 5, "date": "2010-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t6qe0BXW0owmfvljlNZSWw", "review_id": "F-AKCYEr--6ZEcoFRxlq9g", "text": "This place is awesome. Affordable, tasty food.  Simple and clean country environment.", "business_id": "bEQjf7c-9qkNWgXvriSGZw", "stars": 5, "date": "2011-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "kom_byw9fPdVzw7Mw_C4HQ", "review_id": "euT-C8OjEmc6kvBX_BfyBg", "text": "Living near this place a long time ago and driving by I never stopped in.  After seeing more than positive reviews on Yelp here I decided to give it a try.\n\nHere's one thing that bothers me about non-chain places: Train your staff to have a favorite!  Whenever I go to a place I've never been I always ask 'what do you recommend?' -- the default of 'everything is good' is NOT an answer people!!!  Be confident in what your best dish is and I'm ordering it unquestioned.  There HAS to be something that defines your restaurant...if there isn't, then you are just like a chain.\n\nGiven that (I didn't get a recommendation), I went with my trusty judge of Chorizo (burrito with egg and refried beans).  It was plenty portion and just came as the burrito.  It was good.  Not great, but good. \n\nNo free chips like others have said.  This didn't really bother me as I'm trying to eat better and knew I'd be stuffing my face with a giant tortilla, pork fat and beans likely cooked in lard (which is a good thing, btw).\n\nThe salsa was ok.  Definitely could improve here in my opinon.  I think El Ricos in Queen Creek has better salsa.\n\nI  am agreeing with others on the price.  My *lunch* burrito was $8.99.  That's steep for a lunch single item.  Compared to Burrito Shack at nearly half that (and bigger burrito).  I don't think the taste -- which was good -- justified the cost.  My guess is that overhead is high in the complex.\n\nI'd love it if there prices were lower -- if even for lunch specials.\n\nPlace was clean, ample seating and staff was friendly.  I will return and try other things (and bring friends).\n\nThey are also on Twitter: http://twitter.com/lulustacoshop which scores an extra point in my book...hopefully they will push out lunch discount deals via Twitter and that will bring me back sooner.\n\nGood mexican, wish the price was just a bit lower.  \n\nHonestly I was going to rate 3 stars just now but really wanted 3.5.  I'm giving Lulus the benefit here and going with 4.  The food is good, prices could be better, but overall a good Mexican food experience and I will return...hopefully with a discount I got via Twitter (hint, hint).", "business_id": "CRvVvR6aE1eWVRtzQ0UC6g", "stars": 4, "date": "2010-02-15", "type": "review"}
