{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uiMTavYKLw9hxskV4xB2tg", "review_id": "JkxgE789YYH2VGwCFomgkA", "text": "Great mexican food and margaritas ... and in Pittsburgh of all places!  \n\nBig burritos which will really fill you up.", "business_id": "hhNlQWaKqGbMPoeZHoL-IQ", "stars": 5, "date": "2008-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "yfRrC6MhxpIJ4-xMcrmk5Q", "review_id": "vX6KYWHsNukl7UvWlwge3A", "text": "I've been to the taco stand now!  Yaaaaaaaaaaay!  On our way out of town for the holidays, we needed a quick snackie and made a stop at Reyna's for taco deliciousness.  We got four - two chicken, chorizo, carrnitas.  YUM.  They were so fun to eat - messy, sitting in our car, hot sauce dripping down our fingers - who doesn't love street food?  Seriously, this is the only place I've laid eyes on in Pittsburgh that appears to sell tacos of this kind.  I kind of want to go back....like, now.\n\nOH BUT WAIT.  Stop.  the churros.  On a whim, I ordered some churros real quick, and watched the guy pour the batter into hot oil right before my very eyes.  They floated around, browning and sizzling, then he took them out and put them directly into cinnamon sugar, into a paper plate thing, and then into my hands.  They were the best churros ever.  Love at first bite.  Love just watching them sizzle! \n\nI think I want to try empanadas next time if I can tear myself away from the tacos.", "business_id": "buVALudg30kgkDusqB3yJw", "stars": 4, "date": "2011-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PwgNaQDdr_FKRO14CRwotg", "review_id": "q1c2OTmBA7NfnWrXXvA7OA", "text": "The chicken fajitas were enough for two and served in a pineapple.  My friend's margarita poured 3 glasses and looked tasty.  Think I would come back here again, but will probably try some other places in the strip district first.", "business_id": "buVALudg30kgkDusqB3yJw", "stars": 3, "date": "2015-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RqpWbvynlpeuyk9_Dii6cg", "review_id": "G0TmINzg1szSsXfmMtt7LQ", "text": "Went for lunch with coworkers on 1-14-15, extremely slow service. Food was delicious, but within 30 minutes of eating I had regretted every bite. I've been sick for 2 days now and that delicious meal is to blame. I eat Mexican quite regular and know I'm not allergic to anything they have, this is a case of food poisoning people. It's not worth the $10 you'll spend on a meal to miss a day of work. On top of that, the waitress didn't give me the correct change after I paid. Needless to say, I am very disappointed.", "business_id": "CxGK5_GoIhG9798zYPsvfA", "stars": 1, "date": "2015-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "k4vo49Zb_4MZnj38B7x9jA", "review_id": "6lXIJBdvqaqvthbNGx6bjw", "text": "The best Tex-Mex in town, and I've had them all.  Local recipes, not a chain.  Great salsa/chips!   Steak anything is great, especially the Burrito Tequilla.  Spicy, but wonderful!", "business_id": "2kz1P9SlJNAndRkXk4bCDA", "stars": 5, "date": "2009-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "bPCi74MecZWAmhWCbvx-1Q", "review_id": "8rPgOQLXCI17tCURmHp40w", "text": "This is the second year I use them to Cater our end of year company event. [I've never actually ate at the restaurant] \n\nAbout the Catering:\nThey were awesome! so professional! they came to our job with everything ready to go, they set up and served all our employees. The food was great and had a lot left over, even though we ordered lunch portions. I also ordered a Flan, which was delish! I would definitely recommend them as caterers.", "business_id": "rg1-6A-8SKXGh_p-Abbyxg", "stars": 5, "date": "2013-12-31", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "_wedUyuU9TKAb3DSqF6-IA", "review_id": "c1Wyb4_h_X58lw-dCr5vRg", "text": "\"Regular por favor\" has become a phrase we here often after moving into the Wells Fargo 2 building.  Johnny Burrito definitely does it right in terms of customer service, burritos, and style.  How many restaurants can move a line of 30 in 10 minutes?  I also like the fact that \"You're the boss for the next 8 feet\".  This place is amazing.  More or less, you determine the amount of toppings on your burrito.  Even the salads are filling if you prefer a healthier meal.  Free refills until close.", "business_id": "iTjwgc3rHS5k3GptqIp2Uw", "stars": 4, "date": "2013-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RxD8XEw5do9-2ue0NBi9vw", "review_id": "JwRDatzmLZfJbZisC7oERw", "text": "Pretty good. Nice chips, good burrito. Haven't found any Wonderful mexican in Madison so far, but this is not bad.", "business_id": "S4TWo9X6b3gU6uucj4JN3g", "stars": 3, "date": "2009-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AYuf7Fopmel5twxCsOx6_w", "review_id": "fsiq5Xg3ytrOw84dbtASXw", "text": "This place has gone downhill. The staff is slow and the orders are rarely correct. They post hours til 4 am on weekends but are rarely open past 3. They say they open at 7 but I had to wait 15 minutes for them to turn the computers on. Just go further down east wash if you need a crappy taco fix. But if you get Tamara in the drive thru at night,  you're golden. That girl is awesome.", "business_id": "rgyvl8tNVAony634_9vFdQ", "stars": 1, "date": "2015-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E32KWBXRtIKwxVgh1kGGVA", "review_id": "BsXE3X8Bd55wnbtIhXgz-w", "text": "Only giving 2 stars because our waiter was a nice guy. Other than that, disgusting. We decided to go here because of the reviews.  A bunch of liars!  The menu was a sticky, confusing mess. I didn't think tea was an odd beverage. Nope, no tea. Hard taco? Nope, out of hard taco shells. Really?\nMy steak burrito seemed to be mixed with chicken. Only had to spit out one piece a rock hard substance. My husband had to quit eating because it was disgusting. You could not pay me to eat here.", "business_id": "cT9uP_Lr5bz6jhIqZPlLcw", "stars": 2, "date": "2015-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3VIRjR2V29TOaI9u64hMig", "review_id": "OXuRzZ2RB9RJjPRO3Tp7mQ", "text": "Had a nice dinner outside on the patio - it was really pretty. The margaritas were pretty good. The salsa and chips were also pretty tasty - it was nice to have some variety- these were no simple white corn chips; there were blue corn and even sweet potato chips mixed in. My fish tacos were awesome, I love spice and they certainly delivered. I would try it again and hopefully find another item on the menu that was just as good.", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 4, "date": "2010-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K7C-duTQBWpjdA1LA8G5NQ", "review_id": "VT7JweNJAtRaSbaCqcJy5Q", "text": "We didn't have a really good experience here, but I don't think it was the fault of the restaurant.  A little misunderstanding with the server on \"gluten free\" food, but otherwise food was good, relatively competitive with others.  Atmosphere wasn't really what we liked, but that is a matter of personal opinion.", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 3, "date": "2012-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Y-dppYjzqvBIgnzu5accng", "review_id": "a-TRpYru7KDzt35RSjzNFQ", "text": "What a great menu and patio... The commemorativo margarita is great...", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 5, "date": "2014-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TPS6bQ352YxbRWvFBLQ1fA", "review_id": "80eYbuhgqo8IXXzP-kRbCw", "text": "Great for a quick bite to eat. Very tasty and very easy on the wallet! Service was fantastic as well.", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 5, "date": "2015-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p8rErwXZjnyvvzSTQdXTXQ", "review_id": "yqBuZiZjTSwK_Bo5l7ca1A", "text": "Anyone that calls what they serve here chilaquiles has never had a decent plate of chilaquiles in their life.  I was really disappointed to say the least when I was served a plate of soaked tortilla chips in a pasty, canned-tomato sauce... My husband said his huevos rancheros were ok, but then again he'll eat anything.  The place was getting pretty full for lunch, so maybe other menu items were better Phoenix, AZ 85008than the sad and pathetic dish that I got.", "business_id": "BESmH-lmMm34_EefL8X9fQ", "stars": 1, "date": "2012-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yynKilkLQXd2zXnCTwI4Gg", "review_id": "jHeUVufLBIps6he2jguqTg", "text": "I have been coming here for 10 years for good quality Mexican food and that is what I get all of the time.. The service is great and the chips and salsa spicy and amazing. Def going back for more when I am craving homemade Mexican food the way my nana makes it!", "business_id": "BESmH-lmMm34_EefL8X9fQ", "stars": 4, "date": "2015-01-03", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "0Dngp-JFYvvXD4cy6plvbA", "review_id": "rEGI5ImV9Fs4epkyPkNVcw", "text": "A relatively new discovery, mmmmmmmmmmm! I thought it was like a Rubio's or something...it just never stood out to me. Neither did the Starbucks. No idea it was there for months and months even though I knew there was an Einstein's (Which I've never been to). Anyway, I went for the second time yesterday and got the Huevos Mexicanos burrito...best 1:30pm on a Saturday breakfast burrito I've had! It was about $4? They are $1.99 on weekday mornings. It was so messy and dripping with every salsa known to man that is offered at the salsa bar. It didn't taste like greasy chemicals à la any-berto's. The place is clean and cheap. The veggie burrito is really good too and everything comes with chips. The murals stretched on the walls make you feel like you're on vacation. And if I ever went on vacation, \nI would miss Chico's! \nMi amor! \nTry it! \nPor favor!", "business_id": "D09yG6Z3gcsh24Qn7Y4gYA", "stars": 4, "date": "2009-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "GrTuo86QyXkQszFDyijsQw", "review_id": "Je2N6-U3D9288b68A_FQdQ", "text": "Gross. I had a vegetarian burrito and to tell you the truth ive had better burritos at taco bell. I threw it away after 2 bites. Even the tortilla wasn't cooked all the way. My boyfriend had fish tacos and although edible we can make them better at home useing just the microwave.  It was horrible and I won't ever be back.", "business_id": "D09yG6Z3gcsh24Qn7Y4gYA", "stars": 1, "date": "2014-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0a-ISXPjsyyNAMZfDbrKpw", "review_id": "HK99I9FXX002umRPDLNXdg", "text": "Quick to be seated.  Good service.   Best food that I've had on this trip, but not so amazing that I have to come back.", "business_id": "-lOSaCuBRAvX5JBifx-EMw", "stars": 2, "date": "2011-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ovpa3S8xD96dLE5eDxcxJg", "review_id": "PMDe0UvbxF6X-kT0VpQ9TQ", "text": "A few months ago I would've given Baja Fresh five stars. No joke. I don't know if it's me getting older and more frail, but for some reason my body can't handle it as well as it used to be able to and I go into a food coma for a good 45 minutes to an hour after eating it nowadays. \n\nIf that doesn't slow you down, it actually has some of the more authentic tasting mexican food around. Cilantro dominates the smell of the entire restaurant, and they even have a wide selection of salsas of different varieties for all to sample. I am a fan of the burritos, but, then again, that's almost unfair. I'm a fan of just about every burrito I've ever had. \n\nThe chicken quesadillas are good but are heavy on the grease. Unless you have a stomach of steel (like I used to) go with the tacos or a burrito.", "business_id": "XI-_Y2XRw03mozGx0Z90Gw", "stars": 4, "date": "2007-02-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "AyPcoWLzYKbqgcldVRb3hQ", "review_id": "hJNQQYyBE9uPwpNUNh5wOQ", "text": "This is one of the best Mexican food restaurants in the city. The food is authentic and the carnitas is excellent!\nThe location isn't in the best part of town but it's well worth going because the food in amazing and priced great. \nIf you want good Mexican food with large portions this is the pace to go.", "business_id": "hWhVP-28LYP3llaMlAJ_JA", "stars": 5, "date": "2010-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Sua0pp630PjNP0KX-V7Sdw", "review_id": "XzZN1l39yy_SD4hF89rTUw", "text": "exceptional customer service!!!  The cashier was very patient and friendly as well ! great menudo!", "business_id": "hWhVP-28LYP3llaMlAJ_JA", "stars": 5, "date": "2014-02-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "5ZtKf5me7XNTCyZ-L33C9A", "review_id": "W_gJszx9PKiwMuIL5-uM7g", "text": "This place has been a favorite spot for my entire family for 27 years now. The family favorite dish here has always been the green corn tamales with super spicy jalapeño green chilies on top. Other favorites include the cheese enchiladas with green sauce, chicken and beef fajitas, soft tacos, beans and rice w/most dinner orders. Flan for desert. Freshly fried up chips and the spiciest salsa both red and green. If you're into very spicy mexican food, I highly recommend coming here. Truly a cornerstone of traditional PHX mexican food. Delicious!", "business_id": "hWhVP-28LYP3llaMlAJ_JA", "stars": 5, "date": "2015-01-25", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "_ei7Bs7tciprz4im-_0kxg", "review_id": "_X1nFuqq88mY98rdBKUEVg", "text": "Imagine a Filliberto's sized menu selection, even larger, without the searing stomach pains post-meal. Throw in authentic southwestern Mexican dishes served quickly and a great bakery with a huge variety of fresh Mexican sweets and this place deserved five stars hands down. The menu selection is huge and won't break the bank.\n\nMy favorite items are the tamales (pork)with the green sauce, gorditas (gf's favorite), nopales (that's cactus and any self respecting southwestern Mexican restaurant will serve these) and the Mexican sweet breads (not brains, yuck). The food comes fast and my orders have always been right. There is a salsa bar that's always stocked. It's a dine in or take out establishment with no servers. There is also a small butcher, or carneceria, inside for finding cuts of meat for making fajitas or other tastey things at home.\n\nNot a date place but perfect if you're looking for something with a couple of friends that will fill you up and not break the bank. It's on 12th Street and Van Buren so be aware of the area. I've lived in Central or South Phoenix my whole life so I'm used to it (aka my hood). It's open for bf, lunch & dinner. I've only had the latter two but they were muy yummy. \n\nOh and also I've seen that Super Burrito and it would feed a small village ... seriously. Also, even if you're taking it to go, wander over to the dining side while you're waiting the murals on the wall are funny.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2009-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ys187ij5Y9eeg5vxdZFLWA", "review_id": "gegtcJjpd7lKQmbuelQt5A", "text": "My favorite food is Mexican and this place offers some of the finest I've tasted. I came with my family and we're all from out of state. You'll find a lot of choices here and if you don't speak Spanish, you might get a little lost. However, the sights, smells and staff are fantastic. I ordered the super nachos to share. The meat was succulent and delicious, the guacamole was some of the best I've tasted and there wasn't anything skimpy about any of the condiments on the plate. The chips, too, were crisp, salted to perfection and fresh. I only wished I had more room in my tummy for all of it. I also ordered the Milaneso, not realizing it was a sandwich. I wish I had known that because I would have asked for it without the bread. But, it was a delicious cut of breaded beef with melted cheese and loads of iceberg lettuce. My mother ordered the shrimp fajitas and they were scrumptious. I would go there again any day and probably would be there regularly if I lived in the area.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 4, "date": "2013-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w4aiSe6rTnYsY85km3BJHA", "review_id": "GeJ87nuN_MP93QUThNYl1w", "text": "I love this place for its food court.  I love the variety of fresh fruit juices, the cheap and tasty tacos, and the bag of fresh tortillas!  Only near southwest, you can get tasty mexican food at a supermarket and the prices are really hard to beat... sigh.", "business_id": "VXIkI9_EbDbYHeO9IzKjJg", "stars": 4, "date": "2009-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ifdsEPdqr-ejzNa8T4S-RQ", "review_id": "LSBFmZlab3WevaMKjlYmNg", "text": "So tonight my husband wanted street tacos.  So we went to try out the food court at the ranch market.   Best street tacos ever!   We tried the five taco plate, we had tripa & lengua.  Why mess around with people \"trying\" to make street tacos when you can come here and get fresh,  delicious tacos at a great price.", "business_id": "VXIkI9_EbDbYHeO9IzKjJg", "stars": 5, "date": "2015-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_3uLzA-PqsfZWMfKawwF3Q", "review_id": "EOY6i8ZQskHWxatssbVCCA", "text": "This is a hidden gem off 7th Street just North of Roosevelt. Ordered to go from them, and I will definitely be back. I had the machaca burrito, and it was superb. It had egg and jalapenos, which made for a most-delicious meal. The reason it didn't receive 5 stars is that my wife had the carne asada burrito, and it was just good. Not outstanding. As well, their red salsa, which we received a big to go cup of, tasted a little like pizza sauce. It wasn't very good to us as at all. The guacamole was also good. Lastly, we ordered rice and beans, but arrived at home to find there were none in the bags. I didn't get a receipt, so I don't know if we paid for them or not, but it was okay, because the chips (delicious) and guacamole with the burritos was plenty of food. The place itself is small, but nice, and I love the murals painted on the outside. As I said, I'll definitely be back, if only just for the machaca burrito. Happy eating!", "business_id": "cgNIBHS2mLdbTRiodAT6EQ", "stars": 4, "date": "2014-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M6oU3OBf_E6gqlfkLGlStQ", "review_id": "TOH49jMW0wAcb1iWQ4vGKA", "text": "Their food is so good they need metal bars to protect it. Seriously the order and pick up windows are behind bars, but it may be due to the neighborhood.\n\nThis is a place the Yelp is good for. There is no way you will find this driving by as its off the main road and has no sign on the outside. The only indication was the line of people going out the door.  \n\nSeating is limited to some dilapidated picnic tables on the adjacent patio. \n\nThe menu board is quite simple only listing burritos and chimi changas and tostadas, apparently there are some off menu options that are not posted.\n\nI ordered the a bean chimi changa, It was a bean burrito deep fried and then dolloped with guacamole and sour cream there was cheese sprinkled on top of this. It was served on a small bed of shredded lettuce in a white container.\n\nThe Beans are flavorful and runny like a bean dip, the fried tortilla was great a it should be, the guacamole was a neon green fake variety and the sour cream was cold and firm . \n\nThere were down sides, the price was a bit steep considering the location, potion size and lack of seating. They ration the hot sauce and charge $.15 for a thimble or $.50 for a small cup.  Drink are cans of soda only. And the line was long and poorly structured. this is why it only gets 3 stars, the food is good but the drawbacks hurt it. \n\nAlso Note CASH ONLY", "business_id": "Xo9Im4LmIhQrzJcO4R3ZbA", "stars": 3, "date": "2010-02-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "btLssxZq0qOFKKBbYP8L6w", "review_id": "Mx9JZ-QaeJh5eToOOnneSQ", "text": "Well.  WOW.  I honestly can't believe how good this place is.  I have been a long-time fan of Carolina's so I feel bad for saying this, but Rito's beats it hands down.  I went for the Green Chile Burrito Enchilada Style (I meant to specify green sauce but I didn't so it came with red) and it was amazing.  I can't wait to try it again with the green sauce.  My friend ordered two shredded beef tacos...and wow.  You can't go wrong here.", "business_id": "Xo9Im4LmIhQrzJcO4R3ZbA", "stars": 5, "date": "2013-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2Yc8jyDLnyv_yhGEor3Maw", "review_id": "_G0r-dvLSY-blhhBDrHVXw", "text": "This place was delicious...I got a green chili burrito enchilada style with rice and beans...The chili was homemade and not from a can...One of the BEST burrito's I have had in a very long time...Will definitely go back.", "business_id": "Xo9Im4LmIhQrzJcO4R3ZbA", "stars": 5, "date": "2015-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pI6PxvGyrqrHGO6KFl63bQ", "review_id": "QCRjep5-AWTSYsOewKGAhg", "text": "This is the kind of place I want to go back again and again. There are so many amazing things on the menu. Fish of all kinds, prepared in all sorts of traditions. Shrimps, etc.. And Modello Negro on TAP. yeah man. And the people were really friendly - clearly a family run place. LOVE IT.", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2012-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fwkidAyUXAHyXWtMxH0Wnw", "review_id": "NVahEGr4BXQ6b4moxJqUcg", "text": "Went once with my GF and have been back 3 times since! I always get the whole fish plate its sooo good.  I really like the mincheladas also. mmmmm.", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2013-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dBvjLwFTI9VQCO_2uoKq4A", "review_id": "Ew9IhUKYirTr1SJ3h6IRMA", "text": "Clean... Fresh.... Friendly.... Delicious. Hey yelpers get here and devour til your hearts content. Awesome!", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2015-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "--65q1FpAL_UQtVZ2PTGew", "review_id": "PhfbG0vptQ0SQmIl_e5fQw", "text": "I have to agree with Dan in saying that the staff didn't seem too excited to be here on the weekend. I came in on a Saturday for a quick lunch before running errands and I was pretty excited after the rave reviews that I read. Unfortunately, as soon as I was seated and started munching on the chips, I was disappointed. They were bland and a bit cold. I didn't let that totally bash my excitement though; I just salted them a little and enjoyed. The salsas were interesting; they were very fresh tasting, but lacked any sort of explosive flavor that I was expecting (The red is much better than the green). With the bland chips, it wasn't much of a pairing, but with the salted chips, I was pleased. \n\nFor lunch I ordered an al pastor burrito and a barbacoa sope. The burrito was awesome! I actually really liked that it wasn't huge. What it lacked in size, it made up for in flavor. The barbacoa on the other hand, wasn't as good. On the menu it says that barbacoa is only served on Saturday and Sunday. This is apparently because El Napolito's barbacoa is made with lamb. I've had plenty of barbacoa before and I was expecting to be blown away...especially after having some great al pastor, but I wasn't. The meat was really gamy, like really gamy. Salsa and a little salt were needed to make my sope enjoyable, and that was a shame.\n\nI would return to El Napolito, but there are loads of great little Mexican places in the area that I'll be stopping by first.", "business_id": "s87D-mtAuJ8BluKgYYsXGw", "stars": 3, "date": "2011-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 1}, "user_id": "33vUIil_GCaT92aUaZhRXA", "review_id": "U8i_GmL0MPikV7so2sZMjA", "text": "I had to downgrade my rating after last night's delivery. I received a free delivery coupon from Delicious Deliveries so we used it for dinner. There weren't a lot of options in my zip code so we settled on Macayo's. \n\nWe started out with the green corn tamale bites. I didn't care for them but my hubby seemed to enjoy them. They also gave us a big bag of chips with sides of salsa, pretty good as I stated in my previous review. For our entrees, my hubby ordered the steak fajitas & I ordered the carne asada burrito (with rice & beans added). Hubby said his fajitas were pretty good but my burro was gross. The bottom was so soggy I couldn't eat it as a whole, just picked at it & threw a lot away. For dessert I ordered the flan & since our order was over $30 we got a free dessert as well so I chose the mini chocolate chimis. The flan was ok & the chocolate chimis with ice cream were pretty good. \n\nTotal with tip & free delivery was about $50. We won't be ordering here again...I'm pretty much just done with the whole food delivery service thing after 2 expensive, not so great meals.", "business_id": "jzPMl-NoB5F2fwoHX3hN8A", "stars": 2, "date": "2011-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Wyr_WsWFqp9X3Y14tBSGJA", "review_id": "hXcDvuuV95wCaFzn37hjjw", "text": "Well this place has to be doing something right my understanding this is where the President of the United States ate while he was in town very cool my experience has been really great with this restaurant I love the atmosphere and there so many places to sit as far as tables and the atmosphere is very festive the food was good and the service was quick when you consider how many people they are serving they do a good job the margaritas were very good I would definitely recommend recommend them", "business_id": "jzPMl-NoB5F2fwoHX3hN8A", "stars": 5, "date": "2015-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "a4LJJU26cSE7k12-0sEw0Q", "review_id": "GZstqG2VWTlY-1eszCrGPQ", "text": "I love the salsa; plenty of garlic and no green chilies. I pick up to-go containers all the time, and it  gets hotter and tastier the longer is sits in the fridge. \n\nThis is the kind of Mexican place where everything is fried. There's no windows, so if you go at a peak time, you're going to smell when you leave. It is dive-ish, but it's family run and they are really nice folks. \n\nEverything is good, especially the albondigas soup. Get a combo with whatever you want, as the rice and beans are top-notch.", "business_id": "DeAnVirgOxQnI36V1W158A", "stars": 4, "date": "2010-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KA-kazgKKlyrx4fwx4P0Ng", "review_id": "2xlOfpnL4tWLqd0QB983BQ", "text": "Good food but not 4 stars, I got #4 combo plate -- taxi is good, way too much breaking around enchilada Abd pretty bland beans and rice. Cold chips and commercial salsa...", "business_id": "DeAnVirgOxQnI36V1W158A", "stars": 2, "date": "2015-01-30", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "y76b3SuhzkXUzyvQbZEEBw", "review_id": "loUabBSKGsGedWPkgetxsA", "text": "I read plenty of bad reviews and I totally disagree.  I absolutely loved this place.  And I've been looking for a good Mexican restaurant for quite a while...!  Excellent food and excellent service!", "business_id": "VlG9qxAc4d0em2djaU__xw", "stars": 5, "date": "2014-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iwZ_7QuZ1tzT6pIZmOlDQg", "review_id": "-hjiOP0B3_z-GoI4rZ1KEg", "text": "I'm going solid 4 stars, but with a caveat....:)\n\nThe chips were hot and crispy - 4.5 stars.\nThe \"hot\"salsa was nicely done - 4.5 stars.\nThe \"green\" salsa was one of the best I've had - 5 stars.\n\nThe show-buster which gets 6 stars is the \"Spicy Chicken Soup.\"  I read the review of this soup in the New Times 2007 \"Best Of...\" and have to agree that it's one of the better chicken soups around .\n\nPerfectly salted (meaning not overly salty) and with the right amount of pepper.  Nice big chunks of obviously 100% \"REAL\" chicken breast (no fillers, nothing fake about it ) and zucchini and whole baby carrots.  Sprinkled with a touch of corn and rice and small slivers of onion.\n\nVery tasty combo of flavors. Hits the spot on a cold 50 degree day.\n\nThe caveat?\n\nMy other friend had the lunch combo with a taco and a cheese enchilada, refried beans and rice.  Absolutely nothing special or very tasty about any of the stuff on his plate.  Bland.  Boring.  Cheap-looking and cheap-tasting.\n\nSo if you are in the mood for some good, decently flavored chicken soup, and some above-average chips and salsa, give it a try.\n\nIf you're gonna order a combo meal, I'd say take your business elsewhere.", "business_id": "0K35eGvzVRZEirNo5v_WfA", "stars": 4, "date": "2011-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-9G7cH_cBwwgcJFLrSynRA", "review_id": "c33PQ7I7JGJliP1ei0twog", "text": "I have been coming to this restaurant for years, I like just about all of their food. I usually order Cheese enchiladas, and shredded beef tacos. Their cheese enchiladas are good but can be somewhat inconsistent. Sometimes not cooked enough, sometimes with not enough sauce, and even though they are supposed to have onions in them they rarely ever do. \n\nTheir shredded beef tacos are very good but they seem to have gotten shredded beef and machaca tacos mixed up. At most restaurants a machaca taco is very finely shredded spiced beef, and shredded beef tacos are coarsely shredded beef. Here if you order a machaca taco you get a course shredded beef in a preformed taco shell, and if you order shredded beef you get machaca in a properly deep fried taco shell. Whatever, I just order accordingly. \n\nRed chile burros are very good. Cheese crisps are sometimes burned on the bottom. Chips are often very fresh and hot, but their hot sauce has WAY too much oregano in it. it's been consistent over the years but WAY WAY TOO MUCH oregano!\n\nThey make a MEAN Cadillac Margarita on the rocks.\n\nMy wife likes their seafood enchiladas, I can't vouch for them as I don't like seafood that much. \n\nOne note for this and other Mexican restaurants. Why are people charged more when you order something with out rice and beans? Most of the time the amount of food minus the rice and beans is way more than enough. I can't tell you how many times I see plates with rice and beans left on them. They just get thrown away.", "business_id": "0K35eGvzVRZEirNo5v_WfA", "stars": 4, "date": "2015-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bmzq_nkjYqp8aWn12RJdhA", "review_id": "fSzfiWQQAYViJP9G1sWoqQ", "text": "At lunch time in this area, parking sucks. Staff are friendly. Food is nice and spicy. Tastes really good though, so I get heartburn later. Prices are average for a sit down meal.", "business_id": "ib-y5nsfn3unE0lLY1vfAw", "stars": 4, "date": "2010-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zCnSshZN3-96iXHFaowwKg", "review_id": "bxMSO8rszOfuzNMT-9ZDgA", "text": "Overall, it's a pretty nice place. The food is nice. The atmosphere is nice and makes me smile. The staff are very nice... BUT, what really puts them over the top and makes me give them 5 stars is their lunch special. You get food for like two big meals for the price of half a meal during that time. Also, they're very generous with hot and mild salsa and bean dip with your chips while you wait for your food. You can even time it up to where you are there for the lunch special AND happy hour (coinciding between 3 and 4 I believe). I've gotten lunch, a margharita, and left generous tips for almost less than $10 all total and was more than satisfied. Always a good experience when I go there for the lunch special.", "business_id": "ib-y5nsfn3unE0lLY1vfAw", "stars": 5, "date": "2015-02-22", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "EKwGhgLrM18ErVKKeYE2UA", "review_id": "2b17oYvUXO6xOeX_GrNw4Q", "text": "Great place for Happy Hour! The downstairs bar is very dim and the ambiance with the copper bar and fireplace is so cozy. It gets a little warm if you are sitting at the bar across from the fireplace, but this is also probably the brightest spot in the room so you can actually read the menu.  :p \n\nI had the house Chardonnay and bf had the house cab for $5. We tried the tenderloin toasts, beef skewers, carne tacos, and bacon wrapped scallops and they were all good. I enjoyed a couple of the dipping sauces that came with the scallops and skewers (the same 4 sauces came with both) and the 5 different toppings on the small tacos. \n\nWe were stuffed when we left. We will definitely be back.", "business_id": "5kRug3bEienrpovtPRVVwg", "stars": 4, "date": "2009-02-25", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "oMDSmhe72hjxoR3EAj6sXQ", "review_id": "6Ukvj5ReSmbMoVshJzA7Ww", "text": "I have been to Rokerij three times. The first was for a work related lunch - I enjoyed the small plate selection and was impressed by the ambiance. \n\nI enjoyed it enough to take my BF back there for a romantic dinner. It took us a while to actually make it there because they wouldn't take reservations for less than a party of 4 - so we ended up going for an early dinner. It was delicious and the service was great. \n\nBF enjoyed it enough that when I inquired as to what how he would like to celebrate his thirtieth birthday he selected Rokerij. \n\nThis is where disappointment sets in. I hate to be tough on the place but . . . the food was good, the ambiance good - but. . . \n\nI made reservations for 4 two weeks ahead of time for seven pm on a Saturday. We arrived right on time - the hostess alerted me that they were a little behind but would seat us soon. So we took our group to the bar downstairs for a round of drinks. It took them thirty to forty minutes to seat us. But we tried to be understanding (despite the fact that the second couple was paying a babysitter 10 dollars an hour . . . ) \n\nWe were sat - generally enjoyed our meal. But the service was lacking - for this level of restaurant you expect exceptional service - and frankly this caliber of food can be found elsewhere with good service and more reasonable prices. \n\nWe finished our meal (which was decent) we paid our check while we finished our dessert and drinks - but decided we would like to continue our conversation. We flagged down the waiter - who upon us requesting a round of drinks said \"my dad is getting pissed - so if you could sit at the bar . . . \" Our thoughts - so you took an extra forty minutes to seat us - when we had a reservation and now you want us to leave your table and you couldn't come up with a more tactful method of asking us to leave (note - it was 9:30/9:45 at this time, we had been at the table for about two hours, had a full meal (drinks, appetizers, entrees, dessert, second drinks - which equates to a full check and a hefty tip). Now I don't know who our waiters dad is . . . possibly the owner. But the professionalism at Rokerij was seriously lacking. \n\nI don't know whether we will return. But we have concluded: (1) Rokerij does offer good food - but they are slightly over priced for the quality (2) the professionalism was seriously lacking in service (presentation of the wine list focused on the price and not the taste pallets), and (3) they should get their ego in check - I get that you have a long list of people waiting for tables at your restaurant - but the next time I have a special event I will be going to one of the dozens of restaurants in the valley and receive the level of service that should come with the ambiance and food.", "business_id": "5kRug3bEienrpovtPRVVwg", "stars": 3, "date": "2011-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "nSkdplyJyYT_ZI9pezHzfA", "review_id": "9g3NQLG9E3HAgv-UKpDJgg", "text": "3 1/2 stars (but I'll round up).\n\nIt's good, but not particularly outstanding.\nI love New Mexican (as in the state) food and understand the addition of broader American and Mexican options in the menu... but found myself wishing they had stuck with a single theme, and done it well.\n\nThe sauces (for enchilada, chile relleno) were wonderfully flavored.  I was not impressed with the ceviche (probably because I was not anticipating a tomato based marinade).  Wine list was good.  \n\nIt's an accessible menu.  I think I was hoping for more niche-cuisine.", "business_id": "5kRug3bEienrpovtPRVVwg", "stars": 4, "date": "2012-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "JfMs-RXpDmprwVIx-ZU_4Q", "review_id": "yMJb0ejkAWMTXli3jRe29g", "text": "I have to say I agree with a couple of the other reviews.  I SO want to like this place - the atmosphere is amazing, but the food and service will keep me away.\n\nWent there once again the other day and sat at the bar as it was still early enough to get a seat.  Waited about 10 minutes for someone to take our drink order - not a huge deal as we were there to relax and in no hurry - but at Hillstone someone would have taken our drink order in 1 minute. \n\nCould just be me, the music was too loud and too catering to a 20 something crowd.  Doesn't fit the cool vibe of the space and sounds like the bartender or dishwasher selected the music.\n\nOrdered 3 small plates.  Calamari was cold.  Shrimp dish with toast was best and toast with mushrooms could be SO much better.  Overall, below average.  Ordered desert - chocolate torte - which was impossible to eat as it felt like it just came out of the freezer.  It needed one hour of defrost time.  To his credit, our server took that off our bill (without our asking, so good job there).\n\nOverall, atmosphere is great.  But, that's it.", "business_id": "5kRug3bEienrpovtPRVVwg", "stars": 2, "date": "2013-02-21", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "gzJpPaHN-NXBkAZcZri3hw", "review_id": "aaNTJTHxzTI1TJotFnvIKg", "text": "Amazing atmosphere, food and drink. Rokerij is one of those special places in Phoenix to bring friends and family to impress. \n\nEscorted thru the kitchen and then down the stairs (by my very excited host) I wasn't sure what to expect. Greeted by warm candlelight I was surprised. Even though it was incredibly late on a Tuesday the bar was full. A server enthusiastically reassured us the kitchen was open, and that yes, we'd be able to order oysters to our hearts content.\n\nAnd boy did we. Regular raw oysters. Meatball oysters. More regular oysters. And then we had, quite possibly, the best sliders in the world. Three prime rib sliders served with creamy horse radish sauce and au jus. You haven't lived until these have crossed your lips.\n\nThe service is incredible here. Sitting at the bar is wonderful. Sitting in a booth would offer privacy. The fireplace is perfect when Phoenix has a touch of chill in the air. This is a stunning place to come for a date.", "business_id": "5kRug3bEienrpovtPRVVwg", "stars": 5, "date": "2014-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pDSMS-IW5wyZK0XBi4jnDw", "review_id": "hKDLiQDVROjfDLZUAmcqbA", "text": "Great new building and this one didn't get swallowed up by that Julioberto's crap that's infecting several Filiberto's locations.  Consistent food that you definitely need to be in the mood for.  Chips and salsa in the dining room now, and no more bad seating.  Good show.", "business_id": "WzhHlaEyaHE4KIFfcqC_9g", "stars": 4, "date": "2011-01-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "WEBOUozznIdu0hJHcXDyLA", "review_id": "gulIG3legYBKSx8lSFNYvA", "text": "Manuel's is consistent. Service is fast and friendly. Chips are warm and salsa is satisfying. When I worked closer, I'd come regularly for work lunch. We would time them bc food came out so quickly. Record time from server walking away with our order to returning with our food was 4min 53sec! Food is nothing that will wow you but if you're looking for a filling, mediocre Mexican meal (which I often am), Manuel's is a must. \n\nAlso, they just finished their remodel. Bigger bar and brighter atmosphere.", "business_id": "69t2S1u7Rf6qM_c14b42xQ", "stars": 4, "date": "2014-12-22", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "W_R-gVF8OHNrIhtmyhDnyg", "review_id": "yRpy_OA0x9aPYUmjjFvq6w", "text": "Had the Ancho Shrimp Burrito today with chips and drink for  $8.99 which is not to bad.\n\nLittle skimpy on the chips and the burrito was not bad. Could say it is white man's mexican food but not bad for fast food. The tortilla is not of the home made authentic soft type but it is a chain.\n\nThe burrito looked better on the advertisement than in reality. Had a few shrimp but was expecting a few more.\n\nHard not to compare to the more authentic mexican restaurants because we live in Arizona but maybe not fair.\n\nWill probably be back but if I want a more authentic mexican food experience I will eat at my go to places but considering time and location it is what it is.", "business_id": "edjCywtqffQ8__vM7POZbw", "stars": 3, "date": "2015-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9dx-Atgssn3g71cOVVhuNA", "review_id": "Gp3ug5xz-O54IkzFgmnw9A", "text": "I walked in a few months ago to this location and found that service was HORRIBLE. The high schooler behind the counter was rude and very condescending when we asked if she could change gloves for a vegan. We had the employee then roll her eyes and then take a drive through order instead completely ignoring us. Don't come to this location if you are a vegan\\vegetarian", "business_id": "K2_Hmmo5crTYWiT_1sWnfQ", "stars": 1, "date": "2015-01-14", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "rLL7YKSJRyj9cVhiM_Y5pw", "review_id": "kDNFmVDz2OAkOxuRQzaD9w", "text": "i don't know what to say their double chicken bowl deal is delicious! you get a lot of food here for your money i think plus the salsa bar is pretty dang good itself!!!.", "business_id": "TBTaMIaeDw5B79hXDZBtrA", "stars": 4, "date": "2012-12-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zGf3b2LzadjNBTDDQ8hx6Q", "review_id": "pNOL9Hz_9ncecm_EfZhWVQ", "text": "this is the worst service I have ever experienced in my entire life. I get to the restaurant for the first time this week. When I walked inside the owner just got done helping someone he knew by name. My eye caught the special for the day. Never been there before I asked the guy about the special and what it consisted of. no in any way interested and irritated with my questions he finally halfa**ed my order. Right after while I am in the end of my order, this guy decides to seat others  without finishing me. so 2 minutes pass and I finally said \"do you want me to pay or sit down?\" He replies saying \"you will pay with I tell you to.\" By this time I am infuriated by the remark and the treatment I been receiving. He decides to come back 3 minutes later giving me a price for $14 when the special was only $6. Knowing well what I was trying to order I told him to make my order how I wanted it. Long story short he tries to walk me out, and cussed me out along the way. I HAVE NEVER BEEN TREATED LIKE THAT BEFORE IN MY LIFE.  I will never go there again and wont recommend anyone.", "business_id": "uevPN8zwJpBpnxRur1jUhw", "stars": 1, "date": "2012-12-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "I_Y47QFSdnZwZuN6IygWwQ", "review_id": "O8nRo9YU-fuayRalxI_wFQ", "text": "First time here, and it was pretty good!  I had the chimi plate and it was hot and tasty and cooked right.  The salsa is really good too, and the chips were warm and fresh.  Will go back!", "business_id": "ieYiA4L5gk7S3kZYK0l_dg", "stars": 3, "date": "2012-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ovpa3S8xD96dLE5eDxcxJg", "review_id": "77KWnXcKbdPkFQRHCSUVSQ", "text": "This was a tough call for me. I could have just as easily and with valid reason given it three stars or, for completely different reasons, five stars. So I decided to hedge my bets and go with four.\n\nHere's why: the food is average at best, but the ambiance is outstanding and the happy hour is superb. \n\nIn terms of straight up Mexican cuisine, this place doesn't even approach what some other nearby spots have to offer. But, their indoor/outdoor patios are always a good time, they have great live music, and a happy hour with free munchies to boot. \n\nCherry on top: their chips are awesome. They cook them in house and bring them out for free with your drink order.", "business_id": "G9LwkTSdKOyOGqd5BbuIkA", "stars": 4, "date": "2007-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9VBrPQxkQTsQBAcjYM8FIA", "review_id": "qxdg-d8eRuDNhYRsl7fShg", "text": "Best tortilla chips I have had even if the salsa is half ass. The entrees are also above average and the ambiance really does give you that Mexican cantina feel.", "business_id": "G9LwkTSdKOyOGqd5BbuIkA", "stars": 4, "date": "2011-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z4xZrZi_AMtOR6I24dPrHQ", "review_id": "KOuxnME0c8c9qpKBGvuxaQ", "text": "I had a business lunch here recently and we had a wonderful time. The portions here are pretty big so we were both fine with ordering one item each a la carte. She had a tostada; I had a bean burrito. It was just the right amount. And their chips are delicious. It was quiet enough that we could have a conversation at normal volume and the staff was friendly and attentive without being over bearing.", "business_id": "G9LwkTSdKOyOGqd5BbuIkA", "stars": 4, "date": "2014-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Y2NdfZuxgyz2ocQfKb3UDA", "review_id": "8si1raX2f_9ZH6KZojryKg", "text": "Marie, our amazing and professional bartender/server was friendly and helpful when deciding on food and drinks! The service was fast and friendly and the food was delicious! Come get your ice cold beers and amazing Street tacos here!", "business_id": "G9LwkTSdKOyOGqd5BbuIkA", "stars": 5, "date": "2015-02-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "OAWop7e3tUzl-kt3-OwPIQ", "review_id": "wxP2fRFelAzic8igTeQL2w", "text": "I stopped by here on Saturday during the day to scope out the menu. Was 100% empty at 3:30. I sampled (yeah that's right.. i cheated! hardly ever happens) one of their tortillas and was hooked. Small kitchen in the back staffed by some nice Mexican ladies.. Smelled great.. total dive type place. It had success written all over it.\n\nThree of us pull up at 7pm ready to stuff our faces. The parking lot is packed which has to be a good sign. Walk in and are confused. Do we ordered at the window? Sit down and wait? wait to be seated? After about 5 minutes I flag a lady down and ask. She asked if it was take away, I let her know if was to stay she told us to take a seat and she would be with us shortly.\n\nAfter viewing the reviews/pictures the first thing I ordered were the chips and a cheese crisp with guacamole. The chips and salsa and water hit our table right away and the CC zoomed out less than 5 minutes later. Sadly this is where the speediness stopped :(\n\nAnytime we needed something after that point we had to flag someone down and ask.. sometimes twice. Its not that they were lazy its that their were only two of them serving a really busy restaurant. This is no fault of theirs but a fault of management. Staff your establishments accordingly! A Saturday night rush cannot possibly be \"news\" to this place. It was obvious this was the norm.\n\nWith empty drinks/chips we watched and waited as food slowly trickled from the kitchen. 45 minutes and our food finally showed up. It was fresh so we had not been forgotten about. They were THAT busy for the size of the kitchen. Another ding for the restaurant management.\n\nannnyywayys.. I believe I can separate my feelings on management/service/food so onto the food :)\n\nchips hot/mild salsa:\nSuper tasty! The chips had a very pleasant corn flavor, fresh, and far from greasy. On first glance I was sure I was going to hate the regular salsa. I'm one of those weirdo's that likes tomatoes everyway but fresh and it was loaded. I tasted it and prepared for the cringe.. NONE! it was really good. Not sure what they did to remove whatever it is about the fresh tomatoes i hate but they did it. The \"hot\" sauce in the bottle was also very good, standard chili, garlic, Mexican oregano that you find at most places. All three of them were addictive and I was almost happy we never requested a refill.\n\ncheese crisp:\nDelicious Tortilla (check), Super Sexy Cheese Blend (Check), Crispy (Check), Foldability (MASSIVE FAIL). DOH! If you read my review on la piñata you will see me talk about this. This happens when you try and slightly fold and overly crispy cheese crisp to maximize guac/salsa capacity. Snap! you try and recover SNAP! Now your hands are covered with grease and salsa and you have this crazy folded discombobulated mess on your plate(see attached picture.) I have to believe you all know what I'm talking about. Still tasty.\n\nguacamole:\nThey at least have the \"avocado is the star\" aspect of this down but it was lackluster. There are some supporting ingredients that really help bring out the creaminess/fat flavor of the avocado. It lacked citrus, salt, flavor in general. At least it wasn't 3/4 tomato :)\n\nshredded beef taco:\nIt was decent but nothing amazing. They weren't stuffed and then fried which I believe makes a superior taco. Something was overly wet as after two bites it fell victim to taco shell failure. Bottom falls out and you ended up finishing it with a fork. The meat could have definitely used more seasoning.\n\nground beef taco:\nOnly difference here was ground beef and had much more seasoning. Standard large amount of chili powder/cumin.\n\ngreen corn chicken tamale:\nWOW!! The comments about these are dead on. Really good even nekkid. Moist with just the right sweetness and corn flavor. I could have had a plate full of these and probably wanted more.\n\nchile relleno:\nThe pepper was bland, the cheese was a little scarce but at least melted and warm. You can tell the batter was at one point fluffy and light but in a short time ended up a soggy mess. Covered in green sauce.\n\ncheese enchilada:\nAmazing cheese with a small spin of adding onion which I liked the combo. This was covered on red sauce.\n\nSauce:\nRed: Above average, nice fat content and good roasted pepper flavor.\nGreen: No real heat, spice, or even chile flavor. I was disappointed because a few people mentioning how amazing it was.\n\nPros:\nCheese\nTamales\nChips/Salsa\nReasonably Priced\n\nCons:\nHorrible Service: Due to understaffing\nBland: This isn't uncommon for Senoran style but this was excessive.\n\nSummary:\nWhen I have a craving for tamales and delicious tortillas I will be back. Anything else I will likely head elsewhere. If there is something amazing there that I absolutely have to try please let me know! So out of 10 items the group really only liked 2 with a possible 3rd. Maybe it was an off night but I can't give this more then a 2.5 based on our experience. I really wanted to love this place :(", "business_id": "flUKBy7WHqYdfOrwU1A2SA", "stars": 2, "date": "2010-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "rMkQzwPkMVUnDzsvLJ3h8g", "review_id": "oOIsrmwleMy5i_pzvdyxMQ", "text": "Every single time we have been to Eribertos, its been delicious, in fact, as i sit here writing you, i am craving it! We have been to many \"bertos\" but this is the best!.  I like the #2, two shredded beef tacos with rice and beans, love it.\nMy Alex likes the Chorizo, Egg, Potato and Cheese Breakfast Burrito. \nNot sure what is up with some of the other reviews, but we really love their food here at this location. With the other 4/5 star reviews, you have great taste. You get it.  They have made many changes by adding a nice outdoors patio to eat at and two drive-thru windows. That's how busy they are. We will be back and i strongly suggest you try it, i think you will like it.", "business_id": "JqAI4UA2xXPYxvlhzG-i9A", "stars": 5, "date": "2015-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "n8yI65hI3wGBBYddnz1dfw", "review_id": "zbNUBVcpghtcdqtVRmrH2w", "text": "Could be better.  I would like to give it a higher rating but just can't.  The food is mostly tasteless and sloppy.  The price is right, but I've noticed whenever I've been there that the staff is stand-offish and unfriendly.  I won't be going there again....", "business_id": "ZN-RG7wkT8MLsmaTPzIW5g", "stars": 2, "date": "2009-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lwJ2xyoYYUohaefOXs6zpg", "review_id": "Vn6Dim7lVFXsEMDqOf12Vg", "text": "I was really craving some amazing street tacos! So I had the 5 mini al pastor tacos! \nAaaaaaaaaand meh lol Rice, Beans, Guac, and Salsa were just the normal Mexican food taste you would expect - nothing special. I think what ruined it for me was the meat, it was a little tough.", "business_id": "Yb2pNCxYR32XKmpirqJqeQ", "stars": 3, "date": "2015-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AMB8rfw34dGm_q2MfaTkcw", "review_id": "IaJB0iSUO4FYm-Uz7GmZvg", "text": "Burritooooooo lunch special!!!!! awesome, tons of chips and salsa", "business_id": "oqZPXoenkQvAKQJ2pDCo0A", "stars": 4, "date": "2010-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Lmao_DHo-74SN9mxQTiDRg", "review_id": "XQkUrwDyLKX6dUeirLLq2g", "text": "I love love love Rubios!! The food taste fresh and is always great. I usually get the chicken tortilla soup with a health mex chicken taco. The soup is loaded up with chicken, cheese, pico de gallo, rice, avocado on top along with chips and lots of tasty flavors!! The chicken tacos are by far the best tacos.... well I guess that not fair to say because I have never tried any other taco because the chicken tacos are that good!!!!  If you like fresh inexpensive mexican style food then you will absolutly love Rubios!!!!", "business_id": "iOITnizWLD3NlKxRtZd5AA", "stars": 5, "date": "2012-01-11", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "k1Ie4OZYbGBM0b7z00fXUA", "review_id": "y1K9z_sPsSoaqnFtaDxDLw", "text": "I love this place. Everything I have ever had here is yummy! Not once has my order been wrong. Plus the $5 for 5 tacos is great!", "business_id": "1cGZU2gDewDfEu-bBMZEgQ", "stars": 5, "date": "2013-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "4dnDsoHuxUtzhaumxbpR5w", "review_id": "HnQcYEvZbdQL0043MSNf-A", "text": "Tortillas. Enchiladas. \n\nOAXACA SPECIAL.\n\nDon't go during lunchtime. Lines are outrageous and if it's during the summer the heat is unbearable (no a/c). Go in with an open mind.", "business_id": "d52zg-S0o940WUCK-nNiKw", "stars": 5, "date": "2008-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "xv9nUSKR5RqnkgD0tufTfA", "review_id": "GjNAvmQg3DzD7XgdoQu9ug", "text": "I luv this place. Yes, its a hole in the wall, in the ghetto. Who cares...yes, it is a little run down. So what. The red chile beef plate and burrito are scrumptious. Big chunks of meat, sauce is flavorful, not bland at all and not too spicey. I would recommend getting your burrito dbl wrapped, because it does fall apart. You can also buy their homemade, still warm, tortillas for $3 a dozen. I would eat here everyday if I could.", "business_id": "d52zg-S0o940WUCK-nNiKw", "stars": 5, "date": "2010-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UCQNrwN4_hHHTWYa8cqe_Q", "review_id": "wH5aR_jtd0DvscinGJB2jQ", "text": "Had some tamales, and they were one of the worst I have ever had! There is no way this place is the best in town? Now I am not condemning this place, I will come back and give them another try. I will try something different and maybe I might change my mind. But I just don't get the hype!", "business_id": "d52zg-S0o940WUCK-nNiKw", "stars": 2, "date": "2011-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5U0f_3zUi6Yy-bD6csyVjw", "review_id": "bGKfKfdAXKu_u-SNc-3hqg", "text": "Love the food. It gets so busy during lunch I will call in my order. I love the green chile burro. I will also buy my tortillas there too.", "business_id": "d52zg-S0o940WUCK-nNiKw", "stars": 5, "date": "2013-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-9G7cH_cBwwgcJFLrSynRA", "review_id": "nPVaKicR518w_VTFXgNAkg", "text": "This place is scary on the outside, dilapidated on the inside, but 100% good food. I stop here every time I am in the neighborhood. Good taco's, Enchiladas, and burritos. Service can be slow as they are almost always busy.\n\nMake sure you get a dozen tortillas to go. You will never find better and fresher tortillas than here.\n\nSeriously though. fix the place up.", "business_id": "d52zg-S0o940WUCK-nNiKw", "stars": 4, "date": "2015-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nFnMOEJPy98wdEKAVzFs3w", "review_id": "J6Pkroc3FLkFPcfvbtvvKw", "text": "Good for a long flight home!  I always go through this airport early in the morning so i always get the chorizo breakfast burrito, man it's perfect!!!  Hit em up if you are passing through, the staff will take care of you!", "business_id": "3QtWG5sN3HJNBVKn_wHQEw", "stars": 5, "date": "2010-12-10", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "Z02XdD0muEz2FFQKPERMYQ", "review_id": "aTPrHdVOedIlnx96h4nRXQ", "text": "Went to Las Glorias after seeing it on \"Check Please Arizona\".  The restaurant is all about fish.  It's not really \"Mexican food\".  Let me say our shrimp cocktail was very good.  We both had the tacos (I've had better).  I noticed at another table they were just having shrimp cocktails and drinks.  Now I know why.  If I every return it will be only for the shrimp cocktails and salsa and chips.  $50+ total for dinner (one shrimp cocktail, 2 taco dinners and 3 margaritas).  The beans and rice on my plate were cold (most places the beans are so hot you have to let them cool a bit before you take a bite).  Sorry Las Glorias, I'm new to downtown Phoenix and next time I'll try another Mexican restaurant.", "business_id": "Bv3g-9R5wUevZPP0jzihqg", "stars": 2, "date": "2011-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TgV_e3iwHL4i49lA-4mtPQ", "review_id": "x-SkSb5qGC0_JLIgyVjg9w", "text": "One day I'll make it there for something besides breakfast, but I don't know why to bother when the breakfast is so good. They do stop breakfast at 10:30am though.", "business_id": "gw-V13MyfzFaCTbALfnn2Q", "stars": 5, "date": "2014-02-09", "type": "review"}
