{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "TckShYnQa0eD3WQxdoE3GQ", "review_id": "hsdgY8YJtXsCFUjx2nqAdw", "text": "I used to really like this place, but the service can't be overlooked anymore.  I ate here recently on a monday afternoon (granted it's not the A team on Monday's), but  it was so obvious the staff just wanted to get us out of there so they could go back to reading star magazine.  The food was good, not great but good enough.  The service as mentioned was poor.  The server was apathetic at best.  He didn't give us time to finish our soup before he had our entree's in front of us and a check on the table.  I think this was my last visit.", "business_id": "Lm_mR5xDF91OeZw97ch41g", "stars": 2, "date": "2008-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HnYblzLTTMYoqi0mmqMj0A", "review_id": "QXJrPsLLvZ4fMRs0o3iLmg", "text": "Not much to say but I like this place. The Thai style fried rice with crab or lobster meat is pretty good. Service is ok and ambiance is good.", "business_id": "sxeuOMBRllOHXJTaUlI9kQ", "stars": 3, "date": "2011-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XFZIPlTT4fapnuAws7Dgug", "review_id": "8qfVe-dNSBd6d_aZgBM59w", "text": "I asked around Yelp to see what the best Pad Thai in the city was and a lot of people said Thai Cuisine. To my surprise I ended up moving a block away from the place. I go here once or twice a week to get the Pad Thai. Yeah, I could live off Thai food. The pad tha0i is delicious! So is the fried goyza. Try it! Seriously. The portions are so large that the pad thai lasts me a couple meals.", "business_id": "sxeuOMBRllOHXJTaUlI9kQ", "stars": 5, "date": "2015-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b_dTcR-GzNIbJ9Vf1OlOzw", "review_id": "Fg3RXTA807snR71sCTOqpA", "text": "Best I've tasted in Charlotte thus far!", "business_id": "DReLu6HuFOm4p-jYZpgQkw", "stars": 4, "date": "2013-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "egulF33iKiEwgXZkesfkJQ", "review_id": "Av5pVZOoGh_S8B1Q-rP2XA", "text": "Pretty good experience I had with my friends the other night. They close at 9:30 and we got there about 8:50, but they sat us right away and we were able to eat a great meal.  We chose to share mulitple dishes -pad Thai (love it), pineapple fried rice (little bland but great with a touch of hot sauce), spring rolls, house noodles and red curry( delicious). I definitely recommend this place to eat", "business_id": "f9WqdqHuZtwg41HDLSKaPA", "stars": 3, "date": "2014-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FLdun6KWwAh-gC8VHVZGCw", "review_id": "SAENYTJN8pbd4PEhBUVmSw", "text": "The Wild Thaiger is one of my new favorite places.  Every dish I've tried as been excellent.  They accomodated with some grace a friend with food allergies and were polite -- too polite -- in serving me as I (unknowingly) arrived just at closing.  The peanut sauce on the satay is amazing.  Pad Thai is a standby at a Thai place, but it definitely does not disappoint here.  The beef curry was excellent.  The ginger fish dish less remarkable but still good.  Coconut ice cream dessert is good for putting out the fire.  Good place to go after an Art or Heard museum visit.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 4, "date": "2007-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EAJjMgKIjiaVb_2Q9ROeCQ", "review_id": "4Hw16KeJ81m46Gnp_xoXCQ", "text": "My 2nd time here, last time was part of a big group, this time was much better! Able to relax and enjoy it! Had kimow chicken and must warn, it hot! But I like my Thai food hot!! My date ,he had the beef panang(red curry beef) also had Thai iced tea for drinks, definitely needed something cold and refreshing!! and for dessert, omg! Had lemon ginger cheescake, was fantastic!!  Love this place and plan to return!!", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 4, "date": "2010-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "paCAbyBx5vJZsxaARxeblw", "review_id": "CKY1sYr6mKEtRm40eT5Wvg", "text": "I hope the sanitary conditions have been resolved because I love the Pad Thai at Wild Thaiger. By far the best around (at least that I have had)! My only complaint is that sometimes the servers are a bit slow. Other than that, I love it!", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 4, "date": "2012-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "aaHyqSTcpdkismEP0bj0rQ", "review_id": "YojcX8d12Dre3SKiEpWCIQ", "text": "I've gotta say, not super impressed. The spot is cute and the food is ok. I got the chicken pad Thai and spring rolls. Spring rolls were kind of soggy. The pad Thai was good though. Really flavorful. Could have done without all the cilantro and garnishment. I prefer Thai Basil.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 3, "date": "2014-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HzeU53SmLyzluGzOveFhdg", "review_id": "IFI3kEn4skJ9pJ9AF0gEuA", "text": "Updating to give five stars. We've eaten here twice more since and the food is consistently amazing. My boyfriend got the Temple of Fire today and holy cow, it was so good. Very spicy, but that was to be expected. We've tried about six dishes so far and each has been something I'd recommend.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 5, "date": "2015-01-03", "type": "review"}
{"votes": {"funny": 13, "useful": 14, "cool": 12}, "user_id": "qwu5B9anH4AlEtau0K-6aQ", "review_id": "TpNy74V-dsgWjGAvhlY1AQ", "text": "So I really wanted to Yelp something today. So, a buddy (@groovypucks) and I went to Thai Lahna.  I noticed it had a LOT of reviews and still maintained a pretty reputable score!  Hey, its only a block or two from work, so why not?\n\nWe get there and are immediately seated which in my opinion is rare.  For the rave reviews, I noticed it was kind of 'dead' for a lunch crowd.  A few old people and the owners were all I really noticed.  We get a booth seat (I love booth seats.  If I could work, sleep and eat in a booth seat, I would die a happy man) so I am already getting excited.  Groovypucks and I take way too long looking at the menu and finally decide on our dishes (which we accompanied with a Thai Tea).  I asked to make my curry spicy(#36 Yellow Curry Chicken with Green Beans), and it WAS!  Almost too spicy, but I attribute that to my lack of experience with their dishes.  If I were to order it again, I would order it medium.\n\nGroovy got a Peanut and Chicken dish (#35) with onions and peppers.  I tried a bit, as I am comfortable in my sexuality, and I really liked it.  It was Damn good! That's right, Capital D!  The service for the rest of the meal was below par, but not to the point that it was annoying.  It just took a little too long to get my food and my check at the end...\n\n...And with this review I leave you with my fortune\n\nIf strength were all,\ntiger would not fear scorpion.", "business_id": "wct7rZKyZqZftzmAU-vhWQ", "stars": 4, "date": "2009-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KKwve3FShMqrNwIv4ds0xA", "review_id": "TDBQnv2QRnS4pgeNOrjVQw", "text": "best Thai Food in Phoenix.  The have a whole vegetarian menu and The sweat and sour tofu is amazing!", "business_id": "wct7rZKyZqZftzmAU-vhWQ", "stars": 5, "date": "2013-02-22", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "bWWtNUNZwGkP1P0Y1P3srA", "review_id": "sDLSj17KQKIvGQIKHozk9A", "text": "My BF and I went a couple days ago for dinner. Even though it was Saturday night, the restaurant wasn't that full and we were seated fairly quickly. The decor is definitely nothing to speak of, but it was clean. The color scheme, particularly the pink and lilac napkins, was a little strange, but I guess it's supposed to go with the name.\n\nUnfortunately we were seated in an odd area in the back of the restaurant. I guess I would describe it as a corner banquette where we were sitting at a 90 degree angle instead of across from each other. There was an older couple in their 60s or so sitting at the other end of the banquette, and no one in the booths across from us. Throughout dinner the older couple were discussing breast implants, recreational drugs, and menopause the musical. Because the area we were seated in was so empty we couldn't help but overhear their conversation which made for a very unpleasant dining experience.\n\nOur server was a younger lady, I'd say late 20s/early 30s. From the moment she first came to our table things started off on the wrong foot. I was looking at the drinks menu and she made some comment about how I'm too young for that. Now I know that I look young and I don't have any problem with people saying that, but it was her tone that almost sounded like she was scolding me.\n\nAnyway, we went on to order and started off with an appetizer. I don't remember the name, but I jokingly called it a Thai quesadilla. It was chicken, peas, potatoes, and maybe some other stuff wrapped inside a flour tortilla and served with peanut dipping sauce. The tortilla was folded in half and then cut into four pieces. We both liked the taste and flavors a lot but found it very difficult to eat the middle two pieces without making a mess.\n\nFor entrees, I ordered pad see ew and my BF ordered pad thai. Both dishes were okay, but we've had better. For the pad thai, I'm used to seeing the crushed peanuts and bean sprouts come on the side for you to mix into the noodles yourself. But it wasn't served like that. For the pad see ew, this is the second Thai place I've tried in the valley and neither has done it right. First of all, I wish they'd use real Chinese broccoli instead of American broccoli, but I can overlook that. What I don't understand though is why I keep getting asked what degree of spicyness I want. In my experience, pad see ew isn't supposed to be spicy. It's supposed to be cooked with a sweet soy sauce. The noodles were good and had a nice soft texture, but the flavor that I want just wasn't there. Also I ordered it with pork and there was something off about the pork. I think it was either old or just a very poor cut of meat.\n\nNow here's why I ended up giving only two stars. By now the older couple had left and a new couple had been seated in one of the nearby boothes. Both tables had different servers who were very friendly and attentive. After we finished as much of our meals as we could, we sat with our plates untouched for 15-20 minutes and our server basically ignored us. I don't know if she forgot we were there or what. Also neither of the other two servers who kept passing by took notice that we were waiting to be boxed up and go. Finally I had to flag a server down and he went to get our server. She came and made some comment about how it looked like we were falling asleep (duh, we're tired of waiting) and then took our food to boxed up and brought back the check. Then she disappeared again for another 10 minutes before finally returning to pick up our credit card and ring us up.\n\nI'm disappointed because Pink Pepper is pretty close to our house and I was really hoping that this would become a place we could visit frequently. While I'm not outright ruling the possibility of returning, I think we'll have to try some other Thai places first.\n\nHowever, I do have to comment that I disagree with JBH J.'s review that the prices are high. I thought they were very reasonably priced.", "business_id": "_IE5XDjxeM47NSzhg7sItg", "stars": 2, "date": "2009-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "M8qVHr2pKEun0bwk_gOxQA", "review_id": "GIm0kEyd10pEQB5FRbwgbQ", "text": "Amazing! We ordered red curry & panang curry and they both were so good. I really enjoy spicy but I decided to be safe and order medium - which they told me would still be pretty spicy. My mouth was at a perfect balance of on fire and delicious. I would definitely recommend. Also, we ordered take-out and there was plenty for two meals :)", "business_id": "nefBMCGgMPvOnASoyO_X1A", "stars": 5, "date": "2013-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1NXx__E4lfMzoVUIdCFpsQ", "review_id": "pXfmQMWpApo4i6b6JhdJFQ", "text": "Love this place!!! My in-laws are here from Michigan and love their little Thai restaurant they go to frequently. However, they came here and now is their favorite!! (Along with mine) the satay chicken is always amazing and their veggies taste so amazing! I highly recommend anyone wanting to try Thai food to visit Krua.", "business_id": "nefBMCGgMPvOnASoyO_X1A", "stars": 5, "date": "2015-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IPMghNhHzAiqoukTcab9CQ", "review_id": "TpzNydHO0B8HEWcqJEkojw", "text": "This place used to be good when it was Neo Tokyo but it was recently switched to savor flavor . I was hesistant at the change of the owner but decided to give it a shot . When i went to the register i noticed alot of ppl sitting around waiting for there food but placed my order anyways. After waiting about 20 minutes other ppl who were there before me started complaining about the wait so i went to check on the eta of my food and was told about 30 more minutes. I explained i had already been waiting 20 minutes and was rudely told that i should have been told about the long wait when my order was placed. I advised that i was not and recieved a refund and left . 50 minutes for chinese food seemed a bit excessive for a to go order. Will not go back again unless calling ahead . Waaaaay ahead.", "business_id": "GBN0-wo_cHLnC_pwoOTIFQ", "stars": 2, "date": "2015-02-17", "type": "review"}
{"votes": {"funny": 6, "useful": 1, "cool": 0}, "user_id": "HBJr0twBChhWkosCjtkXUQ", "review_id": "74SyKdwgkLNytpybvS6Rlg", "text": "My colleague bit into his egg roll to spit out a bolt. No further review necessary (see photo).", "business_id": "K4DHwck_2ds1wURnmZdFiA", "stars": 1, "date": "2014-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "hnirQYfI4cjrzSMENyQTWw", "review_id": "BSf9iDNzRow2aYA5cB1D0g", "text": "Swaddee's is....all right. As I was answering a question in one of the talk threads, I realized, though, that it's spicy-meter is a bit inconsistent. I've had times when the pad Thai, at a 3, is more than I can handle. At other times, I've ordered a curry at \"medium\" only to find out it's not spicy in the least...\nBasically, I think this place is a solid choice for Thai, but it's by no means earth-shattering or anything like that. I actually like the lunch options better than dinner here. The first few times I've eaten at Swaddee's have  all been at lunch, and I've been impressed. But then I ordered the Panang curry to-go, for dinner. I asked for it with tofu, and I got a curry with tofu and onions. That's it. No veggies, nothing. That's really odd for a Thai restaurant. It wasn't flavorful, either. Then I went here last week for dinner, and ordered pad Thai. The noodles were a bit dry and hard, although I have to say, the service was great.\nAll in all, I think I'll continue to come here for lunch, but when it comes to dinner, I'll probably try to seek out some new Thai restaurants.", "business_id": "vtQOervVVTXjhvSZQiZ6PA", "stars": 3, "date": "2008-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K89HMNXiHy8q7a-OTxwGSQ", "review_id": "f_Hc-oyEkSttBbNG7BJ2DA", "text": "Excellent Thai food!  We got take out.  The Pad Thai and Curry - excellent!  If you like medium spicy...choose #2 (spicy between 1-5).  #3 spicy...was way too hot for my husband....who is always medium spicy.  \nFYI...they DO NOT take AMEX; and there is a 10% discount if you pay with cash!", "business_id": "vtQOervVVTXjhvSZQiZ6PA", "stars": 4, "date": "2013-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "MMwwm-MEp6-XbXd05r8CVQ", "review_id": "VB0jxL2klipuI3Htjj4BaA", "text": "Around Thanksgiving, we went to Mint Thai for lunch (it being our usual thai lunch spot). What a mess. The food wasn't tasty when it arrived - and it had taken forever to get the attention of the waitress for anything. In the end, out of a party of 4, only 1 of us had received what we ordered, 1 of us was violently ill (and remained so for DAYS - having to visit the doctor, etc), 2 of us felt moderately ill later, and only one of us felt ok. Such a disappointment.", "business_id": "RFeDe3fNr14kvUKlVx6_4w", "stars": 1, "date": "2011-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "38z6wpxeCfBPgQFsWzdh7A", "review_id": "4n1rwiX53Ce8CDKEL-MHOQ", "text": "The portions *seem* okay, but actually they aren't that great (they really cheap out on meat).\n\nI've given them a couple chances, but both times I've been very disappointed by how stingy they can be -- it's almost all sauce! Come on, Mint Thai, you can do better than that! I can understand being frugal with seafood, but ...chicken? \n\nIt's not just with their entrees, but with their beverages. I got a $3.95 Thai tea which was 3/4 ice...on one of the coldest days of December. Is the tea made of gold? Mint Thai, for what special occasion are you squirreling away this cheap beverage?\n\nSigh. It's tasty overall, but I just feel awful paying the same price as other Thai restaurants for *truly* half the food.", "business_id": "RFeDe3fNr14kvUKlVx6_4w", "stars": 2, "date": "2015-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "twZoTvWG92ntMVfEvbCnIg", "review_id": "nAVPgdzEXAQB-cQ76Y356w", "text": "Wonderful choice for lunch or dinner.  Menu boasts healthy cooking alternative to the usual greasy/unhealthy feeling you get after eating at a normal chinese restaurant.  THEY ARE RIGHT.  The food is delicious and fresh and I love almost everything that I've tried so far.  Not only convenient, the food is always ready in 5-10 minutes depending on how busy they are.  If you're in the mood for some delicious chinese, or even curry check this place out.  I would recommend it for take-out.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 4, "date": "2011-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zTs4os3QZMQGJNv5IyhGPQ", "review_id": "RCx3Us80dFbDPktmGrfl2A", "text": "Stopped in for half price apps, the pot stickers and and skewered bbq chicken.  Was pleased with the value and would stop back in.  Little to no atmosphere.  Would have to try again to recommend.", "business_id": "H7KzlC0-o1wIhlGg-Me5Ag", "stars": 3, "date": "2011-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kJyR4gT1pfCcNjEY9-YMoQ", "review_id": "rMmg2GKso6viKt6ayuMrXQ", "text": "This place pretty much sucks most people ....ie n scottsdale people seem to think its the cats pajamas or wait the cats meow but I have been here probley 1/2 dozen times because it's close to my job and every time I finish my meal and leave I think how mediocre the food is. The service in the bar is usually good", "business_id": "H7KzlC0-o1wIhlGg-Me5Ag", "stars": 2, "date": "2015-01-22", "type": "review"}
