{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AGdz_vdhCWj4AUfVM9bPHw", "review_id": "9OtT_foXxy3CktvvbP1Mow", "text": "This is far the best dental office & team I have ever been to! I have been so paranoid of dentist that I really let me teeth go to the point of extreme pain that finally led me to the Unique Dental Care office (received flyer in mail) I cannot even begin to express how comfortable the staff made me feel & Dr Baker was amazing! I had to have a wisdom tooth & another tooth pulled, never felt pain. After being home for about 6 hours I couldn't stop the bleeding from one area so Dr Baker had me come down to his office way after closure & fixed me up good as new!  He even called me at home to see how I was doing.  My husband & I were so amazed & grateful for the extended care beyond duty he gave to me & I actually can't wait to go back to start treatment on my teeth!!  Best Dental office by far.", "business_id": "e7ExjMdmeF95SzrZ--dHcA", "stars": 5, "date": "2015-02-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "bYdUMQluPbp_zbIs_RLYDQ", "review_id": "jRehdkEQE0pO_N2RmZ76AA", "text": "Oh dear me, how the mighy have fallen!\n\nA year ago I would've proudly given this place 5 stars but the last 6 or 7 times I've been here it just hasn't been as good. I don't know if its the different people doing the cooking or what but the standards seem to have slipped. Back a couple years ago when I started going there a beefy guy was doing the cooking, always made quality pizza. Now? Not so much! The semi-surly lady from Jersey (sorry Tom T., she's from Jersey) is still there on occassion though. Bring back the beefy guy who can cook please!!\n\nI still love the chicken parm despite the downslope on the pizza, it's a massive sandwich and definitely makes me happy...\n\nAll in all I will keep going back hoping that the pizza will get back to where it once was...", "business_id": "m3O2EFVs3eo8s40MGGzmsA", "stars": 3, "date": "2010-02-07", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "TQ5eVGOFr_qB5_BbEd3Sow", "review_id": "910yZGQyu5Ln43lgsoJfmw", "text": "I was window shopping at Fiesta Mall yesterday when I spotted the LensCrafters. I went in just to  check what they had to offer and was greeted and helped immediately, so maybe they took the other reviewer's criticism to heart. Both clerks who helped me were very pleasant and informative. \n\nThe store was having a 40% off sale and could get my glasses in an hour PROBABLY, barring unforseen glitches. It was evening so the Dr. wasn't in. Frames started at $99, the lenses would be about $190, exam about $85, so my total about $350-400 for one pair minimum. I took their card and continued my window shopping. I do need new glasses and thought it might be worth it to pay more and have them right away.", "business_id": "_CVcmMqTUequ2u6fbJ48vQ", "stars": 3, "date": "2012-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wSiOWRdjIJillDyHMt88jg", "review_id": "1Kp6_gYiZsJThNyYlxm17Q", "text": "The food and drinks where great. This place was full of specials from 55 cents wings to happy hour drink specials! The waiter was friendly and helpful. I look forward to coming back again.", "business_id": "G7-NoraGlmzwO0sgs4fbmQ", "stars": 4, "date": "2014-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2kb0mfOItoGat6bVkEtDdw", "review_id": "-r44mpXdewxCIaRWF-ycAQ", "text": "Easy to find right off southern. Not the best I've ever had but passable. Missing several condiments I am used to with pho. Asian cilantro, nam pla, etc broth was good, generous steak and noodles. Not going out of my way to eat here however.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 3, "date": "2011-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WuKpK0XKAz4LYC4BKKeT8w", "review_id": "0FvYTTjyu_K_yzkyy4lxEQ", "text": "Been going here off and on for many years. This isn't as close to home as it once was, so before today it had been a long time since my last visit. Can't believe how consistently good their teriyaki chicken is!!! If you're looking for healthy options you can get white meat & brown rice; plus they have other low carb options (haven't tried them but they're available).  5 stars all the way!", "business_id": "wc0a0XLhcMkoEQx1TbuhpQ", "stars": 5, "date": "2013-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7UHFwq8juli9W78fDPEwJA", "review_id": "3gexA87f9enU47JkAeuVtA", "text": "Trying again at the slowest Whataburger on earth . 7 minutes to take the order of the two cars in front of me. ...asked to wait before taking my order. 1.5 minutes wait before takin my order.  4 minutes to deliver orders to the 3 cars in front of me. 2.5 minutes wait to receive my order. Total 14 minutes for \"fast\" food drive through.  I might as well go to a sit down restaurant.", "business_id": "2qf-0qkDNh7r8iU0498htQ", "stars": 1, "date": "2015-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nGYaT5sAuqKkd48dqX_2Kw", "review_id": "H5n000B2LyToBwUAN1ExcQ", "text": "Duuuuuuuudeee.....this place is YUM.  Where are my eye drops?\n\nDefinitely an interesting crowd.  Makes me want to grab my Birkenstocks, hacky sack, and drum and hitch hike right back up to Flagstaff.\n\nBut really...the sandwiches rule!!!!  \n\nThe service and pricing...nothing special (neither great nor poor.)\n\nEnvironment...this is a fun place to eat and people watch.  You should try it.", "business_id": "KS2w8ychyieJbUqRa6kCHw", "stars": 3, "date": "2010-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "C57NqfzXRvqsCzvyvvGD-Q", "review_id": "VVxloeADzbKVooVxiBcvGw", "text": "The White Widow is my go to here, chicken with ranch, mushrooms, provolone, and lightly toasted. The atmosphere is new age reggie (american version) which is a fun change in the usual sub sandwich interior. Some of the murals and art work are a little risqué for younger eyes and may have some suggested themes but for the college scene it fits right in. Overall I like the food and service is always friendly.", "business_id": "KS2w8ychyieJbUqRa6kCHw", "stars": 4, "date": "2014-12-20", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "BX9K5JMU-NnjxJaNKxImpQ", "review_id": "6x1DSBZra6RWK0wCICzGOw", "text": "I didn't have any issues with service that previous reviewers had, but I can't really see myself going back to this place. The food wasn't bad, it was actually pretty decent, but it wasn't a \"Wow, I can't wait to go back!\" kind of experience. \n\nI guess what it comes down to is that I can't knock the place for being bad, because it certainly wasn't, but there are at least three other Asian restaurants and an Oregano's in the same tiny strip mall, and I kind of wish I chose any of them instead.", "business_id": "8TGUK7LD3M-vLWml-jLb0w", "stars": 3, "date": "2008-01-28", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "jKeaOrPyJ-dI9SNeVqrbww", "review_id": "9uxyTa1lpmhY9g8g3iw2jA", "text": "I love Nagasaki Grill Toh Zan!  The owners are very friendly and almost always available.  The food is delicious and always fresh.  It's a short drive from Fiesta Mall on Southern, and it's definitely better than the McDonald's eyesore next to it.  I recommend the sushi, and my boyfriend loves the chicken katsu.  I like the big windows and friendly vibe.", "business_id": "BBPkwpj9kSeDuy0uOwWHJA", "stars": 5, "date": "2008-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "znYdiJAwm5EPYk4HRva4EA", "review_id": "WhXCEsVvX0rTXgQU4yu3NQ", "text": "I have had wide range of Japanese food before, from authentic to Americanized. You will have a more authentic experience at Nagasaki Grill. It is owned by a Japanese couple who are reserved and speaks Japanese to themselves. I read the reviews before I went there, so I was prepared to face less than ideal interaction from the owner/server which was fine with me. Now, food-wise, it was great. We had salmon sashimi for appetizer. They were THICK pieces of salmon and fresh. For main course I ordered don katsu (fried pork and rice) and salmon covered rice. Katsu was ok. A little thin and dry. Salmon covered rice was great. I thought it was going to be cooked salmon but I loved it nontheless. My favorite part was STRAWBERRY BOBA TEA! It had real ground strawberries and boba balls. I would definitely go back!", "business_id": "BBPkwpj9kSeDuy0uOwWHJA", "stars": 4, "date": "2013-12-14", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 3}, "user_id": "fPHLPrymsyb6WSFFKoMrTQ", "review_id": "t5V1YLgsIRTDxkoo1oHpvQ", "text": "Korean Food + Me = true love.  I adore Korean food.  I'm not kidding. It's probably my favorite cuisine.  If you haven't tried it, you should.  My typical favorites are kimchi jigae (spicy tofu/kimchi/pork soup), Haemul pajeon (seafood pancake), Galbi (short ribs), oh jing oh duk bokki (spicy squid with rice cakes), Bibimbap (rice bowl with veggies and bulgogi), mul mandu (dumplings)... I could go on and on.  \n\nIf it's your first time with Korean food and you're not very adventurous, get the Galbi and JapChae noodles or Bibimbap (but be sure to try the side dishes (called panchan).  If you're in for the adventure and heat... see my list above! :)\n\nHope and dread were the battling in me when I left CA and realized I'd have to find Korean food here in AZ.  Turned out to be a needless battle though as the Phoenix area continues to surprise me with their hidden and limited but delicious, authentic fare...\n\nYum yum Hodori!  This was my first taste of Phx area Korean food and I have to say, I was impressed!  It's much better than I expected it to be.  They have an extensive menu so I ordered Bibimbap, Kimchi jigae, and Galbi.  It was all good.  The panchan was tasty, too.  I still crave LA Korean food sometimes but this was definitely good enough to return to, many time.\n\nSee ya there!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2011-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AW3NXI9fvON40A-I1M961w", "review_id": "Z0Q6U9VmF3olUC8oPinpJA", "text": "This is the BEST Korean restaurant in Tempe-Mesa. Kimchi pancake with pork, and soon tofu hot pot are my favorite two dishes. It is real Korean taste in Hodori. My friends and i come there several times a week. \n\nHowever, the decorations in Hodori need to be more \"Korean\". The soup in casserole is little bit weird.\n\nOverall, Hodori Restaurant is a great place to go!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2014-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Ba-tIR3a8hhwIk-y_hVzFg", "review_id": "Rl6qs4_VmVWiR5UMkSKWIw", "text": "i don't have to mention how good the chips, salsa and bean dip are here but i do have to tell you the flour tortillas are to die for!   i am seriously thinking about just ordering a stack of those next time!  The beef machacha is much better then the chicken, the pollo ranchero is def a favorite,  and my boyfriend says the chile relleno is delicious.  Service is awesome and the margs are strong!  check this place out :)", "business_id": "VtpnMevn_oAxXGaM9JDrSQ", "stars": 4, "date": "2010-12-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xjUOiQhVsKgqIa_99SRHdw", "review_id": "zI4OPlM8eV-Uga3_AJOalg", "text": "Kind, warm hearted, and professional.  Great place!", "business_id": "smTAygd_rw0RrJB8GDULFw", "stars": 5, "date": "2014-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GlyZqaff1iXpY91JH9gYcA", "review_id": "mT_YUjPClv-gBAb-Ti1UdA", "text": "Had the chicken Marsala. Pretty good. I would go back.", "business_id": "P2i4eojfX61pZn8i7RZZxA", "stars": 3, "date": "2011-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oe614PyMdAayDUfWEaFUUA", "review_id": "SGKn6UBVgNHmSx0VUCcirQ", "text": "Stayed there while visiting family.  Not sure why they would call it a resort but it does have a large pool and space.\n\nRoom was standard Best western, nothing fancy, poor lighting, roomy and free breakfast.  Smores by the outdoor firepit at night (nice touch).  \n\nProbably a great place for families as it seemed like a safe place for kids to gather in the courtyard and play in the pool.  Restaurant had okay food with great prices.  \n\nBut would like to have better lighting for business and for putting on makeup.  Felt like I was working in the dark. It was a great place for my cousins and I to sit around the firepit and get caught up on all the family gossip. \n\nThere is a well know franchise coffee place in walking distance from the \"resort\".  Oh and the water is very nasty.  And am a little concerned about bedspreads and blankets are reused for every customer.  The central air seemed not very effective.\n\nBut for a large group with lots of kids, you can not beat the price and ammenities.", "business_id": "CscJ0RubTHofHvRJhERvXQ", "stars": 2, "date": "2010-02-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SsDYTH14hF6GL-MckCImiQ", "review_id": "OSJCBJ5Kv2tc3VtEXybLSQ", "text": "Yummy! Fresh food and good service! I had the castroville omlette. Tasty! I do wish they has hasbrowns instead of diced potatoes but that is just my preference. Our server was friendly and definitey took care of us. We went on a sunday and it was pretty busy but we didnt suffer from that at all. Overall good experience.", "business_id": "8aPTQeDYOMNEu907WfflCQ", "stars": 3, "date": "2012-01-16", "type": "review"}
{"votes": {"funny": 3, "useful": 0, "cool": 0}, "user_id": "YRDpenlReqnPwuooA9fgrA", "review_id": "KziVv5IFupDYjiYmHcdYwg", "text": "Food was good as expected, but the experience was ruined when my wife received a text message from the driver about 45 min after the delivery making sexual advances toward her. If he is bold enough to use customers private information in this way, then I can only imagine what else he could be doing. It was completely inappropriate, and I will be following up with management soon. Hopefully they will hold their employees accountable.", "business_id": "erYxGVc1A_bce_S_W7dKgQ", "stars": 1, "date": "2015-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AowCktImijF8UG8hgT0IXg", "review_id": "80J_TqMnQ1SVjS2daKpAOg", "text": "Overall, we had a good experience. The registration staff was nice, clean facility, and very quick. However, we  were very disappointed with the doctor who treated our infant. Dr. Young cut us off in the middle of sentences, ignored things we would say- not even responding, and he is very undermining. I would go back to this location, requesting not to be seen by Dr.Young. I deducted 2 stars for the disrespectful service by the doctor.", "business_id": "2bD-KHkntojDT1vqUlRSmQ", "stars": 3, "date": "2015-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cHnlIFP5WwJRer7_C2NUng", "review_id": "qE8Dmt-u2aa7Q1r2XdoYIQ", "text": "Your typical bowling alley.  Cocktails are about $3.50, glow bowling on saturday nights.  They have a package for 6 people for like 65 bucks.. Includes your shoe rental and 2 hours of bowling.. oh, and a pitcher of soda.  The shoes are clean.  The bar is clean, the lanes are clean, and even the bathroom was clean.  Do not underestimate how much money a bar tab can be... 2 different friends racked up over 100 dollar checks in about 3 hours.. maybe 3.5..  Anyway, I liked this place and will return for sure... but maybe because I bowled 168 woot woot!", "business_id": "pS7XA-h0QnjButYIlU-cdQ", "stars": 3, "date": "2010-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6O9JEjAbXojH8LjeL8G3fA", "review_id": "2mil6ZZA3eNxqUDg9jg7IQ", "text": "I have always had a good experience here. Staff, food, everything is nice and service is great.", "business_id": "dbh72sNyNeHUgJqQye9Vbg", "stars": 5, "date": "2013-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "67sKHDUzJkokwtux_Vp8ng", "review_id": "dcpy221G_Mjn2UfWYomL_Q", "text": "I've been going to this shop with my boyfriend for quite some time. Today I decided to extend my snake collection. I called Arizona Reptile Center ahead of time because I saw a certain snake I wanted in the store weeks before hand and they happened to still have it. I get to Arizona Reptile Center and ask the employee Jon to sex the snake because I needed a female. He had the snake I wanted, sexed it, and told me it was a female. I could not sex it myself because pet stores don't like you doing that, which is fine with me. After the purchase of this supposed female snake I go to another pet shop to purchase a similar snake that was a different morph. Before leaving one of the employees questioned the sex of the snake I bought at Arizona Reptile Center and it turned out to be a male. I drove back to Arizona Reptile Center, told them it was not a female and ask to look at the other snakes to see if they had another one that might have been a female. Instead the same employee at Arizona Reptile Center said, \"huh\" \"whatever\". I asked if I could see the other snakes the employee had and the employee said, \"they are probably males\". Then this employee at Arizona Reptile Center proceeded to pull the money I paid for the wrongly sexed snake out of their pocket, slams it on the counter, rips the snake out of my hand and walks away without saying another word. \n\nWORST CUSTOMER SERVICE I HAVE EVER HAD. \n\nI've purchased many animals from Arizona Reptile Center before and every time was awesome. I don't know what this employees problem was but I will not be returning ever again. I go to every local Reptile Expo that comes to the valley and the next one they vendor at I will make it very clear to them just how rude this employee was to myself and my boyfriend.", "business_id": "FryWrZBjBYKeW3pE1WW9EQ", "stars": 1, "date": "2014-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sxRVgm93Mzb_OOjotnQMBA", "review_id": "HhvJokpQdeA8M0oW8pvRzA", "text": "I am a creature of habit but needed to get my haircut, my usual place was not available so I wandered into here. I was very incredibly surprised that they would be able to cut my hair on such short notice on a Saturday night, and how amazingly friendly everyone was. My hair was cut quickly and exactly what I wanted and needed. I think I found my new place :) thanks guys", "business_id": "e1Hfnj_z409Qbc-BGnLGxQ", "stars": 5, "date": "2015-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ytUoZ9yVvRRS5nggxahKXQ", "review_id": "zsbnIM18UEDQ4isPXMWg7Q", "text": "Thank you so much Angel you were very helpful. I have been to other autozone before and did'n't a great experience.  Not going to lie i would go to other stores part  stores before i would go to Autozones but I had to because of my battery. He went above and beyond then a lot of ppl would do. You will be seeing me again and asking Angel next time i need parts or help with my car. \nOne thing I never got to say to him Happy Holidays\nNolan W.", "business_id": "bZJwLj0rb8zPlkUsVeaoqQ", "stars": 5, "date": "2014-12-07", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 1}, "user_id": "cx0RfM8n11zQv8qBeMsuSw", "review_id": "go1BEHB6hqQGen9f8s8xYQ", "text": "Stay away at all costs! Cheap drinks at happy hour 5-7 is where anything positive ends.The worst customer service!Huge attitudes,by ugly,over confident bartenders.Id say the bathrooms are gross,but theyre worse than gross.But if youre missing a few teeth,youll fit right in here.And never go there looking for woman,unless you like obese woman..BBW central.", "business_id": "hi5xfV28jsGBRWJWoBhDaw", "stars": 1, "date": "2012-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "G3sRl4XNtO24PPGLCyOcUg", "review_id": "enBTH47D6vWBZH6gMnyLQg", "text": "These cats got it all going for them. Taste, price and coolness. If your all into the scene and need to be catered to, like your paris hilton, don't bother. It also has a great market selection, mine being the deserts and sweets. The plates have some good choice, I go the way of a main kabob, rice (mmmm), hummus and fries. They also lay on the pita bread, so its all good here. Oh, and be sure to bring someone you can converse with or something to read, its not fast food, so relax.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JhKu0pgYDP2xGY_itiLt-Q", "review_id": "e-MjLBKhPsyw-v_ncImV8Q", "text": "We go to Jupes all the time! We love this place!!! Chris and Carrie are awesome, the beer is frosty and cheap and we love that its a neighborhood bar. The trivia night (Thursday) is so fun and they have a great juke box.", "business_id": "rjjEN8QTMvilB08ImFyMow", "stars": 5, "date": "2015-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kvcb3L0MSdnvbYY-nkW-uw", "review_id": "UqjcTC5qqy1O0CJaru46Bw", "text": "Not like it used to be.  I used to come here all the time about 6 years ago.  I always got the Golden Gate Special Beef, which was a huge pile of beef in a thick red sauce, sprinkled with candy-coated walnuts.  I decided to get that again and was disappointed to find a small plate of soggy fried beef in a watery sauce with a few plain walnuts.  My dining companion had the garlic chicken and it was a little slimy.  The crab angels tasted fishy and the pot stickers were more wrapper than filling, so everything was a disappointment.  It definitely isn't as good and it's far more expensive than I remember it.  Too bad.", "business_id": "PNrOTfMmE0CJFV9YwSLzYw", "stars": 2, "date": "2013-01-04", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "9FAvwDeNwoyOx9WNEiqABg", "review_id": "ZhGQragVqo9GslspZ-m0-g", "text": "I too bought a Groupon and had Chelsea as a stylist. She wasn't to talkative at first but she just went to work on my hair. Super fast foiling! I love it! Had two partials before elsewhere and got a full highlight and love it! \nThey did offer me a soda, which is nice! \nI would love to go back but they are a little expensive. My groupon was $55 for full highlights/deep conditioner/hair cut (which I only got a trim) and since my hair was \"long\" it was an extra $15 (after she started) on top of the $15 tip (since we are suppose to tip on the regular amount )\nI would go back if i have cash burning a hole in my pocket :p", "business_id": "JlwJPlkE5E_97sPhqWnmCg", "stars": 4, "date": "2012-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mAevGxZxfOUnGOu4-ZpqyA", "review_id": "rrG5ltR59hC0lzw2nU9oJA", "text": "Waitress Jessie is very friendly and informative. We ordered a meal that we intended to share and it was brought on separate plates for us (bonus points for that). Food is good (had enchiladas). Salsa not too spicy (for me). Will come back when next craving Mexican food. From what I saw, the restaurant is clean. No complaints!", "business_id": "CuyNmwDOLeMTrbv2c6rNxA", "stars": 4, "date": "2014-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G4IR4Mqsg7kFLaruUpAP2A", "review_id": "xJrGwomDU5myRyRDHL9Q9Q", "text": "So the feel when you first come into this store is high school.  All the stickers and post magazine psuedo graffitti gives the hints the crew that works there are a bit on the younger side but then again shredding the gnar with fluffy stuff everywhere is what it's all about.  The staff seemed really knowledgable about gear, clothing and tuning gear.  Braeden was super helpful in helping be locate the tuning kit I needed and had it shipped from another store on the fly.  Totally appreciated it and have been sending everything from snow bunny rentals to the seasoned brosef for snowboarding needs.", "business_id": "4CMY6DwWo41UdwzE-TUW9g", "stars": 5, "date": "2013-01-21", "type": "review"}
