{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "9cCTmiJ7hz35rHIdr8n9kA", "review_id": "_2XfYypJQASFfqPDr3BQZA", "text": "Best Italian Sausage in the Burgh!  Great to use for sandwiches, spaghetti or grilling.  They also have sandwiches (sausage, meatballs) to eat in or take out.  Stuffed Banana Peppers are out of the world.  Sausage is not greasy with natural casings.  You may have seen Ernie Ricci on Cooking with Chris Fennimore on Qed.  Many restaurants in Pittsburgh use Ricci's sausage.  Some days you can watch them make the sausage thru a window.", "business_id": "9tAbTDdYTASHL7EU1e-OWw", "stars": 5, "date": "2010-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Hys6HzKi24j2809kI_7dKA", "review_id": "Nnf2bIWrUMHcSlGqD6RITw", "text": "I love Whole Foods!  I know that it's pricey and sometimes people scoff when they hear others say that there are certain things that one can only find at WF but it's TRUE!  I do try to do a lot of my shopping at Trader Joes and Market District, but the Market District on Centre Ave is almost comparable in price for the same products at WF and sometimes a little more expensive.  This WF is clean, well laid out, and the staff overall are helpful and friendly though I've run into some employees with attitude particularly at the checkouts, but overall it's a great store and you just have to know that not everything is organic (always read your labels) and that the parking lot will always be a nightmare.  Overall this is a great Whole Foods just avoid shopping here just before any major holiday because it's always madness!", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 4, "date": "2015-02-10", "type": "review"}
{"votes": {"funny": 11, "useful": 15, "cool": 10}, "user_id": "9OZH1Ecw-qUkCW5MS0NefA", "review_id": "NvANy-3_M7Ga4I_UU2kB4w", "text": "Word on the street had it this place has the best hot chocolate in PGH, so I knew I needed to check it out.  Unfortunately, I learned the hard way that the hot chocolate is available on a very limited basis--specifically, between 7:30am and 12:30pm on Saturdays.  It took me three visits to figure this out: The first time, I came at 4pm on Sat. (out of it for the day), and the second time, I came before noon on Sun. (no hot chocolate served on Sun.).  The third time, when I arrived at 12:15pm on Sat. on a bitterly cold Dec. day, was the charm.\n\nSo how was this mythical hot chocolate?  It was good, but not quite what I expected.  When another reviewer described it as \"thick [and] pudding-like,\" I expected something served in a bowl-like cup that I'd have to attack with a spoon.  Instead, I received a thick, but drinkable, chocolate liquid served in a paper cup (see photo).  Was it indeed the best hot chocolate in PGH?  Yeah, I guess--at least out of the hot chocolates I've tried.  Was it worth $4?  Maybe (see answer to point 1). Would I go all the way to the Strip specifically to get it again?  Doubtful.\n\nIn addition to the hot chocolate, I picked up a peppermint-spangled chocolate bar.  It was quite pricy (around $8), but the owner, who I asked if there was a smaller version (no), talked up the maker, so I decided to give it a try.  I had similar feelings about it to the ones I had about the hot chocolate.  Was it good?  Yes.  Was it worth $8?  Probably not.\n\nAs others have mentioned, the owner (the older woman) is a bit lacking in social graces, as I observed from her abrupt answers to my inquiries about the hot chocolate (I felt like she was the hot chocolate Nazi, akin to Seinfeld's soup Nazi).  Even the time when it was available, she introduced some confusion into my interaction with the employee working at the hot chocolate bar.  However, she did a great job talking up that chocolate bar!\n\nI'd be willing to come back to try the gelato when the weather warms up (I'll update this review if I do).  I strongly suspect I'd have a similar reaction to the one I did for the hot chocolate and chocolate bar, however.  3.5 stars.", "business_id": "gFT2yXDXJ1qfuGOSfSU5Bw", "stars": 3, "date": "2015-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1_jp_aTjqF4NaumpMRpyCw", "review_id": "-CkErnVn-wIkdBBsMYqhLw", "text": "Love this place. You can't be a Pittsburgher unless you've been to Penn Mac. \n\nIf you're Italian, it doesn't get much better than this. And remember that Monty Python cheese shop skit? Well unlike that, this place has everything. \n\nSmells delicious, looks like a classic Italian grocer. Quintessential Strip shop. Check it out.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2012-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "nHsj0cHOiroAsmDfF50BtA", "review_id": "eB3m8QzHxYFAlqFPwn-hzQ", "text": "Reid's is a fun little market where you can find eclectic grocery items that you might not find anywhere else.  It's fun to browse the few aisles to see what else is in the world out there besides what's offered in your local Harris Teeter.  The only bad thing is that the pricing is a little higher than I usually like to pay, but it's fun to splurge every once in awhile.  \n\nIf you're hungry, grab a small bite at the cafe or hot bar and sit indoors or outdoors (and watch the lightrail pass by).  Again, prices are a little higher for the basically self-serve food items, but sometimes you've just gotta support your local non-chain markets.", "business_id": "Ak6ThDexfSFwoajgOpio8g", "stars": 4, "date": "2008-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "knNUOTx3EdmAhV5KTXCn5g", "review_id": "QUoAcTOlDHuT5PWbE960RA", "text": "I SERIOUSLY LOVE THIS PLACE!!  Every time I'm in town, I have to make a stop here.  It reminds me of Atlanta's old Eatzi's.  Everything is good here!  You can design your own sandwich or salad, they roll fresh sushi, they have a case full of amazing dishes to be heated, and of course the amazing bakery & cheese area.  I only give it 4 stars instead of 5 because it is pricey.  I really wish they would open a location in Atlanta, hint hint!!!", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 4, "date": "2013-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "v7GD9EmR4lGaXUwgL6CZKQ", "review_id": "0SKkKKFIVdn2abb4by-7nw", "text": "Great little shop next to the highway. Super friendly staff offering up tons of samples. The cheese all seemed to be local/their brand. Beer prices were quite fair as well. I'll be stopping here again!", "business_id": "jpxlSFhdrtbNyxS6vB036A", "stars": 5, "date": "2014-12-28", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "XzIKZTb4I-7wW4BjKwV2Mw", "review_id": "RFSUaAL8NieSUGlsS6naoA", "text": "I'm a student without a car and I walk a few miles round-trip and taking the bus just to come to Old Time for all my deli and meat needs. \n\nThough their selection is pretty extensive, ranging from USDA prime cuts, homemade plates, seafood, frozen stuff, a barrel of pickles, variety of cheeses, etc. The place has the family/homey vibe and that's what seems to set it apart from the very institutionalized food that students like me are used to on and close to campus. But I've matured enough in taste to realize that quality food usually doesn't come from Walmart or Meijer, and that the trek to Old Time is worth it even in the dead of winter for the friendly service, local feel, and most importantly, exceptional food.\n\nI've had quite a few things from here, I particularly enjoy the deli roast beef and pepperoni. As far as meats go I'm a big fan of the petite sirloins and also the filets. I've got a couple crab cakes in the freezer that I haven't tried yet but look amazing. The large twice-baked or loaded potatoes are absolutely to die for! The only things I don't much care for here are the coleslaw and provolone cheese, the latter is the \"picante\" provolone and it isn't the same as what I get back home, it seems.\n\nThe prices to me are maybe a little higher than average, but you definitely get what you pay for in terms of quality and you know the money is in local hands. Quality and locality are two factors that I often consider to overshadow price and should be especially important aspects to anyone who cares about what they eat. \n\nRegardless, Old Time is the water in the figurative desert when it comes to having quality meat, seafood and other food items in the Champaign-Urbana area.", "business_id": "niK-GkBZ_RIFscfy-nH1rg", "stars": 5, "date": "2015-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6pC5j-hfP4xLZB2W0Wi1vg", "review_id": "qewuCqvjzD0gTHS6vJwtsg", "text": "fun place to stop for a treat if you're trecking across campus.  perfectly located just off the quad on wright st.  pretty good flavor and rather fresh.  they stopped making my favorite  piece in their collection; the earl grey truffle, so minus one star for creating a love affair with an unavailable partner.", "business_id": "31LKw0AjFdCvGH2fIE0cwQ", "stars": 4, "date": "2007-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "viizjKdHXHcMEG9jvmCRwQ", "review_id": "dN0dOpvjhK349TVUTyZvcA", "text": "This is a place not to miss! We have been to all the Mexican spots in the Valley (Los Dos Molinos, TeePee, Nando's, Ajo Al's,) and this is our new favorite!\n\nWe decided to give this place a try after a few years of living here and had a great authentic experience. The huevos rancheros were amazing and my husband had the chicken tacos- which were fantastic!\n\nDon't be scared away by what part of town it's in- it adds to the experience! Be sure to get a pastry to go, the bakery is amazing!", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2011-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "saNCRlGYQEBkgpvalJsvRw", "review_id": "uyOYElQe7BkHr_xswQW89Q", "text": "Always a destination when the family is in town from Colorado.  As for me, I'm spoiled, just three short miles north on Central.  You just can't beat a breakfast of a lovely hot Chai latte and a bagel and cream cheese...all for about $5.  LIke I said, I'm spoiled :)", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 5, "date": "2007-01-22", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "ThlEVnHMImzss2RhqMX6XA", "review_id": "e9u6mT0k5a4wybbkbsK21A", "text": "It is a sweet tooth heaven!\n\nPersonally, I do not buy all of my groceries here as they can get bit expensive but I do visit AJ's for many other things such as flowers, fruits&veggies and my all time favorite BAKERY!\n\nThe have an amazing selection of cakes, pastries, and any other sweets you may crave. For many different occasions I ordered cakes from Aj's and it was never disappointment. \n\nMy all times favorite is their big fruit tart cake. It is dangerously delicious. Order it for your next event if you like fruit tarts and believe me, you will nor regret it. \n\nFruits and veggies selection is great. I love to go there for some of my seasonal fruits and veggies. They absolutely have great selection. Same goes for their flowers selection. From nice, fresh birds of paradise to Lilly,s to - you name it. \n\nThe staff is always nice and friendly as well. I am glad AJ's is part of my neighborhood.", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 4, "date": "2015-02-24", "type": "review"}
{"votes": {"funny": 4, "useful": 2, "cool": 2}, "user_id": "0o0VMEJeQY0pAAZ9nxErBA", "review_id": "zf7jsuBdwx-fXjsXAanagg", "text": "You can't beat Shriner's meat!! \nAfter a visit to Short Leash dogs (they serve Shriner's meats) I had to go to the source. \nI am of German decent and grew up with some dang good weenies. They have to be in a natural casing with a great flavor and snap. We got two pounds and they are marvelous, just pick them up and dip in some good mustard and you are set. \nWe also bought some traditional brats. These were the best I have ever had. The flavor was outstanding. \nLast but not least we got some of the bacon. They will slice it to your preferred thickness and boy is it good! \nThe prices here are fair especially considering the quality you receive. \n\nGo get some! (Wieners that is) :)", "business_id": "XRBTHOXaJK_AJ2wy5mX_1A", "stars": 5, "date": "2010-12-09", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 1}, "user_id": "pEVf8GRshP9HUkSpizc9LA", "review_id": "sSQCfN1Q5I_zUdxKd4nesA", "text": "We have driven by this place for years and have never stopped in...boy, were we missing out!  We picked out several items for a picnic and had a great feast - salami, bierwurst, swiss cheese, pretzel sticks, sparkling water and Haribo gummies.  The staff is so pleasant and helpful and the prices are very reasonable, but make sure you remember your cash...no credit cards accepted!\n\nI'll definitely be back for rouladen, potato dumplings, mustard, red cabbage and other tasty treats!", "business_id": "fhLb0v5NBj93D7PLQpFXfQ", "stars": 4, "date": "2014-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 6}, "user_id": "fczQCSmaWF78toLEmb0Zsw", "review_id": "IM3CA76iBr0BIonzG2ikiQ", "text": "Yes, it's expensive, but it's such a treat, and I haven't found another organic grocery in town that has the quality produce, salad bar, cheese selection, meats, seafood, etc... and it all tastes so fresh, healthy, and good!\n\nI returned home to an empty refrigerator after being away on vacation and  since it was New Year's Day, I wanted to start off on the right foot.  So, I went to a yoga class and then headed over to Whole Foods to stock up.  I spent over $100 and brought home 4 bags worth of miscellaneous items to fill up my kitchen with.  (That will probably last me all of a week if I'm lucky).\n\nI will say that the fruit is some of the best I've had in awhile... watermelon, honeydew, mango, and blueberries.  They also have great soup selection - (I purchased chicken noodle, split pea, mushroom barley, and egg flower) and if you want a sweet treat without the guilt, try Bubbies Homemade Mochi Ice Cream.  I've had both the mango and vanilla flavors and they are delicous!\n\nQuality products, impressive selection, helpful staff, and central location... I will be back to visit often, Whole Foods - even if you are a little pricey :)", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 4, "date": "2008-01-02", "type": "review"}
{"votes": {"funny": 4, "useful": 0, "cool": 0}, "user_id": "RGKsDTsV3aVvD8AaZfD6Hg", "review_id": "RHJETgH6L9mu7etrNLpjlg", "text": "I bought a smoothie and a different price came up at the register than the sign and also the $1 promotion was not showing up. Juliana was my cashier and instead of helping me she rolled her eyes and laughed at me. Only after I had to press the issue was she willing to call the bakery to confirm the price. When bakery called her back she said, \"I'm not even going to answer them\" and proceeded to help the person next in line!\n\nI was just standing there waiting to be acknowledged. It was like I was a burden to her just cause I wanted her to do her job!\n\nI shop at whole foods a couple of times a day (coffee in the morning, usually get a smoothie for lunch and my regular groceries) and only had a positive experience. I'm such a whole food fan and this seem so out of place with the whole foods that I experienced in the past. Hope you can resolve this issue ASAP!\n\n\n***i heard from several including an employee friend of mine that after I left Juliana and her coworker Mikelyn Sierra were mocking me and laughing at me.", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 1, "date": "2015-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "c_WtbGlViMy6YEvDGAZPeA", "review_id": "0VvTw2yStY7HwrV4QNlZbQ", "text": "Fresh tortilla, just made. Huge selection of fresh produce. The butcher has everything you can imagine. Fresh fish looked beautiful. Had a $3.50 lunch that was great? Salsa  and guacamole bar , all fresh fresh fresh. Great place to shop for a party.", "business_id": "iyjEqYqSk-mAya95A9hW8w", "stars": 4, "date": "2013-02-21", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 2}, "user_id": "JMzBDe-MWkazzG0BNE8oEA", "review_id": "6ASm96QaZdzPGs2uKixtIg", "text": "I took my out-of-town visitor here based on the rave reviews other yelpers gave it and, let me just say, there was no disappointment!  It was a bit chilly because we had to eat outside in mid-January, but they had heat lamps out to make sure people didn't freeze their arses off (however, it would be wise to bring a jacket depending on how sensitive to cold ya are).\n\nAs soon as we got there, a nice young waitress brought out a basket of scones and muffins in case we wanted to buy any for $2.95.  I had some kind of almond sweet delicious-ness of a muffin and it was well worth the 3 bucks.  I then ordered a la carte and had eggs and rosemary taters.  My friend had a mushroom and tomato omelette.  Boy did we enjoy ourselves.  It was a very pleasant, airy, light-hearted kind of environment, complete with little finches chirping and flitting about here and there as if you were in the movie \"Willow\" or something.  My friend couldn't deny the finches crumbs from her tasty herbed biscuit.  If it were me, I woulda scarfed down the whole thing and said to hell with the finches. \n\nEither way, we both had a wonderful time.  It was a great way to end her visit to Arizona before her flight back to North Carolina.  Although the prices were a little bit on the higher side (hovering around 10 bucks a dish, including bottomless coffee), it was well worth it.  And it's also refreshing to visit a breakfast place that actually attempts to be organic and doesn't deep-fry everything it serves.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 5, "date": "2008-01-23", "type": "review"}
