{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "EcJiDfkjgErhCx8KnRitSg", "review_id": "13ay7_ovvsWzqsUStHdZIA", "text": "One of my absolute favorite places to eat in Pittsburgh.  The meals are a little bit more expensive than you normally want to eat as a student (I probably spend $20-25 with appetizer and dessert), but the food makes this hole-in-the-wall truly worth a trip.\n\nChristo is the owner of the restaurant and was at one time employed upon the Onassis yacht.  Years ago when I first came to his restaurant, he was the head waiter on a staff of one.  More recently when I have gone, there have been other hired waiters.  The service isn't great, but it's not terrible either.\n\nThe food offerings include standard middle eastern fare: hummus, baba ghanouj, phyllo-dough wrapped pockets, and kabobs.  The desserts also include standard middle eastern desserts like baklava and strong coffees, but the signature dessert is the Onassis dessert, a syrup-soaked cake topped with custard and whipped cream, dusted with cinnamon.  The last time I was there, he had added a chocolate Onassis dessert, which was also excellent.\n\nMy normal meal there consists of baba ghanouj (which is about the best I've ever had....it's a real hit-or-miss dish, and Christo's knocks it out of the park), a combination (lamb & chicken) kabob, and the Onassis dessert.\n\nIt's out of the way, but well worth a trip!", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 5, "date": "2006-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "64GBbjUMe_n6Yhi7OH_H6Q", "review_id": "pUPUsLHVg237wYZHFcNyxA", "text": "Excellent excellent food! You won't be disappointed. The service is a little slow, but it could have just been the waitress we had.", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 5, "date": "2015-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tBiAJtAB4RsXiB4uWxtWrA", "review_id": "YvlRKRAM7SGhDz26IyFtIA", "text": "Love the tea here. You will not want to go back to Panera tea after you've had the brewed mint tea. Iced tea is just as good. I don't know what he does or puts in it but this man knows his tea. \n\nThe food is simple, a little plain but good. Never gotten fries here but the hummus is smooth and has a nice flavor with good quality olive oil, the pitas are warm and fresh (and you get  two so they will fill you up) and I actually like the kufta here better than Layalina's which is saying something because I love that place (but am not a fan of their kufta). Lentil soup is also tasty and filling. The  falafel does leave something to be desired.\n\nI also don't mind the guy behind the counter. If you absolutely must be kowtowed to with fake enthusiasm and mock-pleasure to serve you this is not your place. This guy smiles at you its genuine.", "business_id": "-1oj6-fkP-iO6OyW8QBqPg", "stars": 4, "date": "2015-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "G3sRl4XNtO24PPGLCyOcUg", "review_id": "enBTH47D6vWBZH6gMnyLQg", "text": "These cats got it all going for them. Taste, price and coolness. If your all into the scene and need to be catered to, like your paris hilton, don't bother. It also has a great market selection, mine being the deserts and sweets. The plates have some good choice, I go the way of a main kabob, rice (mmmm), hummus and fries. They also lay on the pita bread, so its all good here. Oh, and be sure to bring someone you can converse with or something to read, its not fast food, so relax.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dTvhBR0ObL3SAIUZYoKfOQ", "review_id": "2T9DOEJpgnlOfKYoNfuNKQ", "text": "This is a great place. Lady is very friendly. Tomato Soup is excellent. Nice family atmosphere, relaxing and charming for a night out.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 4, "date": "2010-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2qRcLHvZoJM-a6e3k1Y8mA", "review_id": "uB6RY7kOtV0r4RMnrZkRpg", "text": "The owner was absolutely rude. I came with 3 friends, he was acting as if we own him for coming there. Food was ok, not the best persian food i tried but not the worse. Too bad the owner does ruin his business with his attitude because i would of came back if it wasnt for horrible service i received. Too bad he lost 4 customers because none of us will support this business", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 1, "date": "2012-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EFI3DZhBVyM0hkDCDzJmUg", "review_id": "kwKIh-gFRXXQm0PrB02_pg", "text": "Very friendly service followed by good food! We had beef kabob and gyro wrap, and they were very good.  Only thing I found odd was the appetizer was served last and without pita.", "business_id": "ky6c1bhp1695tWLfnyKOyQ", "stars": 4, "date": "2013-01-04", "type": "review"}
