{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gJrxGgc60GdX9iJhYaM_ZQ", "review_id": "51yxEFT8AceNL8H5TD-ujw", "text": "i love this place more than any other place ever before in the history of places and me eating at them.\nnot only is the ice cream made from local heroes,turner dairy, but the man who operates this fine establishment, chuck page, is one of the friendliest people in pittsburgh.\nthere are so many options, i hate to say i've gotten the same thing more than twice, \na couple of faves:\nthin mint artic swirl\ncoffee ice cream with chocolate sprinkles\nsouthside shake!!!(sundae on top of a milkshake) best ever!", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2010-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HAzO8gXQJhQB4fBK70zIrg", "review_id": "EBQva4DWqjDLXCMWLRVdDQ", "text": "I was browsing the internet earlier this month, and I came across #treavorfrombaskinrobbins and was immediately intrigued. I did some research and found that a handsome young man named Treavor worked at the nearest Baskin Robbins from me. I grabbed my wallet and immediately ran out the door even though my mother had just cut her hand. \"I don't have time for this!\" I yelled as I ran out the door with my wallet in my hand. 10 minutes and several car crashes later, and I was down to Baskin Robbins as fast as I could go. I still had the cops on me so I had to move quickly into the store. Then, everything seemed to move in slow motion. Two younger workers were talking to the owner about how they are out of ice cream in a strange voice. It seemed hectic in there, but I ran up to the counter and jumped over to see Treavor from Baskin Robbins. A bloody kitchen, a totaled car and a taze to the abdomen was all worth getting to see him in person. I now have a restraining order on Treavor and am banned from BR but I don't care. #treavorfrombaskinrobbins", "business_id": "jt5lOq4Ab33j4LdfjrK42Q", "stars": 5, "date": "2014-12-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "t9l2POeWgS-SLEHmyZrs6w", "review_id": "cMyqda8fDyeA06Tyoc0OKQ", "text": "5 stars because \n\n1) it's Culver's and \n\n2) I refuse to let an LA resident (Tracy G) weigh down the supreme awesomeness that is Culver's based on her misunderstanding of cheese curd availability!", "business_id": "kiAsweI4sOjDzGyz3Y_HsQ", "stars": 5, "date": "2008-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gLFICNwtaTH4teH-nIRJ5w", "review_id": "1AHpU3vptXDhlkGloMPSeg", "text": "Upon reading reviews on raspado \"shaved ice\" my curiosity lead me to this place. Originally was to try the one located in Mesa but was in the west side so decided to try this place. The two raspados I tried were delicious. I had the mango and the gf had the strawberry raspado. Not that sweet but enough to hit the palette. Would recommend this place to anyone that is in the area.", "business_id": "9pYBiLe3k5Gi-AJqRklXcQ", "stars": 5, "date": "2015-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hFh2O43n69ne6kjxeMVGSg", "review_id": "9GWhdWLv_i0EoGKb2hrnaw", "text": "Very friendly staff.  We had chocolate malt and half chocolate/Jamaica shake.  Both were delish.", "business_id": "qeqrsjWXc15KmlK5Z8580Q", "stars": 4, "date": "2014-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vNFxfUDTPgZRgV3EHnkmJg", "review_id": "bGVjpOmVqU3Mi23ye0veBA", "text": "This is our fave frozen yogurt place.  It reminds me of the 1st froyo places that sprung up in the 80's.  The yogurt is not the sickly sweet kind you find at most places around the valley.  The flavors change daily and the prices are super good.  They even have a 1/2 size for the littlest customer.  Its a 15 minute drive for us - but we make it!", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 5, "date": "2009-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gXmtPKLWPZJeJX_KPw54HA", "review_id": "aMn2J6kokP5Dce4IrzbYWQ", "text": "I just went to this location. I ordered a mint Oreo blizzard. Got home only to find out it was a regular Oreo blizzard. Went back through the drive-through told them the order was wrong and they took the regular Oreo blizzard back and said they would get me a new one. When I pulled away I took the lid off only to realize my blizzard was like a milkshake. They must have just added the mint into the regular Oreo blizzard. The blizzard that was already half melted. If I wanted a milkshake, I would have ordered a milkshake. Not to mention it was $2.99 for a mini which might be all of 4 oz.", "business_id": "waNp5VTwK1ZRF3XkOwSaSw", "stars": 1, "date": "2015-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-67ZJFCNB7Ewf5AwDu_3ww", "review_id": "homx1ouaN7CUpHBEnVUusw", "text": "Delicious prickly pear and boysenberry although a little too sweet.  Live music.  Comfortable.", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 4, "date": "2013-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eZxEpRYESMVZZJYawYNj6Q", "review_id": "mKmWAY0chA-i6nrMexMZJA", "text": "Great experience here, came here in desperate need for a birthday cake. They were very nice, great customer service, very helpful. This location had a promotion going on at the time so I got a large ice cream strawberry cheesecake for a great price and they even wrote happy birthday on it. Will definitely be back. The cake was a big hit at the party, every one loved it. The only thing that I wish they could have done different was add actual cake into the ice cream cake. It was delicious, but it was really just ice cream in the shape of cake no cake in it besides little cheese cake bits.", "business_id": "m4_H2hZKSoA2iu5aqrP1nA", "stars": 4, "date": "2015-01-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "IXPibgPATsJo1uVaevcH6g", "review_id": "b5v5kwtG5PiB6XcdLqqgRg", "text": "Seedy, walk-up window serving up frozen custard!\n\nIt's just off the strip, but the location is pretty ghetto.  What's worse is we couldn't find it at first and drove around even more ghetto neighbourhoods before we found it.  We were almost too afraid to get out of a car until we saw a 6-year old walk up to the window :)  Then we got out.\n\nIt's not terribly different from a soft-serve sundae from Dairy Queen.  The custard is just a lot more dense.  Their junior sizes are still bigger than anything I can finish though.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2011-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WF_j005D3hox1s7hAEXOHg", "review_id": "QOxvObDzHZDeTuego0i1uw", "text": "I sooooo wanted this place to be amazing! Everything about it seemed awesome. Its super local in a sort of hidden location. Its been in business for ever and the reviews all rave about it. It may of been a bad night when I went and I am willing to try again to see if my experience was a fluke.\n\nI had the Luv-it special sundae which was good but I felt like it was not really custard and seemed much closer to ice-cream in texture and flavor. It was mostly melted by the time the served it to me and it was not a particularly hot night.\n\n It all tasted good but it just was not what I was expecting. Ill give it a second try and hope that I can amend this review.    \n\nCASH ONLY SO COME PREPARED!!!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 3, "date": "2013-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Voo4Q5uUuesTj_EOTu_u8g", "review_id": "yIqBKfuXjD8uKaikhUleLQ", "text": "This place is the bomb! I love lemon and orange flavors the best!!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2014-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "-8nKxCccauLQuEo6jPTPNg", "review_id": "Qr1hbfxevS7TpkfvcGyanw", "text": "how can you not give 5 stars to a place run by Andy, after he names his new dog Sydney Crosby?  A classic Pittsburgh cultural institution--been around on Atwood Street for 25 years now.  Took some great ideas of handmade ice cream, and made them even better.  One of the very first to offer \"add-ins\" (sugary candies, chocolates you could sprinkle on top of your ice cream cone or cup).  The waffle cones that they make there fill the air with a baked smell that gets you salivating.   The Decade may be gone, but Dave and Andy's lives on.  My one stop in Pittsburgh, no matter what.", "business_id": "oN552ZjtfJWV7CMtftGrfA", "stars": 5, "date": "2007-12-15", "type": "review"}
