{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SVd6Re9tpabo413b4LghYw", "review_id": "A8ITgfa0LEuays5I8t2gKw", "text": "This is a very odd restaurant.  I was here once and probably won't be back.  The people who work here were doing a lot of screaming at each other, we were the only 2 people in the restaurant but our food took about 45 minutes to come, and the quality of the food wasn't that great.  You can definitely get better Vietnamese elsewhere in the city.\n\nWith all the wonderful dining options in the Strip, I'm confused as to how this place survives.", "business_id": "GQloL8yRHymE0SGZq-B0zQ", "stars": 2, "date": "2009-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_yr6U4gdIEw_cwtMX8-Ytw", "review_id": "yDk54c1NglZExI3sDPJxdw", "text": "This Place is Under New Management!! They have a new chef who can cook a wonderful pho... These parts it's hard to get pho that tastes like home cooking. The people are super nice and they have wonderful service. They now have great customer service and my soup came out faster than McDonalds! It's a whole new restaurant in downtown. I highly suggest the soups especially in this cold weather!", "business_id": "GQloL8yRHymE0SGZq-B0zQ", "stars": 5, "date": "2010-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Y1NQn63ZHR5emm9kQBZUxA", "review_id": "op32UhWT_jhHLaiQCMe_gg", "text": "I am baffled by some of the low reviews this place got. It looks kind of like a hole in the wall--OK, it is a hole in the wall--but it's got tasty, tasty pho. And, as Al L. mentioned, they give you tea when you come in, a nice touch.\n\nI once ordered some kind of curry. It was not bad, but not spectacular. I'm sticking with pho from now on, as it is really fantastic. \n\nHighly recommended.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 4, "date": "2008-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Q6PGJ1UylVz9bby8wQqEPg", "review_id": "Y14smuLX2kBk6tC2WLkgYA", "text": "I am really conflicted about this place.  I always have a great time when I go, the prices are reasonable (especially vegetarian) and the staff are super friendly.\n\nThat said, the food is OK.  It lacks some of the fresh condiments that I have grown so accustomed to with Vietnamese (basil, cilantro, mint, etc).  If you're looking for something to warm your soul on a 5 degree Pittsburgh day, this will do it.\n\nBYOB before 9, no corkage fee.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 3, "date": "2009-02-07", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "Zff7xm0J-C7hV1z3j-JipQ", "review_id": "DzdiUtcV3oPYajrnaX3zzw", "text": "No way, dudes. Go down the street and get some tastier food at Tram's Kitchen. The grub is better, the restaurant itself is a little cleaner (not saying much on either account), and the water even tastes better. \n\nReally. I'm not joking about the water.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 2, "date": "2009-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oWeFzXlvs1Ms5Y1TT8i5-Q", "review_id": "Cbi70L-jl2bfgX6ncuSMAw", "text": "There's nothing like a piping hot bowl of pho on a cold winter night. The restaurant even starts you out with a nice pot of tea once you come in.\n\nNormally I just order a bowl of pho because I know it'll come out quickly but since I was starving today I decided to try out one of their pork+shrimp spring rolls too. In hindsight, that was a bad choice. Although they were supposed to be cold, it had a tingle of the ingredients inside being undercooked and the pork was actually just the same type of ham you would find in a salad bar. It wasn't what I expected.\n\nI got the #19 (beef and tripe pho) and my friend got the #20 beef balls and it came out smelling pretty nicely and in an extra large bowl. The traditional uncooked bean curd and basil leaves accommodated it but as I started to eat more and more of it, I feel that the taste began to taste marginally...blander. Regardless, for $7.50 for the #19 and $7.25 for the #20, it was a pretty good value and I personally prefer this over its rival down the street, Tram's kitchen.\n\nJust remember that this place is CASH ONLY", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 3, "date": "2009-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Io6At5jerTw_PpWj1hYXeA", "review_id": "xt9dogkZtf6f4DGEBsbpUw", "text": "I am about to make a bold statement; Pho Minh is better than Tram's (and I love Tram's).\n\nI had the chicken pho, and it was absolutely amazing. The summer rolls were fantastic as well, and the owners of Pho Minh are delightful people. I will be going back for pho very, very soon.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 5, "date": "2010-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ai1t-UCf0ElszaDajWlnwg", "review_id": "ygp9XOjgpkkXNmLjKdedIA", "text": "I love this place because it really reminds me of my time in Vietnam.  It's not the classiest joint by quite a stretch, but it took me back to sitting in Pho restaurants or street vendors in Saigon.  Man, I bet I ate at least four bowls of the stuff a day.  Take that for what you will, and I'm sure it's not for everybody.  For those peeps, there is a PF Changs at the Waterfront for you.  There are a few other Vietnamese places that I've tried and really enjoyed, but this place will always be close to my heart.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 5, "date": "2010-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0xIQG-NrqMx5id6yJpQp8Q", "review_id": "CIc8ehYO45Wusj0yNVL_JA", "text": "I absolutely LOVE noodle soups.  From cold winter nights to a late night snack in the summer, a big bowl of pho always hits the spot (as does ramen or beef noodle soup, but that'll be for other reviews).\n\nPho Minh serves up pho with debatably the most fragrant beef broth in Pittsburgh.  Their pho also always comes with sliced rare beef, which is sometimes cooked well done at other pho places (COUGH TRAM's KITCHEN COUGH).  Also, they do some of the \"unique\" parts such as tripe, which I am a fan of.\n\nService is reasonably fast, the atmosphere is reasonably dingy in a comforting homey way, and the food is tasty.  Yes, if I want some fresh spring rolls (Gi cun), I'll probably head to Tram's, but when I want pho, I want no nonsense pho, and Pho Minh is the place to be.\n\nOn a sidenote; their other dishes are pretty good too, but for me I'm heading to Pho Minh for their pho.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 4, "date": "2010-02-03", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "YLft4yXd5lni3kkPgSVDmQ", "review_id": "_0cNgRI5uWXpz1pCKolNmA", "text": "We traversed the Pittsburgh snowglobe post yoga for Pho. Generally Tram's has been the pho destination. I was curious to try another spot.\n\nRestaurant is cash only. Smaller and less \"warm\" than Trams, but with the same familiar atmosphere. The menu is more extensive than Trams, and seems to have a greater variety of rice and vermicelli dishes. \n\nThe spring rolls were okay - gummy thick wrapper - the tofu was a bit too soft. \n\nGreen papaya salad with shrimp and nuts - refreshing however I personally resent when restaurants use frozen \"supermarket\" grade shrimp and charge premium. With several fish resources in the Strip I really expect better quality shrimp.\n\nPho was much lighter than what I have become accustomed to - and in contrast to another reviewer - I thought it was much less saltier than what I have had at Trams. The beef at Pho Minh was a better quality or cooked longer because I didnt experience the tendony gristle I sometimes find in the pho at the other place, It was soft and well flavored =). \n\nI would come back here for Pho again or to try something else off the menu. I think they can improve on the quality of some of the ingredients, but I appreciate the much less filling, and less bloating Pho..", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 3, "date": "2011-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J_q8jN623uew8ZzMChXBCA", "review_id": "jgrodT__dozozGGT6dyedw", "text": "I am a big fan of Pho Minh, and I have eaten here more than a dozen times.  I love how the Pho is served with fresh Thai Basil and lime on the side.  The Pho is delicious, and perhaps the best in Pittsburgh.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 4, "date": "2012-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b-LKB42aOvcWnoHJJGdUJA", "review_id": "zxVAptam9YE2Gq9ZAgNVkA", "text": "Best place for pho in the city. I have tried them all and this is the one I always come back to for more. The woman who takes your order is quick and abrupt, but she is very friendly once you get to know her. I love the little old man who seats you when you come in the door, and serves you tea. You have to ask for water if you want it. I love the tofu in lemongrass curry as an appetizer. The sauce is so good I wish I could put it on everything. I usually get pho with chicken or the special\nSpicy soup. The ingredients are always so fresh and just taste so healthy. The food is very flavorful and perfect after a weekend of riding my snowboard. If you are looking for authentic pho then this is the place to go!", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 5, "date": "2012-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KvVxMBkrcOHW3DkdxUsquQ", "review_id": "iDCWCwGTkkBwxXSIIBIe4g", "text": "Here is another restaurant experience that will make me wanna go there often, for more than just delicious food.. I have stopped by only once and had spicy beef woth lemongrass pho, and boy it was some spicy heaven ! My friends around the table tried different pho as well as some vegetarian tofu stir fry, and I didnt hear a complaint.. \n\nBut the real impressive story about this place is not just food.. a bunch of us went there one afternoon.. we got there a few minutes after 2pm, time they close for lunch.. we saw the timing amd started walking back towards our car and one lady came out and called us back.. they served us with absolutely no rush and an older lady that cooked/prepared our food was genuinely happy to see us walk away happy.. when I eat that kind of food, it not only makes my body happy but mind happier.. people that know that food is not really bound by time but happines to serve.. !", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 4, "date": "2015-01-17", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "hFhHmfwRPkN81NJZkrnRjQ", "review_id": "sNsMzJRC8emkmWI4sh_BJg", "text": "Why do so many people in Pittsburgh love this place? The other day someone asked me... where's your favourite Vietnamese food? I told them that I didn't know which was my favourite, but I could tell you which was my least favourite: Tram's. \n\nI don't even care about the decor or seating etc. Usually the best Vietnamese comes from fairly sketchy looking joints. \n\nI had their \"Special\" noodle bowl which is their version of Bun thit nuong. It looked a mess. The spring rolls were cut up brutally and then everything was tossed in. Usually when you order this at other place, it doesn't come \"pre-mixed.\" Honestly, it looked like someone had already starting eating this. I thought to myself... \"Okay they have a different presentation style.\" \n\nBut as I ate, I was even more disappointed. They hardly put any fresh vegetables in it, and the vermicelli is overcooked. The spring rolls were completely soggy. \n\nI don't think their menu is limited though, it seemed fairly typical. I don't know, maybe their Pho is better, but I'm already too disappointed to come back.\n\nAfter reading other people's reviews and trying other Vietnamese places around the city and then having Vietnamese food in Toronto(at an average place), I'm throughly convinced that people in this city have no idea what Vietnamese food is supposed to taste like.\n\nOh and one last thing... do you actually believe that their food is vegetarian? I guess the joke's on you.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 1, "date": "2008-01-15", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 3}, "user_id": "bU8oW3KjhH4OmCbW1z4xUA", "review_id": "rPzM6LCQL9uj6aLt7ufJBw", "text": "I do have a special place in my stomach for Tram's kitchen and I try to eat there every now and again.  Pho is a good meal to warm you up in the winter and this place is a great place to stop in for a yummy dinner.  I have been a little wary to go off the beaten path of the spring rolls and the Pho, so I got the spring rolls and the chicken peanut soup (I think that is what it was called).  It was very close to the chicken Pho, except it had less noodles, more veggies, and a little different twist on the sauce with some crunched peanuts that settled at the bottom and a bit more spice.  The dishes definitely didn't disappoint.  The parking is on the street (which is usually pretty empty after working hours), and the ambiance seems to have perked up a little bit with what I think is a new coat of baby blue paint and some new flowery table cloths.  Don't worry though, the mother of pearl wall art is still there, and your chances of not understanding your server is still high.  The prices are cheap, the grub is good, and the place is uh... rustic, oh yeah, and bring cash!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2008-12-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Huio39UNBWn0LJUtR8vAjQ", "review_id": "B1vI8wwYVL8qS8Whf7Cmvw", "text": "Great pho and fresh spring rolls!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2009-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q88CP93-o66z1c97fKLknQ", "review_id": "KjBvCtvzyrEwRio4BNWx9Q", "text": "I have had Vietnamese food in Boston, DC, SF, Chicago, and Pittsburgh.  The Pho here is certainly on a par with the other places that I have sampled.  What sets Tram's apart for me are 2 things.  1.  The spicy prawn is really different.  I am not sure what it is that gives it its unique flavor and appeal but I have never had anything like it.  2.  The spring rolls are absolutely amazing.  I know that the spring rolls should technically be very basic--the ingredients are generally well understood etc, there are no real secrets etc.  For whatever reason, these are the best springs I have ever had.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2009-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "q88CP93-o66z1c97fKLknQ", "review_id": "cnUVKsciRY0CyGQaoTX48g", "text": "I have had Vietnamese food in Boston, DC, SF, Chicago, and Pittsburgh.  The Pho here is certainly on a par with the other places that I have sampled.  What sets Tram's apart for me are 2 things.  1.  The spicy prawn is really different.  I am not sure what it is that gives it its unique flavor and appeal but I have never had anything like it.  2.  The spring rolls are absolutely amazing.  I know that the spring rolls should technically be very basic--the ingredients are generally well understood etc, there are no real secrets etc.  For whatever reason, these are the best springs I have ever had.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2009-02-07", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "EjxE1dW0WVqOezpKqFN5kQ", "review_id": "nzzB2Ho8j2lroEq4Iq0Rsw", "text": "CASH ONLY!!! Due to work being called off because of loss of electricity I thought i would take this opportunity to venture to Trams.  When i arrived i was the first and only one there.  I was expecting to see many different types of PHO on the menu, but there was only one line with PHO on it.  This made it easier for me to make my decision even though the vermicelli bowls were tempting.  I also ordered two spring rolls.   The spring rolls came out and they were much bigger than i was expecting.  They tasted fresh, crunchy and filled with goodness such as shrimp, pork, noodles, and herbs.  I dipped them in a chili sauce as well as a brown sauce to complete this delicious experience.  The only negative of my meal was I ordered chicken and shrimp pho and ended up getting Beef pho.  I am guessing i confused the server/owner while i was ordering.   I didn't bother to complain since i figured he wouldn't understand anyways, so i began to consume my pho.  Every aspect of the dish was perfect from the noodles, to the beef to the sprouts that I got to dunk in every so often.  My meal ended up costing $14 without tip and was worth every penny.  By the time I left every table was filled.  Cant wait for our next February Tropical Storm.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2009-02-12", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 3}, "user_id": "rSJpILdRkajArb6QIGDJVA", "review_id": "egyBG0F_dMGEYJPAKyiVJA", "text": "I feel I must defend Tram's... \n\nPoint one: It's dirty. \n\nSo it's not a freakin' Panera Bread in there... with 7 high school students wiping down tables at all times. It's not super clean, so what? Please name for me a spotlessly clean Vietnamese restaurant in the city of Pittsburgh. Seriously, take a spin through the alley behind Pho Minh in Garfield, *ahem* sorry in the Penn Avenue Arts District... Their backyard is like an open sewer... I've still eaten there and lived to tell the tale.\n\nPoint two: But for hipsters, it would not be in business. \n\nDon't give yourselves too much credit, my friends. In the ancient era B.C.H. (Before Coming of Hipsters), Tram's still did a brisk business serving tasty if basic Pittsburgh-Vietnamese cuisine (they've taken the shimp curry over french fries off the menu, but you can still order it) to those who would brave the wilds of Lawrenceville (a distinctly unfashionable address, circa 1995) to get it. Did Tram's have all but a corner on the market at the time? Sure. Would people return if it was terrible? I would hope not. \n\nAs for the food, I am no student of Vietnamese cuisine, but the bun, or as it's billed here: \"grilled meat (why they don't just call it pork is a mystery, perhaps they're leaving their options open?) over vermicelli\" (pronounced \"ver-miss-eh-lee,\" by our esteemed host) is tasty and filling, as are the spring rolls. I can't comment on the pho as I have had too many inedible-mystery-tendon experiences at \"real\" Vietnamese restaurants in \"real\" cites to \"really\" be all that excited about the dish... \n\nLong lives Tram's! Haters beware....", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2010-02-25", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "0dOIBpvjn90hr_56Zi178g", "review_id": "HHaqIqnPmoMOrd6ZTSYj8A", "text": "This is the only pho place... taste is better than Lulu's that's pho sure.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2010-12-07", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "10dhZs996tBtJq2nd_mcRg", "review_id": "dXAL31HK1TFiR6DufXe1AQ", "text": "the pho was good, but not great.\n\ni got the meatball pho just because you don't see that everyday, and the meatballs and broth were excellent.\n\nthe problem i had was with the noodles. they use thin clear noodles that break apart when you go at them with the chopsticks. if they switched up the noodles to something thicker, the pho would be right on with amazing pho i have had in nyc.\n\nthe service could have also been better - not because of the language barrier, but in attentiveness.\n\nso good not great - but will go back.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 3, "date": "2011-01-01", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 2}, "user_id": "5TAhar6dylT65O1uI-O_Pg", "review_id": "4uA7NU-AqRKg92Kog0QP-g", "text": "Tram's is effing FANTASTIC.  \n\nThe soup (pho) is... You can't even call it \"soup\".  It transcends soup.  It's a fragrant, hazy lemongrass experience, like wading through a stream in the hot Viet summer, cooled with basil and lime.  \n\nAnd, it's served by a Vietnamese man with one arm, and he is awesome.  God bless him.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2011-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "MzyUCQD3CtIQ0ifkYKl8iQ", "review_id": "GGO_lvowW4sOySRVPdLMMQ", "text": "Kind of a hole in the wall. But it's authentic and the spring rolls are great; plus, when you order take-out they give you extra hot sauce and package everything separately, so nothing gets mushy on the way home.  Worth your while.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2011-01-18", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "JEvkfVPf_DuhX-ntE5L6bQ", "review_id": "C6wG8rgRhlnM4tMmnEsFoQ", "text": "I have been feeling very sluggish and found out that I am lacking in dietary fiber. It's hard to make good food from scratch during the week bc of my busy schedule. A great friend of mine suggested loading up on Pho a few times a week. I decided to try the vegetarian tofu Pho and veggie spring roles. Everything was so crisp and fresh, bean sprouts, lime, and a sweet spicey sauce. The broth was extremely flavorful and since I work down the street I have found a new place to get something healthy and delicious! \n\nTake cash, no credit cards.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2011-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HPjABAYUiNyrzY6pA8gBFQ", "review_id": "5yOYrjXXMOX0D0SILVlnpQ", "text": "It's not for the service, it's not for the style, it's for the Pho! Tofu lemongrass is equally amazing.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2011-02-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "GoRGZRIybABjx8kuZrbnDw", "review_id": "1usvYkQGKddsjL1Sn3U1rw", "text": "Tram's is a pretty small place, and when first coming here, the interior reminded me your typical cheap Chinese restaurant. But the setting is fine for eating. I don't expect anything fancy.\n\nI got the pho tai, which was not bad. They filled up a big bowl and also had hosin sauce and whatever that red rooster hot sauce (whatever it's called) for the optional additional flavor. In comparison to some of the other pho that I have had, I didn't find the broth to be as flavorful. Everything tasted fresh, though.\n\nWe also got egg rolls and spring rolls. They were both good. I preferred the spring rolls.\n\nService was a little slow. We had to flag down our waiter, but that's not too big a deal. I also felt that the preparation could have been quicker, but I don't know jack about making Vietnamese food besides comparisons to other restaurants.\n\nOverall, this place isn't bad, and I'd recommend you check it out if it's close by. My one friend recommended another place in Pittsburgh, but I can't remember the name and I'm too lazy to ask him. Maybe I'll update later and let you know. I'm a big help, right?", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 3, "date": "2011-12-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "cMlY-nsvj9DCrv_lLVp5Fg", "review_id": "1z-205n3X8JkraEYEO0-AA", "text": "Hands down, the best Spring Rolls in the city.\n\nThe vibe is more about the food, less about the decor. You will find joints like this all over SOMA in San francisco, but not so much here in the 'burgh. Damn, are we lucky or what???!\n\nI first ordered the Spring Rolls with shrimp, and they came out bursting with them! Two huge beautiful rolls. Patrick ordered the seafood pho, which was so bright and vibrant, delicious. And generous with the seafoods! It was the ocean in a bowl. I also ordered the lemongrass tofu appetizer- blown away! Perfectly lemon-y, nice texture and the best combo of salty and sweet. I dumped my peanut sauce all over it and chowed down like it was my last meal on earth. SO good!!!!!!\n\nService is prompt. You won't get hugs and big smiles, but you will get amazingly authentic Vietnamese food!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2011-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "f5I3Que-1U4F6fPL3FQuRg", "review_id": "IvBQhx6Oh6VAy2xWmPy4Ww", "text": "I had a friend recommend this place. Can't complain about the parking or seating, it's Bloomfield for crying out loud! \n\nThe food was take out quality. I loved my noodle and beef bowl with plenty of chili pepper added. ( can't begin to name it, began with a v and is at the bottom of the menu.) but the spring rolls were burnt to a crisp. I'm willing to give them another chance.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 3, "date": "2012-01-08", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "So32N7bSbUd1RwhFtI6jTQ", "review_id": "4GLNZ_KGxcqGuQs8lklDbA", "text": "I am tempted to talk down on the cleanliness of this restaurant. It is truly a greasy spoon joint, but I kind of like that about Tram's Kitchen. \nThe tables are covered with those lamented cloth table cloths that can be wiped down. \nOur server had dirty nails too. \n\n I just happened upon this restaurant completely by accident. I was walking down the street after visiting my nephew at Children's Hospital.  The food was so good. I had the spicy prawn dish the only thing I would change would be to order two servicing. The \"prawns\" in the dish obviously weren't prawns but fairly large sized shrimps. The sauce was the best it had a really good spicy chilli flavor. I also had the lemon grass tofu.  For a fan of tofu I think it would have been enjoyable the tofu was tender and well seasoned. I am trying to find an opportunity to get back to eat at Tram's Kitchen. They are very reasonable priced here lunch for two was under $30.00 which is a bonus for a college student budget.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2012-01-23", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "dLSjb4_VFZz07xBcsR4BiA", "review_id": "nTsEg11_b7zBYNWcGP5yKA", "text": "I feel like this place is right out of a Seinfeld episode.  It's in a tiny space on Penn Ave in Lawrenceville.  Tram is a gentleman who doesn't like it if you're not ready to order immediately when he comes to your table.  Because you only get about 2 minutes to look at the menu, the pressure's on when you sit down!\n\nThe food here is tasty and inexpensive.  The Pho is perfect on a cold winter day.  I'll agree with other reviewers that the spring rolls are delicious as well.\n\nIt gets pretty crowded during the weekday lunch rush.  Recommended if you're in the neighborhood!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 3, "date": "2012-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "uaeRFopwclE8AaB8vWHoYQ", "review_id": "noSlxpQNSD34gHLz7yAxVg", "text": "I am from Houston, since I came here I've been searching for the perfect bowl of pho. I have to say this is the closest thing yet from home!!! Good pho with fair pricing, doesn't get ebtter than this.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2012-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "q7MrNVt1FE23rwtWmPYWHg", "review_id": "rfzDR-1iW3EIDAd-d4ZpMw", "text": "Darren and I came here last weekend, and I liked it very much. The \"Saigon Soup\" was sssoooooo goood! I couldn't finish it! The portion was so generous. I also liked their egg rolls and the sauce that came with them. The owner was nice to us but doesn't play around! You have to order fast because the place is always full! I appreciated how he found a table and some chairs to seat us even though they were superbusy. I love Asian food, and now I have another place to enjoy.\n\nI didn't mind the decor, and the place isn't \"dirty\" either. What do people expect? The Le Mont?", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2012-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "bfcW6VO8ajNb5IXvRQ_xhQ", "review_id": "wQGgfFDSy-LmGTGHZjw-YQ", "text": "This hole-in-the-wall place is just fantastic. I can never resist the spring rolls and often ask for extra dipping sauce. If you want something tastes but aren't feeling adventurous, go for the chicken curry - I have never been let down. Other great dishes include the vermicelli and their version of a pad Thai.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2012-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gcjQt9J7TdnMhZGwDHuXcA", "review_id": "xq5NVmSPSVqd_cbT1WezXw", "text": "love the pho and spring rolls !!! the best vietonamese restaurant !! i", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2012-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "xzqF2AhLwxM5wA-gZa2KCA", "review_id": "OzpRSzAzBrAGAI4jxxWRtw", "text": "I don't see the hype. Bad service, bland food.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 2, "date": "2012-02-13", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "M7dQtu04OsFQRQLZqlJlxw", "review_id": "ePHenuG6nqPuyZnZJn-_sw", "text": "It's been said that you should never eat Chinese Food in Arkansas and never, EVER eat Cambodian food if it's right next door to a veterinary hospital.  I can say with certainty, though, that eating Vietnamese food in Pittsburgh is as healthy and delicious (and remarkably similar to) eating it anywhere else.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2012-02-21", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "GMtILOfAHXUMrfMgLPG0gg", "review_id": "vguyRkUwyBl32XwMycBrrw", "text": "I've been there a couple of times and found their Pho to be really good and the best I've been able to find in Pittsburgh so far.  Their pho menu is kind of limited though in it's options.  It would have been nice to see some more variety in the ingredients.  I also had the spring rolls as an appetizer which were good.  Servers were very friendly and it seems to be a family run place. Food comes up very quickly.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2012-12-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "-Gdjho_gZhgTXkYmSPy0qw", "review_id": "s6XgO5OjgUL-5bLTcdmr1Q", "text": "I came here once and ordered pho, and I was very disappointed. Bland broth, tough meat, I didn't get the Tram's hype. Not that I've ever tried mind-blowing pho (I've only eaten it in Pennsylvania, which is probably the problem) but this was even worse than most.\n\nHowever, I've since been back and ordered the bun. Now I was impressed! Specifically with the version doused in coconut milk--I love coconut anything, and on top of vermicelli noodles with a squirt of hoisin and sriracha, it was heaven. Only thing is, I don't like the selection of vegetables they use. Onions and broccoli just aren't my jam, and my favorite veggie to have with my bun, cucumber, was sadly MIA from Tram's version.\n\nI do consider myself to be a little bit of a fresh spring roll connoisseur (ooookay, maybe not, but I eat them a lot), and Tram's are good, but not my favorite in the city. I know, a lot of people are all about Tram's rolls, but I like mine with lots of Thai basil, and you can barely taste it in theirs. They're still super fresh with a good amount of meat, so this is just a matter of preferences, not quality.\n\nRegardless of the meh pho, I can't stress enough that it's totally worth it to come here for the coconut milk bun! Delicious!!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2013-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "fWdZAtSjlqtt1tkDlVdnyg", "review_id": "e58PgkTuUjqYkuo-tsjbZQ", "text": "Embrace the quirkiness of this place and you may just fall in love with it. Food is good, I always get one of their soups. Its nice that they recently cleaned up a little, repainted and all. cash only, but ATM in the front. nice insider tip for ppl from out of town.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2013-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "NjIjQMKAqBUE1Nw0QgsP1Q", "review_id": "FqHqqqcrsAn21voDHnd3PA", "text": "I'm looking for a Pho I can come home to late at night. A Pho I can dream about on cold days. I have an official Pho place- Pho Bang in NYC- but it's obviously too far away. So far I haven't phound the pho I'm looking for in Pittsburgh. I will persevere and try the other places, but it's hard to live up to Pho Bang. The spring rolls were good. So was the little boy who took my order.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 3, "date": "2013-01-30", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 6}, "user_id": "x1tqIO9G1RX3qd6Y4TsHXg", "review_id": "_MzK65467hBr8LJ7R3BbIQ", "text": "I would give this place 6 stars if that were an option. I have been going to Tram's for the past 3 years, and love the place. Not sure how the people who have given it negative reviews could arrive at their conclusions, but hey, everyone's entitled to his/her opinion, right?\n\nEverything I have ever ordered here has come fast and fresh. Spring Rolls are a must, and can be made a meal unto themselves. Chicken fried rice is astounding. Vermicelli dishes are a great treat in the warmer months (because they come at a cool temperature, and are almost salad-like), and the chicken pho is transcendent.\n\nYes, transcendent.\n\nI yearn for the cold months because it means that I can eat the stuff - my wife at first was horrified that I referred to chicken pho as the best broth based food I had ever eaten. Hell, she even made fun of me for craving 'chicken soup,' which most people would simply make at home, but this is not like anything at home, this is the ultimate comfort dish. The beef pho is good, but their chicken version is simply the best.\n\nI know that they had some problems with their accreditation, but that appears to be well in their past, and frankly, I never had a single problem with their food before that. (That's more than I can say for many other restaurants I've been to...)", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2013-02-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qywVBBmOW9fbqWDi3XO8rQ", "review_id": "n9EgtAQ667BxHZdkf396qg", "text": "It's about 2.5. We live in Squirrel Hill with a lot of good restaurants and I thought this place is better than where we usually go. The pho is the cheapest in Pittsburgh but the portion is very small. The spring roll is the most expensive vietnamese spring roll. \nI ordered the Saigon soup for myself and #17 for my husband. My husband likes it because he is an america and like sweet stuff. Everything with coconut is good for him. These dishes we got doesn't look like what they showed on the photo. The Vietnamese place in Squirrel hill or the stripe is a lot better.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 2, "date": "2013-12-25", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "6MF4uF1_u0b45jIdGIueuQ", "review_id": "XeeNeMq9abxTKhXagtJWkw", "text": "This is my go-to place for Pho. I normally get take out since I live in the area, but sitting here is quite an experience too. This is authentic Vietnamese food. \n\nHighly recommend to anyone looking for some good Pho.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2013-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HXhYt_M1nDOfFse0_QlLww", "review_id": "s6UVuz7lZl5EbprpyOJl1g", "text": "Talk about a hole in the wall. No frills at all here. One page paper menu with only a handful of dishes on it. Worth it for the pho and the price can't be beat.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2014-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WWEsFYU7Xx01TNXi55nc0w", "review_id": "YuJG1JinSthxr9s32Qp1dA", "text": "One of my favorite places in Pittsburgh. Spring rolls, egg rolls, lemon grass tofu appetizer, pho are an absolute must!! So authentic and delicious", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2014-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XaM_5yEzH6lkcTWg-81V_A", "review_id": "xaiSG8GgwGRIvK8t4IwDZw", "text": "Oh man... I wish I still lived in PGH. I really miss this place. Food was ALWAYS awesome. I liked their Banana dessert too!!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2014-01-07", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "KR7R5PrrbMsLMsNcntHvAA", "review_id": "Sbw33qWwtTC8F2b43HKrNQ", "text": "Located in Lawrenceville, Trams is a BYOB, cash-only operation. The restaurant is unassuming and actually rather on the dingy side. I didn't expect much in the way of atmosphere, but I could've done without the grease splatters in the wall. The service was prompt and efficient, if lacking in any charm. We sampled the veggie spring rolls (fabulous!), the lemongrass tofu (meh!  Boring and lacking), the tofu curry (pretty good), and the Pho, which was my favorite dish and was excellent.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2014-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pdSSJvhPYKAKA6VtJ6OzkA", "review_id": "CMHJIMUaKgPIq3guxiTVWw", "text": "First of all, Tram's has been cited by the Allegheny Health Department for code violations like not storing meat at proper temperatures. I also personally know several people who have gotten violently ill from eating there. If that's not enough to stop you, read on.\n\nI feel like people who like this place are confusing \"dirty & mean\" with authentic. The staff are unpleasant and it doesn't feel like a place you'd want someone cooking food. \n\nAnd finally, sure, all of this could be different if the food was good, but in my opinion, it is not. Bland and disappointing, the Pho most of all. Pittsburgh has so many great asian restaurants, including other Vietnamese options, that I don't see any reason to eat here.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 1, "date": "2014-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7BK78dNeaZj_-q67G_pE_A", "review_id": "CmquC_Zw_FUv7H8A4TBxKg", "text": "The quality of the food here is fantastic, and I'm happy that's where they spend their money. I don't need Tram's to be impressive in its appearance because I realize it has been and always will be a family run restaurant. It's about the food, and the food here nails it every visit. \n\nI've read reviews commenting on the service, which there is some truth to the level of character presented in the service. Speaking of which, don't stare at Tram, I'm sure he's well aware of the fact that he's missing an arm. Does that get in the way of the delicious food? Not one bit. Don't think that he doesn't understand you either, don't be ignorant. I just heard a woman almost yelling at him. \n\nThe food is great, just try something that sounds good to you. The decor will fade from your mind as you and your companion(s) get a taste of Vietnam in Pittsburgh. Try the fresh spring rolls, better than the egg rolls. I also recommend the vermicelli and coconut milk with shrimp. The pho, curry, and mung bean noodle soup are also wonderful. At the price point of Tram's you can eat here often and eventually try everything. \n\nOh yeah. It's cash only. That makes me like it even more. No separate checks!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2014-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cYcE8-A33YH8XHfzcTLIpw", "review_id": "KpvXBe-4H3VEDnzz8pezHA", "text": "The food is really as good as it gets for Vietnamese cuisine. Their soups are very flavorful.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2014-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XXOoB-v74AbweZYekybfQA", "review_id": "2rXc8-qqUnbcAt2VgCpeHQ", "text": "This is one of my first stops whenever I return to Pittsburgh.   I always gets the vegetarian spring rolls and a spicy, sate, vegetarian pho.   Wow.  So good.   \n\nThe spring rolls travel well (for short periods of time) and are perfect for a picnic.  If you show up at a friend's door with a package of Tram's spring rolls, you will unquestionably make their day.   \n\nThe pho is great for take out if you are feeling a little under the weather.   They will package it up for you with the ingredients nicely separated, so that nothing gets soggy in transit.   \n\nTram's is cash only.   Enjoy.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2014-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KFRC_GdFH-bXb6brxd7WvQ", "review_id": "bHJXscccO_WPQrvSVsxP9g", "text": "Best Vietnamese in Pittsburgh. The quality of the food in amazing. The service is, as most places with delicious food, not incredible. I don't let that bother me, as the food is worth a drive. I love the chicken pho, and also the curry vermicelli. I enjoy a Vietnamese coffee on occasion, and have sampled most everything on the relatively small menu. Many plates of spring rolls and fresh rolls have passed through my lips, and as I type this I honestly don't know why I am not there right now. In fact, I tried to go there today, but unfortunately they're closed Mondays. Bring cash!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2015-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "px1yoPKoMyD_xrhiYRN7mA", "review_id": "5NjgdQgYi13UoqVYzCt8Yw", "text": "Tram's is one of the few restaurants that I would say you must experience for yourself. The food is good, and sometimes great. But the atmosphere and service are as unique as it gets.\n\nFYI, the owner is Mr. Lee, Tram is his daughter.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2015-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZXdShWzFs1RGCHg53Cpr-g", "review_id": "wh5kiP9k_54vscOz5NZ4Pg", "text": "Maybe I'm spoiled with good Vietnamese food but this was terrible. The chicken in the pho was a mixture of shredded white and dark meat, noodles were larger than normal, and basil was not fresh and the worst part was the flavorless broth. Also questionable tofu in the vegetarian spring rolls.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 1, "date": "2015-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "N-OCcNVeCGXVj2Eeg85cAw", "review_id": "fCZrg51W8XkME9eOFy9AfA", "text": "For the longest time, I heard Tram's Kitchen was the place to go for great Vietnamese food.  So off I went with another one of my foodie friends last night.  \n\nI walked in, and the decor was...pretty bad, but that's pretty run-of-the-mill for a chinese  restaurant.  Watermelons on the tablecloths, generic wall decor...whatever.\n\nWe ended up seating ourselves, I'm still not sure if we were supposed to or not, the staff wasn't very talkative, I'm assuming they didn't speak much english.  We both ordered the Beef Pho and Shrimp Spring Rolls.\n\nSo first major hiccup, our Pho came out, no sign of the spring rolls, though our waiter asked us \"You want any spring roll?\"\n\n\"Yes.  Yes I do.\" -.-\n\nWell we get our spring rolls, pretty good.  The sauce they brought out with it seemed like hoisin sauce with a pretty odd taste.  One piece of halved shrimp was all I found in the roll, which was a bummer, but it was cheap, so I'll let it slide.\n\nThe pho was great.  Nice aromatics, a hint of cinnamon, a decent amount of beef for the price, and a heaping plate of sprouts and limes to accompany it.  The only complaints I could pose were that it was very mild, and it a bit spicier.\n\nOverall, above average, but my quest for the perfect Pho continues.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2015-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-lOEWM9zb-TzsvT4J1tdkQ", "review_id": "ZjQ8OoJt8y1WitnVqTTxVg", "text": "This is my go to place for lunch on my days off of work. As a vegan they are pretty knowledgable and have a decent amount of options. You just have to watch out for fish sauce on cold vegetable salads even if you order them with tofu. And pho is made with ox tail, so I haven't had that. My favorite food to order is the garlic tofu with rice and the spring rolls with tofu. Yum! This place is cash only, but they have an ATM so they got you covered.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2015-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nHQtXSSyn8Ms0t3KC_V06A", "review_id": "Xt0yiqM01uLIAKgCT3UF0Q", "text": "This place is no frills, but the food is delicious. Must try the lemongrass tofu with rice! Downfall is cash only.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2015-12-22", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "3CKkDPMS9Uft43gB8_iBIw", "review_id": "a_tPSt5IVBM_Yl3GQUO1Hg", "text": "I have been going to \"TLC\" for a couple years now.  This is a great spot located near the movies at the Scottsdale 101 shopping center.  The number one thing, in my opinion, about restaraunts is consistency.  I have never been let down here.  I usually get the same thing everytime i go so I cant really comment on the depth of the menu.  But if you like Summer spring rolls which are packed with noodles, shrimp, pork, chicken wrapped in rice paper you will love the ones at Tea Light.  I follow the summer rolls with a huge bowl of chicken soup.  This soup has a phenominal flavor with asian noodles and a genorous amount of tasty chicken.  There are sauces left out on the tables so you can make your soup as spicy hot as you want.  The very casual order counter and friendly service allows for an evironment that makes you feel like you are at the neighhborhood Cafe.  You will see the same people there everytime and they are as nice and appreciative of your business as they can be.   If you are looking for a good lunch or a healthy dinner...TLC is your spot!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2008-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "OQMOgqS1NFIyAW4i66iDYA", "review_id": "nY3T6FeffqDQqqu4E21cnA", "text": "I've recently become a huge pho fan, so I was excited to try Tea Light Cafe, which is right in my neighborhood.  While it wasn't quite as authentic as a place I was recently turned onto in Downtown LA, it was still very tasty  and fresh.  A cup of hot tea and a bowl of pho is always wonderful on a cold winter day!  At $8, it's enough for two to share, or it can be two meals for one person!  We don't exactly have a lot of independent ethnic restaurants in this area, so it's nice to have Tea Light Cafe serving up yummy Vietnamese food - hopefully people will continue to support it.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2008-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MfRSd53TgXPqfVzbccLoKg", "review_id": "6YF_WMqSWejWKRS5T-IJBA", "text": "Even though the temps are over 100 for what seems to be like 9 months a year these days, I always make time for the soup here.  Tea Light is only like 10 minutes from the office, and it is one of my favorites.\n\nI've eaten here more times than I can count, and I always get the Chicken or Beef soup.  The soup broth is always so flavorful and robust.  I love that they bring you fresh herbs and bean sprouts to add it right at the last second.  It really makes the soup seem so fresh.  I know I shouldn't, but I always finish the broth.  it just seems too good to waste...  \n\nThe spring rolls are a nice change of pace as well.  They aren't fried, and are packed with good stuff.  One of my co-workers always gets the Pork Ball sandwich, and I don't think you could pry it from his hands while eating it.\n\nThe people that run this restaurant are really friendly and always have a smile on their face.  The restaurant itself is tiny, so don't be discouraged if you cannot find a seat right away.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2009-02-03", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "cEIeuU0-4fX0Y4qCUW3PwQ", "review_id": "wUvgmVbl3Ny-4vKHYDOH_A", "text": "Love this place! I moved here last year from Orlando, which has a suprisingly robust Vietnamese community and tons of great places to get Vietnamese food. I was thrilled to find this near my home and the food is great.\n\nI usually get the chicken pho, which is very good. It comes with sprouts and spices like cilantro, jalapenos, scallions, etc. that you can add to the broth. This allos you to make it as mild or spicy as your mood demands and allows you to play \"chef\" a little, which is an added bonus.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2009-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wC1CPV5bf--bDLtlhNSPLg", "review_id": "2Q2hfk1zXXpwx54XwPb2wQ", "text": "I am so in love with their chicken pho! Its the best I've had so far! I get takeout sometimes because it is right near work. FYI-Picking up to go is really hard on weekends because of the lack of parking due to the movie theater and other businesses.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2009-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "D9IbFBww5VL3NBiKic4Kqg", "review_id": "AlZ-6nwDjumcPfLPzQNA5Q", "text": "I was craving Bun with chicken and discovered this place via Yelp. Turns out it's about a mile from me which is a huge bonus. Their Bun totally hit the spot and I really liked the egg rolls. I just moved here from the Bay Area where Vietnamese is plentiful. TLC ranks up there with the good CA places I've eaten at. \n\nThe atmosphere of the place is warm and cute. Very clean. The owner was there and very nice. Took good care of my needs. You will be seeing me there on a regular basis :)", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2009-12-08", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "LP0bl3GKToABt3lnpSvA2w", "review_id": "NXQ_lGnoBBNyMjq6GSpPTg", "text": "Thanks, Yelp for helping me find this delicious restaurant in Scottsdale. \n\nThey offer good pho! You can get 2 spring rolls, 2 egg rolls, and a pho for under $10 for lunch. The ingredients were fresh and tasty.\n\nIt can get very crowded due to the small space inside. However, on a nice day, you can enjoy your meal on the patio. This place is popular and busy...order first, find a seat next. The atmosphere is great!\n\nThey don't give out order numbers, but instead someone passes your table with a cart of food and asks you what you ordered. Remember what you ordered! Once you tell the guy, he'll hand you your meal.\n\nTry this place the next time you are in the mood for pho and are in the area!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2009-12-27", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "NLDDaat42UQXQCOpU4e2TA", "review_id": "P_fwXCh8jocfQgo9z3dPBw", "text": "Loved it!\n\nThis is a terrific alternative to the \"look alike\" restaurants in Scottsdale.\n\nIt is not fancy, meaning there are no white table cloths and the like, but the food is so good and light (and very well portioned)!\n\nThe service is friendly and good.  I had to grab my own drinks and silverware, but the table was cleared immediately when I finished.\n\nAnd the price is right on!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2010-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "6gULsnrmD6fhLXk1DVycOg", "review_id": "DPXaqbd5KfDokmSk-oH5ng", "text": "Great place to get some fast Vietnamese food. The semi-sit down environment is good for eating out on your lunch break. Tables are clean and have a cool zen-like touch with pebbles and stones embedded inside the glass.\n\nBut lets talk food folks. The portions are pretty light, but it sure is tasty. BBQ beef is delicious, and they also have a small boba tea and iced coffee offering. Good stuff.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2010-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XyaIK2hN3SNMohT5AbKxbg", "review_id": "A6I9pYC2plJ5pZcYRw2Ajw", "text": "Been a customer ever since the Cine Capri Theatre opened...have never really ventured too far from the noodle bowls untll tonight.  Ordered the Pork Meatball Sandwich and I have got to say, it is one of the top ten sandwiches I have eaten in my life.  (I lived in NY and SF so I know a thing or two about a good sandwich)  A great mix of crusty french bread, cilantro, shredded carrots, vietnamese sweet hot dressing, tasty garlic gingery pork meatballs and lettuce!  \n\nAlso ordered hot tea, which is outside of the box for me, it was served in a cast iron tea kettle with an infuser inside.  An excellent blend of organic tea and citrus peel.  Really good!  \n\nHave always enjoyed the food and service here... the owners are always friendly and grateful!  If you are looking for a healthier alternative to an inexpensive meal before showtime this is the place.  Now I think I am headed there just for the sandwich, skip the darn show!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2010-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7KWW212wobbTzEw1xPhgDw", "review_id": "GpTTkc0kJzOrkNn0XlzHVA", "text": "Based on the reviews and a friend's recommendation, I decided to try the Tea Light Cafe tonight for take-out chicken pho.\n\nPlacing the order was conversationally awkward due to the restaurant's telephone, but, other than my brief confusion about the time I should come pick my order up, ordering was really glitch free.\n\nUpon pick up, I appreciated the cute restaurant for its small outdoor seating, its understated-but-pleasing decor, and its overall cleanliness.  It had a comfortable vibe, and I thought I would feel totally comfortable to be boisterously hanging out with friends or family at this great little viet cafe.  I also found my brief interaction with one of the owners to be quite pleasant.\n\nAs for the food, the most important part, I was seriously impressed with the pho.  Take out comes appreciatively packaged as a container of hot broth and a separate container of fresh rice noodle and accoutrements, so that you can mix the pho yourself when you're ready to eat.  The broth was really spectacularly flavorful, and I had to think hard to come up with the bare few examples in my life when I have enjoyed marginally better pho broths.  The quality of the other ingredients (I had the chicken) was excellent.  All in all, it was a wonderful chicken pho.\n\nAt just under eight bucks for take out, I consider this a great value.  I look forward to going back, and will undoubtedly do so soon--I'm looking forward to trying their bun.   And the sandwich recommended by Greg R...\n\nI vacillated on four vs. five stars, and ultimately decided I could only give four based on a single take out dish.  But hopefully after another visit or two, I'll be sufficiently impressed to up it to five stars.  \n\nAn ngon nhé!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2010-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "7KWW212wobbTzEw1xPhgDw", "review_id": "WeqAwTEweZCdGT-5e-TNPw", "text": "Had take out pho (beef) last night, and my friend had the chicken bun.  Just excellent again, and now I'm left wondering why I'm not eating here more frequently than once a month.  The pho broth is consistently excellent, and the beef was served very well, including a well packaged piece of rare beef, as pho should be served.  The ingredients' freshness was superb.  If I didn't mention it before, the packaging, other than being environmentally bad, is very convenient.\n\nMy friend reports his chicken bun was pretty excellent.   \n\nAnyway--five stars for excellent vietnamese take out.  You should be eating here.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2010-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bPWCuFEaVL5F6dT3JgivLw", "review_id": "o0_7ayQJIBBBvpgki9JHlw", "text": "The pork meatball sandwich is the single best sandwich I have ever eaten! The pho is always delicious, shrimp spring rolls are refreshing, and the tea is first rate.\n\nI always feel appreciated when I come here, and I never leave unsatisfied.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2010-12-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "3vML-LnH0dIyHCrqF5xEYw", "review_id": "dxynXcOLAl8R-tKecmmPJw", "text": "I like this place for a quick fix. Love the bbq with noodles/rice, eggrolls are ok but I do love the spring rolls. The only issue I have are the boba drinks, they are not very good at all. I wish they would figure it out because if their boba drinks were better, I'd buy a drink daily, seriously! But I do like the place a lot and I think the new owners are really nice.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2011-01-03", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "0o0VMEJeQY0pAAZ9nxErBA", "review_id": "cLI5t_tSKdrqN3ANu01L5Q", "text": "Found this hidden place by accident. \nYou order at the counter and they bring your food to the table. we started with shrimp and pork spring rolls. They were good and a large portion. \nWhen it comes to Pho the choices are limited to basic chicken or beef. It is definitely aimed towards main stream eaters...nothing exotic here. The chicken Pho was good. The broth was fabulous. \nI would try the bun next time...\nI liked it here and if I was close by I would return. I don't think I will go out of my way to become a regular.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2011-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wW8lHqh4bxBqExx5egbCBA", "review_id": "zqqjg3iHm4zlWvfiLbwJWw", "text": "I get Pho and a taro boba every time I eat here. It's always really well prepared. I wish they had a little bit more variety on their menu, but everything I've had has always been tasty and I love the owner and the staff. Great place to eat before catching a movie", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2011-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LaEj3VpQh7bgpAZLzSRRrw", "review_id": "Tbw1BAbILKko5Nkoh5FjSA", "text": "This is the closest place that offers a decent bowl of pho, my comfort food on a cold or cloudy day. I always have my order taken out since this little place is always packed during lunch time. \n\nI've tried the Pho with beef (#11), the Tea lite sandwich with grilled beef, and the Bun (#3). And my fav is the Pho, especially the broth! The sandwich was okay, i thought the grilled beef was a bit too salty.. And the Bun was good, but the same as the sandwich, salty beef...\n\nThis is definitely a good place to grab a quick lunch with limited time, fast, affordable, and tasty!!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2011-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SVh9z88-JO2ZSIa1TFVJvg", "review_id": "4pw4dBkmyhZr5Xy5I6GoYg", "text": "Love the beef bun, chicken pho and the egg rolls. Really, you can't go wrong here!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2011-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E57V8rkRheDr5g_9MNAQwA", "review_id": "G_GG30jaOAps2RrwYdnOVQ", "text": "Tea Light Cafe is a great restaurant, no doubt about it.  The only reason for not ticking in at five stars is because of the lack of depth to the menu.  Other than that, the food is impeccable, owners are extremely friendly and the decor and seats always accommodate.  \n\nI always order the same thing here, the chicken pho.  I grab a table next to the wall and proceed to wait approx three minutes for that cart to come rolling out of the kitchen with various goodies, all for my consumption!  The huge bowl of soup that arrives, steaming all the way to your table, has a fantastic aroma.  \n\nI highly recommend hitting this place up after you see a movie in the theater next door.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2011-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "-_kYtEITbj5khWLI1P9TDQ", "review_id": "J3vkO9Aliz_ayLD5NJuj3A", "text": "I'm from Washington D.C. where Pho is a way of life.  I started working in Phoenix/Scottsdale about 15 months ago and was always craving a bowl of pho when I started to miss D.C.  Given my love of Yelp! you'd think I'd have just got on here but it just never occurred to me.\n\nI found this place purely by happenstance when  going to lunch with co-workers at Buffalo Wild Wings.  I now go to Tea Light Cafe sometimes twice a week.\n\nI've only been indulging in pho for about five to six years but in that time span I've enjoyed pho in over 50 pho specific or vietnamese restaurants.  Tea Light definitely scores in my top 10. \n\nSo specific to the pho.  Tea Light is more of a vietnamese cafe/restaurant that has pho than a \"pho spot\" where the menu might be 20 variations of pho.\n\nSo here go the important parts:\n\nThe broth - spiced to perfection. I will admit my palate prefers a saltier pho.   That being said I could show up daily and have them put some broth in a thermos and I could drink it all day.  \n\nThe noodles - the rice noodles have just the right texture and the right quantity.\n\nMeat - Compared to more pho specific spots Tea Light only offers beef or chicken compared to flank steak and round eye or tripe and brisket.  Though it's limited to beef or chicken I feel the meat is consistently of good quality and portion.  The meat appears butchered properly and I never find myself trying to resolve some giant chunk of fat.  Very lean and very yummy.\n\nVeggies - A little lacking.  Typically you get twice as many bean sprouts, jalapeno peppers and cilantro.  I'm willing to assume though that if I actually asked for more they would give it to me.\n\nI'm sorry to say that given the quality of their pho I never tried anything else on their menu.  I plan on coming back whenever my need for pho becomes unbearable or if I'm just driving by.  This place is great.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2011-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vKP7WtaHcHbCxnUiSpKmzQ", "review_id": "2LgYYS6gT9wGob8YIVR2qw", "text": "I eat here at least once a week.  My favorite meal is #14, with extra beef.  Chris and his wife are very accommodating, nice, and always welcoming.  The atmosphere is light, fun and the staff always has a smile.  Definitely come here for a great time with some awesome Vietnamese food!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2011-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FbdB9KXyuvT8rC_zmqRSuQ", "review_id": "L-T7RriY_zuRo6fdNUPhEA", "text": "One word sums this place up - overrated! It was a Sunday and I tried locating a Thai or Pho establishment and everything nearby was closed except for Tea Lite Cafe.\n\nLocated in a large big box shopping center Tea Lite Cafe is small and was fulled to capacity. When I inquired to the Asian if they had a sign in waiting list he replied no so we had to wait and then place our order and then waited to be seated. \n\nWhen I received my plate of bean spouts, mints, lime and slice jalapenos the portion was the smallest ever for a Pho restaurant. The bowl of pho I received was small with a small amount of meats and was over priced in my opinion. In addition the broth tasted sweet and tasted like sugar was added to the broth!  I don't add any sauces when I eat Pho so this just didn't taste natural at all.\n\nI would not return here again.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 2, "date": "2011-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HFzJb1EnBsB6fD5s-9fXUA", "review_id": "wzTL_EGLsLPv786qUBOipQ", "text": "I totally dig this place because it has some tasty broth for the Pho. I was super confused on how to order and the menu and all that but in the end I just ended up with a bowl of Pho, which was fine with me!\n\nThe broth was so good I really didn't have to add anything to it. \n\nI went in at about 12:45PM. This seems like a place that a lot of people that work in the area go to. The staff was very friendly to everyone and I think that everyone else in there was a local. \n\nPretty good and is going on my list! \n\nOh and to find a Pho place that has a soda fountain machine is rare! Other places usually just give you a can of soda. Not this place. Fountain all the way!\n\nI'd go back, for sure.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2011-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BMFgtVX3usJ-Frwvd1LrGQ", "review_id": "XBHSzlixaajR-sUBSrmX9A", "text": "Great food. Very nice owner. Would come back again.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2012-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hcctCQy3bdZMezrUKkZLtA", "review_id": "WRD9CtlO2c_qyO5ZdKbYQA", "text": "My parents love pho so I've practically been enjoying Vietnamese cuisine since the womb. Ha! No wonder I love it so much myself that it was always on the weekly dinner rotation when I lived in OC. Alas, I moved to North Phoenix and I dont have little pho shops or boba cafes on every street corner. I've learned that I have to drive a ways to Chandler/Mesa to satisfy these cravings. Imagine my surprise when the husband and I noticed Tea Lite Cafe when we changed up our movie theater location this past weekend. Of course, we had to try it out and we'd been dying for some pho for months now.\n\nWe both ordered the beef pho and took a seat. The place is small but there's plenty of seating and still feels spacious. The cashier up front was super friendly and welcoming which was nice. We didn't have to wait too long for our food to arrive...another plus. \n\nThe pho itself has really tasty broth and the beef was nice and tender. I was disappointed by the small portion of bean sprouts, mint leaves and limes that accompanied the soup. I'm used to overflowing plates of these veggies so I can load up my soup to my heart's desire. In fact, my hubby usually counts on me doing this since I end up eating all my veggies and leaving most of the beef for him. Double ha! But the lack of sprouts and mint leaves didn't put a damper on the great taste of the pho. What I did miss was the traditional pho ingredients like tripe, rare steak and tendons. I know, I know...sounds intense but trust me it makes pho taste soooo good. I guess I just have a usual when it comes to pho so I was a little disappointed when I couldn't satisfy my craving to the utmost degree. Woe is me. \n\nBut let me conclude by stating again that the pho here is really good and has a great flavor to the broth. I think the hubby and I will go back since it is so conveniently located to us. It'll definitely do in a pinch although I am sure I will occasionally find myself making the trek to get me some tripe!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2012-01-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Psh8PaEh8c2Wn8YjwyGVvA", "review_id": "jPV04RStVJFGoYw1_EzFfw", "text": "This is the best noodle soup bowl place I can find in the area.  I drive 30+ minutes just to go eat here. They are super fast serving up the noodle soup bowls.  Today I got one to go and it was ready before I paid for it!\n\nThe people are very friendly.  I've also had the spring roll and it was really good too.\n\nRecommend this for a fast, delicious meal.  It always seems to have people eating there. At lunch today it was packed inside and out.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2012-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fksrAfKZYrhCzOjUIoFudw", "review_id": "IsT8z9Svt8-Qv5EjugmEag", "text": "although i gave 3 stars i would go back.  tea lite is close to me so an easy choice to start my pho adventure.  liked the combo that included pho, egg rolls and a spring roll.  nice variety and just the right portion.  i always get pho with seafood but they don't offer it so i was bummed about that.  ordered the beef and liked the taste plus it wasn't salty like some places i've tried.  the combo was about $7 so very reasonably priced.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2012-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5vRPcft8ejLrtH7XeOuNDQ", "review_id": "KXRzcvnafRcoVyCr1kI4Sw", "text": "There are only 3 words you need to say at this place: \"tea, light, special.\" \n\nFor soup lovers out there, this will not disappoint. One area which could be improved is the quality of the meat used (particularly the beef.) Prefer the chicken for this reason. \n\nOverall, great food for a good price.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2012-02-11", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "iwUN95LIaEr75TZE_JC6bg", "review_id": "FnMWp1tXwU_6wxpc4xwvEQ", "text": "It's date night and you're headed to the movies.\nNow the dilemma.\nEat a small mountain of hot, faux-buttered popcorn at the movies, or a little popcorn and a  decent meal afterward.\nI go with both.\nOnly I'm usually too full to eat anything of decent substance after all that popcorn so I typically come here.\nTea Lite Cafe.\n\nIt's cheap and filling and, its under ten bucks.\nI've tried both the chicken based pho and the beef, go with the beef...it has a ton more flavor.\nAnother bonus is how the meat in the soup is all very recognizable, putting that whole dog and cat meat thing to rest.\n\nA large bowl will feed two.\nI weasel most of the meat out of it when my date goes to the bathroom. \nAnd she wonders why I fart so much.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2012-12-01", "type": "review"}
{"votes": {"funny": 3, "useful": 9, "cool": 3}, "user_id": "4ozupHULqGyO42s3zNUzOQ", "review_id": "LO0gcAVT1orqhSrMY4xHqQ", "text": "Tea Lite Cafe's offers a quick and delicious meal. Located in the same complex as the Harkins 101 Theater, Babies-R-Us and several other large shops. Tea Lite offers a nice meal option for shoppers and business people alike. I recently visited with Gabi M, who is an expert (in my eyes at least) when it comes to Vietnamese cuisine and luckily I was with her to guide me through the menu. I wanted to get a full taste of Tea Lite Cafe, so we ended up ordering the Tea Lite Special which comes with spring rolls, egg rolls and Pho (choice of chicken or beef). This is absolutely the way to go, especially if you're a first timer! It provided a nice variety and was large enough to share. It's also very inexpensive and less than $9 for the entire dish! I thoroughly enjoyed the Pho and added hot sauce and the various spices.  \n\nThere's not much to say about the atmosphere because there isn't much to the cafe. It feels like a cafe that you'd find in the busy streets of a big city. It's casual, clean and they featured pictures of the menu items on the wall. The service is incredibly fast too! We barely got our drinks and sat down and our food was already being served! It's perfect for a busy lunch hour. \n\nThe owner was very friendly and helpful during our ordering process. We ordered a decent amount of food and after our meal, I decided that I wanted to try a BOBA because I had never had one before. However, I only had a credit card and they have a $5 limit. The owner was so nice that he ended up just giving me the BOBA because I had already ordered so much. It showed their level of customer service and his gesture went a long way. Meow, what are you waiting for? It's time for you to visit for lunch!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2012-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0mkn2kvu8ZBX7LwCIVg9xw", "review_id": "IsMULTiKLmjLw5oYGA4RGA", "text": "Pho is the best...no need to say any more", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2012-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fuziOdxUTuZGLYx5uIOhSg", "review_id": "5w8SkoRmWbiEsF6-gMf4HA", "text": "I go to Tea Lite Cafe for lunch and I have always enjoyed it. It is priced right and they get you your food quickly. If you are looking for some Pho I would recommend this place to anyone. The flavor is good. The only reason I did not give it 5 stars is because it did not blow me away.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2012-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_T4n3k4_pLDzpAepp7iomg", "review_id": "isbojKIL1T6QMZti2Havdg", "text": "Fast service, clean facility. But...\n\n* Rice noodles in my chicken pho are gummy.\n\n* Bean sprouts are brown / old. Hard to believe a Vietnamese place does not have fresh bean sprouts.\n\n* Chicken in pho IS NOT FRESH. It's processed. Bad form.\n\n* Tiny plate of the traditional side veggies.  Feels skimpy.  I expect more for an eight-dollar bowl of soup.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 2, "date": "2013-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UM6ARMpyqvM2aJ3Wnzwcog", "review_id": "0sPKhDqGwPBodICHAOyFqQ", "text": "Our favorite place for Vietnamese food in north Scottsdale.  Nice folks running the place.  We seem to always get the number 3 but every thing we have had here is good including the pho.  There is a nice outside seating area that is great when the wether is nice.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2013-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yuPBS3fak77lgwO_9SXVYQ", "review_id": "IErlEivgiE8xpTxeeGQw3g", "text": "Yep, I sure am a fan of this tucked away Vietnamese jewel. Tea Lite is located by a nail place and the Cine Capri in N. Scottsdale area. Has a small patio area to dine al fresco also, if you please.\n\nI order the Beef Pho and it is pretty good! Spring rolls and egg rolls never disappoint me either! They turn out a very nice Vietnamese (iced) coffee too - especially when the warmer weather hits. ;)\n\nThis is also the first place that I've seen TV monitor advertising in the bathroom (on the sink hardware). Interesting place!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2013-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_oMJgA8CC8EtcywAsl28SA", "review_id": "yfjaPyhVMBBc9gP_OeEtfw", "text": "Love the Pho, but they could use a little better quality chicken.  Still delicious!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2013-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "thdVzCfKx-DV0zYWqId3pw", "review_id": "-D2w2XBNJeFF3C0dtzX8lA", "text": "Tea Lite Cafe offers a massive amount of food quick and cheap.   While the food is plentiful, it's still pretty light.  You'll be quite full after eating at Tea Lite, but you won't have that slickly heavy feeling that comes with over indulging in most fast food.  It's a great place to stop in before or after hitting up a movie right next door.\n\nMy problem with Tea Lite is the lack of variety in its flavor.  The cilantro in each dish sticks out (not a problem for me but I do know plenty of people that dislike cilantro), but every dish pretty much tastes the same.  The small menu basically offers chicken, beef, or pork as a Pho, Bun or sandwich.  The Pho tasted like the Bun only with brought and a touch of spice from jalapeño.  With the acceptation of the dipping sauce, the Vegetarian Spring Rolls tasted like Bun and Pho, only with the added rubbery texture of the clear rice paper (the tofu tastes just like the chicken).  The hot sauce that's served on the side of the entrees is very good and hot.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2013-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ku4d7S44aDbersYKfqyj1Q", "review_id": "i7PPBdXNGBJ6aBdMvH25VA", "text": "I like my Pho soup stronger but this is still pretty good and reasonably priced. I would recommend this place.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2013-12-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xQZE-L4aLQXoIUyrcFbreA", "review_id": "w6JRMV_2WMatuMaqQqWiKQ", "text": "BEST PHO SOUP IN THE VALLEY! I get the Beef Pho w/ brisket or chicken. Amazing little mom and pop shop! I love the Pho here because not only are the broth & rice noodles delicious but they put green onions in it and give you all the fixings that you want according to your taste. You can put in bean sprouts, thai basil, fish sauce & lemons along with sriracha if you like it spicy.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2013-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Wv5puKwYd4aZzFwyjFZFcg", "review_id": "HYRZm8MnXmS798BFwEuMVQ", "text": "Not a fan of Americanized pho.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 1, "date": "2013-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GiR3tvTaAhZSnWKZ24dR_Q", "review_id": "MBQOkmu3_-_qM7rc3TziWg", "text": "Great little place to grab lunch or Pho to go! My boyfriend and I come here often since it's not too far from our home. Definitely a place we go to weekly. We usually get the same thing every time we go and have not been disappointed. I'm hoping they add a few things to their menu...", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2014-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oovShYF-Qz0twrwngcGqHg", "review_id": "bUr8NsLByV7EDb-sVBhUvw", "text": "What happened to your sandwhiches?   Why did you remove them from the menu?  Miss your banh mi's.  It was great to get a bowl of pho and split a sandwhich, best of both worlds.  Now will settle for just pho.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2014-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LPi0BFOckYPf51JFQLGK8w", "review_id": "EhrOJMAFShNaOd2KHUttsg", "text": "Delicious. We had beef bun, spring rolls and beef phô. Nice little place to stop for quick dinner before the movies - conveniently next door.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2014-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WkrQt36X-Y-sEGl6uDwQdw", "review_id": "jeZSAAfAk9w0coSbeeT69A", "text": "New to Arizona and have been dying to find a Pho place! I have found my new home! This is the best place I have had Pho since living in Central California! Very happy customer!!! I can't wait to come back!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2014-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2Ka6GxUzZ0qMh6PttoJC0A", "review_id": "143xnRFfOSBnTwrdiG1NWA", "text": "This place is incredible! My 5 year old loves the beef pho, everything is always fresh and delicious! Great prices and nice and quite. If you are in the area I would more than recommend this restaurant. The staff are also very helpful and always willing to explain the different dishes. Huge portions as well!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2014-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "it1bBAnxric2yEHca5uyaQ", "review_id": "JygJYo5InE8qGz5MJ0xNuA", "text": "Great place to have a bowl of pho for lunch at first glance you might think the pho will be very Americanized but when the first sip of the broth hits your toung you know it was made correct service is very fast so a 30-45 min lunch if you work close by is plenty of time if your ordering a bowl of pho you won't need a apatizer it is a big bowl but if you want to try one the spring rolls are awsome too", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2015-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5aIJuQ8Ily9JWh9ZJxUzMg", "review_id": "qcKbAXzZzVhlLjDgch8ktQ", "text": "I always have the chicken pho bowl and add some chili sauce and hoisen to it...I love this place! The soup just hits the spot! Be sure to add in all the extras they give you, lemon, lime, basil, jalapeño, and sprouts, they make it delicious!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2015-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "A1n9Km3O7YtyapoTfJjj8w", "review_id": "RQDLD37UfSBaut-cn2JifQ", "text": "One of my favorite places to grab a quick lunch for around 10 bucks.  Their #3 with cooked noodles, vegetables, pork and egg roll is very tasty with the additions of some chili and hoisin sauce.  Highly recommended.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2015-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "OpN1MhESDpc4_mPpx2Pd9Q", "review_id": "EOTvuiKVftLO8S-W2FqlLg", "text": "I had walked near this place so many times when going to the movie theater, but never thought to try it until my sister did and gave a rave review! Went here for dinner and thought that the food was reasonably priced and tasted good.\nThe restaurant is pretty small, a lot of the tables were taken when we went around 7pm. The restaurant was clean and nice though. The service was very fast, which was great! \nI ordered the Tea Light Special, vegetarian style. This was nice way to sample a few different things. It came with pho, two eggrolls, and a spring roll. I had never tried pho before, but I love noodles and soup so I enjoyed it. The spring roll wasn't great, the wrapping was a bit too chewy for my liking. The eggrolls were pretty god, not the best, but they were tasty! My friend got a dish with pork and rice I believe, I don't remember exactly what it was called, he enjoyed it but thought the portions were too small. I wasn't too filled up from my meal either, probably a better place for a lighter lunch versus somewhere to go when you're starving!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2015-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2xkeCBjixQTALpzrSFT97Q", "review_id": "b2IFZ5po20zBFfSS9rzO7A", "text": "there was barely any chicken or noodles in the pho, really disappointing, but the flavor was good. terrible service.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 1, "date": "2015-01-28", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "mPLcGk6ao0g4nGP8kNcz3w", "review_id": "dWpqPSdixtXjTlHtjniNeA", "text": "I'm from San Diego so maybe I'm just spoiled with the  best food from around the world located in one city but... Seriously? So my friend and I both order the beef bowl. The food comes out fairly quick so that's one good thing. The rest just downhill from there. The taste of the broth was mediocre, pretty bland. The top was cover entirely with onions and green onions. And the green onions weren't  even chopped well. I had huge pieces of the root in my broth. Now to the soup as a whole. It had maybe 6 pieces of beef, meatballs, and a pinch of noodles. It was the most basic bowl of pho I have ever seen. I am not exaggerating when i say i ate the entire thing with  3 scoops of my chopsticks. For $10 this was the most expensive pho i have ever had and it was also the smallest in portions. \n\nAs far as the service, the restaurant is set up where you order in the front and pick a seat. The man in front seemed very bored of his job. For the most part he answered my questions. That is where they recieve their 1 star.\n\nNever will i ever recommend this place to anyone!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 1, "date": "2015-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6slgAInRY6EbdrFd61eunA", "review_id": "0g-u3IBYSBvoyb_EbDE8bg", "text": "Delicious pho and amazing bubble tea served promptly with kindness. Drove out of my way as a business traveler and I am 100% coming back again. This is an excellent option for lighter Vietnamese fare.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2015-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TkTeSU3s7TpsebhjPyXbhQ", "review_id": "uzH5DEYit2IiMiccuD5oyw", "text": "their beef pho noodles was so good and tasty but their boba drink wasn't! it taste like it was water down!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2015-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EZ8IZMduz11UsUjEjARFyw", "review_id": "g-gwNaE1kjH-SnTNqOiLng", "text": "SO Yummy! I was craving Pho and this restaurant was close so I decided to try it! Definetly going back when I'm in the area", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2015-02-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MYVgzfsFXMAdByQWUirZlw", "review_id": "tw_qLdlRcXnqaoCbUjdjSw", "text": "Shrimp spring rolls had too much rice paper making it a bit gooey and stiff. Sauce was too watery.  Overall,  just so so,  compared to my regular places in Chandler. . Will come back to try the pho.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2015-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UAkBoQ1fX7JcBW-6KC18Ig", "review_id": "8msqH21lUndKcEWZF6QSiw", "text": "This is our VERY favorite restaurant...the best Pho ever! Not toe toon the scrumptious mango Bubble tea!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2015-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jKeaOrPyJ-dI9SNeVqrbww", "review_id": "OSCOZBMl_miGbRd4h-6azw", "text": "Goddess got it right.  This place is pretty, and it looks so promising.  Big disappointment.   There was nothing for vegetarians.  The food was mediocre at best.  I'd choose Pho Nhat over this pretty restaurant any day.  Don't judge a book by its cover.  No good.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 1, "date": "2008-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cdDVlatq0NxUNfnBLSwjCg", "review_id": "DoiFFGupfcyPFGe3scDpug", "text": "#39 = AMAZING. The Thai Tea is also amazing!!  Yes the place is usually not full, but don't let that scare you.  Love this place.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 5, "date": "2010-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2kb0mfOItoGat6bVkEtDdw", "review_id": "-r44mpXdewxCIaRWF-ycAQ", "text": "Easy to find right off southern. Not the best I've ever had but passable. Missing several condiments I am used to with pho. Asian cilantro, nam pla, etc broth was good, generous steak and noodles. Not going out of my way to eat here however.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 3, "date": "2011-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t2YBANsJYySOXvHyOjcZkQ", "review_id": "zYcXC9KSdWG4QjjD6nXMIQ", "text": "My favorite Pho but I think it has a new name now?", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 5, "date": "2012-02-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Gu4yMPJehqLetCtANP-Brw", "review_id": "UXoYhCX4l0ri0yHlM2Ahkg", "text": "This is my regular go-to Pho place. I'm originally from Tucson and having been spoiled by having 2 Miss Saigon locations there (best Pho I've ever had) I was looking for a new replacement here in the valley. I tried a dozen places or so before I found this little gem. There seem to be quite a few Pho places around here so it's hard for any one to stand out, but the food here speaks for itself. I always end up getting the Pho Tai Chin Bo Vein and it is excellent. They tend to be a little skimpy on their meat at times but the broth is so flavorful (and not overpoweringly anisey) that I don't mind. They also have decent spring rolls but their peanut sauce is lacking- that's my only real complaint. I wish they had boba teas here- if they did I would just never leave!\n\nIf you're thinking about visiting this place I'd definitely say go for it! It's a little hard to find at first, being tucked away in a little corner plaza being covered by an Oreganos, so keep a keen eye out! Oh, and if you're into Billy Joel/Elton John type of music they have this musician that regularly plays on Wednesday afternoons. He's not bad- its like Sinatra singing a jazzy Billy Joel.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 4, "date": "2014-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Phj1jHdpcPPBE1hNg9-Tqw", "review_id": "VFuypGeJ9AK-w3CoREq1fg", "text": "has been closed for several months", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 1, "date": "2015-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DDad5K6GNA0sXB7N1OB6wg", "review_id": "JR-A8JHIOXriY3yo1Lh1zQ", "text": "The pho is good but I had one BIG problem. I ordered Spring Rolls and they never brought the peanut sauce. I've never been to a place where peanut sauce did not come with my spring rolls.\n\nAlso, the three bean desert was a bit disappointing.\n\nI will agree, the place is authentic, but I guess I'm just spoiled by Pho restaurants in OC (Little Saigon)", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 3, "date": "2009-12-08", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "xW5ajZ7ke4IeRmJylPKagg", "review_id": "tH1KUDLg_AG1FS9u6rvAKg", "text": "chaaayp!  this place is a well kept secret.  we ordered the pho and bun.  as good as anyplace we've eaten and the prices range from $2.00 (for the  banh mi) and $4.75 for a decent sized bowl of pho.\n\nthe place is a nice little dive with courteous and cordial staff.  on a saturday afternoon the place was steadily busy.\n\ngreat find.", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 4, "date": "2009-12-19", "type": "review"}
{"votes": {"funny": 2, "useful": 6, "cool": 2}, "user_id": "lPaYMDmJbAnv_3pmZH_inw", "review_id": "zCfFoD0BsWUjaBtjwMGaYg", "text": "On a cold winter day, the craving for hot comfort in a bowl makes a person do strange things. It found me driving to a kind of shady part of Mesa, while braving the cold winds in search of a perfect bowl of phò.\n\nMy new holy grail of Vietnamese restaurants is Phú Thành, located in a rundown strip mall on Southern and Extension. A good Vietnamese restaurant is usually kind of old, slightly dingy and super cheap, and in this case all the basics were met and exceeded.\n\nPhú Thành is a no-frills kind of place. Inside it screams for a makeover. Though clearly from another era, it is clean and functional. The service is friendly and the kitchen is fast.\n\nThere might be a slight familiarity here the owners of Phú Thành and my favorite central Vietnamese joint Da Vàng are brothers. The menus of the two places are almost identical, and they offer a lot.\n\nThe No. 50 Chà Giò ($2) is what good Vietnamese cooking is all about. Two golden-brown, crunchy egg rolls filled with shrimp and pork are hands on and interactive. Served with a plate of lettuce leaves and herbs, you wrap the egg roll in lettuce and garnish with mint and cilantro, then dunk them into the house-made n?òc châm, a sweet and spicy dipping sauce. The fresh lettuce and herbs cut through the richness of the egg roll, which on its own might be slightly oily.\n\nApplying the same hands-on approach, the No. 54 Bánh Xèo ($3.95) replaces the rolls with a pan-fried rice flour crepe. The exterior is slightly crispy, while the soft interior is filled with shrimp and bean sprouts. Of all the Bánh Xèo I've tried, this version is by far my favorite. It's full of flavor and texture.\n\nPhó (pronounced like the bad word) is not only fun to say, but fun to eat. Eight versions of the noodle soup are offered, from traditional beef to chicken. Pay attention to the menu description when ordering since you might wind up with unfamiliar cuts of meat.\n\nI'm adventurous and love the textures of beef tendon and tripe, so I was in heaven when my steaming bowl of No. 1 Phò Phú Thành ($4.95) arrived. The broth was incredibly fragrant with clove and star anise. This really should be made into an air freshener.\n\nAlong with the condiments at the table, the soup comes with a plateful of basil and bean sprouts. But also include limes and chilis to add texture, flavor and depth to your pho experience.\n\nFor something hearty and comforting, the No. 7 Mì Bò Kho ($4.75) is a bowl of chewy egg noodles filled with a beef stew. Tender pieces of stewed carrots and beef grace the rich and complex flavors of the dark and tasty brew.\n\nIf you're carbohydrate loading, order a slab of French bread to absorb all of the bone-warming elixir at the bottom of the bowl.\n\nFor food like this, a little shady is worth the drive.", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 4, "date": "2010-02-08", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "JgDkCER12uiv4lbpmkZ9VA", "review_id": "xC245i1voaMRJJDiefU4pg", "text": "From the outside, Phu Thanh looks different from any other Vietnamese restaurant in town. It's larger, has a huge presence outside of the typical hidden strip mall, and looks promising. \n\nRest assured, Phu Thanh is different from most Vietnamese restaurants on the east side... it's very very bad. During a one-hour dinner in their dining room, I noticed three tables that were covered in dirty dishes upon my arrival, and still covered in the same dirty dishes upon my departure. Not to say this ruined my experience, but it sure was disgusting to look at. The waiter service here was actually nicer and more helpful than most, a which is the saving grace here. They offered a refill of my water (rare) and even came back to see if I needed anything else (very rare.) The clientele here seemed like predominately young married couples and young families of non-asian descent. \n\nI had been craving a bowl of Bun all day, a rice noodle dish served with julienned veggies, your choice of meat, and a nuoc mam (fish sauce) to give it a nice flavor. I also ordered spring rolls  prior to my meal, and was a tad surprised when, having ordered in Vietnamese, the server asked me questions that made no sense. My order of Goi Cuon garnered a respose of \"fried or not fried\" which definitely threw me off since fried would be Gha Gio, an entirely different dish... did you ask this because I'm white? He then asked \"you need fork right?\" No, I just gave you my entire order and said hello in conversational Vietnamese... this wasn't a tip off that I know how to eat your food? The spring rolls were very small and contained little filling. I'm used to Goi Cuon bursting with veggies pork and shrimp, not little tiny thunb sized things. When the Bun came, the noodles were all broken, which made it almost impossible to eat in anything other than tiny bites. The Nuoc Mam had an overwhelming fish sauce smell and flavor and was easily the worst I've ever had, and completely lacked chili, garlic, or anything to mask the fish sauce. Utterly awful. I also felt like the Bun portion was incredibly small compared to other Viet restaurants in town.\n\nI would hesitate to give this place any sort of recommendation, given it's proximity to some of the best Vietnamese restaurants in town. The quality seemed to be on par, and service was somewhat decent, but the combination of small portions, bad tasting food, and lack of ability to clean a table earns this restaurant a solid two-star review. Also, eating Vietnamese more than three times a week, I've had a good run of over two years and haven't become sick from a place. This one has had me burping for the past 12 hours and feeling kind of queasy... nothing major, but definitely something didn't sit well. I'm honstly not sure what the appeal of this restaurant is. Two miles away is Pho Ao Sen, one of the premier spots in the valley.", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 2, "date": "2011-01-12", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "nqTdz_3PLZaCHpkC-9ykWw", "review_id": "UCNhwIimgi7Vw4g1BXKOAQ", "text": "$5.00 Pho.....need I say more!?!", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 5, "date": "2012-01-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L0GXS7R-VqgdsobxqfMN4w", "review_id": "SGHpefyRHfzariGMSq7ogA", "text": "The pho broth here is consistently phenomenal, and this place is open on Sundays as well. The food comes out fast and hot.  If they weren't a little stingy with the veggies (even when you ask for more), I would have given it 5 stars.  Otherwise, it is a must try for Pho lovers.", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 4, "date": "2012-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "t_LIUWxS4Gn7FshJfSYWTA", "review_id": "6NFpKcVE7lBXsz0VaFAGvg", "text": "After having a terrible experience elsewhere, I feel obligated to write a review for my go-to pho place.  This is pretty close to what I would consider authentic Vietnamese food, certainly the closest in this area.  The broth is flavorful, and the meat is cooked exactly right.  Other dishes on the menu are just as delicious, but for me, when I go to a pho place, it's all about the pho.  Yes, the service could be better, but this is pretty typical for a Vietnamese restaurant.  They are never rude, but be prepared to have to flag down your server for the check.  Other than that, I have no complaints.", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 4, "date": "2012-12-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MK-EScC1QNysVmb5XESqzQ", "review_id": "VT6UFbz80mHdQLxiOved-w", "text": "I am a PHO-addict and the pho here is VERY good.  I also love their spring rolls both the fried and fresh.  Also, if you are in the mood for fried rice, that is tasty as well.  The service is ok, there are times when we have had to hunt someone down to get our check.  The restaurant is a hole in the wall and it has a \"unique\" smell.  It's bad, but it is different.  If you want some good PHO then try this place out, it's good and priced very well to meet the budget.", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 4, "date": "2012-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6O9JEjAbXojH8LjeL8G3fA", "review_id": "bJQXrmpV5hse_U8kRRTUgw", "text": "Service is usually bad! But, today it was great and food like always was excellent. Me and wifey are always there. App #52 & #54 Main is #4 for wife and I get #22 I drink Coconut soda wife drinks Salted Lemonade with sugar...YUM!!!!!", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 5, "date": "2013-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "AnH84g9V10x41CXmCvcaFg", "review_id": "v6jcgOBKjG2TCLM3drXsKQ", "text": "Easily my favorite Pho restaurant in town.  This is a guilt free place to eat.  There are so many light, fresh, low fat, low everything but good stuff dishes here, you can't go wrong.\n\nThe selection is good... you can get different BBQ meats, shrimp or meatballs in different combinations over noodles in at least 3 different styles of soups.  They also have dishes that are not soups served over rice or different kinds of noodles.\n\nIn addition to the soups and entrees, there is a full selection of appetizers.  My favorite are the spring rolls.... fresh crispy veggies and greens with all the sauces and extras. YUM!\n\nThey also have Boba drinks.  I thought Boba was Japanese. I guess it is Vietnamese as well.\n\nThe price can't be beat.  An entree is around $5.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2008-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "M_rUn8TIYxX2OLQEuC9faw", "review_id": "0Dbrb7_RLeGrcxqV6EObwQ", "text": "This place serves huge portions at decent prices, but that's the best thing I can say about it. The environment is so bland that it reminded me of working in an Intel cubicle farm. The service was pretty bad, I had to walk up front and interrupt the flirtations of the servers to get a container to take my leftover pho home. The food was good, but certainly nothing to rave about. If you need some quick vietnamese and can completely ignore your surroundings, this place could be acceptable, but otherwise I'd avoid it.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2008-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RvyTTpBLqd8yHomBTW_Kpg", "review_id": "bw92u6I9h2cEG2vPWrewcw", "text": "The food is solid, but not awesome.  The room is kind of ugly and occasionally not too fragrant.\n\nIf you want Vietnamese, you want it dirt cheap and you want it now, this place gets it done.\n\nIf you want a warm, memorable dining experience, this is not the place.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2009-01-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "i0A-c2yoHySmFhRV2sDR1g", "review_id": "52H3H--NNIP4fc9ajUjxdA", "text": "This place is great and I eat here often. The food is very good and the prices are great.  Took a friend and we ordered egg rolls, spring rolls, and two main courses, think it was curry chicken noodle soup and a spicy chicken over rice. The bill was under $20. A Vietnamese friend recommended this place and I have been eating here ever since!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2009-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TwajlXNaNen7_Lnfysj1Ig", "review_id": "87AIa_ecEtoC_1nvUZKZrA", "text": "the Pho bo vien is sooo sooo yummy and the spring roll are so die for. great prices and friendly staff.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2009-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mUUy72UfqmFj_krWclKELw", "review_id": "RpnKT8FFwdUt_12AfGTZGA", "text": "So every time I'm craving some pho I always come back here. 90% of the time I go by myself. It's easier than trying to convince someone else to go with me. \n\nThe pho is always delicious and the service is always quick! I sometimes wonder if the servers understand what I'm saying, but I'm glad the numbering system is implemented here, \"#10 Please. Thank you.\" I should try to learn some Vietnamese basics since that's my number one place to go.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2010-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wN05bLB486m30Zd-X7BhuQ", "review_id": "-Qo5YFc0ZuoUftmb8d0bMw", "text": "We always go here when we are too tired to cook during the week or as a on-the-run, default place to eat. The food is really inexpensive and good. The service is quick and the staff is friendly in a foreigner-kind of way. I can't really distinguish between the qualities of Vietnamese food because I didn't grow up with it, but I enjoy the noodle bowls. My new favorite is the coconut milk curry bowl but watch out, it is spicy!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2010-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 4}, "user_id": "KSTOdz0lSFCkqBSRNwjERA", "review_id": "wW2v4bSP3N0KapPIcWAztA", "text": "My initial thoughts of this place was of a dirty hole in the wall restaurant. When I finally stopped by I found out it wasn't so bad. I heard and driven by this place many times but never really had a hankering to stop in and try the food. \n\nTonight, I was not feeling well and wanted a nice, hot bowl of Pho. I decided to finally give this place a shot. I placed my order to go (#11 Pho with beef and beef balls - $6.50 total) and took a seat and waited. I did not have to wait long, I got my food fairly fast. For the short 5-10 minutes I waited, I saw several appealing rice, noodles and seafood dishes passing by me from the kitchen to different tables that I now have to come back and try. Everything looked so appetizing which usually isn;t the case when you're feeling sick.\n\nAnyway, back to the Pho... when I arrived home, I fixed up my hearty bowl of Pho. The portion was huge! More than I can finish. The bean sprouts, mint and lime that accompanied were nice and fresh. The broth was very flavorful and not very oily. Usually, I'd want to add a bunch of lime, hoison sauce and sriracha but tonight it was perfect with just a squirt of lime and the fresh veggies. The broth was still very hot, too. \n\nI will definitely go back for more Pho and also to try other items. Prices here are very affordable.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2010-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "B0vAkXiMO4FJV2sM6tFGDw", "review_id": "zNfOj1Eo9b3U_kyKoBWHjQ", "text": "Fast service, delicious food and excellent prices. \n\nWe've been eating at Saigon for about eight years, and highly recommend it if you enjoy Vietnamese food. \n\nThe service is very prompt. Our food usually comes within minutes of ordering and it's delicious. The waitresses are friendly. And lunch for two is usually around $15. \n\nNewbie advice: \n\nIt's very busy during the lunch rush hour, so get there early. \n\nThe decor isn't the finest, but it's the food you'll be eating! \n\nFish sauce may not smell great, but it's so so tasty. \n\nNot a big Pho (pronounced fawh) fan? Try the char-grilled shrimp and beef over rice, stir fried white onion noodle with chicken or lemon grass chicken over rice (spicy). The Vietnamese spring rolls are also delicious.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2010-12-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0BNs_HWqTRZ8amzaBLd3Vw", "review_id": "KVOx1tNJgMabx-d6nFH9cA", "text": "Fast service, good quality food with affordable price, friendly staff, no complain.   Bravo!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2010-12-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "U57ebl1SZYVYJqe9Ksvnkw", "review_id": "C7GGadUS5uHQd8PS_EStfQ", "text": "This is my absolute favorite pho restaurant, and the prices can NOT be beat.They have a cute little place with a big fish tank full of fresh crabs and lobster and the pho is amazing. I recommend the #25 Its a beef rice noodle dish topped with crunchy spring rolls, lots of veggies and their sauces are divine. No, it's not actually a Pho dish but it's amazing and slightly sweet and they bring it out in record time! We tried the Salt Brown Lemonade last time we were there, let me say that was an ODD drink. I usually go for the hot green tea, I like my own little pot o tea while I Pho-get. Check this place out when you're in the area, I guarantee you won't be disappointed!!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2011-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "3uU_6L8GnFOHTsO4I3oedg", "review_id": "thZfSuPjSRgstqnYQiANGA", "text": "This is one of my favorite places to get Pho. It's made well here. Good flavor, not too oily. The egg rolls are delicious.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2011-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3RD504bNEwOmeqImRuVSsw", "review_id": "M81yN9lyKTXZY3-tU4YmFg", "text": "Saigon Pho Falls Flat\n\nYears ago, my husband and i went to Saigon Pho regularly before choir practice to get a bowl of Bun Hanoi.  Once we quit the choir, and found Cyclo, Saigon Pho was no longer on the radar screen.  Last night, i craved a bowl of pho, and wanting to mix it up a bit, we thought we'd visit the old haunt.\n\nWell, disappointing.  The Pho Tai was flat in flavor, greasy and very, very average.  the \"salad\" consisted of a handful of bean sprouts, a lemon wedge, one basil leaf (!) and a sickly branch of couple day old mint leaves.  \n\nIt was sustenance, but not a great food treat.  \n\nwe'll be moving on.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 2, "date": "2011-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "N646f4MjFUgMPLeyntST6A", "review_id": "7JbKo1nsT2bbgUjPxXrzgA", "text": "yummy vietnam foods at arizona.\nwe order no 39 beef chow fun $ 6,95 (i change beef with chicken),\nthis is my favorite food( if change we spend more  $ 1 ).\nand egg roll  $ 2,95 (for 2 pieces +accesories) ,\nsometimes we order 2 packed.\nif you like spicy  and pork leg don't forget to order BUN BO HUE \n(shank beef  and pork leg soup) $ 5,95 ,\noriginal bun bo hue have pig blood, but don't worry they don't put  those blood.\nwonton soup yummy too.i think anything food  yummy too, \nmy hubby like pepper salty crispy squit($9,95),\nand we always order only a little salt,because to salty.\nwe order fried rice chicken shrimp $6,95.\nsometime we order crispy chicken.fried tofu $ 4,95  yummy too.\nif you come weekend  for dinner,maybe come a little early.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2011-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MYVgzfsFXMAdByQWUirZlw", "review_id": "jB1LuOPMsOeHtC1XtzYVqQ", "text": "Coffee here is to die for!!  :[],,,  (drooling face)  It comes out with its own coffee drip and slowly brews over a layer of condensed milk.  Mix and pour over ice for an extra rich coffee with an awesome aroma!  I like coffee, and I like 'em strong!  there's no cup of joe like this. :D", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2012-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rl_o0q8z-Rv9bneDafM0KA", "review_id": "h4ZdX65dcDwhjbJOhTnoSg", "text": "Saigon Pho is probably the cheapest pho I have ever seen in all of Arizona. $6 for a huuuge bowl of pho, of course I'll bite! I came here with my uncle and cousin for lunch and it was packed. Even so, the service was friendly and the food came out fast. I had the chicken pho, while the other two had their regular pho. The egg rolls we got were just so-so, but the soup was delicious. Not the best pho I've ever had but I will come back whenever I have a craving for Vietnamese while I'm at home.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2012-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ghoBw5923PH-03Rly2hRJg", "review_id": "ZLA8HoYKntE8We4xHzEgUw", "text": "This is a great quick lunch spot! The Pho is aright not my favorite but great for the money only about $5 a bowl. They also offer many other dishes as well, their house crispy chicken, beef and basil chow fun, house fried rice, crispy egg noodles with chicken and vegetables, and their fried egg rolls are a must :-) I usually alternate between all of these dishes all of which are under $7-8 a plate.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2012-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3vML-LnH0dIyHCrqF5xEYw", "review_id": "OBT9K5ULJmDBjGamG4FniA", "text": "Love it!!! The salt and pepper calamari is UNREAL!!!!! I also get the beef sliced pho. I love how fast the service is! I've been here 3 times in a week and I live in Scottsdale!!! Love it!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2012-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qEDc_9lOstDO3I4ZBO58Hw", "review_id": "zOr6iFofPoGanoZxMFF7DQ", "text": "Love this place! I make sure and go at least once a week.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2012-02-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vXvvI6ChFWZ8b5-H8DWJCQ", "review_id": "6wS94d2jRgB5RtiEP7N6pA", "text": "It just doesn't get better than this place, in every way... service, quality, value, taste, etc.  And I can't over-emphasize VALUE!!!  This is just plain old CHEAP, yet lacks nothing in quality.\n\nI've been to this place dozens of times, and I would give it a 5 every time.\n\nGet the lemonade.  Trust me!!  It's made in house, and is such amazing.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2012-02-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yhgWeNHwQJ32qUYCUJiwHg", "review_id": "X_FpRaHZYr2Ag2cCMQr6Iw", "text": "I gave this an A-OK rating because i'm not an expert of PHO. I like the food, but just haven't been to plenty of vietnamese places.\n\nI ordered the spicy beef pho. It was good, very large bowl and the price was great ! This place was recommended to me by my asian friends. And i saw lots of asain peeps eating there as well, so it's probably a good place. Service was good, even though they were really busy.  I would go again, the menu has plenty of selections.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2012-02-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "J_Wqa5tUZ6pen_OD1ikCEw", "review_id": "tH6l-X11QqJPjH4IZjHzQQ", "text": "This place is awesome. You just need to know what you want or go with someone that speaks Vietnamese to make sure you are getting what you want. \nI really like the beef noodle soup and the vegetable rolls. Sometimes for lunch if I am driving by, I just order their vegetable rolls to go and it is enough to fill me for lunch. Wide range of other food as well that has some very good authentic flavor like the chow fun.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2012-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "aBcVCp9M5uczhOTAz6_4sQ", "review_id": "3COcKd2q0WTrTy8LZv7PFA", "text": "Don't go to this restaurant.  The employees are THIEVES.   My daughter left her phone on the table and went back to get it from the parking lot.  When she got back to the table the phone and the tip was gone.  The employees claimed they didn't have or see the phone.  I used Lookout security to locate the phone 4 hours later at the restaurant and returned.  When I did the employees again played innocent.  We then made the phone scream using the software.  When we did someone in the restaurant stashed the phone in the men's bathroom in the toilet brush holder (YUK).   Proof is that an employee had the phone and wouldn't give it up to me or my daughter until they couldn't silence it and had to stash it in the bathroom.  Again, nothing but a bunch of thieves work there and they'll steal from you any chance they get.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 1, "date": "2012-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vRuc0i6O1xgFJtSLAhctcw", "review_id": "HVpAyn3qxq2NT_oebC99AQ", "text": "Since our first visit almost 14 years ago this has been our favorite location for Pho in Arizona.  My wife and I frequently had Pho when we were dating in the Bay Area and were delighted to find a fantastic restaurant out here in AZ.  My son has some pretty severe food allergies and Lauren and the rest of the staff do a wonderful job of ensuring that his soup is always how he needs it to be. Due to his allergies, this is one of the few restaurants we can eat out at without bringing food from home.  My current favorite is the BBQ Pork With Shrimp over Rice while my wife loves the #22 Curry Chicken Soup.\n\nThe restaurant is even better since the remodel and the staff has always been courteous and kind.  Also, try the #1 Egg roll, they are crisp and delicious and finish up the meal with the Iced Coffee.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2012-12-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EReAHJGuV788PxfaAFd0kQ", "review_id": "c7YEfGNEmpnB1yJKzJQPgg", "text": "Having never delved into the fabulous world of pho before, and finding myself a bit under the weather, I was instructed by a friend (who I now consider very wise) to head over to Saigon Pho and grab some pho.  Since my initial visit, Saigon Pho has introduced me to the brothy wonders of Vietnamese soup.  I regularly call in to order for pick up, and it's always ready within 15-20 minutes.  The broth and meat of choice (to go) comes in a huge styrofoam (Argh!  But what can you do?) cup and all of the fixins - basil, sprouts, rice noodles, lime, sauces, jalepeños - come in a separate box so you can mix to your liking.  \n\nBasically, if you're having a low-key movie night at home and don't want to cook, but don't want to stuff your face with fatty foods, you'll want to order something from here (I recommend the chicken or beef pho) on your way home.  And don't forget the spring rolls...they are unique in flavor and texture despite being made with the standard ingredients.  I'm not sure what it is, but it almost tastes like they brush the wrapper with almond extract, really delicious!  \n\nWhile I'm still exploring my pho options, this place is so conveniently close to my house, I won't feel bad using it as a fall back if I ever find somewhere better.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2013-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "omoEjYFKVV7e-DtnezeUOw", "review_id": "9XzV_UQSMmGDDJoaRt3JjA", "text": "What happened to this place?  it used to be one of my favorite places and now the food has gone way down hill. Worse, our family has gotten food poisoning the last two times they ate there so it is no more for us.  What a shame this place used to be amazing.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 1, "date": "2013-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dqNAl9HWKtFvj9IltcJAVQ", "review_id": "C390NPsHKbOmINN1BUKmBA", "text": "I use to like coming to this place, it was by far my favorite place to eat Pho. But the last time I went, last Sunday, I didn't care for it that much.\nWe were seated in a corner booth next to the door on the other side, servers rushed us to order, after ordering another two severs tried rushing us to order again!?! \n\nFood was brought out pretty quick, a lot of noodles, but where did all my meat go for my combination pho?!! I asked for a little side dish to put my sauce in, never came. My drink was refilled once, it took forever to get my check, and all of a sudden where did my server(s) go? \n\nI just felt super rushed, then when I was ready to go, no one was there...", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 2, "date": "2013-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PB5f_4Ojjv6Nf-iGg6JN3Q", "review_id": "pQZdsoTThZFHT4L0BPbP_w", "text": "This is by far my favorite Viatnamese place in town. I've been going there for about 10 years now, and love it every time. \n\nI often order takeout as well, and it's always ready lightning fast!\n\nI have so many favorites, so it's difficult to make a recommendation. But the egg rolls (#1) are a must have! The spring rolls (#2) are also tasty if you're looking for something a little healthier.  For entrees, I love the chicken pho (#14) when I want something simple or the rice and egg noodle soups (#18 and #19?) when I'm looking for more variety. The noodle bowls are awesome as well--#28 is nice because they'll chop up egg rolls and put them right in your bowl. Yum! As a plus, prices for any of the above top out at around $6.95.\n\nThe only thing I wouldn't recommend is getting one of Saigon's few fusion dishes--teriyaki chicken, for example. Stick to a strictly Vietnamese dish.\n\nI would score a 5/5 for sure except a friend of mine did get sick there once a few years ago. I haven't had it happen in 10 years, so it may be a fluke. Still, I figure it's good to know!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2013-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BN36guOBWF5LjzoEvWExtQ", "review_id": "-aCAeMYpP64w6D0p97uk0A", "text": "This place is delicious. Awesome food every time and great prices. Looks pretty divey but its fantastic. It is what it is. Will be back many times", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2013-02-06", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "wVSGZN8d3ao4ad97kEDzYg", "review_id": "EIlK4sqOX_0XZZg8WAPdEQ", "text": "This has been my go to pho spot since I moved to Chandler. Although I still think Saigon Pho is quite good and an excellent value, unfortunately I had to downgrade my rating from last year's review.\n\nTonight I ordered 2 orders of chicken pho, 1 order of spring rolls, and a Thai iced. My total was $18.36! Now that is unbeatable price wise.\n\nUnfortunately, my Thai basil was old and brown and not a good portion. Same with the bean sprouts. And the shrimp in my spring rolls were not cleaned (you know what I mean!). EW.\n\nI know the economy is still sluggish and money is tight. But I think it would be better to up the prices slightly than serve old food. For me as a customer it is awful to expect the quality you're used to, and to open your box to find rotting sides and poopy shrimp.\n\nDisappointed tonight. Luckily, pho spots are plentiful in Chandler and I have a few bookmarked. I really hope this experience was a fluke because in my experience this place has always been great.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2013-02-08", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "2FtCOwNwd6UsBgScSc1_Ug", "review_id": "F1P8z4dJEtWi7k8rGw-FbQ", "text": "When I first pulled up, I wasn't even sure this place was open (still on  usiness). All the windows and doors are completely blacked out. But I tried the door and yay! Success.\n\nPho is dirt cheap, and still tasty.  I opt for chicken and veggies is my Pho- which was not on menu... But they served up, no problem. Service was fast even durin flinch peak. Will be back.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2013-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "TzRNJqZOti3QmNIGXjAzQg", "review_id": "RzC3BB9d2-cXlmeNQkDy_A", "text": "Quick, easy, inexpensive, delicious Pho. Love the egg rolls, spring rolls, and beef pho!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2013-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "O2pwb-9f5aOvEvp5aKtEkA", "review_id": "SFaIJKo-Wfj3IevTB4I7kw", "text": "This yummy Vietnamese spot never disappoints!  It's fresh and delicious.\n\nI've been here many times with family and friends (who are Vietnamese food experts) and they love it!  \n\nMy boyfriend always gets the charbroiled pork and egg rolls over noodles (#24) and there is never anything left on his plate.\n\nI'm a bit more adventurous and try lots of different things.  The Pho is great and comes in a huge serving!  \n\nYesterday I tried #37 (chinese sausage and shrimp fried rice).  Delicious.  The chinese sausage gave the dish a nice salty sweetness and the shrimp were big and plump.  The rice was cooked to perfection and had just the right amount of stickiness to it.\n\nAnother great dish is the salt and pepper shrimp.  The flavoring is fantastic and the shrimp are crispy and succulent.  \n\nOne of the best things about this place is the pricing!!  Dishes range from $5.95 to $6.50 with seafood running a bit more.  \n\nIt is a hole in the wall kinda joint.  Do not go here if you are expecting high class furnishings and impeccable service.  The staff do their job and are nice and fast.  But it's not a high-society affair.  Food comes out fast and piping hot!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2013-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zvTN1CbOo16Y3xKPytf79Q", "review_id": "87fXDbZLIUesm8_AH50h4Q", "text": "My favorite restaurant in Chandler, hands down!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2013-12-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DJuaMH7zSXdGbXydnOxvBQ", "review_id": "9Jj2LEC31sDYlr9_rOBzbw", "text": "Very reasonable prices for excellent, largely portioned food! Favorite pho place by far.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2013-12-10", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "mMZqUhuAX42U7U2k-GjAnA", "review_id": "7sZ_LwJ15DGLbKUMhmM2wA", "text": "Went in tonight with my wife and the place was packed. We were seated in 5 minutes max and were served our drinks immediately. Our server took our order and apologized in advance because she said the kitchen was a bit behind. 10 minutes later our order was served and the waitress refilled our drinks several times. The pho was good and there was plenty. We are from Northern Cal and I have been to plenty of Vietnamese restaurants and I would put this one up there with my favorites now.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2013-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9REDFmCtBSlFP01IJlTucg", "review_id": "TeyU0s8ERhYmrlGzqRDDMg", "text": "I came here with a large group with about 20 people so we had two tables.  The 2nd table ordered their dinner first and seemed to get all of their dishes within 10 to 15 minutes of ordering.  However, the table I was at ordered about 5 to 10 minutes after our other table, but it took like 30 minutes for our food to come out.  The server taking our order was distracted the whole time while taking our order.  Each table ordered the Spring Rolls, Beef Chow Fun, House Special Fried Rice, Crispy Fried 1/2 Chicken, and Fish Filet Special Sauce.  Our table also ordered the spicy green beans.  The other table also ordered the BBQ Beef.  In general all the food was pretty good probably a 5 but the portion sizes leave a lot to be desired.  I as well as some other in my party had been here before noticed that the portion sizes were noticeably smaller.  In addition the lady waiting our table messed up our spring roll order for fried egg rolls and blamed it in us with an attitude (maybe if she wasn't soo distracted), though she corrected the problem.  Our other table ordered a second order of Fish Filet with Special Sauce after they had eaten theirs and asked how long it would take for the second order.  The server said 5-7 minutes--it took almost 30 minutes!!\n\nMaybe it's just me, but most of my experiences at Chinese/Vietnamese/Asian restaurants within the past few years just seem to be bad.  Maybe my below average expectations at these types of restaurants have to be so low that everything will be good.  Though I don't think I should have to lower my expectations at Asian restaurants because I've also been to American and Mexican restaurants with mostly good experiences.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 2, "date": "2013-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hD7ElN3wuyAkFOJk9DmmrA", "review_id": "g0aiyyg4jLDMFEArCcPPIg", "text": "I have been coming back to this place with my friends couple times. The pho here is decent. I always get the beef pho which comes with several parts of beef. The soup base is pretty good! The restaurant is pretty dark and always there are people eating every time I entered here which is good sign. \n\nIf you are looking for the decent price meal, i would come here for some lunch!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2013-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8JRWtb_dCXMkI3D_uKiYUQ", "review_id": "zx-4PNjzrrLjrc5hetIt9A", "text": "The service is usually terrible, but the food has always been good.  I really like the broth in their Pho.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2014-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "myTJRLscSfXChSy3R8IcJA", "review_id": "DhSRG3HfAttzODtkmF5SmA", "text": "I had congee and it was a bit mediocre to me. I would come back just to get a quick meal, but not really spend much time because the service was ehh too.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2014-01-10", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "d8B0rpK3LRPKry8AXydEZg", "review_id": "WU0Sx0B0xuQnvSfG9k8mcQ", "text": "My favorite pho place!\n\nI love coming here to study and have a good quick bowl of pho. Their portions are great and their prices are the best. Service is great as well -- every time I go I overhear the servers all chummy with their tables, so clearly they have many regulars, and I am definitely one of them now!\n\nI love their string beans with ground pork as well, a big whole plate of them for just $5.95. \n\nOne odd thing though, for the past couple of months, they have not had jalapenos to serve with the pho. Instead, they use little thai chilis. Not sure why they stopped using jalapenos but in the off-chance they read these reviews, please start buying jalapenos again!! lol", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RGCHoFd5ND46cLtdyJHKjg", "review_id": "bWj__qSdhCsOFZBnmq_3Rg", "text": "This place is dirty I feel like my food was recycled.  The service was bad. I asked for a lot of lemons they gave me two slices(dry slices) I had to clean my chopsticks and spoons.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 1, "date": "2014-01-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hD7ElN3wuyAkFOJk9DmmrA", "review_id": "ONQdU7YYan2_UYjV7551kg", "text": "We went there on Friday dinner time. As usual as the other places, this place was busy. The customer service was phenomenal. We ordered spring rolls first. Yummy!! you can enjoy this tasty dish three different ways; hot sauce, sweet peanut sauce and Asian sweet sauce. \nWe always get Pho as the title indicates, but this time, we got Beef and Basil Chow Fu noodle and stir fried vegetable tofu over rice. There were delicious. We had no regret ordering from the individual dish. Although we only got two dishes, we were satisfied with the quality. We would order those individual dish in the future as well.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JLLZNC4588j8YVHhOSmUVA", "review_id": "0E0fuZd14DrcLzxaDfz76A", "text": "Good food, excellent service!! A+", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2014-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bJFdmJJxfXgCYA5DMmyeqQ", "review_id": "nkYZHDPvyeMIOf99SYF9GQ", "text": "I apologize but I reviewed the wrong restaurant as you can see by my picture. I am sure that this is a great restaurant which I will have to visit soon.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8yPpRejQLyfKBni54sftjA", "review_id": "WVSH4KUqtwIuQdY3d53xgg", "text": "This place is a little bit of a dive but in a weird way it is unique and good.  It may take some getting used to it but once you do, you'll get the hang of it and like it the way I do.  My husband introduced this to me and what pho is about.  Their other dishes are good too.  Try the basil chicken with another entre like mixed vegetables, it is really good especially , if your sharing because portions are big.  The waiting staff hardly speaks English so it is best to order straight from the menu without a lot of changes. Again, for a mom and pop Vietnamese type place without the fuss, this is good.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lFuuyO2gM4_9pCcPdUNRmA", "review_id": "F3Ke20pEzi6CR4h-smgYLA", "text": "Usual start off with the shrimp spring rolls.   I always get the sliced beef pho #12.  Wife will usually get the sliced chicken breast pho.   We got the #40 to share which is shrimp with fried with noodles and veggies. \n\nEverything we get had great taste. We usual come to this place for pho.  We think this is the best on this side of town.  The portions are big and the prices are pretty cheap.  \n\nThe service is ok. They are right to the point.  Sit here, throw you a couple menus and some water, come back in a few minutes to take you're order.  Not a lot of chit chat.  This is fine with me as I'm there to eat. \n\nTry the thai iced tea.  It's delish.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cVcZifVh8iSVRso0pXhvBg", "review_id": "Lg60SR9t8LlvTm8fYFGJNw", "text": "The best pho and spring rolls in chandler! This is my go to pho place.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "D2wh4SD5xAA0TJYYfQyk3Q", "review_id": "AwqDAKwO1tRQw9Ujk1jjgA", "text": "Great price but was lacking...\n\nThe shrimp vegetable roll was delicious for an appetizer. Had the veggie pho, but wasn't as awesome as I had hoped it'd be based on previous reviews. The vegetables were good, but the broth was not the best. \n\nBetween two dinners and an appetizer, it came to about $16 for me & a friend. Very convenient location but think I'd definitely make the journey to my favorite spot across town for the broth alone.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2014-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tHfpeqdjF6Ve6vsogXiHlg", "review_id": "h4ht7rOsCupUPhVJECI4Rw", "text": "Been craving on Pho for some time now, and so i decided to invite a friend to this place for her first Pho ever and my first Pho in three years. Saigon Pho is a neat small Vietnamese restaurant located conspicously from its flashy bar neighbors Iguana Mack and Dos Gringos.\n\nI was feeling beefy and brave that day so i got the #10 (thank you Yelp reviewers, nice choice), brave btw is for the portion of an uncooked beef on my hot soup, which i didn't eat but added a distinct flavor. #14 Chicken broth is spot-on good broth (which i got on another day). Shrimp and vegetable rolls or egg rolls are crunchily delicious if you are up for an appetizer.\n\nNow it is true that a full bodied beef broth is flavorful and it is what makes a Pho stands out, but i have to say for the purpose of eating healthy, the more flavor there is the more fat and calories, not to mention the sodium if it has one, there are in the beef broth. This one, though, falls a tad short on the flavor, so i just season it, a good thing because it gives me a choice without compromising the freshness of the bean sprouts and mint. \n\nMy friend and i stayed here for about thirty minutes on a Sunday afternoon and although they don't have a maximum customers, i notice the waiters are hovering around our table a lot as if they wanted us to leave, which i think is the only negative experience i have with this place.\n\nThree stars and i would most likely come back.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2014-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rO3WEI9L-_deUR9-JHuNQw", "review_id": "tisMBr_4JzVYa--jTrydTg", "text": "This probably might be the only favorite Pho spot I have ate at in Arizona so far.  I feel like there is definitely more to try on the menu for sure thats undiscovered by me quite yet but its just so hard to stray from the known and true.  I am not a fan of tendons tripe etc etc.  Keep it pretty simple with the strips of beef and meat balls. As well as the egg rolls number one or two on the menu I believe.  I also love how affordable they are and can always just hop skip and jump across the street when I am not feeling well to get some soup.  If you have not been...I urge you to go...NOW!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5CPtDL-GA2KCa_4poOeOjw", "review_id": "uI_88DzrowNNGLcDVhL3Ng", "text": "My wife and I have been here several times. At least once a week. I asked her today she said like 44 times. Probably not that much but it definitely is worth the 5 star rating. Service. The price. And now for the food: Sliced beef Pho. Spring rolls. Beans with minced pork. Chicken curry is also a must try. Come here and you won't be disappointed.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-12-13", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 1}, "user_id": "m9_1jCgU7mvSkL6oLPJT5Q", "review_id": "HvdcREv00KA-B2XpJ8kt4w", "text": "This has been bookmarked for a while because I am on a hot search for the BEST PHO in PHOenix. I was finally on the Chandler side of life over the weekend, so I excitedly stopped into Saigon Pho to get a take out order of Veggie Pho.\n\nThe place was PACKED when I arrived, which I took as a great sign. I literally had to carefully pick my way through the packed tables to get to the back of the restaurant to place an order.\n\nI was never greeted or acknowledged, but stood there awkwardly for a few minutes until I finally stopped someone and asked if I could place an order to go. I ordered vegetable pho and waited.\n\nI waited by the scary lobster tank in the back that I am positive Chef Ramsay would find appalling. I know it made me queasy quite a few times.\n\nI was not given any utensils with my to go order, so again I had to wait another awkward few minutes to finally flag someone down to get chopsticks (seriously, who can eat pho without chopsticks, am I right?)\n\nWhen I arrived home with my long awaited taste of pho...I was disappointed. It was 80% broth, 10 % noodles, 5% vegetables (literally 4 pieces of broccoli and two slices of carrot) and 5% sprouts, onions,basil.  I was still hungry after I finished all five bites of my meal and had to scrounge around my house to find something else to eat.\n\nWill not be back, but glad I can say I tried another place...the search for the best PHO in the valley is still on!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 2, "date": "2014-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QtVtBdCTrnlQMlI5HDZv6g", "review_id": "7_j-24ukTpdsKuRXz0m7fQ", "text": "For the price you can not beat this place.., ordered take out about 5 times.. I order the pho tai for $6 (last couple times I did extra meat because I like a lot of the shredded beef)\nTheir spring rolls are really really good and fresh \nTheir egg rolls are my favorite! They are skinnier and crispy \nDon't order basil chicken as an entree (portion is huge but very plain)", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ygfxmUZfz3Ktvn9waSITog", "review_id": "_kdxQIdzZNGInEwM2IB6uQ", "text": "Stopped here for a bowl of Hu Tieu Bo Kho (Beef stew noodle soup).  The place was filled with mostly Asians many speaking Vietnamese.  The noodle soup was filled to the brim with noodles, soup, beef.  The broth is hot and a little bit spicy.  The beef chunks are tender and the carrots chunks are perfectly softened, not too much that they break up in the soup.  The service was super fast and my noodle soup came out in record time.  I was in and out in about 25 minutes!   I want to go back and try their other soups.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2015-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ntbKUW9qPoZSWolthyQmyQ", "review_id": "8Iq2cZHb9FucHlBvJkYMCw", "text": "This place is delicious. If you like pho #12 is my personal favorite. Oh and the spring rolls so amazing ... Fried tofu is on point the sauce with it is to die for legitimately. String beans with pork is great. Really I haven't had anything I don't like here \n\nThey can get super busy here but worth the wait. This is my favorite pho place around", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2015-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "i36_2aAcOgjxPXNsGg_gEw", "review_id": "SWtI6l_Wb3Wmg5VBSy_x4A", "text": "Pho was good , but not 4 star quality .... over crowed  and service was below average.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2015-02-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h1DPbpSqE2gugtpkbesqzQ", "review_id": "Y2IBYLxCzG7da78ZWCfNow", "text": "Great pho! I got Pho Tai, beef came out nice and thin and rare. The broth was excellent.  I just hope they stay in business so I can keep coming. The broth was better than their near by competition in my opinion! There are a lot of good Pho places in Chandler,  but this one was the best I've had in a long time!!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2015-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "R5ANNF-4V-dfZDX_TdBToA", "review_id": "APRQc51jbVZCSA9_Bj9Slg", "text": "Service was fast and the ladies that work there are friendly. Food is tasty and cheap  I would come back here again", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2015-12-23", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "9Z05mtXrXJ-22PElwp1ahA", "review_id": "bsyajhAUSMlSv9VCn0GQ5g", "text": "Great when lovely owner Justina is there, but when she's not -- beware.\n\nNormally, food is explosively flavorful and service is warm and attentive. Went recently on an owner-free Saturday. Employees tried to close early, poured us the last of our BYO (about 25 minutes after we'd arrived and wolfed our food), then screamed at us to leave. \n\nI don't know if this is biz-as-usual, but it's not worth another trip to find out.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 2, "date": "2006-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "CQVPwymzvS01Re6O4DATGQ", "review_id": "eOsI3BG5NFumdWp8phYc7Q", "text": "Have been to Cyclo twice. Both times the food was very good.  Ate both times in the late afternoon. Good service...an unanimated, but effiicient staff. \n\nStart with the pork and shrimp spring rolls, move on to the crisp lemongrass chicken or pad thai, end it with one of their unique desserts...and you have a meal that is sure to satisfy! \n\nBeware the plum soda! LOL That's all I have to say about that...", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2006-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "Udj_a2KWaxqeOHu_1FrFAg", "review_id": "Xoa34u5Cs_NsW-sYQjCL4w", "text": "You gotta love Justina, the owner...I just don't know why she keeps chopping her hair off. But she is like a walking fashion show. \n\nAnyway, we have been going to Cyclo since its early days. Coming from the Bay Area, we were a bit disappointed that there were no decent Asian restaurants in the area, until we stumbled upon this restaurant. The flavors of the foods are amazing, really rich and sometimes a bit complex. Try the Hanoi and the shrimp appetizer...yum! And I truly enjoy the refreshing lemonade...a bit on the sweet side, but strangely refreshing! You have to go! Oh, and you can bring your own wine...just make sure it's a good bottle. Justina's going to make a note of it if you bring a cheap one.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2007-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "lC4X2crUuxT9Ac9BlOX4Uw", "review_id": "dxOvpFQlLd17f2WGHEX0Iw", "text": "I had high hopes for Cyclo ( pronunced see-klo). Alas, it was not to be. Although the place is clean and classy and the prices reasonable, the service leaves A. LOT. to be desired. Both times we visited, the staff were unpleasant and downright rude. Too bad, since the pho bo vien (a delightfuul blend of slender rice noodles, beef meatballs, bean sprouts and herbs) could have been magical...", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 3, "date": "2007-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BW2sIZnJSRbi-FcGpU7MYg", "review_id": "zbroC8qbZ87Vj8D35bkQwQ", "text": "The food is superb... Hands down, the best Vietnamese food I've ever had in the west. Justina is great too.. Such a character... Don't piss her off though or she'll make you feel about 2 inches tall... Not that I know from personal experience ;)", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2007-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 4}, "user_id": "cXhs6BawP6L_V59zKb9dOw", "review_id": "BG8rMNARwIxGd8Vna5A4dA", "text": "So the first thing I noticed when I walked into Cyclo was the atmosphere.  It's very cool inside - there's a big painting across one of the walls and there's an old, retro-style light post in the middle of the room (think The Lion, The Witch, and The Wardrobe).  The interior of Cyclo isn't very big by Phoenix standards (I suppose it's enormous by NYC standards), but it's certainly large enough that things aren't cramped at all.  There's good, mellow music playing at a not-too-quiet-or-too-loud volume.\n\nThe menu has a decent number of choices, but isn't overwhelming.  All the prices are very reasonable - an entree will be around $8-10.  We started with Spring Rolls and they were good - the shrimp inside had a really good flavor to it.\n\nThen we moved onto our entrees.  I got Saigon Rice Vermicelli, which was a big bowl full of vermicelli and various meats.  All the meat had *fantastic* flavor.  I spiced the dish up with some of the chili sauce that was on our table and really enjoyed it.  The dish was a good size, although I can eat a house so it didn't quite fill me up.  She got Pho with beef (sorry, I can't remember exactly what it was called).  It was MONSTROUS.  Seriously, I've never seen a bowl of pho this big.  Anyway, the flavor of the pho was excellent - the broth, the meat...everything was just awesome.\n\nThen we got our bill for dinner with one appetizer and two entrees - it only came out to $25 and change (plus tip, of course).  And the food was awesome.  This place is a keeper.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2008-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "TQ5eVGOFr_qB5_BbEd3Sow", "review_id": "aAdzqCfDRn-zfynPXiG8DQ", "text": "I only got here once and meant to get back before I left town but just never made it.  I had the pho at the recommendation of my waitress and she was right--it was delicious!  I will definitely try to go again next time I am in town!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2008-02-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "AGFZfI2VEoWGE39sVjI-MA", "review_id": "LoZnKe-MP3o04SoLrukuDA", "text": "What can I tell ya...it's SO good.  Have lived right around the corner from this place for 2 years and have probably been there once a week (sometimes more if I can convince someone to go for lunch!) and have never had a bad meal.  Yeah, maybe I have made some interesting choices that weren't for me, but even then I could taste the flavors and freshness in every dish.  My favs are the crispy rice noodle cake (how do they keep the veggies from not being soggy, over-cooked messes?), the papaya salad, shrimp in black bean sauce, crispy lemon chicken, pad thai and the soups are divine.  Oh, I forgot the spicy green beans.  And the desserts - a taste sensation.  \nJustina (what a gem) has recently just revamped the place and it looks fantastic.  Hard to believe this hip joint is nestled next to a dry cleaners (which I don't recommend...cannot believe some of the racists comments to come out the owners mouth on a few occasions) and a Walgreens.  \nAnd hey, it's BYOB, what's not to love about this place.  I wish I hadn't written this review because now all I can think about eating for dinner is crispy rice noodle cake and Cyclo is closed on Mondays. Blast you Yelp for making me Yelp!!!!!!!!!!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2008-12-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cXhs6BawP6L_V59zKb9dOw", "review_id": "jSQK45hiVhEsa8oCBVwWaw", "text": "I left my previous review after my first time at Cyclo, which was an awesome experience.  Since then, I've been back a couple of times, and each time both the food and the service seem to get a little bit worse.  At this point Cyclo is nothing special, and Anise and Pho Van up the street are probably both better.  Additionally, I read that Cyclo nearly got shut down during their last health inspection for some major violations, so that makes me a bit hesitant to ever return.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 3, "date": "2009-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3XyuBpNbvrHukaEJyWBAsw", "review_id": "_RtZvDI6yQ2_NJDxm0aQAQ", "text": "I ate here 5 nights in a row after I found this place in the summer of 2008. It was a very different kind of restaurant. The food and service was good and the owner's over abundance of personality provided the atmosphere / entertainment. \n\nIt reminded me of Pesto's before success ruined them. A small place where the owner had their thumb on the pulse to ensure a really good experience. \n\nCyclo's was also B.Y.O.B. which added to the uniqueness of the joint. The only reason I stopped going is, we had tried all the appetizers, desserts and most of the entrees on the menu. And it is too expensive to be a place to go for a daily fix of noodles and water. But definitely worth a visit if you haven't been there.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2009-01-13", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "OYpsdMcpdCdlkknpgpFMLA", "review_id": "XQJjWg60-hYtIlHvvW9SoA", "text": "If you're like us, you bring about three bottles of wine and two six packs of beer for dinner (yes, we're the loud ones packed out at the big table.) Justina is great, always has an amazing pair of Nordstrom shoes on every time I see her and I feel like family when I visit her restaurant. The green beans are worth the price of admission alone (yes, I admit, I will sometimes order enough of the appetizer portions so I can eat green beans for dinner and nothing else.) The other options are delightful, too. Always a wait, but if you have a large party, don't hesitate to call the day of and make a reservation. She can usually fit you in.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2009-01-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "AQxlX8bOQiSDwvlrHThnMg", "review_id": "iBpEsR5zKdmSgDwnTVDOjw", "text": "So it has been a looooooong time since I have eaten at Cyclo and had an opportunity to have a little Vietnamese lunch so there I sat.... waiting for my friend.  The place looks great!  lively fun new interior.  I was sat promptly and offered water with a bit of mint (nice touch).  \n\nI ordered the short rib appetizer and crispy chicken.  My friend ordered the mixed grill.  The short ribs as I remember did not disappoint.  Succulently flavorful making me dream of taking a full order of them home just to smell in the car!  The crispy chicken had great flavor, but was a little over cooked.  (of course that didn't stop me from eating it.)  My friend really liked the mixed grill and loved the atmosphere.  \n\nBefore I would have given 5 stars, but today a 4.  Don't let that stop you from trying though... It is definitely worth trying and I'd say a little more lively at dinner.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2009-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "snK49gWJBJHk7Of68aEbZg", "review_id": "xne2L_5p30Fxr6paHyg1EA", "text": "I was at a wine tasting recently with a group of friends and we began to talk about Vietnamese food. Someone swore that this was absolutely the best in the valley so I had to try it. Suffice to say I was disappointed. I ordered the seafood pho and while it was okay it definitely lacked flavor. I will admit that the black pepper shrimp was delicious but everything else we had was subpar and much more expensive than any other Vietnamese spot I have been to...I'm going back to Pho Van.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 2, "date": "2009-12-18", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "GnZWh25MyJD1d5FMKl3QmA", "review_id": "quxuK37XWRZCbpWFsENMhg", "text": "Let's play chicken.  Lots of chicken on the Cyclo menu, which based upon my experience at other Vietnamese places apparently isn't very typical Vietnamese...and dang it I'm allergic to chicken so I notice and dislike heavily chicken-biased menus.  Of all the meat and rice dishes only one is not chicken.\n\nWe ordered the spring rolls with pork and shrimp - very nice, though I would have preferred fish sauce over peanut sauce.  Next was beef pho.  Also decent but nothing to make me drive all the way to Chandler (I was passing through today).  it was a good meal, and it looks like there are some other interesting items on the very small-ish menu, but I really don't understand all the fuss about this place.  What did Seftel see in it that I don't ?  Of course Seftel thinks Yelp is one of the worst ideas of the last decade so my faith in him is slowly being shaken....  Cyclo doesn't shake a stick at Da Vang or the long lost Pho Loc....", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 3, "date": "2010-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LT3L8-tthzD0IakgXm81pw", "review_id": "UMTvez3cGKQCed_2HHXL2Q", "text": "it's good, very good, but for a Vietnamese place, has a very short menu with limited choices.  \n\nAnd for the biggest knock on the place, no fish sauce on the table.  Huh?  Well, judging from the lunch crowd, none of the people that eat there would know what it is anyway.  Not a Nguyen in the place other than the people running it.  (joke for those of you with Smith for last name!)  No big deal.\n\nPho Tai was very good, I love having green onions in the soup, but I doubt it is traditional.  The accessory bowl was short a few green items but all very fresh.  The broth very nice, though I think salty, but mmm, good.\n\nService was excellent.  Ambience different than I expected.  Small, quaint, clean, lots of awards on the wall, which I'm sure are well deserved.  \n\nThe spring rolls were very tasty, though not traditional with dried pork, but the crispy and very yummy grilled pork and shrimp were delicious with the right hint of mint.  mmmm.  Very good peanut sauce to go with it, though I'm a fish sauce fan, which I didn't get to try THIS time.  Next time I will.\n\nI also tried the preserved lemon soda.  Delicious!\n\nI think if this place was close by, I'd eat here a lot.  A nice Pho can't be beat and I would love to give their other menu items a chance.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2010-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sYe1DZYWnAHVfEzWlLkaAw", "review_id": "jKtXOr-MO2uQbXCMwqUcbg", "text": "Use to really brag about Cyclo.... don't know if the economy got the better of the business, or the owner is just gotten complacent, but I no longer go, or recommend it.  The portions have gotten smaller, and the quality has gone down hill.  One bright note... the owner is still funny, and sarcastic, which I love.  Get your act together, and put the shine back on your gem!!!!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 2, "date": "2010-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "rviVgJFfVSBKEyRFFkH05A", "review_id": "AJ5mPqFSx5_EXemJGpEiDg", "text": "I have never, ever had a bad or even mediocre meal here in the 9 years since I discovered Cyclo. Everything on the menu is fresh and delicious. My faves are the Spring Rolls, Spare Ribs, Garlic  Green Beans, Papaya Salad, Chicken Soup, just to name a few. Justina, the proprietor, is sassy and fashion forward. There are only about 10-14 tables so either get there early or be prepared to wait...it's worth it!! (it's BYOB so bring your favorite wine - no corking fee!)", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2010-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VmbTDmF6Ib-wWtRzyM1fpA", "review_id": "-J30_6wjSIG7d2yHBCp8rA", "text": "Visited Cyclo on Friday night with a party of 7 and mmmmmmmm......mmmmmmmmm....it was delish!! Justine was the perfect host and of course, love the fact that it is BYOB without a corkage fee!\n\nWe turned our evening over to sweet Justine and she did not disappoint! Everything was wonderful....spare ribs, spring rolls (love the grilled pork), green beans and the yummy egg crepe! Really good!\n\nFor our entrees, we shared a number of outstanding dishes! Plus the food just coming and coming! It was a great way to try so many different options! To top off our feast, we ended with amazing Vietnamese coffee (seriously wish she would open a coffee shop - it's that good!) and a Thai Ice Tea! Refreshing, fabulous and I seriously could have had 4 more!!\n\nBecause it is not the largest location, be prepared to wait, but it is definitely worth it! Can't wait to make the hike down to C-town again to get my pho on!!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2010-02-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "jOs47GO0b7iPsbYZe-lLSQ", "review_id": "urabuvoEtnbudMtB8_zBIA", "text": "Great. The owner just made us dinner. We didn't even look at a menu. No corkage fee on the wine. All good.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2010-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KucBnMrhalzxnD9AWrxwYQ", "review_id": "iPEN3PMABni_BcMxsxTEWw", "text": "There are not many Vietnamese places around so I go here on rare occasion when I feel like eating something different... and spending a lot of money... yes really - it is overpriced IMO\n\nIt would get another star or even two if the prices were more reasonable. They do well so I'm sure they are not going to change the prices.\n\nFood: quality and flavor is good. \nService: I've never has good service here. It is average, at best.\n\nOverall: unless I'm going out on business (and the company is picking up the tab) and the person says take me somewhere close by that is \"different\" I usually skip this place and spend the same $ on better places.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 3, "date": "2010-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Zgp9T6IOVFOozrWDw_mUGQ", "review_id": "aw8THeBbd9mANhBO2ZUJ0g", "text": "Why is this listed far away from its actual location. I can't seem to be able to check in here\n\n\nPros:\nAmbiance, Small Establishment (mom and popish... something I support)\n\nCons:\nProbably everything else.\n\nThis is my 5th time visiting this place and the only reason for it has been its proximity. The service has always been shoddy (subjective). I guess you have to be a regular or catch the owners eye to be given any sort of good service. As for me I got the \"don't care for you\" service ( even though only 4 tables were occupied during the lunch hour). I guess I must be becoming invisible.\n\nFood: Saw the prices and was a bit surprised (asian upper class restaurant?? somewhat of an anomaly, easily double of what you get in other Vietnamese restaurants. Thought to myself the food better rock for these prices). Ordered the mint chicken, what I got was a well decorated but bland and not seasoned dish. I had to put in heaps of fish sauce and oyster sauce just to make it palatable. \n\nWhat a waste of good earned cash and a bad aftertaste to boot. Hopefully in future this review will remind me never to visit this place again.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 1, "date": "2010-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zSqJtVQeamKxBz9g9gK5kw", "review_id": "xOzBCjvMcHNkvVGubcpFoA", "text": "Very good food.  The restaurant had a cool vibe and great artwork.  Was very clean and the service was great.  I had the Beef Pho and it was excellent.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2011-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r3hmpTrS7My8i8M0GbAgxQ", "review_id": "dpTHXXFJ_Rl_aBukdgtHTQ", "text": "Justina is fabulous! The food is amazing. This is a great date night for my wife & I. Love love love it!  We bring guest in with us and everyone always loves it!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2011-02-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "3RD504bNEwOmeqImRuVSsw", "review_id": "yOkGdXKJ6d1tjdbUUwMU8g", "text": "I cannot believe it has taken me this long to write a review for Justina Duong's wonderful Cyclo Vietnames Cuisine.\n\nWe visited Cyclo for the first time on the first Friday after a very positive review by the Arizona Republic food critic Howard Seftel.  The small place was slammed.  Being a woman of action, I stepped in and helped by being the \"hostess\" and taking down names for a waiting list.  Guess that helped me become friends with the acerbic but deep down sweet woman that is Justina Duong.\n\nYou really can't go wrong with anything on the menu.  Spring rolls are compact but full of all sorts of meat and veggies.  Bun Hanoi and Bun Saigon are tasty treats full of fresh herbs and vegetables.  My husband loves this lemon chicken curry dish that to me smells like Lemon Pledge, but he gets it each time. \n\nthe beef pho is full of flavor and comes with a mound of salad, unlike some of the other \"cheaper\" pho shops nearby.  \n\ni can't imagine anyone has complaints with the food at Cyclo.  If they do, it is probably that their judgment is clouded as they came on a Friday and Saturday night at 7 p.m. to a 14 table establishment and expected to be served immediately and be fawned after.  If you are this needy, don't come here and take up a table...we're waiting patiently to be served. :)", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2011-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rviVgJFfVSBKEyRFFkH05A", "review_id": "0vX6RbUei3HY6y9el3fhSw", "text": "Delicious yet again! Pho, garlic green beans, papaya salad...they can do no dish wrong. The owner, Justina, is hip, cool, gorgeous and awesome! It's BYOB so bring a nice wine or beer...no corking fee so don't forget to tip well!\n\nIf you're eating and there's a big line of others waiting, please do what we do and go across the street to gelato so that other people don't have to wait an hour.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2012-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GLwSntMlUtHUYCGFikHVHw", "review_id": "tk0tPKfHs33pjpKy4z8Mqw", "text": "Love this place! The food is excellent. The atmosphere is intimate. And Justine, the owner is a riot! She interacts with all her customers, and she has some serious personality! Don't forget to bring your own bottle of wine.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2012-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uo_QrRmhVfv6iGIsZo-7Vw", "review_id": "RvFLNjeZELZndY7YaCBQqg", "text": "This place is more about ambiance than anything else. It's a Vietnamese restaurant for trendy hipsters-- complete with extremely liberal and free-spirited proprietor, Justine.\n\nAlthough I like Justine, I can see how some might be turned off by her. But for me, she would be the main reason for frequenting this place. I like friendly and engaging staff, and I believe in supporting local business. \n\nBut the food is not particularly special. I've been here twice, and the meals have had little impact.  I like the atmosphere so much that I went again, hoping to fall in love with the food, but it just isn't happening. The flavor is too mild. And it makes me sad. \n\nArizona severely lacks culture and general character, so I want to support these types of restaurants so more will pop up. I might keep trying. Maybe I need to find *THAT ONE* dish that knocks my socks off. Here's hoping.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 3, "date": "2012-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FKNdmT7FSpdgaqM3fvjQ7g", "review_id": "3B2tWXU38Rc5e4bEgJsV_A", "text": "The pho is fab... and the seafood with rice cakes awesome!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2013-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IVv4rnmrMlBC6wSxM0nw8w", "review_id": "Ef3aOErGP39oybmkJOwJtQ", "text": "I only truly crave a couple of dishes and the Saigon Noodles at Cyclo is one them.  Every now and then I need to go in and get my \"fix\", LOVE IT!  The restaurant is clean, the owner oversees the place daily and the service is fast & attentive.  Give it a try.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2013-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZE7thFRTlT7kpObe51DUkw", "review_id": "DKfm6xs6e2LxssP4bV4zug", "text": "This place is very trendy and the service is great. The staff is friendly and always ready  to recommend dishes. They do not sell alcohol but you can bring your own wine and they will serve it for you. A great spot for meeting friends. I love their pho....", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2013-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xEtDx69diKkGb42TqIG_FQ", "review_id": "gGR5Zw6ZnOmxRFkzweN7rw", "text": "my favorite!  love, love, love!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2013-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qU7X0MZ3_eS4joV1s-E_qw", "review_id": "Ko5x8eS3ZrWw3oM9N08TXA", "text": "Still of fan of both Justina and the food at Cyclo.  Crisp rice noodle cake is great, the the green beans and pho are excellent too.  Justina could not be nicer to my kids, and she is always ready to laugh.  For those with kids, the chicken noodle soup and green beans are both big hits.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2013-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "cI6OM7xuSW-v2k5v-Xr2aQ", "review_id": "TRIvbBrZFtv6xBaoQjd-jQ", "text": "Food is great. Prices are through the roof. \nHostess is usually high on something and uses the \"F\" word in every sentence. Also hogs the tables for annoyingly long time. We are there to eat not be your best \"F\" buddies!!!!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 3, "date": "2013-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "pFZYPHIn4m1xIOS1boLfyA", "review_id": "9vbFhGO34Wq-llPf79NrMw", "text": "I really don't understand what the fuss is about with this place.  I had it years ago and thought it was horrible, but decided to give it a try again today with some co-workers. What a mistake!  First off, the food is horribly overpriced.  You can get a better bowl of pho at many other Vietnamese restaurants for half the price.  Taste wise, the pho was horrible.  It's all about the broth for a good bowl of pho, and it tasted like they just used beef broth from a can.  Additionally, the brisket smelled like it was spoiled.  Even my American co-worker thought the food tasted horribly.  This is the first time I have not left a tip at a restaurant.  It was that bad.  If you go to a Vietnamese restaurant and you don't see any Vietnamese people there, it should tell you something.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 1, "date": "2013-12-15", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "59HZ2d69gRPyKsvWGGZwCA", "review_id": "CQYVX5C_CX0UTB1MdOnk_w", "text": "A friend turned me on to this place.   The food is top notch.   Justine is a hoot.  If I go too long between visits, I get withdrawls.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2013-12-16", "type": "review"}
{"votes": {"funny": 3, "useful": 6, "cool": 1}, "user_id": "liIQCDzDTnvXc7X8twBIjg", "review_id": "wIjQ3U-y_XGkum6afkCIvg", "text": "Let me start by saying that I'm biased because I'm originally from the Bay Area and I know Vietnamese food...\n\nThis is not it, they're way over price and the quality of food does not make up for the poor service or the portion size.\n\nYou're looking at a $13 entree avg price, which is already high - but they don't make up for it in flavor/taste.\n\nIt took a while to get our food when two other parties got theirs before ours.\n\nOne of the pork chops on our table was really dry. Described it as eating jerky!\n\nWhen looking around for the hostess to get our bill, she was sitting down eating with a friend.\n\nLike others I've heard great things by word of mouth... But I won't be coming back here at all.\n\nThe good: It has a \"wanna be trendy\" little vibe to the restaurant decor. There was a diverse crowd when I was there. It's a small establishment, but clean.\n\nI'll keep it 100... When someone chooses to not talk to you in the native language of the cuisine they're serving... That's when you need to get up out of your chair and leave. That should have been the warning sign for me.\n\nBottom line: Never hurts to try a new spot. But don't let me say...\"I told you so\"", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 2, "date": "2013-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j2NjJ-WyR6c8BygoIHH0bQ", "review_id": "NsOyRfCATkJRkIIr6RPiIg", "text": "Wow, what a mixed bag of reviews.  Seems to me that some folks happen to go to Cyclo when their low mental cycles coincide with low points for the restaurant and others manage to coincide their highs.  Either that or too many cranky people are going to a great place.  That said, we just got back from meeting out of town relatives at Cyclo, which has become a tradition.  Don't understand the complaints about the decor or the service.  I do understand the differences in reactions to the food since in our party of five, there were definite differences.  The pork chop and the crispy noodle cake were thumbs down, with the verdict rendered on the noodles because it was impossible to tell apart the different types of protein that were supposed to be served with it.  Two had the mint chicken which was given an OK, although the broken rice was a bit plain for both eaters' tastes.  I had the Hanoi vermicelli and it was to die for.  Incredible broth, perfectly grilled meat, great herb accompaniment.  So folks, it all boils down (pardon the pun) to what you order.  By the way, heard no f-bombs from the owner who was her delightfully sassy self as well as being an efficient server and a really snazzy dresser.  Friday night and the place was at capacity.  Still on my list of places to go back to, even if all too infrequently.  BTW, all those complaints about the pricing were just silly.  It's not 1952 any more.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2014-01-17", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "P1fXuGmbdTz_jfEZLbWYcA", "review_id": "eDmmUGPAHhuhJpWZq3f98Q", "text": "This by far is the best Vietnamese Restaurant! We live in North Scottsdale and are always down to make the drive for Cyclo. We haven't had anything we didn't like! \n\nThe owner is amazing and the rest if the team is super friendly as well.\n\nNeed suggestions?... The Pho is Amazing! Want to try something different?.. Go for the Fried Rice Cakes with seafood, veggies, and beef! To start be sure to order the Vietnamese Egg Rolls, Green Beans, and Black Bean Shrimp! We always end our meal with an iced Vietnamese coffee. Better than any others. And don't forget-- it's byob!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2014-02-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z44yQHWO4EfCzgxHmG9UAA", "review_id": "AmsR3-l2UNHOf8zCcYSXkQ", "text": "Vegan, vegetarian and pescan friendly! By the gods it has amazing pho! The decor and music are hip and stylish. At night the low lighting with the festive lights is almost creepy. The people are friendly and most speak enough English to understand complex orders. My only complaint was that bean sprouts were not offered. The cilantro served was for one person not two. The limes and jalapeno were sufficient however. I always want more basil/mint but I'm just picky. Been to three pho places tonight. I'm glad one was friendly enough to serve all. A great restaurant. Although pricier than the rest. Worth every cent.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2014-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xuncLWv-69AqBo-ho16CBA", "review_id": "1rG3hFS3TQ9DE2kbNKl6LQ", "text": "Great food, terrific service.  The owner is super funny and very thoughtful.  Go here!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2014-12-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "sCU3KOdf_E1X1THWjhhxDw", "review_id": "aH8o5WZ6mAu3FKEqUm9aDg", "text": "Me and la familia ate here 3 times over my 3 nights stay over christmas ( i think i wont be missing pho for a good couple of months). I lovee the pho soup. And i heard the entrees are pretty damn good too, especially the clams and oysters. The only reasons for the 4 stars are the service and the ventilation. I always come out smelling like pho, which i dont like. I like my hair to smell flowery, u know?", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2007-01-02", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "YyPncV7fwWflne10BiCf6Q", "review_id": "6WG0bt9wew39wmdyCoFteQ", "text": "When we went to Vegas for New Year's, some people were talking about pho the entire trip.  We finally got a chance to go right before we left back for LA.  On a brisk windy day around 1p, we headed here.  The line was crazy, I think we waited for about 30 minutes before getting seated.\n\nWe were famished by the time we sat down.  The orders came relatively fast except for a rice dish, but considering how busy they were, it wasn't so bad.  I haven't had pho in awhile, and this was definitely one of the better places I've been to in a long time, and you know how many pho places there are in the South Bay.\n\nThe broth was great, the meat tender, and the noodles light yet hearty and filling.  I had a serious hangover after the NYE festivities, and I had to drive the way back to LA.  I don't doubt that having a belly full of good pho helped me recuperate.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2007-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "C6wyE9k2vjpU4tIGsbN7Ww", "review_id": "s6dt4gwoqV-0B_TOljcWEA", "text": "I'm giving it 3 stars because I only like 3 items here (not the other items on the menu), but these 3 items are actually really good and on its own deserve 4 stars.  I only like pho at 3 locations here in Vegas and this is one of them.  It's good and the place is cleaner than Pho So 1.  I also like their che ba mau because it comes with shaved ice, and they serve it in a plastic to go cup (in case I don't finish it).  Their spring rolls are pretty good too, but I can make those at home.\n\nUpdate:  I changed it to 4 stars because I've missed it so much while I was gone that I ate here twice a week while I was back home for break.  :oP", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2007-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7Oj_nlhwmUoTQGSLegMCdQ", "review_id": "7EPKJm7bB6EsW0Ke0lRWKg", "text": "I have to be honest, the first time I ate hear was out of curiousity! Come on with a name like that... You should of seen the billboard Ad. Let me just say they had very long chop sticks, LOL!!!! =P \n\nEverytime I'm in Vegas, I have to eat here especially if I'm with friends. For some reason they never believe you when you tell them where you what to eat. \n\nThe Pho is actually pretty good along with the spring rolls and egg rolls. If your tired of all the buffets on the strip or your looking for a cheap place to eat, just head over to China town.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2007-01-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "R-2GWjkuiCyFojQZ5cmvIw", "review_id": "EFIVGXez5b9k43865kgJKg", "text": "Dirty name, great pho!  A wonderful choice on chilly Vegas nights or to detox from a weekend of buffets and alcohol.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2007-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E7tozhm23vJSKBfozHWEMQ", "review_id": "KbSS9aNkdNBUk9k9FnjFwA", "text": "Lose all your $$ at the casino and need a cheap, but good, meal?  This is my Vegas destination for Pho.  Quick service and the place is big enough for alot of customers. They're open late and get alot of locals in the latter part of the night, which tells me this is a good spot for Vietnamese.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2007-02-12", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "23zYCcnqfru5jdxnTqjgDg", "review_id": "OriGmtTDre89_LYSUC7HDw", "text": "So in the Philippines --- it's called Bulalo --- late night soup for drunken debaucherous nights-no noodles --- eat with rice.  In Japan it's Ramen that  makes Cup O noodles tremble in fear. Vietnam... Pho. Yea not FO....FA A long long way to RUN!  But Pho Kim Long I'll run here any day. It's just fun to hang out and eat. It's kinda loud with the bustle of all the asian community hanging out and enjoying or celebrating the food. I just wanna eat it....They have Beef or Chicken pho. I love variety. I always get the beef pho with the thin sliced brisket and the part that's been boiled down for hours. I also like the fried eggplant. Mmmm with big ole garlic chunks. OH and if you haven't had it --- the bbq pork chops. Mmmm with rice. Ohhhh yea and the fried rice there rocks....Crap...I'm hungry....I feel like pho kim....pho kim long time....mwahahaha", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2007-02-12", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "uMZwpBuQiBqOG7EjeO3WBg", "review_id": "CWfIa3-zTsSV0A31dqBspQ", "text": "Pho Kim Long is good.  If you are going to Pho Kim Long you need to drive off the strip.  It takes about 20 minutes to Pho Kim Long.  There is no pho king here.  Its just ok.  I've had better phos.  The pho kim long broth was warm and not sticky.  I prefer mine a little more salty and less bitter.  There is a pho shizzle down the street but i wanted pho kim long.    I don't think I will be back to pho kim long any time soon.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2007-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "38JK-SfO9NkAGs1RwlH2Gw", "review_id": "TzgWY50tp6yOuC5FF1p-cg", "text": "My wife ordered bun tom thit nuong, also known as old #43 -   charbroiled shrimp & egg roll with rice vermicelli served cold.  I ordered pho tai, #10 - rare steak noodle soup with basil, sprouts and lime.  I requested the steak on the side and cranked up the spice level through a liberal application of hot chili sauce.  Both dishes were excellent as was the service.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2007-12-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "YLAkOLATflwWz_IkjW6izQ", "review_id": "IqnxdwkzZQC2rTNKyItrVA", "text": "Good pho option if you're seeking rehab from Vegas. This is my oasis in the dessert. An excellent find, considering most places on the strip are pricey are regular american fare. If you're craving noodle soup, this is worth venturing off the strip a bit.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2008-01-03", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "B8mwmQMrZO9nmhoXH9-pTw", "review_id": "80dZEiJQKNkglnch7yKBPQ", "text": "pho kim long can't make veggies dishes, i came there with a mad mad vegetarian, there tofu fried rice was just fried tofu with no taste the rice platter did  not even come with a dipping sauce till' we asked for some, the specialty pho was not as good as i thought it would be, i wasn' t that impress but i can with an appetite to eat and the food made me full, but it wasn't as pleasant but i  give it a so so rating.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2008-01-04", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "VEmJIx0QU5s-s230PreLVQ", "review_id": "JLlhf7jVHOQsw1umODNw8w", "text": "Boy this is the nicest decorated pho restaurant I ever been too!  The tables and flooring were all different from the usual pho places in the Bay Area, it was clean!  The pho itself was decent, nothing really that special, but it was good.  Its located in this Asian Plaza on this Asian Street, felt like I was back in Cupertino or something.  Anyways cheap ok food quick is always good!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2008-01-07", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "9nMgaQpWCG_vtogX0GYGjA", "review_id": "tMUPXPMKx0nl12hYsCI5YQ", "text": "Come for the name, stay for the pho.  I was pleasently surprised by FHL...I mean PKL.  At first I refused to come here based solely on the name, but after my girlfriend's cousin (who's a local) swore up and down that this was the best Pho in town, I relented.  \n\nSurely this is better than any of the Pho I've had in DC, though curiously, the best pho I've ever had was in my home town of Syracuse, NY, not the most cosmopolitan place, I know.  Maybe I am only rating it so high because it totally beat all my expectations, maybe there are better places in Vegas, but I will say I throughly recommend Pho Kim Long.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2008-01-09", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 3}, "user_id": "ipbvpgecCA0lPLecBNxUQw", "review_id": "p-Qu_QKcqJ0IL-cfppcvfw", "text": "The real deal...it's my \"Lotus of Siam\" of Vietnamese food...(at least here in Vegas...)\n\nMy husband, the chef, eats here weekly with the boys from the kitchen and a few chef buddies from around town...They always sit in Ben's section - he makes great recommendations when Chef is feeling like having more than #11 (pho) and some orange chicken (hey it's usually 2am so he's entitled to be a creature of habit of sorts...).  Since I work more normal hours, I rarely meet him -- but when I can, it's always a treat...\n\nLast night, since I had the day off today, we went -- and it was yummy!  \n\nBen was there and in addition to my usual can't miss dish (the salt and pepper calamari -- with jalapeno, green onions and crispy garlic), he suggested the Vietnamese salad with chicken -- it was brilliant!  Crispy cabbage, crunchy crushed peanuts, fried shallot rings, crispy garlic , tender pulled chicken, cilantro and a miso/ginger dressing that was perfect -- I love salads that are balanced in flavor, texture and acidity... he said they make it with duck, beef, shrimp, calamari, just about every protein they have in house...  \n\nThen he suggested we try the lamb -- I know...lamb at Pho?  It was phenomenal -- tender lamb chops with Chinese spices, grilled to medium rare...over a cold, crispy romaine salad -- again another great dressing -- not sure about ingredients in this one though...\n\nThen he told us they had venison...but by the time he got back with sauces it was 86d, so he ordered the beef for us.  Out came a large, smoking hot black river rock -- a plate of sliced beef, with chunks of butter and limes.   He melted the butter on the stone, then put the beef on it and we cooked it to our degree of doneness -- squeeze of lime -- a dip in the sauce, and it was tender and delicious and took seconds.   That rock wasn't going to cool down anytime soon...\n\nLast night, the spring rolls weren't that great, and the dumplings were tough -- so I'll avoid them next time.  Hey, I can't eat everything...so it's fine with me -- but I'm still looking for Vegas' best potstickers... \n\nBut for a chef to come, and when he's in the mood, for the experience to be totally different -- that many think is just same ol, same ol --  and for us to be treated like royalty (uh, we're not Asian...), is a real treat.  \n\nI've been in a few times by myself for a quick lunch -- and they always remember me.  It's nice because I'm not the kind of regular that I'd love to be...", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2008-02-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "CMr1unJEmblTB0LhDqdNOQ", "review_id": "svtvEae8IMOLheMP7xK4kA", "text": "What an awesome name!\n\nOkay, first off... as a teenager, I lived in San Jose CA - a city which has a ton of Vietnamese gangsters... and since I was always looking to get \"hookups\" on car parts, I ended up meeting and befriending alot of the aforementioned Vietnamese gangsters. Those guys ALWAYS used to take me to the best pho spots, so I'm no pho newbie.\n\nI decided to try out Pho Kim Long with one of my boys right before he got married in Vegas, because it was quick, inexpensive, and let's face it, the name of the restaurant is awesome! Funny as hell!\n\nAfter taking some quick Myspace pics by the sign outside, we ventured in the restaurant and ordered our food. My homie ordered Pho Dac Biet, and I ordered Pho Tai, which is my favorite because I love the thin, rare, red slices of steak (tai) that they throw on top of your steaming soup with hot rice noodles. \n\nAs we waited for our food, I did my standard Vietnamese restaurant ritual of thoroughly wiping down my chopsticks and little condiment dishes with hot tea and napkins. You can never be too careful, especially since Pho Kim Long is located conveniently next to a platform shoes store for strippers.\n\nThe service was pretty good, I appreciated the fact that the waiter made an extra effort to hold our pho bowls on the outside! =) I've been to pho places before where they grab the bowl with their thumb on top, and the other fingers below the bowl... but I hate that, cause the soup splashes around, and the waiter's thumb often times goes into the soup! Aw heyllll NO!\n\nThe broth at Pho Kim Long was just \"aiight\" but I guess not bad for Las Vegas... I dont expect Vegas to have top quality pho anyways. Let's face it, people go to Vegas for buffets, gambling, parties, drinking, lap dances, and drive through weddings. Not pho. \n\nSo I'm rating PKL (FHL hehe) with 4 stars. Cause I think it ain't bad for Vegas, and at least the guy's thumb didn't go into my soup. Good lookin out homie.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2008-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LeQV9wij3J0JDEcE_xd1Pg", "review_id": "ylhOPGpoJ6nLUCeyku0Kig", "text": "I was hoping for this place to be like Pho Kim Long in San Jose but it was a far cry from that.  The pho was \"ok\" from the other folks with me and my bun rieu was not good at all.  It was very salty and they had snails instead of ground pork mixture.  That would've been bun rieu oc but their menu just said bun rieu.  Very misleading.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 2, "date": "2008-02-27", "type": "review"}
{"votes": {"funny": 5, "useful": 5, "cool": 6}, "user_id": "gbKH4HrMms3kYIAFILuaCQ", "review_id": "GZDTuX3w_juq_qdeUdz29Q", "text": "Before I write my review I just wanted to say, this is more of a *CANTONESE* restaurant than Vietnamese.\n\nMy family and I always eat here at least once when we visit Vegas.  I don't really comprehend why we do, we just do.  Actually, here or some other Asian restaurant in \"Chinatown\" - but as of late, mostly here.  Last visit, we arrived at 8:00 pm driving from Grand Canyon, so we were all beat.  Surprisingly, the restaurant was packed so we waited approximately 10 minutes.\n\nI found it strange that they have a \"smoking section\" of the restaurant, but that area isn't blocked off.  Wide variety of selections on the menu.  I think the only Vietnamese food they serve are pho and the dessert.  Everything else is pretty much from the Chinese/Cantonese culture, which is why I don't understand why their restaurant name is in Vietnamese.  Oh well.\n\nStuff is average - pretty good at times.  Not the best pho I've ever tasted, but will suffice during a late night craving of Vietnamese food.  I don't think I've ever had a bad experience here.  Oh, and one of the waiters is pretty cute :)", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2008-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d1B7lZdPgF1M61E1zROjqQ", "review_id": "3we324XBAlio7z1TnHpoew", "text": "If you're visiting Vegas, sometime it's just nice to get off the Strip. If you're a local, sometimes... well, sometimes you're in Chinatown or want some pho.  Pho Kim Long offers up good pho and also Chinese food and does it until 3 in the morning! I wish I could get late-night pho in Seattle, though this isn't the best, as it is pretty good and fills that need! The service isn't phenomenal, the food isn't spectacular, but Pho Kim Long delivers what you want at odd hours, even, and it's pretty affordable, as is typical for pho. I've been here for pho in the morning with a coffee and late at night when it just hits the spot and it does the trick!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2008-12-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "hz9v9G_-aLSfum-Z4OQn2Q", "review_id": "VAXLOLOUipsqH6SE4VxwdQ", "text": "Best Pho in Las Vegas, since I crave PHO especially when you come from the Bay Area. I got to have my pho fix. This place fills the bill. I like the fact it is open 24/7 since people like myself fly in late to Vegas.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2008-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UusRCkF4ObNdxOGSkwUQMw", "review_id": "fz8JJfT-e0AX6He0jMT7dw", "text": "I believe this is related to the restaurant of the same name in San Jose, CA. Anyways, I had the spacial beef Pho and it was average at best. The portions are small for the price, but the service and the atmosphere is significantly better then the one in SJ. Probably will come back if I'm craving Pho in the area.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 2, "date": "2009-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BfCysDOVY3lV6WSEYb92EQ", "review_id": "0XSRjnQIJcznjfnb2b0E8Q", "text": "If you're in the mood for pho, this is one of the best places in Vegas to get it.  Quick seating and service, and a hot and tasty broth make it worth the trip.  I'm not one to get fancy with pho, so I usually go with pho tai or pho tai chin.  A bit of hot sauces mixed up for dipping the meat, and I'm happy.\n\nThe egg rolls are served nuclear hot, and unlike a lot of other places, appear to be home-made... at least ours always appear that way, from their non-uniform shapes and funky bulges.  Oh, and they're tasty, too.\n\nA bowl of pho runs you around $7 with a large being $1 more.  This is expensive for pho compared to places in L.A., but is about the norm for Pho here in Vegas.  It's one of our default go-to suggestions when we're hungry and cruising up Spring Mountain.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-01-04", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "ECGa0INRH7Tr3qGDU8I60A", "review_id": "5mwwj8c2FQuT9Tpa-oOUcQ", "text": "Got tired of eating along the strip, so we all decided to head off the strip and go for some authentic asian cooking...some comfort food since it was freezing cold out (literally, temps were at freezing point or below).  For a party of six, the bill came out to be just shy of $90 and that's already including the tip!  How can you beat that in Vegas.\n\nWe ordered:  (2) Hu Tieu Hoac Mi Ga -Chicken Rice  Noodle - 5.95; (2) Kim Lon Egg Rolls; Pho Tai 5.95; (3) Rare Steak Noodle Soup; Special Combination Tender Beef Noodle Soup - Pho Dac Biet 6.95; 4 Avocado shakes; Soda Chanh Duong - Soda with Fresh Lemon - 2.50.\n\nService was good and food came in a jiffy.  I'd definitely be returning and the name of the place is hilarious...just say it really fast and you'll get what I'm talking about =)", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2009-01-06", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "W_vpGqQlGVrWN7eMYopPHw", "review_id": "a44KmA3Q39HB8ZvSBgYnuw", "text": "This is the place to go for some nice Pho noodle soup and classic Vietnamese food! I usually grade Pho noodle shops by a couple of things... First, the flavor and quality of the broth, it can't be too greasy, great deep color of the broth, nor too much MSG. Secondly, the quality of the meat! I usually get the combination, of tripe, tendon, and the rare beef . Lastly, the quality of, what I call the extras, i.e. Thai basil, white onions, bean sprouts, jalapenos, &etc. \n\nThe second dish I usually judge a Pho joint is by the quality of the spring rolls. Now, I've been to many places where the spring roll just plain sucked! It's hard to find a place that has all the elements of a good spring roll. i.e. the shrimp, not too over cooked. The pork, is it flavorful? Is the vegetables mushy? and the overall quality of the flavor, not too much vinegar, a slight touch of mirin, and of course the quality of the peanut sauce. Makes me hungry as I write this! This place hit all the mark! \n\nNow, let me say this, when a place is called Pho Kim Long...Pho soup is the way to go! Enjoy what they are known for! With that being said, the bowls of delectable Pho has to be one of the better ones in Vegas. It's not to say that the Banh Mi sandwiches are not bad, to be exact, it's actually pretty good! \n\nService is very prompted, friendly, and professional! Nothing negative to say about it at all!  \n\nPrice wise, it's great! Everything is pretty much under $10.00! Can't complain too much here! \n\nEnjoy! \n\n n ngon nhé", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2009-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0kAmqblOxHzDZSIqfZmboQ", "review_id": "FLu4ZSwPnKVikSRs89oAog", "text": "I think we chose to eat here because of the name of the restaurant.\n\nFood is pretty good. I came here with my parents and my boyfriend while visiting Vegas. My dad and I both ordered the typical pho bowl. My mom and my boyfriend both ordered this soup which was almost like ours except it also had blood cubes in it. I liked them all, and it really hit the spot on a cold night.\n\nI just thought it was kinda pricey compared to what I'm used to. But I love the fact that it's open late night.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2009-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TI05zd3zWVIt401z1qzsgw", "review_id": "zJ8A_GPAzyJ00j2ifhk-rA", "text": "I am shocked we came here on our face day of being in Vegas. My pops never really likes to eat anything unless its Chinese food. Well, okay that's somewhat of a lie. But here's what I make of the place:\n\nNot too bad...was this placed called something else prior to being Pho Kim Long? I know we came here ages ago (my family and I) and I was sorely disappointed back then. This time around it wasn't too bad and it was actually quite good. The only problem was it was quite pricy for a bowl of Pho. I think it was 7 or 8 dollars for a average sized bowl. Trust me, coming from San Jose, CA you have places with an XL bowl costing you only 4 to 5 bucks. \n\nOverall, I give them 3/3.5 out of 5. It was better then before, food was YUM-O, and service was eh, and the atmosphere was also EH. Enjoy!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2009-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "X_yK-amzvo5y-sh1Wyj-ww", "review_id": "_2bAJ_Ts8yvwHqtvCmxnQg", "text": "I like this place. Don't need to worry about sticky table or greasy floors. It's clean here and food is great. I've tried the Pho combo and Vermecilli noodle with egg roll and pork. I've been here a few times when driving to Vegas. \nIt's about 10 mins off the strip. Some authentic Vietnamese food. I'd definitely return here again.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-01-11", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "LrezRHu1W8Rygp7bag16tQ", "review_id": "g7Vu7K9n__Ty7qdqHKoxGQ", "text": "Ah, Fuck Him Long. My posse's current late-night dining obsession. I am no pho expert, and as a matter of fact, I order bun and not pho, but I find this place to be only OK. On our most recent visit, our table ordered together, and my #32 didn't come until everyone was done eating and we inquired about it. It's on the pricey side for pho...most dishes around $9-12. The shrimp spring rolls are popular with my krew, as are the rolls with the shredded pork skin, but I'm not particularly fond of either, especially considering the price. Service is OK at best. Decor is nice, almost classy, even. They're open late, and they're pretty close to the freeway, which are very good things. I'm not in love with the place, but some of my more pho-knowledgeable friends are very fond of it. I'll continue to go, but I'm definitely keeping my eye out for something better, or at least cheaper.\n\nPRO-TIP: They won't split checks, so if dining with a group, bring cash.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2009-01-12", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "B69QV5-wmQf27l-yGcNK4g", "review_id": "l2lt7ijC8Gf5ROAZR2BUwQ", "text": "This used to be my favorite pho spot in Vegas.  Some days, you tire of the endless buffets with rich, greasy foods and you just want some nice comfort food.   Pho Kim Long (yes, the name turns us all into giggly 12 year olds), was that place for me.  \n\nHowever, on recent visit, I noticed that they have remodeled/redecorated and their prices are really inflated now.  A bowl of pho there used to be like no more than 7 dollars but now, there are bowls of noodles over 10 dollars.  I think they are trying to reach into the non-asian market or something and trying to make it more upscale.  Bah!\n\nTheir food is not the greatest, compared to LA standards but it is pretty darn good considering the few choices that you have to select from.  \n\nI would have given 5 stats but took 1 away for unconscionable pho prices.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HYrswcOFPKUcrFCPxCO7PA", "review_id": "huhxO3nVT_SuBji2Z3dJ-g", "text": "I would give this place another star but the service we got from our tired waiter ruined it.  He actually said he was worn out and was ready to go home.  Not what we wanted to hear especially since we were hungry.\nHe took his time and never really checked on us.  Good thing the other wait staff brought out our food.....and in no particular order.  We had our fried rice brought out to us like 10 min before the rest of our dishes.  What good is that?  Good thing it was yummy.  We then had to get white rice which they now charge for, to have with our entrees.  We had the honey walnut shrimp, salt and pepper pork chops, and crispy noodles with beef and brocolli.  Everything was great!  I definitely recommend this place if you're looking for something comforting to eat off the strip.  Price wise....we were around in mid 20s per person for about 4 shared dishes and drinks....(smoothie, and thai iced tea).", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2009-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ntCuKtSIW9wZaceiLL8NjQ", "review_id": "cOUKhCrfP1-kKUCgQWzxUg", "text": "Can't go wrong with soup if/when your drunk after a night at the club. A friend took me here once and I just could not believe the name. The pho is pretty good and their cooking time is pretty fast; but besides that the service was pretty horrible they practically forgot about us.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2009-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sXD4UCK93v0RY4Z-JKltbg", "review_id": "iabD6fw7iwZZl1JVEWjvrg", "text": "Pho and bun are worth the extra mile off the strip.  Beware, the rooster sauce for some reason is much more potent than anywhere else. Trust. I am a hot sauce mastress.  Upset that I didn't get any TRIPE in my soup. Yea I said tripe. ...But their sliced brisket was deliciously pink and tender.  #9 rocks.  I was also intro'd to an interesting new concoction... ask for a side of sliced pickled onions and toss it yourself with some lime juice, sriracha and crispy bean sprouts for a yum bump to your soup.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GDjbuO8V1xnB0ilPzfToQw", "review_id": "2xs2K-I92ymEdxsHj2Rk1w", "text": "Ate the pho here...pho dac biet...it was okay.  Not as flavorful as the pho I've had at other places.  Big restaurant though and good for large groups.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2009-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JSFvo564_N4eZ0PM4BQ6Rg", "review_id": "TtHR69p78R4PNl9hnZ6Wpw", "text": "This place was off the beaten path and somewhere off of the strip but what a great find.  There was about 9 of us that popped in here around 4 am on a Friday night...and all of us left here with a smile on our face.  that's a tough task to accomplish after drinking for 16hrs straight, getting your ass kicked at every game at the casinos and leaving Rhino with mad blue balls...but somehow Pho Kim Long had that right receipe.  \n\nThe pork chops were so ridiculous that we had to order another order as soon as we all sampled a bite. The pho (I had the chicken) was awesome, probably one of the best that I have had. And this place served us BEER at 4 AM, now that's outstanding. \n\nFor a late, late night joint the place was clean and the atmosphere was classy and inviting.  we were in awe of some of the fish that were swimming around in their fish tank or maybe it was the two hotties reflection off of the aquarium that all nine of us were taking glances at, remember we just left Rhino.\n\nBut none the less, if you are in need of a hangover fix or something to soak up all the booze, definately get a bowl of Pho, here. all the gambling wounds, phony temptations of banging a stripper and regretful short term memories that flash back from the evening will dissappear once you get involved in a bowl of pho. I know us 9 rowdy guys found a moment of bliss just by the shear silence of words replaced by the sounds of slurp.  That lasted about a minute.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2009-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BB8kIgEs2SHssl6xE9lIAg", "review_id": "kdPUFW_mL-ndXIV6BqNGKA", "text": "I have come to this restaurant at least 10 every time I come to Las Vegas.  My take here are decor is ok, so is the food, service is unpredictable, and the prices are varied.\n     The dining room is buddhist-like temple  theme which is more of a cross between Chinese and Vietnamese.  There are lots of buddha figurines in different sizes.  The fresh water fish tank is nice with expensive variety of fishes. The plants need to be taken care of because they are covered with dust.  The restroom needs to be clean because toilet paper are all over the floor.  By the way they haven't upkept since the remodeling.  The place needs better ventilation because I can smell lot of pho flavors when first entered.  \n     The beef noodle soup here is reasonable.  First, the soup come out really fast.  The broth has a distinct cinnamon flavor, which is typical.  I prefer a balance flavor broth.  The price for the beef noodle soup is fair.  The seafood soup here is overpriced because the content in the soup are 3 pieces of shrimp, 2 fishballs, 3 slices of cuttlefish, and egg noodle in a blanched broth.  The BBQ duck is tasty which has a balance flavor of crispy skin, duck with fair amount of meat,  and good price.\n     The service is unpredictable.  They have all male servers with a serious look on their faces most of the time.  You have to ask for service. One upswing is  they give you the right utensil for your needs.  The 17% gratuity is added with five or more in your party.  Since there is not much service that seems rediculous.  You can't split check, boomer.\n  Their non-alcohol prices are more than their beers.  Might as well order a beer for your thirst.  One more thing,  the servers dress in a nice tunic-like shirt which I thought stand out.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 2, "date": "2009-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jUj71E-IdFkyxfGq9M3BQw", "review_id": "sMfNN3gpcTEDFJE7E5Cqag", "text": "love it,   gimmie my roast duck and bbq pork rice plate and im good!!!\nbeen here several times and its always busy and for good reason, because to food is damn good, well priced and did i say its good!!!\neasy to access location and has a great menu with many many options, almost too many at times.\n\n2 thumbs up", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QSQeU6bDea42m6yH_pOQ8A", "review_id": "qWRmA2ljsrPfomCkA-6tiQ", "text": "24 hour Pho, they know how to do it.  If only they didn't make the broth so salty it would have been good.  The meat came out medium rare, just enough so I could dunk it under the noodles to let it cook a little before consuming.\n\nThey definitely want you in and out.  A few people wanted to take our order and before we could finish we were asked if we were done and the check was coming.\n\nMaybe the other dishes were good, but when they say Pho, the first item I would go for is the Pho Tai.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2009-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "38JK-SfO9NkAGs1RwlH2Gw", "review_id": "FDq6yDugoK_RYB5eahMojw", "text": "We shared another bowl of pho ga. It was much tastier and fresher than was served at Pho Saigon 8 though it should have been hotter.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2009-12-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Kr5slhHH7qYEWpzOhnhaUQ", "review_id": "N4pHI7x11F2GvG16efJZww", "text": "thanks for the tip, yelp!\n\nnice decor (especially impressive for a pho restaurant!), open 24 hrs, and, most importantly, yummy pho (tasty, rich broth, perfectly chewy noodles, fresh veggies). this place was so good my vietnamese mom, who is a pho expert, expressed her approval!\n\nother non-pho dishes were waay too oily. the noodle dish we ordered was shiny and there was a pool of oil at the bottom of the plate... and the chinese donuts were overly crunchy, missing that slightly sweet and chewy flavor that i love, and also dripping with oil. \n\ni'd definitely go back for the pho, but would probably discourage being too adventurous with their other menu offerings :)", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZG4bZCEfDZqcVzNwTtFgKg", "review_id": "BW5G0OESYQmDyA8hJpbKAQ", "text": "This place hit the spot after a long night of being out and about in the cold. And it definitely made me feel better after learning that Avatar in IMAX 3D was sold out.\n\nThe fresh spring rolls are so good. Granted, I don't think you can really mess it up, but the peanut sauce was yummy! The pho is your standard pho...meaning it is good any time of day. \n\nService is fast, food is cheap. Will definitely go back when I'm in town.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-01-06", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "itOl59QJzkI23FCG3RMlHQ", "review_id": "w7sTrRDCb6UzWeMJame-4w", "text": "let me first start off by saying that the pho kim long in san jose is WAYYY better..the only thing that remains the same at both places is, sad to say but the lack in service. \n\nwhy this place sucks more in service is because they are really rude and they get angry when you say you're going to \"share a bowl\". excuse me for buying a jumbo size pho and wanting to share with my bf. jeez. another annoying thing is they grab your bowls off the table when you're still in the middle of eating. it's really rude that they just \"assume\" that you're done with your food just because you're sitting and talking with your other guests at the table. \n\n3 stars only because i realized pho hung sucks more. minus 2 stars for service and PRICES. they are REALLY overpriced for pho compared to san jose.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HGyi79YroBjXt1Qr-wJkAg", "review_id": "j_WJeQSJfHeYohKWHNL5UQ", "text": "Wait was long... service was bad ( aside from one bus boy).  Food???  Not worth the price you pay for.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 1, "date": "2010-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S_JqbX-UTZvHdKOaTM92Pg", "review_id": "Cn5Za2mhm81ymlo-I4mR3A", "text": "I thought this PHO KIM LONG was related to the one in SF and SJ so I'm here asking the waiter, hey, from your other sister restaurants in SF AND SJ, I heard your crab was really good. They look at me like with a confused face. LOL. They didn't even know the other Pho Kim Long existed. I felt SO moded. So actuallly THEY ARENT RELATED. I forgot what I ordered but it was the last meal (birthday meal) I had in Vegas before I left. All I remember is that I had their egg rolls, seabass, veggies, prawns, fried rice and soup. I had no problems with their service. Our waiter was really nice and gave us tips on what to order. If I'm ever in Vegas, I'll BE BACKKKK!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2010-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UEEBbjBpSy0MLu3-8FUpcA", "review_id": "AvvrTg9TEacK9qdGsVYBYg", "text": "Don't let location or exterior fool you.  Once you are in, you'll see a top tier classy and s immaculate restaurant.  Pho was top notch.  The noodle was perfect in consistency and the soup was piping hot. Very accommodating, my friends wife ask for vegetables in her noodles and they did an excellent job.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2010-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Kf0pU3QyHgBM4fVXDzwyjw", "review_id": "DuHrUdtAO3b_91PJm9kLmQ", "text": "OK, so maybe its bad to review and eat this after a Batali restaurant... but still... best Bun I've had... and the price was just right.  There are still eating bargains in Vegas.\n\nOpen 24hrs is a plus for food that's this decent and reasonably priced in the area.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wLfwrNlZGIsSnv6xi4ReWw", "review_id": "766nhojIG3y3SOeg7ZEndw", "text": "We came to this locale two Mondays ago for brunch. It was among the few small \"last hoorahs\" we will have had before heading back to San Jose.\n\nPho Kim Long in Las Vegas happened to be comparable to many pho restaurants in San Jose. Surprisingly, as I didn't think pho here would be any good. \n\nWe ordered:\n\n1 Regular Pho Dac Biet\n1 Jumbo Pho Dac Biet\n1 Hu Tieu\n1 Pho Ga\n1 OJ\n1 Sinh To Xoai\n\nBill came out to be around $45ish\n\nOverall, some complaints we had was that they didn't have the vinegared onions .. how can they not? Also, my friend ordered dark meat with bones for her pho ga, and they gave her white meat.\n\nService wasn't so bad.. they weren't as rushy and unpleasant like most pho joints. Would come back to try other items on their menu.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-01-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "lgyUc1Wuwi-INDAf448WTA", "review_id": "-MGKNoj2ZI8CTn38BOdXAA", "text": "Had dinner here on Monday night.  We ordered half a hai nan chicken, oyster hot pot, salt and pepper shrimp, and the pork chop combo rice plate.  The shrimp and the hot pot were good.  The hai nan chicken had no flavor at all.   The shredded pork in the combo plate came out cold.  It wasn't great but it wasn't awful either...  so hence the 3 star rating.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aIEXh8FDX8KB9QQfkkOYSw", "review_id": "Bn_DEs9FKOGiGtGZ57qilA", "text": "Came in here for a quick lunch before my flight. The food is decent. However, I wouldn't say that it was an authentic Vietnamese restaurant, much more like a Chinese restaurant to me.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "O1v9uPw8pDOCMCPp3whxLQ", "review_id": "eiKVCq3fahumBJZIlQenpg", "text": "The rare beef pho is amazing! The best part is they're open 24 hours.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2010-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "glRXVWWD6x1EZKfjJawTOg", "review_id": "oRKuxzJMX5dQGVh0xfjMlg", "text": "First the name is amusing and I have loud gay friends who visit from Los Angeles- you know just taking them to a place called pho kim long is always gonna be a hit with the queenies. \n\nMy bf and I are regulars for some late night pho as it is one of the few 24 hour pho. \n\n I dock off a star because, normally its fairly good but a few occasions the broth to me was more strongly spiced than it should be or lacked the spice, but many times it was spot on to my taste of how I like to spice it at home. \n\nBun and rice places have been consistantly good. I usually like the porkchop rice plate and bun with eggrolls with pork or beef bbq. \n\nI like that this place is clean and smells fresh. I like Pho So 1 too and find I prefer their broth but last few times I smelled so strongly of smoke BBQ that it was unpleasant to be that tired and can't crash into bed because I can wake myself up with the smell.\n\nI'm forgiving about Asian service. They are fast about serving in most places and then run off in their own world and you gotta wave em down for things like the check. I'm just happy to get food fast and not be held hostage waiting for a check this late and they do refill my drinks regularly enough so not gonna dock them down for the few times I needed to wave down to ask for something.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "fA-7xjEi4AiXV9bmATWDZQ", "review_id": "8vVx9mrNgoVRuRXYwxF_cQ", "text": "This place is a convenient location on Spring Mountain not too far from the strip.  A great place to go after a night out.  The inside of the restaurant is pretty spacious and better looking than the outside... which isn't impressive and the parking is frustrating because of the extremely narrow parking lot (more like a parking strip).  I usually order #13 steak & brisket noodle soup.  Their meals are decent.  Not great, but still pretty good.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5QqZTgUV7l1teCRkj9u0KQ", "review_id": "YIzJjZEocFbhpw3IzxDO1w", "text": "Pho Kim Long was a very nice and clean restaurant.  The menu is very extensive in terms of various Vietnamese dishes - it's not just pho. My friends and I had breakfast here,and ordered the pho dac bièt and bún tìt núóng. One friend wanted the pho ga as well as the pho dac bièt, so she ended up asking if she could have the pho dac bièt with the tìt ga in it and they were more than obliged to do so! My other friend ordered the bun tìt núóng but they gave her chicken instead of the beef. My friend not being so picky ended up eating the dish, which turned out to be pretty good.  The table adjacent to us ended up getting her dish instead. The waiters knew they made a mistake as did we and surprisingly acknowledged their mistake, which is always great and rare for any pho restaurant to do. Good thing we're not picky eaters, plus we were on a time crunch so we were more interested in eating and going.  Our food came with a good amount of meat so it turned out to be very filling.  I do believe the dishes are priced a little high but since I did not see too many other pho restaurants I guess competition is scarce.  All in all a good place for Vietnamese food, almost like home cooking.  I enjoy eating off the Vegas strip.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "8WGEyUit6DRXmpndNq4mXQ", "review_id": "4ISFXH8N9kbJOcGbqPmi3g", "text": "nothing cures a hangover like a good bowl of pho! we were most definitely surprised to find good pho in vegas of all places.\n\nfairly large party, so we were separated into two tables. one group actually showed up a little later but were accommodated quickly considering it was a busy weekend lunch hour. they were also able to seat us fairly close.\n\nin addition to pho, they also serve many other vietnamese rice and noodle dishes. we also ordered the chicken wings as an appetizer. lucky for us the portions are super filling so the chicken wings ended up a great after hours snack back at the hotel room.\n\nthey also have a super size which is seriously humongous! i don't remember if i saw that listed on the menu, but one of my friends was joking with the wait to super size her bf's order and the next thing you know they came out with one of the largest bowls of pho i've seen yet! too bad we didn't take a pic, it would've added to the prosthetics. but after all it is vegas! good thing the pho here is actually good, unlike the pho challenge in sf...", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-02-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "CJoUyxlaCgCjkvAf_Xuv8g", "review_id": "OYNqvPSxdXkVLChjWP9lUg", "text": "by far, the most amazing hangover pho i've ever had in my life. hands down.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-02-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NnZgbnniPdrXUBcfYFQXMw", "review_id": "M8boRZ11j0BCEl4v4r-dmg", "text": "This was definitely the perfect cure for our morning-after hangovers. It was surprisingly very nice and clean for a Vietnamese restaurant, but maybe I'm too used to 'the dirtier, the better' mentality of Viet restaurants in Little Saigon. \n\nThey had a huge selection to satisfy all of your Vietnamese and Chinese cravings, not just pho. However, I just got my usual Pho Ga (I loove dipping chicken in the ginger sauce). Definitely DE-LISH!\n\nIt definitely had the whole Vietnamese-people-running-around-busy atmosphere. They were too busy running around that they forgot to bring one of our friend's bowls... and she was the only one sitting there without any food when everyone else had ordered the exact same thing. Goodness.\n\nBut I'm glad to know that I can always satisfy my late-night-after-clubbing pho craves. YAYY~", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-12-03", "type": "review"}
