{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6ZyqtV5nQPL2RjMhfHOxWQ", "review_id": "S1ng7qqc0Q-OZIs62cwpyw", "text": "The food was alright. Not good. Not bad. And considering the portion, the prices weren't bad either. The service, on the other hand, was terrible. Severely understaffed. Three hours order to check. Worst of all the chef put cooked lobster tail back into the raw shell to serve it. Avoid at all costs.", "business_id": "8Nm_jcCYtMXYW0ODSHDiXA", "stars": 1, "date": "2014-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kMJAITuqfdBmr3O6Acq10A", "review_id": "rDaeP2h6QnLPcOZrdEngNA", "text": "Sunday night dinner turned Sunday Night Delight! \nWe started the meal with Spicy Salmon Tartar. We originally order Spicy Tuna Tartar but they were out of tuna and our waitress suggested the salmon version. It was quite good even though tuna would have had an edge for me as far as my preferences. I had the Nabeyaki Udon and was pleased but I don't think I would order it again. It was just not for me. My boyfriend really liked it. But a bit too leek-y/scallion-y and I just didn't care for the kamaboko. My boyfriend had the Little Conqueror and was really happy. \nGREAT service, lovely atmosphere and super food....will be revisiting!", "business_id": "mPlWLIA4pkHMRtlQDm6UyQ", "stars": 4, "date": "2011-02-13", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "HKnZ2i_fLupIiT05QDAaYw", "review_id": "do-wSTu0pB6F74uhcoKRUQ", "text": "Tasty & fresh sushi!  The food is very nicely prepared & laid out before you with a fair amount of simplicity, no really outrageous creative plating going on.  The menu seemed fairly traditional, I don't recall seeing the more \"Americanized\" (what I consider) \"crazy\" rolls that many trendy sushi restaurants (like NYC's & PHL's Haru) offer.  And don't take that as a bad thing.  While I'll happily admit to liking those \"crazy Americanized\" rolls, its nice to find a great more traditional place out there.  From what I understand Mr Shu is very stringent in regards to his sushi standards, to the point that he does not allow his sous chefs to prepare sushi if he is not around to supervise.\n\nThe restaurant itself is small & cozy (& up a loooooooong flights of stairs) & without the loud banging tunes you find in the more trendy restaurants so that a great conversation is possible to have whether you're there on a date or catching up with a friend.\n\nI wanted to try the omakase, but opted against it as Umi was my second dinner of the evening (I'm a pig, I know), however I have heard pretty mixed reviews on whether or not its worth it.\n\nThe service was simply OK.  Kind of slow.  No, more like definitely slow.  Nothing special.  Still gave the waitress a 20%+ tip though so obviously I still wouldn't call the service horrendous.", "business_id": "Cy9XgM3ZG2jZ1ganvolb6Q", "stars": 4, "date": "2007-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OdJ8lJs8nBLVmuyuY1Jjew", "review_id": "LUXzY5yS9NiM3l2rBgbDLA", "text": "the best Japanese restaurant in Pittsburgh, have to try the omakase which is absolutely deserve 100 bucks! Enjoy it", "business_id": "Cy9XgM3ZG2jZ1ganvolb6Q", "stars": 5, "date": "2015-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XZuMpc6E9RqZX4HXtmlr-g", "review_id": "Sc2ludREJRfTqpEWhT60Pg", "text": "I had high hopes for this place after a friend said it was a well known gem with the Japanese in Charlotte. I enjoy restaurants that are run and frequented by people who know the food well. My friend and I came here on a Thursday night around 8:30pm and were the only souls in the place. Let me also say how hard it was to find this place. Granted, it was raining and dark, but their sign was not lit and was hard to see amoungst the other places in this strip/suite mall. I was anxious to try the ramen noodles since it was a cold, rainy night and it sounded very comfortable, like memories from college days. The bowl was very large but could have used more noodles. I don't eat pork and there were 3 hefty slices in the bowl which my friend gladly ate. Overall the ramen tasted good, but there could have been much more noodles and less broth. This would be a great meal to eat if you had a cold or wanted to be warmed quickly. My friend had the squid salad which was pretty good. We also had 3 different sushi rolls which were named after a baseball theme. The spicy tuna roll was pretty bland. It was wrapped in tuna and had spicy tuna in the middle of the rice roll. The tempura shrimp roll was good but a little large to eat with chopsticks or even your fingers! We also had some sort of avocado and crab roll which was fairly decent. Overall this place was just ok. I may be back for some take out ramen but honestly I could probably just make my own at home for 95 cents and add some veggies.", "business_id": "Y_OeiGhTm6ZEfZ1UQgM_wA", "stars": 3, "date": "2013-02-08", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "LrgQbdg3V7uqLllQEbsKRg", "review_id": "dbpkyXcm6g1Gy5hEgWtfBQ", "text": "I have to rate Kabuto on the level of all the other places in charlotte and surrounding and it certainly does not match up well at all . I did try their sushi and the teppanyaki. The sushi was basically grocery store level maybe even worse and the teppanyaki was overly salty. The quality of all there food simply was not there. They did put on a decent show though and I would recommend it for families with kids or if you live near by and do not want to travel to the other better places. Other than that they have similar prices to other places so it is a waste of your money.", "business_id": "P0aKJw8rb0DKLaGottHEAw", "stars": 2, "date": "2010-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GaVTF29D82S0RlMtQxvQUg", "review_id": "p23RXlsTtnhHzBOFaZlAAQ", "text": "overall food and service is what you would expect from a Japanese style steak house. What bugs me, is the fact that they menu is not up to date. We dined at 5:30 p.m. In order to get the early bird special as shown on the menu. When I ordered the early bird special which is a steak and chicken combo, the waitress told me they no longer do the early bird special. I asked her how long they have stopped doing this and she said Oh it has been a long time. But obviously they have not updated their menu to reflect the change in what they offer. So beware the menu does not reflect the true reality at this restaurant.", "business_id": "xLZilmaLXY0r-dBFaiLxww", "stars": 3, "date": "2015-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6T8aRZyzdRaRQPreSBKWSg", "review_id": "yz8yk_-Km1Oy6mZVCsWmIg", "text": "Not bad at all.  Service was a little slow at first but then a second sushi chef came out!   I'll let you know if I get sick or not!?!?   Fish looked a little sketchy at first, off color.  :o/", "business_id": "1PSnPPFVfp03iPfJRPWWQw", "stars": 5, "date": "2015-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "griafDT_UC8o42i7P_9sWQ", "review_id": "-MyeINKtD6ldoxJHqMt7WQ", "text": "As far as I remember, this place is pretty good. A pretty unique restaurant for Champaign. Definitely sit at one of the tables where the food is cooked in front of you, it's basically a requirement.. or something. \n\nThe food was consistently pretty good but nothing hugely fantastic and not a whole lot of traditional dishes, unfortunately. \n\nNever had sushi here", "business_id": "K5PfWwW61Ajommy9xvXdAw", "stars": 3, "date": "2011-02-03", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "_PzSNcfrCjeBxSLXRoMmgQ", "review_id": "zg5va8QgCyAdd4F7wbZ1dg", "text": "Back to Blue Fin for the nth visit, but the first visit for 2011!  Same great service, same good food, and same affordable prices.  \n\nHad my usual order:\n\nTerriyaki bowl - YUM\nFried Gyoza - HUM\nGreen Ice Tea - AHH", "business_id": "kaIue7GRCmkPzDeHDBTttQ", "stars": 5, "date": "2011-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m3TiH6pCzL4NFZnJTUT9lQ", "review_id": "MCRDTEXM5alPvddGt5eOqg", "text": "After living downtown for 2 years my husband and I finally tried this place.  I got the chicken teriyaki plate. It was all I hoped it would be: tender moist tangy chicken. The salad dressing was super garlicky and a wonderful compliment to the rich teriyaki  and sticky rice.  The only reason I can't give it 5 stars is that Husband ordered the all white meat version and it wasn't nearly as succulent as mine. Granted I understand that white meat is, by definition, drier -- but even I've managed to cook a moist chicken breast so.... Regardless I am definitely going back as I really want to try some of the fried dishes. The dude next to us was just SCARFING down some sort of wonton-type things.", "business_id": "kaIue7GRCmkPzDeHDBTttQ", "stars": 4, "date": "2014-12-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "i7VMvAVM5WKraN5ETG15Vg", "review_id": "OaNdPRd8M7yHzySjUUeOZQ", "text": "The teriyaki bowl with white meat is good.  It's not knock your socks off but I go there weekly to get my rice bowl fix on.\n\nThe lunch service is pretty fast which is a big plus.", "business_id": "L19_1cG2ALVjdBQ456h26A", "stars": 3, "date": "2012-12-14", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "55ecDCpJIXzTWjEzMQ11Vg", "review_id": "gCwZvHa_j4Vppn8aa8hjdA", "text": "3 stars - Yelp says - A OK\n\nThat means, sure, I'd go back and I should state here and now that the 3 stars might not be all their fault but my fault too.\n\nPlan to see mid-week movie with my daughter who teaches at junior high school and after school volleyball and we have plans for 7:45 movie which means time is compressed. Daughter has limited sense of adventure for foods so I figure this place always offers her bail-out choice of Italian. Enough background...\n\nProblem is, I had lunch too late and I arrived less than hungry. I'm equivocal what to order. I ask waiter for advice (mistake). I order cream soda and he comes back and asks me what flavor and listing too many choices. I order cherry and it seems to be a club soda with grenadiene (sp?) - mistake.\n\nOrders arrive - daughter shocks me by ordering Pad Thai which was quite good. I get winter special of Ishikari - Salmon, cabbage, tofu and rice noodles rather cleverly cooked in a miso based soup in industrial type mini-bucket with oak sealing lid and apparently brought to table from oven. The salmon infusion into the miso was an incredibly delightful broth. The salmon appeared to be generous, good quality but a bit undercooked and I didn't have the time window to do anything about it. The rest...the tofu / cabbage / etc. seemed to derive no benefit from the delightful miso broth.\n\nSo in the end...I probably could have given them 4 stars because there is nothing inherently wrong with CherryBlossom Noodle Cafe. The waiter wasn't all that helpful but he was available at the most important times and we managed to get orders, served and check paid in time for movie which by other reviews worried me because of our narrow time window and the fact that this place is indeed busy.\n\nI would definitely return a much wiser person and next time, I go with my gut instinct and order the Champon as I had intended to the first time.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 3, "date": "2009-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VaAyueHI542jkLo_w7Yyrg", "review_id": "JxcByoDwcByz8F2uBQVqLg", "text": "Cherry Blossom Noodle Cafe has the authenticity of Japan's finest \"Mom & Pop\" eateries.  This effect is achieved by trasporting diners to a quaint interior with friendly service and delicious food the moment the enter from the low scale strip mall exterior.  The Ramen with Pork Cutlett (chashu ramen) is superb as are many of their other Asian dishes and even their italian fare is done with care and skill.  Sometimes the servers aren't the best in terms of knowledge and attentiveness, but the quality of food, affordable price and friendly atmosphere make up for it.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2010-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "5_C2KNifxj1BYRZrMybJVw", "review_id": "WeIXbPAj1SVeMUk3D6mKLQ", "text": "A friend suggested this place for lunch the other day and since I had never heard of it I said sure.  We walked in and he walked us over to the bar and we sat ourselves there.  We were warmly greeted by a smiling asian lady, and given menus.  We both decided on the Cha-shu (ramen soup with BBQ Pork)  I told her that I was allergic to Sesame, and she was very responsive to my needs and immedeatly told the cooks about my allergy.  Great food...great service and she even gave me a to-go cup for my iced tea....what service....I will be going back here a lot in the future.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2012-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "4lkTIhTuMhLprQprGlTRlA", "review_id": "xELErewTMglpvdORKB4ZIw", "text": "FYI, the two seats at the end of the bar are reserved for me at all times. Well at least they should be and I'll say they are the best seats in the house. We get to see every dish that comes from behind the bar and usually make our dinner selection based on the \"order up\" items. It makes for an adventurous dinning experience.\n\nMy faves and must tries are the Extremely Spicy Gyoza Pot-Pot Stickers in Spicy Soup and the Tori Nanban (add Sansai Vegi). I have the Gyoza soup first then whatever brothy goodness is still left at the bottom of my bowl I add to my Tori Nanban. It's weird but a tasty ritual.  The Iron Pot soups are also really good.  I've yet to have any of the Italian pasta dishes. Although they look just as good as the Asian items, it just doesn't seem right for me to order Italian. Who knows, maybe I'll give one a try on my next visit. \n\nThe CBNC does get busy with a wait during the lunch and dinner hours and service can be inconsistent outside of the bar which is another reason I sit at the bar.  But I feel the food makes up for just a few easy to overlook annoyances.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 4, "date": "2013-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EuT0_VBuRo2ZLEgp8Avmcw", "review_id": "Amx5dCMmFWk0uAo2_nxgmA", "text": "I went to CherryBlossom about a month ago and it was a very memorable experience. It is very small, but the atmosphere was excellent, as was the service.  \n\nI had the Hot Soba Noodle Soup with Sansai Mixed Mountain Vegetables.  This was delicious!  I find myself craving this soup very frequently.  \n\nThe restaurant was also very classy, and I would be happy to take family, friends, and even my boyfriend's business associates to this location.  They have happy hour prices, too.  Some good happy hour specials are a $3 draft beer, $2 California roll, $3 crunchy roll, and a $5 summer roll.  I plan to go back ASAP!", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2014-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "MnCEMnzDc63UxCvnom3R1w", "review_id": "dosokzLAxt2paEQHQ2EUjw", "text": "I've been to cherry blossom before and didn't have a good experience with it. After hearing rave reviews about their ramen, I decided to give it another try. \nI was pleasantly surprised with how much I enjoyed their ramen. My husband ordered the spicy Tan-Tan with a side order of sliced pork and I ordered the Cha-shu. I liked them both and would order them again. \nI really liked the broth and noodles of both bowls. \n\nWill be coming back!", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2014-02-09", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "6teUzcdOBAydncEmvW02zQ", "review_id": "azY-9ihDKKgiLQlpIGLRzw", "text": "So far this is my favorite place to enjoy good ramen in Arizona. It was so good that I even took my mom here! (She is very hard to impress when it comes to food) She actually expected the ramen to taste like the Korean Shin Ramyum noodle packs. Surprisingly, she was very please with how well their ramen was cooked along with their fresh broth. My favorite time to go is for lunch! Their combo lunch included the ramen with a whole California roll, and the complementary bread rolls! This is way more than enough for one person. The best part is that the combo was about $8.00!", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2015-01-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "icGS6Ix5XL80WAkXXqp1kA", "review_id": "BozxmGA8RM1JDz2fu0saSQ", "text": "This place is one our  favorite places to eat. Great prices excellent food. I have enjoy everything I have tried so far (half the menu). The curry is delicious, soups are tasty, even the pasta is good as well. I suggest trying something each time you come.\n\nThe only thing is to keep be mindful if you are waiting to get a seat don't disappear. They will move on to the next person if they can't find you.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2015-12-12", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "FGZkbk4G9lUfBrT4BlsyGg", "review_id": "-0PFqDCvbEbWGQLXl52ARw", "text": "This is truthfully the best sushi place in town! when your there dont forget to ask for the secret menu.....", "business_id": "c0RSs2KYK5Y-ZlSrNq9LyA", "stars": 5, "date": "2009-01-22", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "gJrTS-8XuK11J2kdiKH5XA", "review_id": "U06VZTJ-XWbHdryhZpiaZw", "text": "Have been here a couple times now and cannot stop raving about it!! I was lucky enough to have had a girlfriend that worked there a while back tell me about the \"hidden menu\" that no one really knows about. I ordered the \"Senorita\" off that menu and have been going back for it ever since.\nOf course their happy hour is RIDICULOUS, so cheap and really good!! I feel sorry for the waitresses because of all the horrible customers they must get that don't know how to tip at happy hour (in case you don't know its always tip what the meal would have been before the discount). But if they have bad customers I wouldn't know, I always get the best service!!\n\nAwesome, yummy, and healthy! Now go have some Sushi;)", "business_id": "c0RSs2KYK5Y-ZlSrNq9LyA", "stars": 5, "date": "2012-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KDWVldPD48FF0mWol9v8BQ", "review_id": "0QUBZod1WzkGxHBJgeZPkg", "text": "Been going here for years.  The food and service is going downhill.  Last night entrees arrived 15 minutes apart.  Manager who appeared to be about 16 said it was because they have two kitchens? Apparently they don't talk to each other. Avoid", "business_id": "c0RSs2KYK5Y-ZlSrNq9LyA", "stars": 1, "date": "2014-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Ovpa3S8xD96dLE5eDxcxJg", "review_id": "kS4cv2ymq0kA9qa-gEgHxA", "text": "Not one of my favorite sushi spots in Phoenix, but not bad.\n\nIt's a trendy spot so getting a table may take a little while. The sushi is above average, but the price tag has the built-in trendiness fee that will sting you when the bill comes. \n\nService is on and off but it seems like that could just be a product of the total lack of organization that is a result of the layout. There is some free seating and people seem to haphazardly move tables around unchecked outside. Point is, the service isn't the most reliable. \n\nAll in all, not bad, just not great.", "business_id": "NDKkce5Au-o_OhIt5f2ZBg", "stars": 3, "date": "2007-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LP0bl3GKToABt3lnpSvA2w", "review_id": "eTe69eIEy8ojiB2f28l_eg", "text": "I wish we had a happy hour sushi bar that started at 10pm for the night lovers in all of us in Charlotte, NC! Zen 32 offers $3-$6 happy hour sushi rolls, appetizers, and some drinks from 10pm-2am. \n\nThe quality of the sushi was very good! I wish at the time I would have been more hungry, I could have eaten it up! The spicy tuna and vegetable rolls were great...I can't remember the other rolls we ordered, but just as delicious.\n\nThe downfall was the service. Initially we were greeted by the hostess, but it took approximately 18 minutes for a server to show up. Typically that would have been unacceptable and I would have said something or just left, but it was on New Year's Eve and was a reunion with friends that I had not seen in a long time so we were just chatting. However, I think the hostess caught on to how long it had been because when we eventually started looking around we caught her eye and within another minute, our server showed. \n\nThe atmosphere is dim and intimate. They also have a patio (with heat lamps). Overall, I enjoyed my experience and the food was delicious! Next time I'm in town, I'll visit you again Zen 32!", "business_id": "NDKkce5Au-o_OhIt5f2ZBg", "stars": 4, "date": "2010-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z4MlPZ8SGa2ODhn4vZoGog", "review_id": "yE0TSteNVvGKSU5UwvPxBg", "text": "Love this place. My husband is fan of the sushi, always happy with all he chooses. He averages 90$ at dinner himself. I am a huge fan of the Giant Turkey salad that they have been famous for many many years. I also love the Shogun chicken - sauteed chicken breast with Udon noodles, not oily at all. This place is like home for us. My kids consider it their favorite stop.The tempura is crisp and flavorful- no worry of dirty over used fryer oil. I don't need to be seen at trendy places- I just want consistent meals that I have grown to love. It is perfect for girls lunch out and the bar side is fun with all the upbeat 80's music. I used to go to the bar when it was a separate establishment called Paradise Lounge. I probably have been here over 100 times. I have been in a Chef in AZ for 25 years and I know good quality ingredients when I taste them. This is the place.", "business_id": "r7Ge8_c5Y2TXthb4CSjzaA", "stars": 4, "date": "2011-01-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ngD5RF07pxwlq4euexSluA", "review_id": "flRZR0PHPlTENkiLiWt4ww", "text": "I enjoyed my recent visit to Shogun.\n\nWent around 9pm, ate at the bar.  Ordered a variety of sushi, enjoyed it all.  Highly recommend the Spicy Yellowtail Roll - Yum!", "business_id": "r7Ge8_c5Y2TXthb4CSjzaA", "stars": 4, "date": "2014-02-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "ztqIQOnW1jF8nIYJucM3UQ", "review_id": "PKO_TkUUwkyexg2w7nG3Ew", "text": "I've been a big fan (a five star fan of Sakana) for at least 5 years. When we moved to the South in 2006 and tried a handful of Sushi places in mid-sized southern towns I really missed Sakana. We went last night to celebrate the New Year and I was disappointed. I think they may have changed management I know they change distributors. The just wasn't the same. Maybe they're cutting corners because of the economy. Who knows? At any rate I'll probably just drive up the Scottsdale location next time -hopefully Ray is still running that show to perfection.", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 3, "date": "2009-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M4FtX4LNZfJ7fFzxxE0PUQ", "review_id": "maCugLOn15E0WtsaY8TXLA", "text": "I went here for the first time last week and was disappointed in many ways. The service was  bad. My waitress took forever to take our orders. We waited 40 min for the food, she didn't even come back to refill our waters. We ordered 3 different rolls including the special \" Crazy Dragon Rolls?\" , all of them, some how ,taste the same: all had imitation crab as fillers. The rice has way too much vinegar that completely overwhelm the taste of the unagi.  The price was good, I guess you get what you pay for.  I probably will not come back, however thumb up to the manager who was walking around chit chatting with customers.", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 3, "date": "2012-02-09", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "aThkIdpPnim8OLES1WVvgA", "review_id": "ZV1g3vxvD8r3Z_n4YWmflQ", "text": "Great value for the sushi you are getting but the indoor environment was not what I expected. We got stuck in a extremely small table and could barely fit everything on it.  The servers were good, but nothing special. We ordered a couple of rolls, received free edamame after my Yelp check-in and some Saki bombs to complete the meal. \n\nI will say that all the rolls we ordered were quite delicious, but got way too full too early so save room! Spicy tuna, Las Vegas and Toostie Rolls were the winners that evening.  \n\nWe came here for a late dinner, and they were very forceful with us after last call for sushi. It made us feel like they were rushing out to pay the bill. I wouldn't mind coming back here to grab a couple rolls again.", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 3, "date": "2014-12-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "AirVzN1BVQBmq5zY0YMNYQ", "review_id": "KlnnJkkd-O8uiaQeJyKBhg", "text": "RA is a great happy hour spot and is pretty happening on a Friday night!  The music is always great and even when it's chilly outside, the heaters keep the temperature perfect.  The service is okay, pretty friendly, just busy.  I tried the Mango Margarita last time and it was delicious.  With so many items on the sushi happy hour menu now, it is hard to pick sometimes, so I just got my usual of the Spicy Tuna Roll and the Salmon Nigiri, and of course, always edamame!  The side of grilled veggies is also one of my favorites, a little on the spicy side, just the way I like them!\n\nGo on your birthday and enjoy a full size Tempura Ice Cream dessert!  Plenty for the whole table to share!", "business_id": "nBfusVbqwul0BU0Rcrlelw", "stars": 4, "date": "2010-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UIHT5FjnQu99trc8mueQEg", "review_id": "p-eYMpXOoGHQGVvIPyhH-Q", "text": "This is a decent happy hour spot.  I go here occasionally with a group of my girlfriends (ages 20s and 30s) and we reserve one of the big corner booths.  Sushi is good, drinks are excellent.  Bill is usually around $30.  Service is decent.", "business_id": "nBfusVbqwul0BU0Rcrlelw", "stars": 3, "date": "2013-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LdhwY7eudLlx1KFQQe9GwA", "review_id": "s0xfiI8jmGiHUs7NqdkS-g", "text": "A little surprised by all of the great reviews here, as I was very underwhelmed. Maybe I was in on a bad day? Came for lunch, and found the chinese food to be mediocre at best. The Orange chicken I had was really bad, so dry it kind of broke apart and separated when I would cut it. I also tried the sesame chicken, mongolian beef and sweet and sour pork. Some of the flavors were okay, but all of the meat felt like it was overcooked. Maybe that was just the constant reheating from a buffet style. I didn't get seconds of anything, and while I felt bad about it, I didn't completely finish anything that I took.\n\nI don't like sushi, so I didn't try that station, and no one was working the mongolian grill style area, so that wasn't an option. For what I had, I found it disappointing, and at $11+ a drink, tax and tip, it's not cheap enough to be worth it. Service was fine, and the restaurant seemed clean, which is a plus.\n\nIt may well float other people's boats, but Hong Kong Gourmet Buffet is not for me.", "business_id": "-Ogv7rpcgUHkFaSy3vD8Sw", "stars": 2, "date": "2012-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7LcgqDrVWpZNRZ_A3egKPw", "review_id": "tBQxGDsIc-oN_-o81GRdMQ", "text": "Cleaned and nice but everyone at the table agreed the food was not even warm.  Stir fry is a safe bet.", "business_id": "-Ogv7rpcgUHkFaSy3vD8Sw", "stars": 3, "date": "2015-01-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "49RIGDu-A1eRPDSAs9QZtg", "review_id": "i7MoMN2WO0vM_cthwhvrTQ", "text": "This is not a sushi joint so don't go expecting sushi though they do serve some.  Nagasaki Grill is about as close to a Japanese Ramen/Udon/Soba shop as you'll find in Arizona.  The owners are friendly and they even have the summer seasonal cold Saimin noodle dishes I like.  \n\nMy favorite dish is the Champon, it's a huge bowl of rich broth w/ ramen like noodles, napa cabage, and pork belly slices. It reminds me of my dads cooking.", "business_id": "BBPkwpj9kSeDuy0uOwWHJA", "stars": 4, "date": "2010-02-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "0dbqLkXGVjo1dZLd_HtDIA", "review_id": "APRdUTinunkWzNTsj_o-2g", "text": "My family and i have been dissapointed for years that we didn't have a good chinese restaurant by our house. I found this place on yelp and it's japanese, not chinese but we are so happy. They have some really good food. Beware that the sign does not even have their business name on it and if it wasn't for yelp you would probably never go here judging by the outside. With that said don't judge a book by its cover. This place has some really grub and we are excited to add this place to our Friday night takeout rotation.", "business_id": "BBPkwpj9kSeDuy0uOwWHJA", "stars": 5, "date": "2015-02-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "W9f0YU0C9JnFBnel2d7pPw", "review_id": "r3emOjw85HOBvFH2JdZs0g", "text": "So, I Had The Chicken Yakisoba (Chow Mein) I was not impressed at all. Sadly as soon as I took my first bite I knew I wasted my money. Didn't have enough chicken and  the noodles were over cooked the flavor could have been better. Now I'm now saying the place was horrible that's why I gave it two stars not just one. The atmosphere wasn't great either that should have turned me away in the first place but I had a friend that was telling me how good this place was so I gave it a shot. I will not go back", "business_id": "Js7xxK2D4Dc0W8XkAzc4cg", "stars": 2, "date": "2013-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I3UnKe5Bu7f1bZufg5HNsg", "review_id": "bDp4FQ7ZNB1kbAjFFZfyRg", "text": "This place is a hidden gem! My boyfriend found it driving by and took me there tonight. The staff is very friendly and the sushi is AMAZING!! Very fresh tasting, a great variety of rolls and specials and all for a very reasonable price. Before leaving we found out they have been in business for 17 years from regulars that have been going since they opened. I love that we were able to not only have great food but also support a local family run business in the process! Highly recommend this restaurant. Best sushi in the East Valley for sure and probably the Valley!!", "business_id": "6syMU43FKGkcbX2957Ga8A", "stars": 5, "date": "2015-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fthlmF6ocmBCxVoeSyjt3g", "review_id": "OtP4MXeFBiRDaelf0k0Niw", "text": "This is the best sushi / japanese food \nin town beats RA and benihanas!! Can't get enough! My boyfriend is addicted, we definitely will be coming back", "business_id": "5vgmIwBB48fwo_WC8vGiXA", "stars": 5, "date": "2012-01-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Zqoshmau0tsf4F7dKqMQ8A", "review_id": "hSvAYNu2wC47oKTBWfR2OA", "text": "Ninja. A true Heaven on Earth! All you can eat sushi for $22? Yes, please! My wife and I dine at Ninja about once a month. The staff are incredibly friendly, the dining area is always clean, the sushi is absolutely delicious and the pricing is awesome for all you can eat. I often order the Hipster roll, the Boston roll and the Gringo roll. Phenomenal food. I highly recommend Ninja for the sushi whore in you. There are tons of rolls to choose from and not a one is disappointing. Get ya some!", "business_id": "5vgmIwBB48fwo_WC8vGiXA", "stars": 5, "date": "2015-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QRylTSmLdTNavluqfkWCvg", "review_id": "zK7pnwozAAPLTptMgJPz2g", "text": "Always an awesome time. The whole team there is great and the fish is fresh. You're in for a treat, especially if they have baby yellowtail. Try the beef carpaccio...delish. Al is rad.", "business_id": "un3KC2gyMrSG6yqjVRctXg", "stars": 5, "date": "2012-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Jmfjq2QR2PmMBl7NOy2z9Q", "review_id": "QUghirUcExqsZhpR5uSUVg", "text": "Excellent service, very quaint atmosphere and the sushi is very fresh.  The miso soup and miso salad were great, not to mention great sashimi and house rolls.  This place is a hidden gem.", "business_id": "un3KC2gyMrSG6yqjVRctXg", "stars": 4, "date": "2014-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "SYwbj0uiG1GGWNfWSbvvCw", "review_id": "LpjMHBsS6nanaFH4rC5YNA", "text": "The best spicy teriyaki chicken I have ever eaten!  The place looks deceiving, but produces excellent food and the staff is friendly.", "business_id": "l1kqHWtICTNk8TdCNisf5A", "stars": 5, "date": "2010-12-03", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 0}, "user_id": "Lxj0xeEoXOIoUNweLaGRPQ", "review_id": "XnDqv5CHa_z3OFWGljwidg", "text": "I've been coming here for years and the food has always been good the prices fair and the service exceptional.  it appears there is new management, the food is bad, and I say that with all sadness.  The teriyaki sauce is watered down a lacks flavor, the Yakasoba is dry.  Very sad.  The staff is OK but not near where it used to be. too bad.  my suggestion pass on this place.  You will see that all the good reviews are old.", "business_id": "l1kqHWtICTNk8TdCNisf5A", "stars": 1, "date": "2014-12-17", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "8cne7KdTrHJ1ISOzFA_fYw", "review_id": "WsVDamYf5z661JVamShTPA", "text": "Fantastic sushi always fresh and tasty!", "business_id": "Er20nsiOS6TFHmAE717iTA", "stars": 5, "date": "2012-02-22", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "2FtCOwNwd6UsBgScSc1_Ug", "review_id": "o55Aj78PKQssZkgpqcI0rg", "text": "Can get a bit crowded -- not uncommon to see a line leading out the door on weekends.  Couple this with the fact that servers are in no rush to seat people... \n\nStill, a great place to grab quality sushi.  And the prices are not outrageous.", "business_id": "Bjt3rB73dvSDe1XEPEWc6w", "stars": 4, "date": "2007-01-21", "type": "review"}
