{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "-DCSpG7OP7ATeQ6VrPGARw", "review_id": "RsHR3fI56sGV5GiCWCJztg", "text": "Came here from PGH for the first time.  This bakery is legit.  I bought some Rye bread and Italian 5 grain.  Delicious.  A strange snickerdoodle thing with pink frosting.  Delicious. Chocolate chip cookie dipped in chocolate, extra chewy and humongous.  Delicious.\n\nAnd a sweet old lady serving em up.\n\nThe best.\n\nDelicious.", "business_id": "hnHt6EinzC-IX6y3GSF7jw", "stars": 5, "date": "2013-02-16", "type": "review"}
{"votes": {"funny": 8, "useful": 10, "cool": 11}, "user_id": "bhZ13wN_5lQrKX278AP_aw", "review_id": "vEebKtSczwZE_fphTKkKjw", "text": "Review #200\n\nI got hooked on this bakery while living in Brighton Heights.  Now, when I drive past, I HAVE to stop.  I think this one is so much better than the sister store in West View.  I don't know why; I just like it better.\n\nThe sweetest ladies run this local bakery, and they always serve with a smile.  It's usually pretty fast too!  And they're CHEAP.  Doughnuts and giant muffins for $.65.  Cookies of all shapes and sizes are delicious and cheap as well.  It makes me so happy.  Some favorites:\n\nAll of the doughnuts:  Raised or cake, cream or jelly, chocolate or vanilla, they're ALL SO GOOD.  I wish I could stop and say no.  But I just can't.  The selection here doesn't go too fast.  I can usually still get one around lunch time, but if you want options, go early.\n\nLemon Poppyseed Muffin:  They run out quick, but they're so yummy!  It usually triumphs over the doughnuts.\n\nThumbprint cookies:  Maybe I just love the cookie, but I really like them here too!\n\nIs the cliental a little special sometimes?  You bet.  Are the hours old fashioned early to open and early to close?  Yup.  But I just view it as absence makes the heart grow fonder.... :)", "business_id": "N2DwycuZl95miWf39Yskaw", "stars": 4, "date": "2014-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WcDdWdsxmOYPxtbRRr1IaA", "review_id": "VUU-5Tmil2QZNNSBF_-rdQ", "text": "We always order our birthday cakes from Kribel's, and appreciate the great service, and reasonable prices. I didn't make paczki last year before Lent, and bought them from Kribel's instead, and I have to say, the custard filled ones are spectacular!", "business_id": "DEH4worm2017xT3KHLoyAw", "stars": 4, "date": "2010-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IsfCmYahjSE-WLGdxZx1Ng", "review_id": "LQV8i4uCSLKOzH1uYl3kbw", "text": "YEAH COOKIES!  ALL TYPES!  for $2 each...\nI, too, miss the couch.", "business_id": "DJKpwLp4mISNDNDpNz67tw", "stars": 4, "date": "2012-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZSscg5qdsHQHfCoSU4dEKA", "review_id": "FW_ETOmw_N4gKf2xD1dW3g", "text": "I just got into town and I had to get to Prantl's. Their sugar dusted cut out cookies are amazing! You can't get cookies like these down south.", "business_id": "yWVY1Bq19lDxu3BP7_96EQ", "stars": 4, "date": "2012-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "do-fO-EruYVP_FQPMNWmZg", "review_id": "e1pjIUC83plHc_kz-AJ73A", "text": "So, after dropping my Mom off in Barnes & Noble, to look at Nook's, I decided a quick run to Auntie Anne's sounded good.  I arrived to a freshly made batch being made. I ordered a pretzel with extra salt and a cinnamon pretzel for my Mom.  Both pretzels were amazing, and the added bonus of extra salt was awesome!  Already thinking about my next visit to the mall, this is my go to snack.", "business_id": "yJUsWEt4HQS0GSLd1YqsmA", "stars": 5, "date": "2014-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VauuOm5DdfExwIjgDIsUjg", "review_id": "f-O0aWppUuQ3eGoRdD05Tg", "text": "The breakfast food here is amazing! The staff and service are great! They always have fresh products. Love it!", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 5, "date": "2015-02-09", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "dd5ffMsCUhTgwGBBhllaqQ", "review_id": "wLsatTjFJVHUJF6Ou_ealg", "text": "Want donuts in Madison?  This is where you ought to be.  The people's bakery is a small donut shop on Madison's east side and the place represents this town perfectly.  They also serve food like Gyros, which are delicious, but probably not Madison best gyro.  \n\nA husband and wife team run this place and they do an outstanding job.  Super nice too.  If you want an outstanding box of donuts, like top-notch stuff, this place is worth your time.  And if you want to buy local and support an outstanding company than THIS IS IT!", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2015-02-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "E5QyEU6FCQwnTys0S73zNw", "review_id": "SwYjCajwf3xG_Tkl1bgavA", "text": "they have pretty good cookies, i know there are allot better options in my neighborhood for some cookies. but if i'm downtown in the mix and they are open, i might grab a snickerdoodle or a Chocolate Macadamia", "business_id": "LXhL5X3edNRy7epku6UAEw", "stars": 3, "date": "2008-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "66oDhsKSB_eSrhCKiERDow", "review_id": "r5kE1s3L3k9W5JNpHAf8tg", "text": "Visited this small bakery today, my second time.  I had the baked (fluffy browned bread, not the steamed white one) cha siu bao (barbecue pork bun) and a baked custard bun.\n\nBaked Cha Siu Bao: Good except for a nasty hard piece of something crunchy (gristle?  ligament?) disguised as a piece of meat in it.  It was really gross, but I spit it out and ate the rest because besides that little bit of nastiness it was good.  They're losing a star for this though.\n\nCustard Bun: Very good.  Fluffy not-too-sweet bread with a creamy custard that had a strong vanilla flavor.\n\nUnder $3 for both!  They have that annoying $5 minimum for card transactions though, which is discouraging younger, frequent small-purchase repeat customers.  Their sales volume would definitely increase if they would eliminate the minimum and invest in a remodel to play off of Sweet Republic's traffic next door.\n\nThe older woman behind the cases was polite but rushed.  She rang up my total after I had chosen the second item, which put an end to my buying anything else.  To be fair, they were closing soon, but the place was dead and you would think she would want more business or encourage me to try something else.\n\nAs others have noted, many items in the unlit (not easy to see inside) pastry case are unlabeled.  The handwritten signs that are in the cases are faded and really should be replaced with something better (Microsoft word, a printer, and a laminator will do wonders).\n\nThe interior was clean (though cluttered) but looked very tired.  Parking was a breeze though!  I'll be back.", "business_id": "Tr3EsurgHqGPTXwAfjZ04Q", "stars": 3, "date": "2015-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_LEQt7oTVjiaXyVHK_MM7g", "review_id": "SA2gTiOIf61T0e8r_jS2Cw", "text": "**Update: Catherine, one of the owners, sent me a very sweet message thanking me for the business and wishing me a happy holiday. You can't put a price on such good nature!", "business_id": "wftoNIA0Q8nX-Da47psBCA", "stars": 5, "date": "2009-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "WJkmgkrSPMHTfDTD3VgqqA", "review_id": "kc50cwveAVnQsBwQWsXKWA", "text": "My sister was craving cookies so I immediately turned to Yelp for suggestions nearby. I wanted to try a small bakery and there was Barb's. I've driven by it several times and not sure why I never tried it. But here we were. \n\nThe case was full of delicious looking cakes. Oooey Gooey cake, cheesecake, cookies, brownies just to name a few. But we went with the raspberry cheesecake brownie, the tiramisu and a donut. Yes! They have donuts there!\n\nThe lady who helped us was very nice. We asked about the different cakes and treats and she was very helpful even though it was hard to make a decision.\n\nAs soon as we got in the car, my sister hoovered the donut before I could even ask to have some. I dove into the first pastry- the cheesecake was soft and semi-tart with the raspberry preserve layer separating that from the rich chocolate brownie underneath. MMMM.\n\nHowever, the tiramisu was, in the words of Oprah, AHHH-MAAAAZZZING! Soft creams with coffee flavors and covered with chocolate sprinkles. I wish I didn't have to share.\n\nThe prices were really reasonable. It was about $2 for each of the pastry and i think $0.50 for the donut. \n\nI would definitely come here again to get my dessert fix.", "business_id": "vv1uvJRBUqi707TA5GuhCg", "stars": 4, "date": "2010-01-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aXFu7vW8OMwLHYHGcMG0gw", "review_id": "2pIrb0e3WXsbMd0j8Zxlzg", "text": "Being a sweets fanatic, it's not rare that I meet a dessert that I like, but it is rare to meet a dessert I absolutely LOVE. I am extremely picky about what I consider to be a really great dessert item, specifically with cake (which happens to be my absolute favorite food!) When Valentine's Day rolled around this year, I told my fiance that all I wanted was a good cake, and he absolutely delivered by finding Barbs Bakery. \n\nWe ended up ordering a whole carrot cake (yes just for the two of us haha), that I was to pick up at noon on Valentine's Day. Now I should note that my 5 stars doesn't just include the phenomenal cake we received, but also includes the great service we received! I was running a little late to pick up the cake, and they were super busy on Valentine's Day, but when I called to see if I could reschedule my pickup (rather last minute, mind you), they were so absolutely accommodating and sweet about it. When I got there, they actually asked if there was any complimentary writing I would like on it, so I had them add \"Happy Valentine's Day!\", which was cute and lovely. I also couldn't resist snagging one of their heart shaped sugar cookies with icing, which was so incredibly delicious. \n\nThe REAL rockstar here though was that carrot cake. Ohhhh my gosh, it must have weighed no less than 10 pounds haha. It was super moist & dense, with plenty of delicious buttercream/cream cheese frosting. Carrot cake can be a little tough to master, but this one had the perfect blend of spices, carrot shreds, and walnuts to make it absolute perfection! I will definitely be going to Barbs for any future cake needs in the future!", "business_id": "vv1uvJRBUqi707TA5GuhCg", "stars": 5, "date": "2014-02-20", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "EVN484M7GZxhVpp61JgQBA", "review_id": "_4gM75z8xiako1swSvx3sg", "text": "Ah, the Spanish Latte.  I did a little recon and found that one Spanish Latte yields...are you ready?  Wait for it...wait for it...approximately ONE THOUSAND CALORIES.  Geez, no wonder they are delicious and I love them so.  We happened to ask the girl at the counter we we ordered a skim SL, and she said that a regular one has approx 1,000 cals.  Dang.\n\nAnyway, I dig this place.  I pretty much always order the Croque Monsieur.  The bread is good and sturdy and the cheese is perfectly melted and bubbly.  The sandwiches and salads are good and I like that they'll let you pretty much specialize anything you like.  Those English Muffins are wonderful!  \n\nTammie Coe and MJ Bread do an amazing job with the pastries and the breads.  I have a really hard time passing up an Ooey Gooey Cupcake.\n\nMy strategy is to go between 10 and 11:30 in the morning or between 1:30 and 4 in the afternoon.  You can pretty much waltz in and grab any table.  \n\nI have started to notice that they have an extraordinary number of staff.  It seems like there are 5 or 6 behind the counter, 2 or 3 at the coffee bar, many bussers and runners.  Even when it's really busy it seems like there are a few standing around.  I don't get it.  Whatever works I guess.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2007-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "9qB4q1s6c5AEoperHdNLxw", "review_id": "KOGa5hzAQnDz2pBmus_Bhw", "text": "La Grande Orange is one of my favorite breakfast places. I always try to make a stop here whenver I'm in the Valley. It's in a nice, quiet neighborhood with a view of Camelback Mountain. The place always seems to be packed whenever I go, but that just shows how good it is. You order at the counter and can sit in the market, the pizzeria, or outside (be warned, seating is hard to find at peak times). There are two places to get coffee, one inside the market and one in the outdoor seating area. On top of serving good food, they have a small gourmet market that sells all sorts of things related to food. I had the daybreaker the last time I was here. It is an egg white omelet with turkey and tomato-avocado salsa on top. It is really good. It has a very fresh taste to it and it feels healthy, yet satisfying. I had bacon on the side, which was excellent. It was nice and crispy, as well as full of grease, the way bacon should be. Overall, if you're looking for a great breakfast place in Phoenix, head to LGO. I have yet to eat lunch or dinner here, but I hope I can next time I'm in Phoenix.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2009-01-06", "type": "review"}
{"votes": {"funny": 12, "useful": 13, "cool": 13}, "user_id": "vhAn390OgR1H4DwacJdc7w", "review_id": "sKy2SPPG21iWk-IVw9n9Dw", "text": "Well...\n\nI was told to go to this place by none other than Gabi M., because I am a philistine and I had no idea it existed.  But I didn't go right away.  Which was my loss, because this place is phenomenal.  I finally ended up here somewhat fortuitously because a student of mine suggested it.  Anyway...\n\nI've been doing this phoenix biggest loser thing because my wife says I'm the biggest loser in phoenix, so when Amber W. started up a competition with the same name I figured hell, I can win that.  Turns out it's about weight loss and so that pretty much means I'm screwed on the $25 entry fee.\n\nWell I wasn't until I went here.  My diet was doing very well, thank you, *until* I went to LGO.  As soon as I walked in I was met with a tsunami of poor health choices and didn't know just how to hold it together.  Pumpkin-chocolate chunk muffin? Blackberry bran muffin? (Which I ordered because bran=fiber=healthy, der!) Strawberry muffin? Cream cheese coffee cake?!?! and a million more delightful delicacies which tempted me for forty seconds before I gave in.\n\nWell not really.  Here's how it went down: I held firm and got oatmeal with bananas, strawberries, and raisins.  Spare me the nutritionist's take, I'm confident that was the best I could do.  So I was pretty proud of myself.  But I *did* have to bring home a muffin to my wife because that story about her saying I was a big loser was a lie and she's actually pretty great.  So I paid for the strawberry muffin but at the last minute changed to blackberry bran at an employee's recommendation and GOD DAMN i am glad i did because that is probably the best muffin I ever had.\n\nNote: Since the charming Gabi M. decided to laugh at me for my food choices *all night* at the OYE I will point out that I ate only 3/7 of the muffin.  That's it!  that's like, um, a 57% healthy choice based on my math.\n\nAnyway my student had an english muffin with avocado and smoked salmon that I was looking lustily at so she told me that I *must* have an english muffin.  She bought a pack and gave me two (I'm a good tutor evidently) and so of COURSE I HAD to eat one.  I say that defensively because Gabi laughed at me for the english muffin too.  I'm scarred.\n\nAnyway.... I know this review is dragging because my wife is now watching Lifetime which means that her head is being filled with all sort of anti-man propaganda as I type.  So I'll wrap it up: \n\nToday we went there and I had a croque madame which is a whole grain open face deal with ham and tomato and mustard and a sunny side up egg.  Pretty damn good.  But we also had the strawberry muffin which was a little disappointing: not moist enough and not strawberry-y enough.  So I give this place five stars anyway because it is super cute and I don't think I could eat everything I wanted to eat there if I went in for 14 days straight.  I loved it.\n\nAnd for the acting on Lifetime, one star.  And the writing:\n\"I love billy, but I love you more.\"\n\"Really?\"\n\"Really.\"\n\nPulitzer prize stuff, that.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2010-01-21", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "qRo9gHN5OiV1-peDuhCh-g", "review_id": "wwPaSz_AbmLrSsVfxouhKw", "text": "I love the food and coffee here (although I would double dog dare anyone to actually commute anywhere while trying to eat the commuter breakfast sandwich). Long lines? I can deal with those. But for food/coffee this expensive why... WHY are there tip jars out? Please explain to me why I need to tip... for someone to call out my name? Really? Are you not paying your employees enough? It's ridiculous. I hate tip jars. But the service is always good so I feel like a jerk for not tipping, which results in fewer visits here. Seriously, your price+tip=way too much for what you get.\n\nAlso, what's up with the disappearance of the small yogurt granola? It's not on the menu and missing from the refrigerated case the last couple of times I've been in there. Boo.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 2, "date": "2011-02-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DACiFcUgLSTM3DrHOk-KYw", "review_id": "i8BiWwfNEyFBirVRVuMUWQ", "text": "this place is amazing!  everything is made to order and they have fantastic breakfast dishes and a great selection of bread, beer, wine and cheeses.  i was very impressed with the quality of their food, espresso and cleanliness of their store.  it is dog friendly and a great place to eat.  i hope to come back to this place whenever i am in town---they offer something for everyone and also have a very good gift shop with shirts, cards and books and other unique stuff.   for those seeking quality food at reasonable prices, this place is very hard to beat.  i only wish they had one of these in Seattle.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2012-02-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "W2RG2MbQlHCX6MTGZIuhIg", "review_id": "Ac5yAO8FZIH5R4y_OeAqiA", "text": "Oh La Grande.. je t'aime.\n\nThis is almost a weekly Saturday morning ritual for \"The Better Half\" and I. Wondering why she's my better half? Because she introduced me to breakfast at LGO of course. The perfect place to sit and enjoy your morning, if you are lucky to find a seat. Since were talking rituals we practically order the same thing every single time. Not that everything else doesn't look amazing but because what we order is so damn good to deviate from.\n\n* The Commuter Sandwich - Seriously the most heavenly breakfast sandwich known to man. Eggs, Tomatoes, Cheese loaded on LGO fresh made english muffins. Side note: If they served english muffins in heaven, they would be catered by LGO.\n\n* Chilaquiles - I know what you're thinking...\"Chilli-who?\" This is a traditional Mexican breakfast dish with a lil LGO flair. Don't make the mistake of passing up this dish. Do your palate a huge favor.\n\n* Havana Cafe - This latte makes my tummy cry tears of joy!\n\nMy only complaint is the parking. Which seems to be common among the area. On Saturdays you might find yourself circling the area to find a spot. Don't let it stop you!", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2013-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mA14soH_Nwa2xeIlfgQJ3g", "review_id": "3-fZ5Dck-pguOoPpAwYjhQ", "text": "The best coffee and pastries in town! Get there in the early AM and enjoy the outdoor setting.\nGreat for cyclist who are out on a ride a want a place to rest and fuel up. Also great for family and friends just hanging out.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2014-01-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "H1apFIGrvnuIIwUMhWIDlg", "review_id": "UcjvX4CZr1BLb0Zzehx-7A", "text": "The food here is simply amazing. I LOVE their \"rocket man\" pizza and kale salad! Definitely recommend it for take out or a casual dinner atmosphere. I like to sit at the bar and the bartenders always friendly & delightful.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2015-01-15", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "fczQCSmaWF78toLEmb0Zsw", "review_id": "wTUN7X1UKdczGlWzJnQM4Q", "text": "I have a new favorite sandwich place!\n\nI've probably driven by Breadcrafters over 3.000 times since I moved to Phoenix.  It's in an unassuming little shopping center on Tatum across the street from PV Mall.  I noticed the sign but never thought twice about going in until my friend Deborah recently told me that they have wonderful sandwiches and salads that are perfect for picking up when you're on the run.\n\nSo, instead of trusting Deborah 100% (I don't know her THAT well yet), I sent my mom in to try Breadcrafters when she asked me where she should go for lunch during her last visit.  It passed the 'mom test' with flying colors... my mom loved it - she said it was perfect!\n\nToday was my turn... and needless to say, I was extremely impressed!  The staff was really sincere, friendly and helpful.  When I walked in, I smelled fresh bread and I saw several cases full of not only bread, but sandwiches, salads, and baked goods too!  Everything looked awesome!  I looked at the menu and noticed that prices were reasonable and they offered daily specials including soup/sandwich combo and 'the daily double' where you pick two different items to make your own combo.  It took me a few minutes. but I decided to design my own sandwich off the menu... I went with turkey, lettuce, tomato. avocado., sprouts, and spicy mustard on multi-grain alsatian bread.  It came with my choice of sides (I went with coleslaw) and a pickle.\n\nIf you've read my reviews, you know I don't usually go into detail about the food more than saying what I ordered, liked, didn't like. etc... however, I have to make an exception on this one.  The sandwich may sound like any other sandwich you could pick up anywhere, but this sandwich was special!  Every bite I took, I tasted all of the ingredients.  It was balanced perfectly!  Just the right amount of mustard and avocado spread evenly on the bread, fresh and juicy turkey. crisp lettuce, and ripe tomato.  Yum!\n\nI was there after 2 for a late lunch expecting this random place to be empty... but I was wrong.  The place was hopping!  I noticed that people were eating outside (it was a beautiful day) and that Breadcrafters is DOG FRIENDLY!  I also noticed that many people came in just to buy freshly-baked bread.  Not a bad idea - I'll have to remember that for next time we're entertaining!\n\nI overheard Angela. the (new) owner, tell a customer that the bread sold like crazy today, so I imagine the best selection is first thing in the morning... It may have been my first visit to Breadcrafters but it will not be my last.  See you there!", "business_id": "j5HLcBru7FEirYJPbKFVWA", "stars": 5, "date": "2008-02-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ilqzHzqOLErfe-Xa19BfCA", "review_id": "rqVNMkGXcIx8Q8TrNAgAuQ", "text": "They will never have what you want so why waste your time going here.  They ALWAYS run out of main ingredients. I have gone 3 times with high hopes that management could figure out how to order but 3 out of 3 they proved their incompetence to manage... it's too bad considering their food looks and smells delecious...", "business_id": "j5HLcBru7FEirYJPbKFVWA", "stars": 1, "date": "2015-12-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Kv9z6Qwt2Vc9PyYx7K07Hg", "review_id": "WmGNfXVAV5ilUnw9_YD3gA", "text": "Pretty decent. Friendliest staff ever. Happily provided me avocado for my breakfast as which free of charge.\n\n#thankyou!\n\nI had a veggie Mediterranean on power whole wheat. Egg while, roasted tomato. I ordered the pesto on the side but it still a little greasy and the bread a tad soggy but I swapped the bread out (it came with ciabatta) so maybe that's the reason.\n\nGreat deal too -- under 5!\n\nAnd free sample of warm molasses cookies. Loving breakfast desert!", "business_id": "Cm1jT60fxb1DjwpqjWJ8EA", "stars": 4, "date": "2013-12-26", "type": "review"}
